{"ardent_badger": [{"0_comments": [{"dwryhbb": [{"0_Comment Submission": "Holy fuck I just watched a movie and it was so much better high [10]", "1_Text": "The life aquatic with steve zissou. You will thank me later.", "2_Subreddit": "trees"}], "dwt5cpn": [{"0_Comment Submission": "I’m addicted to being high because I don’t feel anything when I’m sober.", "1_Text": "This hit home. I'm in the same place right now and have been for a while. For me it's pot and heroin. Before, I used alcohol but it became too hard on my body. Every day I feel less and less like a person and more and more like a husk. The only pleasure I get is from smoking pot or heroin. I don't know the way out, though most would probably say to start with quitting. To me though right now that's not really an option, because without my drugs I'm just not even me.", "2_Subreddit": "Drugs"}], "dwt5ou8": [{"0_Comment Submission": "What do you think the government or society could do to minimize the deaths related to the opioid epidemic?", "1_Text": "Legalize other medical treatments like marijuana", "2_Subreddit": "opiates"}], "dwtnwv7": [{"0_Comment Submission": "Thanks doc", "1_Text": "How?", "2_Subreddit": "opiates"}], "dwtnzgg": [{"0_Comment Submission": "My snack ate itself", "1_Text": "Taqis count as a meal, not a snack!", "2_Subreddit": "mildlyinteresting"}], "dwto970": [{"0_Comment Submission": "Freddy from ICarly looks more like rob mcelhenney than rob mcelhenney", "1_Text": "He really needs to start cultivating some mass, though.", "2_Subreddit": "IASIP"}], "dwtoc39": [{"0_Comment Submission": "Far cry 3 or Red dead", "1_Text": "Far cry 3 blood dragon dlc. Best 10 hours of my life", "2_Subreddit": "gaming"}], "dwtok5l": [{"0_Comment Submission": "My snack ate itself", "1_Text": "The best part is that slight tang once the heat starts to wear off", "2_Subreddit": "mildlyinteresting"}], "dwtpek5": [{"0_Comment Submission": "All Dogs Go To Heaven", "1_Text": "I love/hate when Futurama ends an episode with the feels. I think it's the only adult cartoon thats made me rethink my life. Well that and the scene in Rick and Morty where Rick tries to commits suicide after his breakup with unity. Such feels, so tears!", "2_Subreddit": "memes"}], "dwtsz08": [{"0_Comment Submission": "My snack ate itself", "1_Text": "Betcha can't eat just one.... Bag!", "2_Subreddit": "mildlyinteresting"}], "dwtude8": [{"0_Comment Submission": "\"As fuck\" has become a universal unit of measurement", "1_Text": "It's almost equivalent to a fuck ton", "2_Subreddit": "Showerthoughts"}], "dwtufof": [{"0_Comment Submission": "Is anyone else sober and live with people that get high?", "1_Text": "You could just start getting high with everyone", "2_Subreddit": "opiates"}], "dwtuy3u": [{"0_Comment Submission": "Is anyone else sober and live with people that get high?", "1_Text": "Yeah, i understand. I'm a drug user so I've never really been in your position. I would recommend getting yourself out of the situation as soon as possible honestly. Anyone who uses is going to be on an emotional Rollercoaster. That can be very hard for anyone around them", "2_Subreddit": "opiates"}], "dwtv0uw": [{"0_Comment Submission": "Is anyone else sober and live with people that get high?", "1_Text": "You said you're in the middle of nowhere right, one of the most peaceful things I've ever found is taking a walk in the woods, maybe when shit gets too hard to handle at home just bounce out and go for a walk", "2_Subreddit": "opiates"}], "dwty0z8": [{"0_Comment Submission": "\"As fuck\" has become a universal unit of measurement", "1_Text": "Amateurs. Everyone knows it's 2.694 x 10", "2_Subreddit": "Showerthoughts"}], "dwtyi3m": [{"0_Comment Submission": "Is anyone else sober and live with people that get high?", "1_Text": "Yeah I didn't mean to be a clown, sorry I guess it's how I deal with facing myself in the mirror. I guess I'm seeing your post and realizing some things about myself. Look, I wish I was on your side of the tracks and not my own. Save your money. Get out of there as soon as humanly possible. Call your brother once a month and buy him lunch. He probably isn't eating if he's like most of us scumbags and it'll mean the world to him. Just don't give him money when he asks, buy him a beer instead. He gets his peace and you know you didn't give 20$ to heroin. Plus you get to meet him in a neutral location. Until that day comes don't get bogged down in their bullshit. They're going to take everything out on you because you are a normal person with emotions that they know they can manipulate. Your brother isn't going to get sober until he wants to which may be never. Prepare for that reality.", "2_Subreddit": "opiates"}], "dwu2upn": [{"0_Comment Submission": "This is my favorite frog picture", "1_Text": "You cant trick me. That's a sad rock!", "2_Subreddit": "trees"}], "dwu2wxk": [{"0_Comment Submission": "Is one or two beers max okay with Xanax ?", "1_Text": "You'll be fine", "2_Subreddit": "Drugs"}], "dwu3kaw": [{"0_Comment Submission": "Is one or two beers max okay with Xanax ?", "1_Text": "Take the xans then start drinking to get you up to when they hit. By the time the Xanax hit I promise 2 beers won't mean shit. They'll totally trump. You'd have to drink a six pack or more at that point to really even realize you're drinking too", "2_Subreddit": "Drugs"}], "dwu3nm9": [{"0_Comment Submission": "Is one or two beers max okay with Xanax ?", "1_Text": "I mix bars weed and alcohol all the time and by the end of the night the Xanax high overpowers everything else", "2_Subreddit": "Drugs"}], "dwu3tiv": [{"0_Comment Submission": "I found a ridiculously large chair at work today", "1_Text": "This chair has some secrets.", "2_Subreddit": "funny"}], "dwu40yi": [{"0_Comment Submission": "Who are these 2 characters on my r&m tapestry?", "1_Text": "The first one is crocubot from the vindicators. Hard to tell who the second is", "2_Subreddit": "rickandmorty"}], "dwu443k": [{"0_Comment Submission": "Who are these 2 characters on my r&m tapestry?", "1_Text": "Oh the second is one of the rick less mortys from the school at the citadel.", "2_Subreddit": "rickandmorty"}], "dwu4nq4": [{"0_Comment Submission": "Who are these 2 characters on my r&m tapestry?", "1_Text": "Could be pencilvester", "2_Subreddit": "rickandmorty"}], "dwu4rd5": [{"0_Comment Submission": "Who are these 2 characters on my r&m tapestry?", "1_Text": "I'm now 95% positive it is pencilvester after looking it up", "2_Subreddit": "rickandmorty"}]}], "1_submissions": [{"7i2syc": [{"0_Title": "Lfg dnd 5e", "1_Text": "The life aquatic with steve zissou. You will thank me later.", "2_Subreddit": "lfg"}]}]}]}