{"FrankNSam": [{"0_comments": [{"dvix0uv": [{"0_Comment Submission": "A beautiful, yet subtle moment in the show.", "1_Text": "(Season 2) :)", "2_Subreddit": "californication"}], "dvix244": [{"0_Comment Submission": "The apartment. I love this quote from Hank! I think it summaries most of the show.", "1_Text": "Aka The Best Episode", "2_Subreddit": "californication"}], "dviz9tq": [{"0_Comment Submission": "Sub taper to kratom taper. Any experience?", "1_Text": "Stupid question, but why does one start using subs after being clean for a month? I was under the impression that you don’t get high off subs..?\n\n\nOh I wish I had some subs, I need to quit this shit like now", "2_Subreddit": "opiates"}], "dvizd3p": [{"0_Comment Submission": "What are the very first symptoms you notice in opiate withdrawal?", "1_Text": "Crazy sad depression. Grumbly stomach, and the ability to poop. Then sinus issues..", "2_Subreddit": "opiates"}], "dvj7e7k": [{"0_Comment Submission": "Sub taper to kratom taper. Any experience?", "1_Text": "Another stupid question, but why didn’t you just get regular opioids like sweet sweet heroin, or oxy, if your intention was to get high?", "2_Subreddit": "opiates"}], "dw6galm": [{"0_Comment Submission": "The frustration of losing a dealer’s contact info..", "1_Text": "I have his old numbers.. the problem is that he changes his number every so often.. :)", "2_Subreddit": "opiates"}], "dw6lv09": [{"0_Comment Submission": "Good ass song about opiate addiction", "1_Text": "Heroin, by a fresh new band called Velvet Underground", "2_Subreddit": "opiates"}], "dw6pbol": [{"0_Comment Submission": "The frustration of losing a dealer’s contact info..", "1_Text": "I never met him at his house. I know his neighborhood, but not his specific home :/", "2_Subreddit": "opiates"}], "dw6pkwv": [{"0_Comment Submission": "Why didn't Hank say anything about Tyler cheating on Becca in the first place?", "1_Text": "I agree with you.. also, he might have not wanted to hurt Becca.", "2_Subreddit": "californication"}], "dw6pqu6": [{"0_Comment Submission": "Stu Beggs house: Frank Sinatra's house", "1_Text": "It was also Dennis Wilson’s house in Aquarius, another Duchovny show..", "2_Subreddit": "californication"}], "dw6q7qx": [{"0_Comment Submission": "I found this show at the start of my spring break, I just finished it the night before school starts again. \"spoilers'\"", "1_Text": "A friend of a friend made a Spotify playlist..\nhttps://open.spotify.com/user/1227094490/playlist/0Q0hwzuGeIwkWsBhDwn17N?si=B_y9igG9TwC1lhAgBYiDrw", "2_Subreddit": "californication"}], "dwhf5x3": [{"0_Comment Submission": "What Kratom?", "1_Text": "I love me some white maeng da. Gives me a little pep, is quite good for pain, and even gives me a nice warm euphoria (less than heroin, but still nice)\n\nMessage me for more info.", "2_Subreddit": "opiates"}], "dwhquu7": [{"0_Comment Submission": "NA isn't the only way to get clean", "1_Text": "I found that work is heroin replacement that was most effective for me. Unfortunately I'm unemployed right now, and finding work is annoyingly difficult.. but the structure of getting up, heading out, actually moving around as opposed to laying in bed watching Law and Order was invigorating to me. That energy built on itself until I didn't even think of heroin.. alas, here I am. Out of work and dreaming of big chunks of ECP... remembering the excitement of seeing that Priority envelope in the mailbox.\n\nFuck", "2_Subreddit": "opiates"}], "dwjcdw6": [{"0_Comment Submission": "Check was way late getting deposited I just assumed today wasn't payday no more and decided to ask my dealer what's up.", "1_Text": "I, for one, would fuck a dealer for heroin. Assuming, of course, that said dealer was a woman.", "2_Subreddit": "opiates"}], "dwjcwn8": [{"0_Comment Submission": "Here we go again", "1_Text": "That implies that the effects of WD will be over in 2 days. For me, the extreme depression, lingering weakness, and ever present cravings are still there after the main issues of WD are passed. In my experience, one can't quit until one has truly made the decision to quit.", "2_Subreddit": "opiates"}], "dwjlu9p": [{"0_Comment Submission": "You guys have no idea how excited I am.", "1_Text": "Pretty sure we all know how excited you are. You probably don’t know how envious WE all are. Heading over, just send me your address.. something like this requires the buddy system", "2_Subreddit": "opiates"}], "dwjlz06": [{"0_Comment Submission": "So in true junkie fashion last night I found a few bags and a baggie of girl I thought I lost. Mixed up a mean speedball to end my opiate career with a bang this morning. And here..we..go...", "1_Text": "I never tried a speedball.. something I need to correct", "2_Subreddit": "opiates"}], "dwmf1f2": [{"0_Comment Submission": "Oxy got me laid last night", "1_Text": "Wait a sec.. I bought opana once and it sucked.. couldn’t break it down, couldn’t snort it. What am I missing? How do you take it?", "2_Subreddit": "opiates"}], "dwmfdk3": [{"0_Comment Submission": "Would you be apprehensive to buy this? This was my introduction to the wild world of H...", "1_Text": "That’s an amazing price. Hell, that would be a great price for 2 grams..", "2_Subreddit": "opiates"}], "dwmgkzo": [{"0_Comment Submission": "Oxy got me laid last night", "1_Text": "I don’t remember, it was years ago.. I put them in my spice grinder and they barely broke down at all.. eventually I lost patience and just took it whole.. which did nothing :)", "2_Subreddit": "opiates"}], "dwrl52b": [{"0_Comment Submission": "I know what my problem is-- I want to use heroin forever.", "1_Text": "You don’t know that. Maybe it was true for you, but it is far from true for plenty of people.", "2_Subreddit": "opiates"}], "dwtgvrn": [{"0_Comment Submission": "Why does dope have such a bad stigma?", "1_Text": "I can only speak for myself here.. but switching from pills to snorting heroin was the worst mistake of my life. My logic was just like yours.. if I can handle pills without abusing them (meaning only for pain), then I can do the same with heroin and everything would be fine. Cheaper and easier to get.. what I didn’t expect was how much I enjoyed the rush, even with snorting. All the good feelings that come with oxy are there with heroin, only quicker and concentrated. Soon I was using heroin without having any pain. That was 4 years, many tens of thousands of dollars, and a trip to rehab ago. Now, I don’t just crave the euphoria, I crave the ritual of prepping my dope; the bitter drip in the back of my throat that I used to despise I now look forward to. \n\nThey aren’t remotely the same.. despite being very similar :)", "2_Subreddit": "opiates"}], "dwtke9w": [{"0_Comment Submission": "How much does the average rehab cost? How do you pay for your stay, insurance or out of pocket?", "1_Text": "45k for detox followed by 28 day rehab in CT. Out of pocket.", "2_Subreddit": "opiates"}], "dwtkfzz": [{"0_Comment Submission": "My dad taking a mirror selfie before it was cool, circa 1980s.", "1_Text": "Your dad looks like Anna Wintour", "2_Subreddit": "OldSchoolCool"}], "dwuku3x": [{"0_Comment Submission": "Fentanyl is 1000xs stronger than morphine...", "1_Text": "Seriously? So you think we were all hiding under a rock? You can’t live in today’s society without seeing a weekly story about the dangers of fent. \n\nSorry, I can’t tell if this post is serious or not", "2_Subreddit": "opiates"}]}], "1_submissions": [{"4bz3nm": [{"0_Title": "ELI5:How are sailing vessels able to sail faster than the wind that is propelling them.", "1_Text": "(Season 2) :)", "2_Subreddit": "explainlikeimfive"}], "4mynyq": [{"0_Title": "ELI5: If iron destroys stars, what's preventing an evil mastermind from sending a giant chunk of iron into the sun?", "1_Text": "(Season 2) :)", "2_Subreddit": "explainlikeimfive"}], "4sasq2": [{"0_Title": "ELI5:why do these annoying memes that beg to be shared always taunt the reader by saying \"I bet 99% won't share\".", "1_Text": "(Season 2) :)", "2_Subreddit": "explainlikeimfive"}], "5o5fom": [{"0_Title": "A new Spotify playlist", "1_Text": "(Season 2) :)", "2_Subreddit": "californication"}], "63ubpw": [{"0_Title": "Buying BTC same day in NY seems almost impossible", "1_Text": "(Season 2) :)", "2_Subreddit": "Bitcoin"}], "6k91gi": [{"0_Title": "I love Hank, but he really is kinda lame..", "1_Text": "(Season 2) :)", "2_Subreddit": "californication"}], "6ncifd": [{"0_Title": "Lew Ashby's death; I call bullshit", "1_Text": "(Season 2) :)", "2_Subreddit": "californication"}], "6snb8q": [{"0_Title": "Opiate Rollcall?", "1_Text": "(Season 2) :)", "2_Subreddit": "opiates"}], "6u1v4k": [{"0_Title": "My shitty dealer got picked up, I'm ordering some kratom", "1_Text": "(Season 2) :)", "2_Subreddit": "opiates"}], "6u2er1": [{"0_Title": "What measures have to you taken to help you NOT do heroin?", "1_Text": "(Season 2) :)", "2_Subreddit": "opiates"}], "6vbkvm": [{"0_Title": "Kratom assortment I got last week.. this one is amazing for pain", "1_Text": "(Season 2) :)", "2_Subreddit": "opiates"}], "6vy3kf": [{"0_Title": "One year ago today, I left rehab. Anyone else been?", "1_Text": "(Season 2) :)", "2_Subreddit": "opiates"}], "73fo7s": [{"0_Title": "H is the only letter of the alphabet in which the sound of the letter is not found in the name of the letter", "1_Text": "(Season 2) :)", "2_Subreddit": "Showerthoughts"}], "75g1z9": [{"0_Title": "A suggestive sign in the stairwell of a police station", "1_Text": "(Season 2) :)", "2_Subreddit": "mildlyinteresting"}], "75g3i0": [{"0_Title": "55 Gallons of mulatto flesh?", "1_Text": "(Season 2) :)", "2_Subreddit": "mildlyinteresting"}], "7asm06": [{"0_Title": "Give in to those occasional cravings, or try to use willpower to get through?", "1_Text": "(Season 2) :)", "2_Subreddit": "opiates"}], "7d0nw8": [{"0_Title": "I was looking at a map or Europe recently when I noticed a chunk of Russia that wasn’t connected to the rest of it (between Poland and Germany).", "1_Text": "(Season 2) :)", "2_Subreddit": "Showerthoughts"}], "7jrqgt": [{"0_Title": "Ever leave paraphernalia in plain view accidentally?", "1_Text": "(Season 2) :)", "2_Subreddit": "opiates"}], "7mqnr6": [{"0_Title": "Changing channels within app (like slingTV or DirectTV) using Siri", "1_Text": "(Season 2) :)", "2_Subreddit": "appletv"}], "7uhb7r": [{"0_Title": "Suffering from withdrawal.. of the glassine subreddit", "1_Text": "(Season 2) :)", "2_Subreddit": "opiates"}], "80m826": [{"0_Title": "What's the worst part of withdrawals for you?", "1_Text": "(Season 2) :)", "2_Subreddit": "opiates"}], "83gi5u": [{"0_Title": "Do you use gabapentin with heroin (or other opioids)? If so, why?", "1_Text": "(Season 2) :)", "2_Subreddit": "opiates"}], "86ne43": [{"0_Title": "The frustration of losing a dealer’s contact info..", "1_Text": "(Season 2) :)", "2_Subreddit": "opiates"}], "88cvoi": [{"0_Title": "Is Slingtv very glitchy today for anyone else?", "1_Text": "(Season 2) :)", "2_Subreddit": "slingtv"}], "88qqqm": [{"0_Title": "Palmolive is a portmanteau", "1_Text": "(Season 2) :)", "2_Subreddit": "Showerthoughts"}]}]}]}