{"italian_mom": [{"0_comments": [{"dt16xkk": [{"0_Comment Submission": "Easiest way of injuring yourself to get opiates at the ER?", "1_Text": "My son recently broke his ankle and leg in a skateboard accident.   He also ripped ligaments from his bones and said ligaments were pushed out the side of his ankle.  This your man was in a lot of pain, required surgery and they gave him 50 percocet to last 6 weeks. The kid was in so much pain but was told that pain part of having a broken bone.   He is in his 20's  and the doctor wanted no part in prescribing.   If you harm yourself you will just be in pain and told to take Tylenol.", "2_Subreddit": "opiates"}], "du1reyf": [{"0_Comment Submission": "I got a call from the HR telling me they were putting an offer letter together for me. When I asked her for joining bonus, she said they don't give that. They only give joining bonus if the applicant is losing money from the transfer of employees. Does this seem normal?", "1_Text": "If somebody promises you a sign on bonus you must get it in an email prior to receiving an offer letter.   Many times hiring leaders will promise money but HR can not deliver those funds.   You'll have to be able to document the conversation with email or you made me to let this one go.\n\n Sign on bonuses are very normal but they must be discussed prior to an offer.\n\n And yes if you are losing money by joining a new company that can be compensated but must be discussed and documented before the offer is extended since it will need additional approval.", "2_Subreddit": "AskHR"}], "du3szv9": [{"0_Comment Submission": "Best way to mention overdue bonus/raise?", "1_Text": "You absolutely have the right to this conversation.   Why don't you take some time on your boss's calendar for a 1 on 1?  Discuss any new goals you may have for 2018 and how grateful you were for the Christmas bonus.   Once you mention the Christmas bonus be silent.... A good leader will get the hint.", "2_Subreddit": "AskHR"}], "du5c8nw": [{"0_Comment Submission": "Re-watching the episode with designing the 4 homes", "1_Text": "I do understand Utah is not a very expensive state but how does one family afford for homes and all these mouths to feed?", "2_Subreddit": "TLCsisterwives"}], "du5nvd5": [{"0_Comment Submission": "$5 goes a long way", "1_Text": "Oh my gosh I see this dude everyday", "2_Subreddit": "Unexpected"}], "dus9t3v": [{"0_Comment Submission": "I work at a thrift store. Yesterday, a #bossbabe brought in all of her LLR that she hasn’t been able to sell.", "1_Text": "Think about donating that to hospice.   Our patients like comfy clothes and the bright colors may do somebody a little bit of good.   Typically our patients are in pajamas all day but do like to throw on comfy clothes if the family is coming by.   Much of the clothing used at hospice is cut down the back to accommodate any tubes the patient may have.", "2_Subreddit": "antiMLM"}], "duwk4w4": [{"0_Comment Submission": "Best 3.00 ever spent!", "1_Text": "Do Look creepy", "2_Subreddit": "ThriftStoreHauls"}], "duwk7bg": [{"0_Comment Submission": "The best $15 I’ve given and brought home. GW.", "1_Text": "Love love love....cornflower blue!", "2_Subreddit": "ThriftStoreHauls"}], "duwka39": [{"0_Comment Submission": "After countless trips to goodwill, i finally found a denim jacket! 1969 gap icon denim jacket for $5. I wasn’t even going to go thrifting today either", "1_Text": "Congrats on finding America!", "2_Subreddit": "ThriftStoreHauls"}], "dv37elc": [{"0_Comment Submission": "Ex-Google recruiter: I was fired because I resisted “illegal” diversity efforts", "1_Text": "I can verify this...it's part of goals  as an individual contributor.", "2_Subreddit": "technology"}], "dvj8o0l": [{"0_Comment Submission": "An ex-YouTube recruiter claims Google discriminated against white and Asian men, then deleted the evidence", "1_Text": "At my company we are awarded for diverse hies...", "2_Subreddit": "technology"}], "dvjvhf2": [{"0_Comment Submission": "Is it weird yet?", "1_Text": "I live in Arizona and he has been spotted the past couple of days climbing Camelback Mountain with Lauren.", "2_Subreddit": "thebachelor"}], "dvs554s": [{"0_Comment Submission": "The shade is real!", "1_Text": "Like Sydney", "2_Subreddit": "thebachelor"}], "dvwtthq": [{"0_Comment Submission": "How do you feel about Abortion?", "1_Text": "Rosaries do not belong on ovaries", "2_Subreddit": "excatholic"}], "dwe5vgs": [{"0_Comment Submission": "The time I saw a wife fat her shame her husband in front of their kids", "1_Text": "This makes me so sad.  My parents both fat shamed me constantly.    I was often left alone as a child and would eat out of loneliness and my parents would say that I would have food orgies alone at night.  I was 12 at the time.  I try very hard to forgive them to this day...58  years later.    My older brother had died of a brain tumor and it was  a horrible death at home so I realize they had nothing left to give me emotionally.   I feel awful for these kids because it will affect their life and their mental health.", "2_Subreddit": "TalesFromYourServer"}], "dwedvoi": [{"0_Comment Submission": "TIL my sister knows Arie's brother.", "1_Text": "Locals call it *Snottsdale*", "2_Subreddit": "thebachelor"}], "dwk2hlf": [{"0_Comment Submission": "Thank goodness we have easy, fat blocking pills to help combat obesity!", "1_Text": "I call bullshit.", "2_Subreddit": "fatlogic"}], "dwly4pw": [{"0_Comment Submission": "My little sister is dying", "1_Text": "I am a hospice volunteer in Phoenix.   My recommendation to you would be to reach out hospice now.   You are carrying so many thoughts that will interfere with your grieving process At the time your family will need you most.   You have every right to be angry and every right to be questioning choices that have been made without your consent.   I do hope you will take advantage of the resources hospice will offer as well as any local organizations that will help her children.\n\n I am so very sorry for the pain you are going through but please focus on loving her right now and enjoying life with her for as long as you can.   Families grieve, including spouses, in different ways and I have even had to call the police on families behaving badly at a patient's bedside at my unit.   Emotions run all over the place and people start questioning decisions that were made and family members lash out at each other simply because they're hurting so deeply.\n\nPlease feel free to reach out to me privately if you ever need somebody to talk to.  While I have never gone through what you are going through I can just assure you that all these feelings fought with a normal.  \n\n Your sister will need to know you are OK and you will help care for her children.   Again I am so very sorry and I'm here for you.", "2_Subreddit": "hospice"}], "dwlybh8": [{"0_Comment Submission": "My little sister is dying", "1_Text": "And please listen to your sister when she is talking about her final arrangements because you do need to know that information and she needs to be assured that you will honor her requests.  \n\n People die very similar to the way they live.   Some people like to plan out every little detail so nobody else must worry about decisions and details. \n\n She really needs to know about you are going to be OK without her.... And yes that is absolutely a horrible statement to have to make but please understand it will give her peace.", "2_Subreddit": "hospice"}], "dwlyrut": [{"0_Comment Submission": "[TX] No added sugar", "1_Text": "As you are struggling how to handle the situation please remember there are lots of diabetic kids who are given no sugar treats for a reason.  I know your intention is not to cause harm but this can kill someone.  Please report this.", "2_Subreddit": "legaladvice"}], "dwm48hk": [{"0_Comment Submission": "What's the dumbest thing a customer has sent food back for?", "1_Text": "Did he want heinz?", "2_Subreddit": "TalesFromYourServer"}], "dwm4clh": [{"0_Comment Submission": "$20 for the two dresses at Value Village.", "1_Text": "Gorgeous.. enjoy them!", "2_Subreddit": "ThriftStoreHauls"}], "dwm4rwf": [{"0_Comment Submission": "In for a night of restless legs.", "1_Text": "Go a to Sprouts and  buy *Hylands  Restful legs.*\n\n This is a homeopathic remedy that will not interact with any medications you may be taking to sleep.   You can also take this during the work day to help focus and get your mind off the crazy legs.\n\n If you are not near a Sproutsl please look on Amazon.", "2_Subreddit": "opiates"}], "dwm4ydh": [{"0_Comment Submission": "I have nowhere to wear this. I had no reason to buy it... but I couldn't resist those colors! $10 fabulous vintage dress!", "1_Text": "Perfect dress for cinco DE Mayo", "2_Subreddit": "ThriftStoreHauls"}], "dwqxjcx": [{"0_Comment Submission": "In for a night of restless legs.", "1_Text": "Just trying to help as restless legs is awful", "2_Subreddit": "opiates"}]}], "1_submissions": [{"7mvmq2": [{"0_Title": "Go find God", "1_Text": "My son recently broke his ankle and leg in a skateboard accident.   He also ripped ligaments from his bones and said ligaments were pushed out the side of his ankle.  This your man was in a lot of pain, required surgery and they gave him 50 percocet to last 6 weeks. The kid was in so much pain but was told that pain part of having a broken bone.   He is in his 20's  and the doctor wanted no part in prescribing.   If you harm yourself you will just be in pain and told to take Tylenol.", "2_Subreddit": "excatholic"}], "80mfc2": [{"0_Title": "Clay pot for what not...brand new at Goodwill on half of day....drum roll...$2.50", "1_Text": "My son recently broke his ankle and leg in a skateboard accident.   He also ripped ligaments from his bones and said ligaments were pushed out the side of his ankle.  This your man was in a lot of pain, required surgery and they gave him 50 percocet to last 6 weeks. The kid was in so much pain but was told that pain part of having a broken bone.   He is in his 20's  and the doctor wanted no part in prescribing.   If you harm yourself you will just be in pain and told to take Tylenol.", "2_Subreddit": "u_italian_mom"}], "82bbfd": [{"0_Title": "Roast Beast on Friday", "1_Text": "My son recently broke his ankle and leg in a skateboard accident.   He also ripped ligaments from his bones and said ligaments were pushed out the side of his ankle.  This your man was in a lot of pain, required surgery and they gave him 50 percocet to last 6 weeks. The kid was in so much pain but was told that pain part of having a broken bone.   He is in his 20's  and the doctor wanted no part in prescribing.   If you harm yourself you will just be in pain and told to take Tylenol.", "2_Subreddit": "excatholic"}], "84y0xx": [{"0_Title": "At your local Cracker Barrel....", "1_Text": "My son recently broke his ankle and leg in a skateboard accident.   He also ripped ligaments from his bones and said ligaments were pushed out the side of his ankle.  This your man was in a lot of pain, required surgery and they gave him 50 percocet to last 6 weeks. The kid was in so much pain but was told that pain part of having a broken bone.   He is in his 20's  and the doctor wanted no part in prescribing.   If you harm yourself you will just be in pain and told to take Tylenol.", "2_Subreddit": "u_italian_mom"}]}]}]}