{"DerFixer": [{"0_comments": [{"dn0fvd2": [{"0_Comment Submission": "You do, dumbass.", "1_Text": "Too bad the only time he applies his atrophied and fox news sodden intellect is when he's attempting to manipulate the perception that he's won a negotiation he's lost.", "2_Subreddit": "MarchAgainstTrump"}], "dn0st0r": [{"0_Comment Submission": "Nick Diaz opens old wounds on a dark day in his career - Ariel Helwani article", "1_Text": "He's saying nate has a fight soon? I haven't heard of anything but I'm hoping it's not conor. I'd rather see conor fight ANYBODY else in the world than nate again.", "2_Subreddit": "MMA"}], "dn28jui": [{"0_Comment Submission": "Singapore FP2 Longrun Averages", "1_Text": "I think it's gonna be a really rough weekend for kimi, seb and bottas. Imnho, unless there's some odd event during the race I highly doubt kimi finishes top 5 and seb only makes the podium if a rb retires. I think ferrari has bungled the setup too much and aren't sandbagging at all. Too bad we don't do flair bets here.", "2_Subreddit": "formula1"}], "dn29cj8": [{"0_Comment Submission": "Vettel said they didn't find the right balance and thus not trusting the car", "1_Text": "I'll bet a chilton flair they don't.", "2_Subreddit": "formula1"}], "dn9o156": [{"0_Comment Submission": "Entire Volume of CIA Files On Lee Harvey Oswald, Set to Be Released in October, Has 'Gone Missing'", "1_Text": "I guess because of 'volume 5'? From the comments it seems 90%+ didn't read the 'article' and just assumed it said what they wanted to hear.", "2_Subreddit": "conspiracy"}], "dnda619": [{"0_Comment Submission": "Master of Crime Great Plan and Flawless Execution", "1_Text": "Well the video is from poland..", "2_Subreddit": "JusticeServed"}], "dnidf5l": [{"0_Comment Submission": "Guy pretends to be aboriginal, gets sleuthed", "1_Text": "Good ol ignorantimgur.", "2_Subreddit": "quityourbullshit"}], "do031qz": [{"0_Comment Submission": "More Information Regarding 2018 F1 Coverage on ESPN in USA", "1_Text": "Will qualifying broadcast live on the family of ESPN networks or will this session only be available via streaming? \n>Yes \n\n?", "2_Subreddit": "formula1"}], "do0bgh8": [{"0_Comment Submission": "[Idea] Max card level limitations for each arena.Make the ladder fun again!!", "1_Text": "They're never gonna fix ladder balancing issues. I just pay $5 a month and only play challenges. It's the only way to play this stupid ass game where you're not punished for being an above average player and actually get to play whatever you want.", "2_Subreddit": "ClashRoyale"}], "doi0g2i": [{"0_Comment Submission": "In Silence of the Lambs, Hannibal Lecter tells Clarice that he ate a man's liver with fava beans and \"a nice Chianti.\" All of these foods interfere with MAOI antidepressants, which are used to treat various personality disorders as well. In other words, Hannibal wasn't taking his meds.", "1_Text": "I would also assume anyone who is familiar with MAOI's would think they would be an odd choice for a murderous cannibal psychopath. It doesn't add up as a movie detail when it's highly speculative and the fact that these foods wouldn't inhibit the medications efficacy, and would only make the patient feel unwell. I would be extremely surprised if this 'detail' was intended by the production team.", "2_Subreddit": "MovieDetails"}], "doz2h43": [{"0_Comment Submission": "RIP Kimiquokka", "1_Text": "Might have been a little too subtle\n\n>It's than. Another lesson in English my dear.\n\nIs referring to: /u/Ireddit2learnEnglish", "2_Subreddit": "formula1"}], "dozajjr": [{"0_Comment Submission": "If it's not a ball or a moon, what is it? [OC]", "1_Text": "Fake. Dogs can't look up.", "2_Subreddit": "AnimalTextGifs"}], "dpt9q7x": [{"0_Comment Submission": "Get real, son - Abu Dhabi GP 2010", "1_Text": "**B**ettel", "2_Subreddit": "formula1"}], "dq5wn08": [{"0_Comment Submission": "The Halo Is Giving F1 Teams a Hard Time", "1_Text": "Who was injured in those?", "2_Subreddit": "formula1"}], "dq69xft": [{"0_Comment Submission": "these guys were hit by net neutrality early on", "1_Text": "I checked it out today to see what they were saying about it. I spent a lot of time on 4chan a decade ago. It was a little disturbing back then with pics of beastiality, cp, retard rape etc. As someone who thinks that people are generally selfish, jealous, ego driven garbage I've never been so disappointed in humanity as I was after looking at /pol/ tonight. Obviously they're pro net neutrality because it's just a trump circle jerk in there now. \n\nIt's obvious to me that trump and the internet will be the doom of humankind. Before retards kept to themselves but now these ideas spread like viruses. Each side now chooses their own facts and separation from reality will only grow stronger. It's undeniable that most people are fucking stupid and now these same people decide for themselves what's true. And they do that by reading the news they want to hear and the only time they are suspicious is if facebook or newrepublicfreedom.tv tells them something they don't want to believe. Soon there will be no staple reputable news organizations and the minor integrity and accountability that's left will be gone. Civilization cannot continue when everything it doesn't want to believe is fake news. \n\nIt is so fucking mind boggling to me that people can't see how full of shit he is.", "2_Subreddit": "AdviceAnimals"}], "dqooz09": [{"0_Comment Submission": "Event Thread:UFC 218: HOLLOWAY VS. ALDO (10:00PM ET)", "1_Text": "It's depressing the amount of ignorant douchebags conor has brought to this sport.", "2_Subreddit": "MMAStreams"}], "dqp4h73": [{"0_Comment Submission": "ABC News Suspends Brian Ross for 4 Weeks Without Pay: ‘Effective Immediately’", "1_Text": "Ya right? It sounds like the correction was only about using the wrong title for trump. But that doesn't seem very consequential and most in the comments here are saying the error is that it wasn't trump who made the request of flynn. That makes sense since it was ABC that first claimed trump made the request. However I'm not sure there is any way someone who's unfamiliar with the situation would be able to deduce that from their statement.", "2_Subreddit": "news"}], "dqpnhny": [{"0_Comment Submission": "Let's play a game! Post an unpopular opinion about F1.", "1_Text": "Why is this so heavily downvoted?", "2_Subreddit": "formula1"}], "drlvmye": [{"0_Comment Submission": "[Editorial] What is up with Jackson Wink MMA?", "1_Text": "This losing streak began right after BJ had his weeklong camp there. In Hilo BJ is known as a Kahuna Nui, or master of sorcery. It's obvious to me that while BJ was educating the team about flat earth he also cast a spell to absorb their energy and motivation.", "2_Subreddit": "MMA"}], "dro5mdp": [{"0_Comment Submission": "JDM Rocketbunny Wide Body Honda NSX at SEMA 2017", "1_Text": "The design isn't hideous and has some well executed areas but overall it's on the cheezy side. And it fits like shit. There's massive gaps everywhere.", "2_Subreddit": "AwesomeCarMods"}], "drz1iyg": [{"0_Comment Submission": "Suman Mokhtarian vs BJ Penn at UFC 221 Perth", "1_Text": "He never really fought out of JW. He trained there sporadically for a couple weeks.", "2_Subreddit": "MMA"}], "ds0l32f": [{"0_Comment Submission": "Cat Piss Pick up!", "1_Text": "Dude might not even smell it anymore. In high school I went to a kids house and they had 2 big dogs that just pissed wherever they wanted. You needed a gas mask to go in but the kid who lived there couldn't even tell it smelled at all.", "2_Subreddit": "opiates"}], "dvm4ild": [{"0_Comment Submission": "Cops pull over man for speeding while driving to the hospital for medical emergency. They detain him on the side of the rode for 10 minutes while he begs for his life until he suffocates to death after his throat swells shut.", "1_Text": "He wasn't the one driving though.", "2_Subreddit": "Bad_Cop_No_Donut"}], "dwfkzj0": [{"0_Comment Submission": "$10,000 a week for H???", "1_Text": "That's bullshit. Anybody that's had unlimited dope knows there's no reason to shoot more than 3gs a day of good dope. You hit the ceiling and doing any more literally does nothing for you.", "2_Subreddit": "opiates"}], "dwrksyh": [{"0_Comment Submission": "Flying to Pakistan shitpost", "1_Text": "I'd be worried it would look different on the xray. Swapping out the contents of capsules is a well known method so I'd want to make sure it's pretty close. You could fill the other caps with a more similar powder. I went through customs with 5gs once. This was before body scanners were around. I just had it in my pants pockets. I was really high and hadn't thought it through. Made it passed no problem though.", "2_Subreddit": "opiates"}]}], "1_submissions": [{"5ntqce": [{"0_Title": "OJ - Dart Goblin Decks | Chest Opening | Mass Gobs", "1_Text": "Too bad the only time he applies his atrophied and fox news sodden intellect is when he's attempting to manipulate the perception that he's won a negotiation he's lost.", "2_Subreddit": "ClashRoyale"}], "5opxtx": [{"0_Title": "Supercell did a good job to address trophy dropping for the clan chest", "1_Text": "Too bad the only time he applies his atrophied and fox news sodden intellect is when he's attempting to manipulate the perception that he's won a negotiation he's lost.", "2_Subreddit": "ClashRoyale"}], "6fpdtu": [{"0_Title": "Change bookmark folders in dropdown menu?", "1_Text": "Too bad the only time he applies his atrophied and fox news sodden intellect is when he's attempting to manipulate the perception that he's won a negotiation he's lost.", "2_Subreddit": "chrome"}]}]}]}