{"Felix_Laranga": [{"0_comments": [{"dvzeiuy": [{"0_Comment Submission": "Anyone up? Totally tweaked and sleep deprived, trying to chill w h, might’ve taken a bit too much (probably just bugging though)", "1_Text": "I'm not sure if I should be interested or not...", "2_Subreddit": "opiates"}], "dvzem0u": [{"0_Comment Submission": "Wowza", "1_Text": "Just been trying to chip since the first of the year; the 3 or 4 times I've gotten product, (not quite sure I can call it dope lol) I feel like it's been very fent-y. I can get a small nod going for a minute or two.\n\nHappy nods tho brother/sister... Stay safe", "2_Subreddit": "opiates"}], "dvzfc1b": [{"0_Comment Submission": "i snorted 1 mg of Subutex for the last 2-3 days. Since i snorted it, can we assume it leaves my system faster than usual. Or will there still be a significant amount of bupe to block opiate receptor communications?", "1_Text": "At that dose for 2 or 3 days, would it even block the dope? Maybe some but i think you would still get high. I'm far from a scientist, but I have messed with small bupe doses and full agonists in the past. \n\nDo you feel any WD symptoms right now?", "2_Subreddit": "opiates"}], "dvzffy3": [{"0_Comment Submission": "Anyone up? Totally tweaked and sleep deprived, trying to chill w h, might’ve taken a bit too much (probably just bugging though)", "1_Text": "How long have you been up, OP? I almost feel like I did some ice earlier(kinda planned on it but it fell through.) i guess I drank too much caffeine today and the h I got is trash.\n\nUnfortunately that seems to be the standard anymore :(", "2_Subreddit": "opiates"}], "dvzhqal": [{"0_Comment Submission": "Postgame interviews and why they represent my love for this team", "1_Text": "At first I read that last sentence as \"I want to grow old with this team...\" \n\nI agree 1000%, enjoying this team just as much as I did this years Eagles team. I could also go for another improbable championship run", "2_Subreddit": "sixers"}], "dvziaiz": [{"0_Comment Submission": "Park was dark added light but tonight's pick up ain't bad 🌞🌝", "1_Text": "I seen a headline earlier on facebook that said \"study shows alcohol is the major gateway drug\" or something along those lines. I didn't read the article, but I definitely agree with the headline.\n\nI know quite a few people in my area who got into hard drugs who weren't 'stoners' in high school. Most of them were the 'preppy' kids whose parents would buy them booze on weekends or at least turn a blind eye to their teenager(s) drinking.\n\n\nPersonally, I've smoked pot since 7th grade, but I was already messing with lortabs and klonopin around that time. Jumped in head first, it's not like I couldn't get weed one day do I started doing pills", "2_Subreddit": "opiates"}], "dvzibsz": [{"0_Comment Submission": "I love staring at oxys lol", "1_Text": "Reminds me of some Sweet Tarts... Yum", "2_Subreddit": "opiates"}], "dvzihev": [{"0_Comment Submission": "Last sack before I quit boys", "1_Text": "Sigh, Reddit is the only place I see ecp that isn't straight powder anymore...\n\nAnyway, good luck op! You're doing the right thing and once you get clean I think you'll find it to be the most rewarding thing besides being a parent in itself! \n\nWe're rootin for ya", "2_Subreddit": "opiates"}], "dvzilsm": [{"0_Comment Submission": "Making it hard", "1_Text": "Yea, I've been \"chipping\" and trying to stay clean for the most part, especially since I have no dope connects and my oxy connect fell off...\n\nGot a couple bags through a \"buddy\" of mine who middled for me. The best I've gotten in the 3 times I've gotten shit lately, but it's still trash lol.\n\nThe whole process made me realize how much it's NOT worth it anymore and after this one, hopefully I can put together some actual clean time. Good luck out there OP and remember, there are worse things than not having dope", "2_Subreddit": "opiates"}], "dvzki2d": [{"0_Comment Submission": "Yooo anybody purchase Coke from \"lil joe\" and get a pleasant surprise?", "1_Text": "Ol' Joe \"fuckin up the\" Blow with the fenta-no", "2_Subreddit": "opiates"}], "dw8po3w": [{"0_Comment Submission": "Get To Know the 76ers' Dario Saric Interview with Kristen Ledlow", "1_Text": "The Homie!", "2_Subreddit": "sixers"}], "dwe51lx": [{"0_Comment Submission": "Updated collection of Ben Simmons' 3PA", "1_Text": "FG% still goes down when he does though", "2_Subreddit": "nba"}], "dweugwb": [{"0_Comment Submission": "[Sixers] As is tradition at team breakfasts, a player gives a presentation on a topic of their choosing. This morning, @BenSimmons25 educated his teammates on Australia", "1_Text": "You might be right, I can see that pretty well haha", "2_Subreddit": "sixers"}], "dwgtf5g": [{"0_Comment Submission": "Ben Simmons with the 'wtf'", "1_Text": "More times than i can count tbh, even though I seen it during the game", "2_Subreddit": "sixers"}], "dwl92ve": [{"0_Comment Submission": "Something to add to your Withdrawal remedies~", "1_Text": "Fuck, there goes my clean time", "2_Subreddit": "opiates"}], "dwlb2qw": [{"0_Comment Submission": "Shouldn't Charlotte be faded?", "1_Text": "Jay-Z and Beyonce 2.0 and it's not even close", "2_Subreddit": "nba"}], "dwld1dh": [{"0_Comment Submission": "Anthony Davis makes a drastic change", "1_Text": "Same thing, right? Right??", "2_Subreddit": "nba"}], "dwnh2yt": [{"0_Comment Submission": "[Post Game Thread] Sixers win 119 to 102 vs the Hornets!", "1_Text": "76-0 this time next year", "2_Subreddit": "sixers"}], "dwnhcp0": [{"0_Comment Submission": "[Post Game Thread] Sixers win 119 to 102 vs the Hornets!", "1_Text": "Niiiiice", "2_Subreddit": "sixers"}], "dwntckw": [{"0_Comment Submission": "The Sixers have totaled 30+ assists in NINE straight games. This is the 3rd longest streak recorded IN NBA HISTORY.", "1_Text": "Impressive. It sure is fun to watch, too.", "2_Subreddit": "sixers"}], "dwpycna": [{"0_Comment Submission": "{NSFW} Boof Queen!", "1_Text": "Top quality", "2_Subreddit": "opiates"}], "dwu0g76": [{"0_Comment Submission": "With his 48th win of the season tonight, Brett Brown has won more games this season than he did in his 1st three seasons combined.", "1_Text": "Sticking around like he did, helluva guy", "2_Subreddit": "sixers"}], "dwvisl1": [{"0_Comment Submission": "Do you guys ever get tired of this life?", "1_Text": "Deja vu", "2_Subreddit": "opiates"}], "dwy74he": [{"0_Comment Submission": "[POST GAME] Sixers hang on to beat the Cavs without Embiid. 13 Straight! TTP", "1_Text": "He loves em", "2_Subreddit": "sixers"}], "dwydb0c": [{"0_Comment Submission": "Never had H this white before. WTF is it?", "1_Text": "Gotta love those classy dope dealers", "2_Subreddit": "opiates"}]}], "1_submissions": [{"5q0n8f": [{"0_Title": "[2400] The Stoners recruiting #8P9P8J2 Growing like Weeds!!", "1_Text": "I'm not sure if I should be interested or not...", "2_Subreddit": "RoyaleRecruit"}], "6y4sd2": [{"0_Title": "[0] Clan looking for new players, casual players, any trophy count is fine! death by gods", "1_Text": "I'm not sure if I should be interested or not...", "2_Subreddit": "RoyaleRecruit"}], "7w14m7": [{"0_Title": "[3800] (17+) The Stoners, 3 spots available right now, looking to push top 200 North America {#8p9p8j2}", "1_Text": "I'm not sure if I should be interested or not...", "2_Subreddit": "RoyaleRecruit"}]}]}]}