{"notoriousMEG": [{"0_comments": [{"dwc4uxs": [{"0_Comment Submission": "Yup....fucking junkie 101. Got these jeans about 6 hours or so ago and already burnt em up. I swear I can’t have anything nice. And if I do the shit don’t last more then a damn day.", "1_Text": "Trippy looking ain't it... and trippy to be commenting on a 90 day old post...lol", "2_Subreddit": "opiates"}], "dwc54ym": [{"0_Comment Submission": "Short story-Rush", "1_Text": "That's some no bullshit , straight to point advice. It made me chuckle for some reason :)", "2_Subreddit": "opiates"}], "dwc5ool": [{"0_Comment Submission": "How much are you paying for heroin where you're at?", "1_Text": "Mid -Atlantic , East Coast part of U.S.  I pay $100 to $120 a gram of ecp ( usually heroin cut fent) . You can get shitty gel caps of scramble for $6-$10 but they are not my fave...I don't know how much is in them maybe .1?", "2_Subreddit": "opiates"}], "dwdfghx": [{"0_Comment Submission": "44 Hours Since Last Use: STILL Not Dopesick!", "1_Text": "Gagging on ciggs....lol. . I feel you. I can't smoke cigarettes dopesick and I have been smoking over 20 years. I will gag then vomit. My ex was the opposite and just *had* to smoke when sick. Even his 2nd hand smoke made me gag. \n\nGood luck, maybe your WD won't be hard or you will magically not get them.", "2_Subreddit": "opiates"}], "dwdv4tp": [{"0_Comment Submission": "44 Hours Since Last Use: STILL Not Dopesick!", "1_Text": "Very weird. Methadone has done this to me before. Maybe you got magical dope...lol..Good luck.", "2_Subreddit": "opiates"}], "dwewle8": [{"0_Comment Submission": "Crazy shit my roommate says volume 3 : hardcore edition", "1_Text": "I just wanna see what OpiLobster looks like now. If crazy thinks your cute, you must be cute OP.", "2_Subreddit": "opiates"}], "dwf5sbj": [{"0_Comment Submission": "Crazy shit my roommate says volume 3 : hardcore edition", "1_Text": "That's exactly what I was gonna say...lol. If crazy is attracted to him and I think he is cute, does that mean I am fucking crazy? Hear that OpiLobster. .. your cute but I swear I am normal as shit.  Well as normal as a heroin addict can be ;)", "2_Subreddit": "opiates"}], "dwgaumn": [{"0_Comment Submission": "Long time lurker, first time poster", "1_Text": "So my question ( which I am sure alot of others are also thinking)  With the proliferation of counterfeit fentanyl pills that you could end up getting , and the same proliferation of fentanyl cut heroin or just straight up fentanyl pretending to be heroin, the difference between pills and heroin is getting smaller and smaller. With that knowledge,  I guess unless you know 100% you are getting pharm legit pills. Why not just do heroin if being sick stresses you out this much? Is it like a red line in your mind that you told yourself you would never cross? Because if you are getting dopesick you are already down that rabbit hole....", "2_Subreddit": "opiates"}], "dwgdy9f": [{"0_Comment Submission": "Long time lurker, first time poster", "1_Text": "I understand, alot of people have that line they don't want to cross. I guess I just jumped head first into heroin ( I wasn't someone who did pills and then couldn't get them, I just did H first. .lol) \n\nIt sounded like you are getting real pills too if you know the girl & her dad. I guess my point was if you are going to start venturing out and getting pills from other sources be prepared to get pressed pills, and if you are willing to take a chance on pressed pills you could find dope a fuck of alot faster and cheaper. Especially if you can still go to the place where you used to buy the 500 hydro.... Anywho....\n\nWe welcome you here & we feel your pain , it sucks to be in withdrawal . Whatever you decide to do be safe !", "2_Subreddit": "opiates"}], "dwjv35m": [{"0_Comment Submission": "Fuck my life", "1_Text": "So your fiancé was at a therapy appointment and mentioned you did heroin ( I am guessing your fiancé , the mother of the child does not use) and the therapist called CPS? Were you abusive or falling asleep while taking care of the baby? Did your fiancé tell her actual anecdotal stories of you being negligent *because*  you use dope? \n\nI know doctors are mandatory reporters for child abuse but drug use doesn't always = child abuse. Seems like more to the story.", "2_Subreddit": "opiates"}], "dwjwayt": [{"0_Comment Submission": "Just a lines worth of some H", "1_Text": "ha,ha,ha,ha.", "2_Subreddit": "opiates"}], "dwk8ij6": [{"0_Comment Submission": "Fuck my life", "1_Text": "Not necessarily true. I know people who went to jail for heroin possession and didn't loose their kids. I know other people who voluntarily & temporarily gave their kids up because of drug related problems with homelessness & legal trouble... then when they went to get their kids back their family member tried to block them so they couldn't ....so my friend went to court and even acknowledged their addiction and *still* got their kids back.", "2_Subreddit": "opiates"}], "dwkuszv": [{"0_Comment Submission": "Fuck my life", "1_Text": "Then that is crazy that you can't live with your child. I can think of so much more harmful stuff people do to their kids and nothing happens to them. If every addict ( drugs, alcohol,  sex, food, gambling. .*whatever* ) lost their children just because of addiction there would be alot of children that the government would have to take care of. Addiction does not automatically =abuse", "2_Subreddit": "opiates"}], "dwkux50": [{"0_Comment Submission": "A day at a time.", "1_Text": "Man big ups to you. You are kicking 2 of the hardest opiates to kick...methadone & fentanyl.  Good for you: )", "2_Subreddit": "opiates"}], "dwmrd1t": [{"0_Comment Submission": "Hallelujah! Its an Easter miracle", "1_Text": "Fuck yeah! Easter dinner = dope .... you the junkie chef. Best be starting your cooking show.", "2_Subreddit": "opiates"}], "dwmstly": [{"0_Comment Submission": "What would you do?", "1_Text": "What? Who's dying?", "2_Subreddit": "opiates"}], "dwn0hvi": [{"0_Comment Submission": "Hallelujah! Its an Easter miracle", "1_Text": "Chills Nodding Noches. .. ha,ha,ha,ha.", "2_Subreddit": "opiates"}], "dwo22uw": [{"0_Comment Submission": "Happy April Fool's, guys.", "1_Text": "That was good.", "2_Subreddit": "opiates"}], "dwodqa0": [{"0_Comment Submission": "I’m sick and tired of this, and nobody wants to help me. I’m a grown ass man and I’m crying right now.", "1_Text": "Question for you? Are you calling private methadone clinics that you pay for out of pocket?  That just seems crazy that there are no clinics with openings.... Sorry you are sick. It sucks", "2_Subreddit": "opiates"}], "dwothu1": [{"0_Comment Submission": "Lost my job of 4 years--the one thing is was proud of in my life", "1_Text": "Dude, your cakes are amazing. You do that shit with buttercream too...which is *really* hard. People see these shows on T.V. that decorate cakes but 90% of those use fondant and they use cookie cutter type things to cut them out. Plus fondant is very stiff ( and gross tasting). Buttercream is delicious and so soft that its suuuper hard to decorate with. Again, WOW your cakes are awesome. You really are an artist.\n\nI feel for you the loss of the job, but when you are ready to get a new job you shouldn't have a problem with how talented you are. Good luck girlie!", "2_Subreddit": "opiates"}], "dwotw5h": [{"0_Comment Submission": "I’m sick and tired of this, and nobody wants to help me. I’m a grown ass man and I’m crying right now.", "1_Text": "Wow, that's crazy. Sometimes they have a wait list for state subsidized or \"free\" methadone but usually if you are paying out of pocket they get you in. That sucks. Well good luck !", "2_Subreddit": "opiates"}], "dwpj2n5": [{"0_Comment Submission": "H Porn", "1_Text": "Somebody tried to start one a couple years ago... It kinda petered out. It always seemed like a good idea.", "2_Subreddit": "opiates"}], "dwssf1m": [{"0_Comment Submission": "Kratom Recall?", "1_Text": "Elliott in the morning ....lol. I recently called into their show and was on air trying to explain about \"bartards\"  and people blacking out and doing bizarre shit on xanax.", "2_Subreddit": "opiates"}], "dwxe252": [{"0_Comment Submission": "Sorry for the delay. GF has the rest put away for me. Oh well. It’s 🐼 🐸 time!!!", "1_Text": "Hey Catman!  I was just thinking about you the other day....how is your stomach  feeling? Hopefully better! Enjoy those pills....meeeeooooow: )", "2_Subreddit": "opiates"}], "dwxo3tf": [{"0_Comment Submission": "Sorry for the delay. GF has the rest put away for me. Oh well. It’s 🐼 🐸 time!!!", "1_Text": "Awesome :)", "2_Subreddit": "opiates"}]}], "1_submissions": [{"6ctaeo": [{"0_Title": "trim 15DCEA41 851B 4242 8527 A5E4D33FCDE4", "1_Text": "Trippy looking ain't it... and trippy to be commenting on a 90 day old post...lol", "2_Subreddit": "opiates"}], "6gvwxt": [{"0_Title": "Dude. Makers of Vivitrol are evil geniuses . They are lobbying state g'vrmnts to PASS LAWS so Suboxen won't be prescribed.", "1_Text": "Trippy looking ain't it... and trippy to be commenting on a 90 day old post...lol", "2_Subreddit": "opiates"}], "6oqb8h": [{"0_Title": "Huh..Cops aren't 100% honest always? No way!", "1_Text": "Trippy looking ain't it... and trippy to be commenting on a 90 day old post...lol", "2_Subreddit": "opiates"}], "72w5rn": [{"0_Title": "Thanks methadone clinic counselor, I love feeling like a middle schooler in the principals office!", "1_Text": "Trippy looking ain't it... and trippy to be commenting on a 90 day old post...lol", "2_Subreddit": "opiates"}], "7dfqvo": [{"0_Title": "Oh yeah we at 44,444 Subscribers y'all", "1_Text": "Trippy looking ain't it... and trippy to be commenting on a 90 day old post...lol", "2_Subreddit": "opiates"}], "7ru8mj": [{"0_Title": "So this is a junkie \"What would you do\"", "1_Text": "Trippy looking ain't it... and trippy to be commenting on a 90 day old post...lol", "2_Subreddit": "opiates"}], "88rnh5": [{"0_Title": "Hallelujah! Its an Easter miracle", "1_Text": "Trippy looking ain't it... and trippy to be commenting on a 90 day old post...lol", "2_Subreddit": "opiates"}]}]}]}