{"Pongpianskul": [{"0_comments": [{"dwqz9t7": [{"0_Comment Submission": "Someone left a coupon they weren't using next to the cheese in my grocery store", "1_Text": "yep", "2_Subreddit": "HumansBeingBros"}], "dwqzco2": [{"0_Comment Submission": "Someone left a coupon they weren't using next to the cheese in my grocery store", "1_Text": "oh no, not again.... sigh", "2_Subreddit": "HumansBeingBros"}], "dwr58b3": [{"0_Comment Submission": "\"oh you have migraines? have you tried....?\"", "1_Text": "Trepanation was a suggestion I seriously considered at one time. Oldest form of surgery known to mankind.", "2_Subreddit": "migraine"}], "dwrbtv1": [{"0_Comment Submission": "\"oh you have migraines? have you tried....?\"", "1_Text": "I saw a documentary in which 20th century people did it to themselves on camera out of desperation, or else went to Egypt or someplace similar where at the time, people could get doctors to do it.", "2_Subreddit": "migraine"}], "dwrcz16": [{"0_Comment Submission": "So is ALKS 5461 finished?", "1_Text": "I tried bupe for depression but it did nothing to help and getting off is a bit troublesome. But my sister has been taking it for BPD symptoms for about 12 years and swears by it. Never worked for me, unfortunately.", "2_Subreddit": "depressionregimens"}], "dwsclnw": [{"0_Comment Submission": "\"oh you have migraines? have you tried....?\"", "1_Text": "> because of my personality \n\nI would've strangled him. Fucking asshole is right! I only hope he has the opportunity to sample a migraine or two for himself. My sister has about 15 migraines a month and does sumatriptan shots which she swears by.", "2_Subreddit": "migraine"}], "dwt2xun": [{"0_Comment Submission": "I understand suicide", "1_Text": "There are so many of us. This isn't comforting. I've become too sick to reach out too for the most part. Can barely do bare necessities. Can barely satisfy needs of dogs. Can't imagine how hard it must be to have kids and depression. That's a lot. My mom had bouts of severe depression too (and other issues) and I understood only much later in my life, a lot of ways she acted and things she said that made no sense at the time but do now.", "2_Subreddit": "SuicideWatch"}], "dwt33j4": [{"0_Comment Submission": "I understand suicide", "1_Text": "The thing is, everything and everyone is constantly changing. We don't know what the future may hold. Some remember times of being happy and will go through hell in the smallest hope of having that back someday. It's not as simple as it sounds sometimes. One has to be sure that nothing will ever improve no matter what. Although I'm getting close to that, I'm not quite there yet - obviously.", "2_Subreddit": "SuicideWatch"}], "dwtkzjt": [{"0_Comment Submission": "An aspect of humans I've always hated: unrealistic declarations", "1_Text": "Absolutely!", "2_Subreddit": "misanthropy"}], "dwwo4g8": [{"0_Comment Submission": "Nobody knows this but me.", "1_Text": "Been there. It was a long time ago but I remember it in excruciating detail. It is pure hell. \n\nBut there's good news. If you keep off the opiates, you WILL get better and better with every passing day. There are few conditions you can truthfully say this about, but withdrawal from heroin is one of them, thankfully.\n\nYou have gone through the worst now. You will start appreciating little things again soon. Music will start sounding very intense and moving. Life will stir inside you and hunger will return. Then, you know you're gonna live.\n\nYou are VERY brave and honest and now you're newly painfully free. Freedom hurts a bit at first but it's gloriously worthwhile.\n\nI have TONS of respect for anyone who can do what you've done and keep going. It's probably one of my most painful memories to this day.\n\nStay free no matter what, OP. Life can be more enjoyable.\n\nTry Alteril for sleep - a mix of melatonin and herbal shit that actually works. L-theanine is a supplement that helps calm and soothe a bit. If you have access to marijuana, it can stimulate the appetite and sagging sense of humor. Being able to chuckle even once is extremely helpful and eating is a blessing too.\n\nExercise if you can. Warm baths when muscles hurt too bad for sleep.\n\nIt's spring. LIfe is returning. The process of rebirth is difficult but worth every second of pain - hard as that may be to believe at this point. \n\nAmazed you're well enough to post. Damn. Well done.", "2_Subreddit": "TrueOffMyChest"}], "dwwo7cj": [{"0_Comment Submission": "Nobody knows this but me.", "1_Text": "no", "2_Subreddit": "TrueOffMyChest"}], "dwwp4yj": [{"0_Comment Submission": "I.....I think I'm becoming a psychopath", "1_Text": "\"Wanting to occasionally kill people\" is not the medical definition of psychopathy and you should look up what the real symptoms are instead of going exclusively by what you see in popular culture.\n\nI grew up with a mother with anti-social personality disorder, i.e. psychopathy. She has never killed anyone as far as I know (she is a complete liar so who knows?) but she's committed countless petty crimes and a few assaults and has hurt a lot of people without remorse or fear or the slightest consideration of the consequences of her actions.\n\nYour trepidation regarding your murderous thoughts is something that would be alien to her. No fear about anything. Your self doubts and distress would be alien too. Having true romantic interests is impossible for psychopaths because they cannot love or feel empathy. They know this and it hurts terribly.\n\nBelieve me, you don't want to live the empty, lonely, frustrating life of a real psychopath. It's not all blood and guts and murder. There's a ton of suffering and loneliness and absolute isolation involved as well.\n\nAnyway, so many people are intolerable jerks that fantasizing about offing them is pretty normal. \nDoing it is utterly different, of course.\n\nGet a more experienced and competent therapist. Yours sounds as if they may be out of their depth.", "2_Subreddit": "needadvice"}], "dwwpqxz": [{"0_Comment Submission": "My home when i was homeless", "1_Text": "Were you in a cold part of the country? Is that a wood stove stack on the right side? Was it cozy or ... ?\n\nWhen I was a teen in a similar situation to yours, I lived near a big city (Wash DC) so I just moved into an abandoned factory. Much more peaceful than home even with the bullshit of street life.", "2_Subreddit": "OffGridCabins"}], "dwwq0mw": [{"0_Comment Submission": "Chris Paine’s New AI Documentary is free to watch until Sunday Night", "1_Text": "So transcend the binary.", "2_Subreddit": "singularity"}], "dwwq9ai": [{"0_Comment Submission": "How to be alone?", "1_Text": "I have been alone over 10 years (though with 2 dogs) and I've found (the hard way as usual) that we are an inherently social species, hard-wired to need one another - as inconvenient and difficult as that may be.\n\nI am still alone but suffering mental illness and agonizing loneliness even though I hate people. Perhaps because I also dislike myself. Even the dogs don't much care for me.\n\nAnyway, some people can do it. Hermits, religious fanatics, and so on and not be overwhelmed by insanity but I am not one of them.\n\nUnfortunately, once you've managed to abandon humanity, getting back in is very hard. I can't think of anyone who isn't totally indifferent about me. I am useless to everyone so no one would miss me if I stopped existing. I'm still alone even though I no longer want to be. I've lost a lot of the meager social skills I once had. I fear my fellow man. I don't know how to get out of the hole I dug myself into. I am, perhaps meant to live as a cautionary tale. Don't do whatever I do. Who knows.", "2_Subreddit": "Life"}], "dwwreqt": [{"0_Comment Submission": "Questions about subutex//bupenorphine", "1_Text": "Tramadol is no joke to get off of either from what I've heard. It's a mix of opioids and antidepressant-type substances which makes it one of the most painful drugs to quit, people say.\n\nI have quit bupe and know that a long slow taper can be practically painless and that the long half life helps in that respect. It is usually harder to taper off opioids with short half lives.\n\nSubs don't kill pain long term for many people but if they work for you, they may be a viable option.", "2_Subreddit": "suboxone"}], "dwwyuwi": [{"0_Comment Submission": "Questions about subutex//bupenorphine", "1_Text": "Ugh. Your taste in highs, like everyone's, is personal I suppose, and therefore beyond useful debate but I hate the tramadol high and only did it a few times when no other opiates were around and I was in a bad state and I found some left over from my dad's illness.\n\nIn my experience, getting off anything with SNRI effects has been, without exception, the worst hell imaginable. Comparatively, heroin withdrawal was a piece of cake even after 12 years of IV use and a huge $200/day habit. For me, getting off antidepressants has led to 2 years of uninterrupted anhedonia, which doctors assure me is not unheard of in spite of how outrageous it sounds and feels.", "2_Subreddit": "suboxone"}], "dwx0ndw": [{"0_Comment Submission": "Follow up from the last post “Departing this world in 3 hours”.", "1_Text": "Read your previous post this AM. Actually cried because the despair was so relatable and your decision to end it, so hard to accept but also sadly understandable.\n\nYou can't imagine the spark of hope this new post has generated!!! We are all connected and more similar than we may think and changing your mind as well as writing this to tell people about it has made an enormous difference.\n\nThere is a ton of suffering in this world and we need to find out why and do something about it. First, we need to be able to survive and enjoy at least parts of our lives as individuals. Second, we need to root out the sources of our shared suffering and address it and help others as best we can. By saving others, we save ourselves. I'm pretty sure of that. No one can just survive alone. I've tried and failed miserably. \n\nThank you so much for this badly needed post. Thanks more than words can convey.", "2_Subreddit": "SuicideWatch"}], "dwx4f7a": [{"0_Comment Submission": "I have never done any opiates. I've been browsing this sub for ~2 hours now.", "1_Text": "And while you're at it, you might also want to not try crack cocaine, meth, benzos, paint or glue fumes and any addictive brain-altering pharmaceuticals either. Fuck I could go on and on but you seem like a pretty sensible person and can probably figure most of it out for yourself. You're lucky.", "2_Subreddit": "opiates"}], "dwx4ls0": [{"0_Comment Submission": "I have never done any opiates. I've been browsing this sub for ~2 hours now.", "1_Text": "Well said. For the less verbal, this video conveys the addiction situation accurately:\n\nhttps://www.youtube.com/watch?v=HUngLgGRJpo&t=32s", "2_Subreddit": "opiates"}], "dwx4y95": [{"0_Comment Submission": "Tom Cruise Salutes The Portrait", "1_Text": "This doesn't make him seem intelligent or spiritual. He seems sincerely bamboozled. It's a shame.", "2_Subreddit": "scientology"}], "dwx59b2": [{"0_Comment Submission": "a thing I learned with age", "1_Text": "And a living in a narrative of some sort also seems necessary for human beings. It's not optional. Tried to live w/o one and it was impossible and painful. Now trying to put together a new one to replace the one I trashed. Harder than one might imagine.", "2_Subreddit": "self"}], "dwxf9ng": [{"0_Comment Submission": "Questions about subutex//bupenorphine", "1_Text": "Well alright then. We are more similar than not.", "2_Subreddit": "suboxone"}], "dwxfdjr": [{"0_Comment Submission": "My home when i was homeless", "1_Text": "Redneck engineering at its finest!", "2_Subreddit": "OffGridCabins"}], "dwxfv81": [{"0_Comment Submission": "I have never done any opiates. I've been browsing this sub for ~2 hours now.", "1_Text": "Hadn't seen that before but it matches my own experience pretty well. My first words after trying a tiny line of heroin for the first time were \"So, this is what it's like to feel normal.\" All I felt, for the first time in years probably, was \"OK in my own skin\". Nothing more and nothing less. For some of my friends who were OK, they tried it, liked it OK but didn't become addicts. They were not depressed or in pain like I was and didn't really have enough devotion to the feeling it gave to give up everything for it. Only me and one other friend with serious depression became serious long term addicts almost overnight. It was almost a step up for me because until I tried heroin I could barely look people in the eye.", "2_Subreddit": "opiates"}]}], "1_submissions": [{"2kvsaq": [{"0_Title": "Does anyone know an \"investor dog\"?", "1_Text": "yep", "2_Subreddit": "DOG"}], "2pz7e9": [{"0_Title": "Let's celebrate \"Happy Day\"!", "1_Text": "yep", "2_Subreddit": "happy"}], "2xnz1i": [{"0_Title": "Anyone see adult dogs playing 2 on 1 with puppies?", "1_Text": "yep", "2_Subreddit": "caninebehavior"}], "31uwsr": [{"0_Title": "Can I improve myself? A paradox.", "1_Text": "yep", "2_Subreddit": "self"}], "34v1b6": [{"0_Title": "An insight into how not to give a fuck.", "1_Text": "yep", "2_Subreddit": "howtonotgiveafuck"}], "35ed7i": [{"0_Title": "Ecclesiastes:Despairing or Joyful?", "1_Text": "yep", "2_Subreddit": "DebateAChristian"}], "37x4i5": [{"0_Title": "How nice to find people who hate people as much as I do!", "1_Text": "yep", "2_Subreddit": "misanthropy"}], "38o2l2": [{"0_Title": "Anyone have a donkey?", "1_Text": "yep", "2_Subreddit": "homestead"}], "38wp28": [{"0_Title": "Why can't I unsubscribe to this subreddit?", "1_Text": "yep", "2_Subreddit": "SandersForPresident"}], "390tl3": [{"0_Title": "Harry Potter books spark rise in Satanism [cross-post from /r/TheOnion", "1_Text": "yep", "2_Subreddit": "exjw"}], "3bb9o5": [{"0_Title": "My parent left me out in the cold to die. [x-post from /r/depression]", "1_Text": "yep", "2_Subreddit": "exjw"}], "3bms80": [{"0_Title": "F**K gay marriage and f**k non-gay marriage too.", "1_Text": "yep", "2_Subreddit": "rant"}], "3cx2v8": [{"0_Title": "Psychologist complicit in CIA torture. Maybe LRH was right after all.", "1_Text": "yep", "2_Subreddit": "scientology"}], "3g688n": [{"0_Title": "According to Scientologists, what is \"spiritual freedom\"?", "1_Text": "yep", "2_Subreddit": "scientology"}], "3h57ov": [{"0_Title": "Scientology vs Jehovah's Witnesses - A Talk with Lloyd Evans [x-post from r/scientology]", "1_Text": "yep", "2_Subreddit": "exjw"}], "3kern0": [{"0_Title": "What cultural changes have you noticed as the result of legalization?", "1_Text": "yep", "2_Subreddit": "OregonTrees"}], "3loar5": [{"0_Title": "Did your illumination follow a long \"dark night of the soul\"?", "1_Text": "yep", "2_Subreddit": "awakened"}], "3lov7p": [{"0_Title": "Believers: How did you become religious?", "1_Text": "yep", "2_Subreddit": "DebateReligion"}], "3lu7j2": [{"0_Title": "Why do you talk about God?", "1_Text": "yep", "2_Subreddit": "DebateReligion"}], "5uvcxy": [{"0_Title": "Drinking delicious kava", "1_Text": "yep", "2_Subreddit": "Kava"}]}]}]}