{"abruptdismissal": [{"0_comments": [{"dwsg63s": [{"0_Comment Submission": "Is tor anonymous from session to session?", "1_Text": "oh yeah, and install privoxy.", "2_Subreddit": "TOR"}], "dwsgvpq": [{"0_Comment Submission": "r/CoreCyberpunk Book Club Voting Thread - Apr 2018", "1_Text": "I vote for Neuromancer, let's start at the beginning.", "2_Subreddit": "CoreCyberpunk"}], "dwshujs": [{"0_Comment Submission": "Melted capsule?", "1_Text": "gel caps are water soluble? it's gelatine. it's supposed to melt in your stomach", "2_Subreddit": "researchchemicals"}], "dwshzwt": [{"0_Comment Submission": "Chems most likely to cause HPPD?", "1_Text": "i had minor trippy visual distortions, sort of flowing liquid effects on textured surfaces...  but yeah wasn't bad.", "2_Subreddit": "researchchemicals"}], "dwti0ah": [{"0_Comment Submission": "A demonstration of the Chinese image recognition system SenseTime", "1_Text": "In ideal conditions maybe... I work as a pentester, at my job we tested a facial recognition identity system. It was fooled by a crude cardboard cutout mask. I'm not saying this is the case with this, but you'd be surprised how brittle this shit can be.", "2_Subreddit": "CoreCyberpunk"}], "dwtjoi4": [{"0_Comment Submission": "Apple and their oppression...", "1_Text": "i believe the fat hierarchy goes smallfat < deathfat < infinifat", "2_Subreddit": "TumblrInAction"}], "dwtl00g": [{"0_Comment Submission": "[D] If I could synthesize any high quality image data set for you with class/feature point/mask annotations, what would you pick?", "1_Text": "don't know why you're getting downvoted, seems logical to me.", "2_Subreddit": "MachineLearning"}], "dwtlggd": [{"0_Comment Submission": "The same slack", "1_Text": "It's true, I watched this great documentary called \"The Exorcist\" that had about that.", "2_Subreddit": "TumblrInAction"}], "dwtmpsd": [{"0_Comment Submission": "milk is racist", "1_Text": "unpasteurised milk is delicious though...\n\ni ate raw chicken in japan, it was fine.... just walked it off afterwards :)", "2_Subreddit": "TumblrInAction"}], "dwtmzy1": [{"0_Comment Submission": "milk is racist", "1_Text": "I gotta admit, the cultural imprinting of \"DON'T EAT THS! YOU'LL GET SICK!\" was pretty strong", "2_Subreddit": "TumblrInAction"}], "dwtpq15": [{"0_Comment Submission": "milk is racist", "1_Text": "oh yes, i was a guest somewhere and it was offered, couldn't really refuse out of politeness", "2_Subreddit": "TumblrInAction"}], "dwtxffg": [{"0_Comment Submission": "milk is racist", "1_Text": "I don't know,  it was at a traditional restaurant so I assume they knew what they were doing.", "2_Subreddit": "TumblrInAction"}], "dwtxmnc": [{"0_Comment Submission": "Does anyone here like Spike Fuck?", "1_Text": "Ah glad someone replied, was feeling like I was shouting into the void haha.\n\nPretty sure I found them by searching for \"junkie\" on spotify.", "2_Subreddit": "opiates"}], "dwtyig6": [{"0_Comment Submission": "White people can't use slang I guess.", "1_Text": "Get on your bikes and ride!", "2_Subreddit": "TumblrInAction"}], "dwu36ee": [{"0_Comment Submission": "Gangstalking: The next New Kids On The Block", "1_Text": "I suppose to outsiders, it seems \"obvious\" what is going on here, and frustrating that it's being indulged. Having experienced (substance induced) paranoid delusions myself, it all seems very familiar.", "2_Subreddit": "Gangstalking"}], "dwu81wm": [{"0_Comment Submission": "Gangstalking: The next New Kids On The Block", "1_Text": "That wasn't me (downvoting), I'm just commenting on what  you see as dismissive. Perhaps paranoid schizophrenia  might be a leap too far, but I think general paranoia and delusions of reference are actually pretty obvious. \n\nIt struck me, after I came out of a delusional state (which fortunately happened pretty rapidly after cessation), how my theories of persecution exactly fit with the observable evidence while still being totally utterly wrong. Same evidence, completely incorrect interpretation. \n\nThree red cars drive past you in a row. An  hour later, another red car drives past. You could interpret this as total coincidence, as completely meaningless and unremarkable. Or you could interpret it as evidence of a deliberate conspiracy to gangstalk you. \n\nTo everyone who isn't experiencing persecutory delusions,  option two appears completely unreasonable. It is indeed \"obvious\"  what the reasonable  interpretation is..", "2_Subreddit": "Gangstalking"}], "dww2d4u": [{"0_Comment Submission": "r/CoreCyberpunk Book Club Voting Thread - Apr 2018", "1_Text": "While I've read neuromancer before, it's a solid fifteen years ago... I've basically entirely forgotten the  plot.", "2_Subreddit": "CoreCyberpunk"}], "dww49j8": [{"0_Comment Submission": "Gangstalking: The next New Kids On The Block", "1_Text": "Does three red cars in a row suggest a conspiracy to you? \n\nBUT IT'S NOT JUST THAT -- the  people on the  TV are making hand signals! I know everyone sees them  but  they are  aimed specifically at me!\n\nWhen the only difference between  gangstalking and perfectly normal random events is the subject's state of mind, it's  paranoia.  I think people get frustrated with seeing delusions being encouraged here, while pointing out the simplest explanation \"you are not being gangstalked,  you are suffering from paranoia\" is forbidden by the rules of this sub.  \n\nI agree that trolling is extremely shitty -- but i also think encouraging delusions of persecution iss actively harmful, and that appears to be what this sub is engaging in.", "2_Subreddit": "Gangstalking"}], "dww4u1z": [{"0_Comment Submission": "Possibly gangstalking?", "1_Text": "epic troll \\m/", "2_Subreddit": "Gangstalking"}], "dww6ijb": [{"0_Comment Submission": "Reading books makes you Alt-Right", "1_Text": "Aldous Huxley! Alt-right!  You gotta be fucking shitting me. This is beyond retarded.", "2_Subreddit": "TumblrInAction"}], "dwwr5d8": [{"0_Comment Submission": "Introducing FindSubDomains, a new subdomain enumeration and information gathering tool", "1_Text": "TL;DR points of differentiation?", "2_Subreddit": "netsec"}], "dwwvup7": [{"0_Comment Submission": "Gangstalking: The next New Kids On The Block", "1_Text": "I understand your point of view, and you're probably right in that it won't do any good. All I know is in my case, someone telling me a I was paranoid (it wasn't a stranger admittedly) was really a wake up call for me, and made me think \"hey this is ridiculous, and I need to start taking care of my own mental health\". \n\nIt was a deeply frightening experience, and made me realise how much the mind is capable of twisting things. \n\nI've been lurking on this sub on and off for a while, and I don't think I've ever seen anyone here post any real proof that they are being stalked. It's always of the three red cars, hand signals on the television variety. In such cases, I feel pretty confident in saying \"this is pure paranoia\". Someone brought up the COINTELPRO campaign against MLK here before. The major difference is, Martin Luther King received actual letters telling him to kill himself. If someone  offers evidence like that, then yes, something is probably happening. But they never do.", "2_Subreddit": "Gangstalking"}], "dwww3z5": [{"0_Comment Submission": "Philadelphia considers opening site for heroin users to shoot up safely", "1_Text": "Utopia if you ask me.", "2_Subreddit": "DystopiaToday"}], "dwwwauf": [{"0_Comment Submission": "Gunwoman attacked YouTube for filtering her videos, police say", "1_Text": "The interesting thing about this is the way it was reported. First it was a \"domestic dispute\".  Now they are saying she didn't know the victims. \n\nThey went straight to the motive draw and picked up the first non-matching set of socks they found.", "2_Subreddit": "DystopiaToday"}], "dwwxhoi": [{"0_Comment Submission": "The age of Commercial Augments is here, and now.", "1_Text": "I was thinking about that too. Also, why the power to weight ratio of robotics is so crappy compared to biological muscle.", "2_Subreddit": "CoreCyberpunk"}]}], "1_submissions": [{"6cfvnx": [{"0_Title": "If you’re into disturbing documentaries that capture the essence of human frailty, I heartily recommend “Dream Deceivers” (1992)", "1_Text": "oh yeah, and install privoxy.", "2_Subreddit": "horror"}], "6ctkku": [{"0_Title": "Which version of IDA to buy?", "1_Text": "oh yeah, and install privoxy.", "2_Subreddit": "netsecstudents"}], "6ctqap": [{"0_Title": "Which version of IDA to buy? Xposted from /r/netsecstudents", "1_Text": "oh yeah, and install privoxy.", "2_Subreddit": "AskNetsec"}], "6gky6b": [{"0_Title": "Are the saxaphone riffs from Mark Knopfler's Local Hero \"Going Home\" & Gerry Rafferty's \"Baker Street\" EXACTLY the same?", "1_Text": "oh yeah, and install privoxy.", "2_Subreddit": "direstraits"}], "6j5jc2": [{"0_Title": "[AF] What's the community standard for page/fragment caching with flask / jinja2", "1_Text": "oh yeah, and install privoxy.", "2_Subreddit": "flask"}], "6k7wxc": [{"0_Title": "I run the \"Fresh Onions\" directory, what Features would Improve the Site For you?", "1_Text": "oh yeah, and install privoxy.", "2_Subreddit": "deepweb"}], "6k7xbn": [{"0_Title": "I run the \"Fresh Onions\" directory, what features would improve the site for you? (x-posted /r/deepweb)", "1_Text": "oh yeah, and install privoxy.", "2_Subreddit": "onions"}], "6nlrw5": [{"0_Title": "So you want to Start The Next AlphaBay: Threat Modelling For Criminals", "1_Text": "oh yeah, and install privoxy.", "2_Subreddit": "deepweb"}], "6shz0o": [{"0_Title": "How much is your insurance?", "1_Text": "oh yeah, and install privoxy.", "2_Subreddit": "ElitePS"}], "73xkaf": [{"0_Title": "Click here to support Help X not lose hope escaping abuse after Cheetos denial", "1_Text": "oh yeah, and install privoxy.", "2_Subreddit": "TumblrInAction"}], "74dkjg": [{"0_Title": "/r/gangstalking - paranoid schizophrenics convince each other they are \"targeted individuals\" that are being harassed. mind control is often involved.", "1_Text": "oh yeah, and install privoxy.", "2_Subreddit": "WeirdSubreddits"}], "7ns8i4": [{"0_Title": "Are our brains really so different? Wondering why different chemicals affect people so differently.", "1_Text": "oh yeah, and install privoxy.", "2_Subreddit": "Nootropics"}], "7psmh1": [{"0_Title": "Get explicit about sexual consent! Secured in the blockchain!", "1_Text": "oh yeah, and install privoxy.", "2_Subreddit": "TumblrInAction"}], "7ybf5w": [{"0_Title": "the old semantic bait-in-switch", "1_Text": "oh yeah, and install privoxy.", "2_Subreddit": "TiADiscussion"}], "7yug17": [{"0_Title": "Request: Horror Movies With Labyrinths or Mazes", "1_Text": "oh yeah, and install privoxy.", "2_Subreddit": "horror"}], "7yvg40": [{"0_Title": "Why has dream been removed From the DNM Superlist?", "1_Text": "oh yeah, and install privoxy.", "2_Subreddit": "deepweb"}], "83ly6p": [{"0_Title": "what is \"gender\"?", "1_Text": "oh yeah, and install privoxy.", "2_Subreddit": "AskFeminists"}], "861t0v": [{"0_Title": "Sex relies entirely on humiliation and power imbalance", "1_Text": "oh yeah, and install privoxy.", "2_Subreddit": "TumblrInAction"}], "88p7qu": [{"0_Title": "Study shows VG as bad as smoking, PG nearly as good as pure air (on mice)", "1_Text": "oh yeah, and install privoxy.", "2_Subreddit": "Vaping"}], "88qjti": [{"0_Title": "As an anthropologist I just want to say: emojis are magick", "1_Text": "oh yeah, and install privoxy.", "2_Subreddit": "TumblrInAction"}], "89d5ac": [{"0_Title": "[Help] Tracking down some poems by H. L. Hix", "1_Text": "oh yeah, and install privoxy.", "2_Subreddit": "Poetry"}], "89dyky": [{"0_Title": "LAFORGE Optical -- A wearable HUD that doesn't make you look like a glasshole", "1_Text": "oh yeah, and install privoxy.", "2_Subreddit": "CoreCyberpunk"}], "89mxun": [{"0_Title": "Does anyone here like Spike Fuck?", "1_Text": "oh yeah, and install privoxy.", "2_Subreddit": "opiates"}], "89y6q5": [{"0_Title": "Grim Future", "1_Text": "oh yeah, and install privoxy.", "2_Subreddit": "CircleofTrust"}], "8aesua": [{"0_Title": "Myths Over Miami: Homeless Children Create Their Own Mythology", "1_Text": "oh yeah, and install privoxy.", "2_Subreddit": "DystopiaToday"}]}]}]}