{"PontiffTheGreat": [{"0_comments": [{"dwqbhkt": [{"0_Comment Submission": "Pray for post pt 2 dope porn! 2Gs, it's gonna be a good few days! Hope your all good today opiate peeps!", "1_Text": "Yeah I agree, That looks like a solid, damn tasty 2 grams. What's your ROA? And is that #3 or #4?? Looks very nice!", "2_Subreddit": "opiates"}], "dwqolow": [{"0_Comment Submission": "The Psychopathology of Long-Term Addiction and Cessation.", "1_Text": "Hey there, thanks for bringing that up for discussion.\n\nFirstly; the implication of my post, as stated in the OP, is on addressing depressive states triggered by long term opioid abuse, the PAWS/depression that can follow after cessation, whereby people tend to go on with the mentality that their condition is an ongoing pathology of their past opioid abuse, and \"will never be happy again without/due to opioid use\", when in fact prior use can simply be the trigger of a persisting mental state that (again; while triggered by long term abuse) is not continuously caused by the latter, but instead is a now independant depression in its own right. And should be identified and treated as such.\n\n>isn't simply because of the neurobiology that results\n\nNote I imply this precise notion in the OP; the neurochemistry is typically the trigger, yet the primordial, persisting pathology after chemical equilibria is resolved is in fact a case of clinical depression; an abstract psycholathology, regardless of the trigger.\n\nYou make reference to a somewhat different context; a pre-use state of depression wherein opioid use is consequently engaged in as a method of self-medication. I dont mention this in the OP, but to discuss it; I don't believe self medication with opioids is inherently negative here. In fact I would posit that opioids are as you say; hugely effective for this purpose. It is a possible therapeutic approach that is however plagued by stigma, negative legal bias and fear of abuse potential. If used in a properly structured therapeutic regimen then I believe opioids are extremely effective, this us however unquestionably a difficult task to adhere to; as opioids *do* have poignant recreational potential and progression from use to abuse is very easy.\n\nNow for my overall psychological opinion. Having been treated with SSRIs and experienced my fair share of mental illness personally and academically, I dont think any medication (bar in a generally uncommon context; where an inherent neurochemical deficiency is evidently a core causal factor in mental illness), should be used as an ultimate treatment for said pathology. Including opioids. Anxiety and depression are almost always triggered, perpetuated and reinforced by higher level, abstract psychological elements; issues in perspective and appraisals, distortions of thought, overly reactive thinking, potent discomfort with uncertainty, catastrophic beliefs, pseudo-delusional desire for control and others. They are abstract, relational disorders. As put by my psychiatrist; medication does not and will never address the actual problem in mental illness, what they do is create space ane flexibility. **Psychology neede to go in this space, to address the high level, relational pathologies that at the very least; perpetuate and worsen mental illness.**\n\nI dont see your self medicating with opioids as inherently bad, but only if one is capable of *using* them in a calculated and structured fashion, and not *abusing* them. I strongly believe this is however not a context where some of the core issues underpinning your pathology are being treated. You should not neglect to undertake a psychological approach in parallel. My recommendations regarding this are the same suggested in the OP for post-addiction onset of depressive states.", "2_Subreddit": "opiates"}], "dww7yu0": [{"0_Comment Submission": "Who got the link of the post about the guy claiming he's in Afghanistan or somewhere in Iraq or something about him and 10 other Muhammad's cooking up dope from start to finish. It was like a 30 pic Imgur link.", "1_Text": "Regardless of who the pics belong to, man would I love to bury my face in that container.", "2_Subreddit": "opiates"}], "dww9cuc": [{"0_Comment Submission": "Today’s pick up", "1_Text": "Beautiful. The trifecta.", "2_Subreddit": "opiates"}], "dwwdp19": [{"0_Comment Submission": "Just when I thought I was gonna have to go thru WD hell found these OTC.", "1_Text": "Wow in FR that's still impressive. Nice score. Those are crusheable too?", "2_Subreddit": "opiates"}], "dwweu1c": [{"0_Comment Submission": "Just when I thought I was gonna have to go thru WD hell found these OTC.", "1_Text": "Crush and parachute em.", "2_Subreddit": "opiates"}], "dwwf65d": [{"0_Comment Submission": "Quitting is impossible because I'd rather die than be sober", "1_Text": "What you believe and how you feel at the moment is irrelevent to the potential reality at your fingertips.\n\nYou describe a classically depressed affect. You also have an addiction and distortions of perspective. All things that are very, **very** treatable. There are many with full on psychotic depression, schizophrenia, bipolar, PTSD, whatever, and the vast majority **do come to enjoy life with treatment**. Just to underscore that this feeling of hopelesness and futility is almost always just that; a feeling. A feeling that arises because of poor psychology, abuse, addiction, trauma, whatever. A feeling can be changed. A belief can be changed. Both of these things can be completely incorrect and unrealistic, *no matter how they feel*, the sense that they are true is what defines depression as an illness. Depression isnt some extraneous feeling gloom, it manifests through your tendencies of thought, beliefs and expectations.\n\nI 100% guarrantee you that there is a plethora of unimaginably ecstatic possibilities in your future outside of drug use. Yes it isnt easy. Yes it can take a lot of work and courage, but those possibilities are ultimately there. Keep on keeping on, challenge your beliefs/feelingds, put yourself out of your comfort zone and adhere to your values regardless of thoughts/feelings you may have. Investigate and challenge the uncertainties you face.\n\nLife is unquestionably, absolutely beautiful, sometimes we just need to relearn how to appreciate it. Take care.", "2_Subreddit": "opiates"}], "dwwh9iq": [{"0_Comment Submission": "Quitting is impossible because I'd rather die than be sober", "1_Text": "No worries. But trust me. Can you believe that someone else believes these things 100%? The very nature of psychopathology involves distortions in perspective, where we can come to *believe* such frightening and terrible things. No matter how dark or deep the hole, there is always a ladder, no matter how difficult or impossible the climb seems, it can be done. Keep on keeping on mate.", "2_Subreddit": "opiates"}], "dwwigx5": [{"0_Comment Submission": "wish my dboy would see this ad 🙄", "1_Text": "If Im 30 minutes out. I *always* say im 10-15 away. Works like a charm.", "2_Subreddit": "opiates"}], "dwwihyb": [{"0_Comment Submission": "My dick after 3 days off opiates", "1_Text": "Is it just me or is fapping 10x more rewarding while withdrawing, weird shite.", "2_Subreddit": "opiates"}], "dwwijci": [{"0_Comment Submission": "Feelsgoodman.jpg", "1_Text": "VeryNice.PNG\nStay safe with the combo mate, under-dose one of them!", "2_Subreddit": "opiates"}], "dwwik2e": [{"0_Comment Submission": "To those who are going through a rough time in there lives at the moment.", "1_Text": "Cheers Mate.\nHugs to all!", "2_Subreddit": "opiates"}], "dwwnnph": [{"0_Comment Submission": "New CWE idea", "1_Text": "**No**. I would not do this. The negative pressure and cotton are going to draw too much APAP. Just grt some coffee filters man, its like a 10-15min task.", "2_Subreddit": "opiates"}], "dwwntgi": [{"0_Comment Submission": "Roxys Vs Pandas", "1_Text": "Oxymorphone is way better than codone haha. Oxymorphone is oxycodone's most potent metabolite, its minimum twice as strong and depending on metabolism (say you have low oxycodone metabolism) could be more. Start just taking half your usual oxyC doses as OxyM.\n\nConsider a tolerance break. A pill habit is going to start getting expensive if 200mg+ isnt getting you high.", "2_Subreddit": "opiates"}], "dwwo0jr": [{"0_Comment Submission": "Advice for a noob", "1_Text": "Start with 15mg. If you arent where you want to be in 1-1.5 hours redose in 10mg increments.\n\nWeed will potentiate so leave it out of your first experience. Once you have your bearings you can consider taking *small* hits of weed after having come up.\n\nStay safe!", "2_Subreddit": "opiates"}], "dwwo6k3": [{"0_Comment Submission": "Had an interesting thought: What if opiates were legal but extremely expensive? (im high and sleepy but lets get philosophical)", "1_Text": "If prices are high but opioids are legal then chances are street availability will skyrocket and the black market will still exist, just at lower prices. The plummeting legal action and risk associated with selling illicit opioids will also push those prices down. All in all, vast criminal operations will adapt and remain.", "2_Subreddit": "opiates"}], "dwwoy0k": [{"0_Comment Submission": "Fentanyl transdermal system 100 micrograms an hour for 72 hours", "1_Text": "As others have advised. **Do NOT use this patch in any way.** Fentanyl is absurdly potent, dangerous and not even that euphoric.\n\nProcure some hydrocodone (vicodin), oxycodone (percocet,  norco, roxi, etc) or even some Codeine (take 150mg, google a CWE). You can probably sell or trade the patch with some solid value, do some researching into its worth. Fent isnt an opioid you want to touch with a 10 foot pole being opiate naive.", "2_Subreddit": "opiates"}], "dwwp50b": [{"0_Comment Submission": "Quick question about perscriptions from docs", "1_Text": "Go in and discuss the pain and OTC meds you've used to no avail. Make a case for how the pain is significantly affecting your life. Show interest in properly addressing your injury, dont just focus on the drugs. Then ask candidly if you can receive something for the pain and/or get referred to pain specialist/clinic.", "2_Subreddit": "opiates"}], "dwwut7d": [{"0_Comment Submission": "Can i mix 150mg of tramadol with 100mg of morphine ?", "1_Text": "Can you tolerate/have experience with 100~130 mg of morphine? If so then yeah it'll be fine.\n\nHonestly as far as the mix goes its entirely subjective. The opioid effects of the tram will just stack with the morphine; 150mg tramadol is like 10-20mg morphine equivalent.\n\nMorphine's oral bioavalability is abysmal however. You could plug 30-40mg and get similar results.", "2_Subreddit": "opiates"}], "dwwvktv": [{"0_Comment Submission": "Naloxone in Suboxone", "1_Text": "For all intents and purposes; yes it will. Bupe has a super high affinity for MOR. It essentially hogs the receptors preventing other opiates from working. It is technically possible to \"break through\" a bupe blockade via brute force dosing. But this can be a huge waste and quite dangerous. I do **not** recomend attempting this. Stay safe!", "2_Subreddit": "opiates"}], "dwww9r0": [{"0_Comment Submission": "Can i mix 150mg of tramadol with 100mg of morphine ?", "1_Text": "Been using daily? That'll do your tolerance in real quick. I've never let myself use a week straight. A lot of mini detoxes/rebounds which can be tiresome, and I definitely accrued a physical dependence, but tolerance has been pretty stable for months.\n\nPlugging morphine is just so good haha, difficult to stay away from if you have consistent access. IV aside, plugging morphine is the number one opioid high IMO.\n\nI'm assuming you didn't feel much from that 150mg tramadol, or did you plug it?", "2_Subreddit": "opiates"}], "dwwx9sm": [{"0_Comment Submission": "Naloxone in Suboxone", "1_Text": "If you're getting scripted hydro you may as well fill it for future use.\n\nYes it's possible that after 10-12 hours another opiate may be useable. But that is a *big* maybe and will absolutely depend on individual metabolism. Generally though; no I don't think it will be viable. Bupe has a slow onset and minimum 24 hour half-life, often more. Not only will there always be some bupe lurking in your bloodstream, but basal concentrations will also increase with daily intake. I honestly doubt that Vicodin (at intended doses) will have much of an effect while you're on buprenorphine. Vicodin is also likely in the vicinity of bupe as far as analgesia goes.", "2_Subreddit": "opiates"}], "dwwygzw": [{"0_Comment Submission": "Got my hands on these. I have NO idea how to use them, have only done oral and intranasal oxy. Would be so grateful if someone gave me a step by step. How do I get a needle?", "1_Text": "Yeah you grasp the thin end and snap the top off. You could IV/IM but its not absolutely necessary. You can plug the solution with an oral syringe or enema (for more volume). Do you have any tolerance?", "2_Subreddit": "opiates"}], "dwwzu57": [{"0_Comment Submission": "Naloxone in Suboxone", "1_Text": "Yeah I'm not certain about that but there are a few possibilities. Just the one bag of H, a singular point?\n\nHe is potentially a rapid metabolizer of Buprenorphine, if he clears it to negligible levels in 12 hours (half the typical minimum range), say down to 10-30% of the dose, there is probably enough free receptors for the heroin to do its thing. He may also be getting heroin cut with fentanyl, bupe can have a Ki (affinity) of 0.3-1.5, depending on the individual, and fent  has a Ki of around 0.7~. So in a good proportion of individuals fent can displace bupe and fully agonize.\n\nJust some speculation, there are numerous possibilities, or combinations of possibilities, for why he is getting high.\n\nDoes he get proper high? Does the efficacy vary with the time he takes it? Some interesting queries.", "2_Subreddit": "opiates"}], "dwx2yfu": [{"0_Comment Submission": "Got my hands on these. I have NO idea how to use them, have only done oral and intranasal oxy. Would be so grateful if someone gave me a step by step. How do I get a needle?", "1_Text": "Are they 10mg each? How much did ya get em for? 30mg plugged with a 20mg redose would be solid. Will be more euphoric than oral oxy due to BA and absorbtion rate. Make sure youve hit the toilet then done an enema before plugging. Only other real way to stretch em would be IV, but IMO fuck opening that can of worms.", "2_Subreddit": "opiates"}]}], "1_submissions": [{"786h14": [{"0_Title": "What's on the menu for everyone this fine evening?", "1_Text": "Yeah I agree, That looks like a solid, damn tasty 2 grams. What's your ROA? And is that #3 or #4?? Looks very nice!", "2_Subreddit": "opiates"}], "78e158": [{"0_Title": "What a CWE should look like (410mg Codeine + 10mg Oxycodone).", "1_Text": "Yeah I agree, That looks like a solid, damn tasty 2 grams. What's your ROA? And is that #3 or #4?? Looks very nice!", "2_Subreddit": "opiates"}], "78gxa1": [{"0_Title": "Question about the big H!", "1_Text": "Yeah I agree, That looks like a solid, damn tasty 2 grams. What's your ROA? And is that #3 or #4?? Looks very nice!", "2_Subreddit": "opiates"}], "78mc2y": [{"0_Title": "Getting high on Heroin tonight. Need advice on ROA/Equivalency to my use/Dosages and tips! See comments.", "1_Text": "Yeah I agree, That looks like a solid, damn tasty 2 grams. What's your ROA? And is that #3 or #4?? Looks very nice!", "2_Subreddit": "opiates"}], "78tfb9": [{"0_Title": "Need some advice on this Heroin and Dosing", "1_Text": "Yeah I agree, That looks like a solid, damn tasty 2 grams. What's your ROA? And is that #3 or #4?? Looks very nice!", "2_Subreddit": "opiates"}], "78vpja": [{"0_Title": "How is everybody tonight? Cruising altitude has been reached :)", "1_Text": "Yeah I agree, That looks like a solid, damn tasty 2 grams. What's your ROA? And is that #3 or #4?? Looks very nice!", "2_Subreddit": "opiates"}], "79e30o": [{"0_Title": "Need some serious advice and input fellas. I may be at a crossroads.", "1_Text": "Yeah I agree, That looks like a solid, damn tasty 2 grams. What's your ROA? And is that #3 or #4?? Looks very nice!", "2_Subreddit": "opiates"}], "79tldh": [{"0_Title": "Taking the right turn. No one to talk to and need some wise words. The mental aspect is weighing upon me greatly.", "1_Text": "Yeah I agree, That looks like a solid, damn tasty 2 grams. What's your ROA? And is that #3 or #4?? Looks very nice!", "2_Subreddit": "opiates"}], "79ue7p": [{"0_Title": "Taking the right turn. Mental angst and looking for wise words/support.", "1_Text": "Yeah I agree, That looks like a solid, damn tasty 2 grams. What's your ROA? And is that #3 or #4?? Looks very nice!", "2_Subreddit": "OpiatesRecovery"}], "7byepe": [{"0_Title": "Struggling fellas~", "1_Text": "Yeah I agree, That looks like a solid, damn tasty 2 grams. What's your ROA? And is that #3 or #4?? Looks very nice!", "2_Subreddit": "opiates"}], "7cem8t": [{"0_Title": "Bloody did it. One foot in front of the other. Cheers for all the past support :)", "1_Text": "Yeah I agree, That looks like a solid, damn tasty 2 grams. What's your ROA? And is that #3 or #4?? Looks very nice!", "2_Subreddit": "opiates"}], "7impi9": [{"0_Title": "Anyone relate to the effect of cigarettes?", "1_Text": "Yeah I agree, That looks like a solid, damn tasty 2 grams. What's your ROA? And is that #3 or #4?? Looks very nice!", "2_Subreddit": "opiates"}], "7k73a5": [{"0_Title": "Opiates have utterly ruined Fanta for me. Conditioning is a Bitch.", "1_Text": "Yeah I agree, That looks like a solid, damn tasty 2 grams. What's your ROA? And is that #3 or #4?? Looks very nice!", "2_Subreddit": "opiates"}], "7m0spd": [{"0_Title": "Need some advice re: recreational Tramadol use.", "1_Text": "Yeah I agree, That looks like a solid, damn tasty 2 grams. What's your ROA? And is that #3 or #4?? Looks very nice!", "2_Subreddit": "opiates"}], "7m20cc": [{"0_Title": "Feeling like a piece of worthless shit.", "1_Text": "Yeah I agree, That looks like a solid, damn tasty 2 grams. What's your ROA? And is that #3 or #4?? Looks very nice!", "2_Subreddit": "depression"}], "7mi4eo": [{"0_Title": "High as fuck. Whats everyone dipping into today, keen for a chat.", "1_Text": "Yeah I agree, That looks like a solid, damn tasty 2 grams. What's your ROA? And is that #3 or #4?? Looks very nice!", "2_Subreddit": "opiates"}], "7mutii": [{"0_Title": "Specific dosing queries regarding Tramadol.", "1_Text": "Yeah I agree, That looks like a solid, damn tasty 2 grams. What's your ROA? And is that #3 or #4?? Looks very nice!", "2_Subreddit": "opiates"}], "7npgzj": [{"0_Title": "While I didn't think a proper euphoria was possible from benzos (opiate-esque). I HAVE DONE IT.", "1_Text": "Yeah I agree, That looks like a solid, damn tasty 2 grams. What's your ROA? And is that #3 or #4?? Looks very nice!", "2_Subreddit": "benzodiazepines"}], "7simvd": [{"0_Title": "3-Methyl-Morphine", "1_Text": "Yeah I agree, That looks like a solid, damn tasty 2 grams. What's your ROA? And is that #3 or #4?? Looks very nice!", "2_Subreddit": "opiates"}], "82cpck": [{"0_Title": "Fire Half for today, and then back into withdrawal with the only relief meds I have.", "1_Text": "Yeah I agree, That looks like a solid, damn tasty 2 grams. What's your ROA? And is that #3 or #4?? Looks very nice!", "2_Subreddit": "opiates"}], "84b6he": [{"0_Title": "Dope in balloons?", "1_Text": "Yeah I agree, That looks like a solid, damn tasty 2 grams. What's your ROA? And is that #3 or #4?? Looks very nice!", "2_Subreddit": "opiates"}], "84lwho": [{"0_Title": "Dboy waited around for ME today!", "1_Text": "Yeah I agree, That looks like a solid, damn tasty 2 grams. What's your ROA? And is that #3 or #4?? Looks very nice!", "2_Subreddit": "opiates"}], "84swbd": [{"0_Title": "Anyone got any references about the Benzo x Opioid interaction, and how it's so dangerous, pharmacologically?", "1_Text": "Yeah I agree, That looks like a solid, damn tasty 2 grams. What's your ROA? And is that #3 or #4?? Looks very nice!", "2_Subreddit": "opiates"}], "88h6z2": [{"0_Title": "Something to add to your Withdrawal remedies~", "1_Text": "Yeah I agree, That looks like a solid, damn tasty 2 grams. What's your ROA? And is that #3 or #4?? Looks very nice!", "2_Subreddit": "opiates"}], "89at0f": [{"0_Title": "The Psychopathology of Long-Term Addiction and Cessation.", "1_Text": "Yeah I agree, That looks like a solid, damn tasty 2 grams. What's your ROA? And is that #3 or #4?? Looks very nice!", "2_Subreddit": "opiates"}]}]}]}