{"poppioid": [{"0_comments": [{"dsghm8d": [{"0_Comment Submission": "The FDA is full of shit", "1_Text": "Hahaha oh shut up 😁😁😁\n\n\nTotally fn right though", "2_Subreddit": "kratom"}], "dshuv6o": [{"0_Comment Submission": "The FDA is full of shit", "1_Text": "I would love to see that! They can't though because they have no idea that a consumable lethal amount even exists, and if they release some BS you know it would be easily disputed. I'm willing to bet there's plenty of people who have ingested over what supposedly was the \"lethal amount\" in those 36 cases and can prove it.", "2_Subreddit": "kratom"}], "dshv10m": [{"0_Comment Submission": "The FDA is full of shit", "1_Text": "https://www.fda.gov/AboutFDA/CommissionersPage/default.htm\n\nThere's an email link to contact him.", "2_Subreddit": "kratom"}], "dshw97l": [{"0_Comment Submission": "How do people keep getting good effects from the same dose? Plus another question", "1_Text": "I can't speak to whether agmatine is bad for your heart. I do know that it is a common supplement used in strength training and cardio, and is healthy for you in normal doses. I'm actually pretty sure your body makes it on it's own, too. There was a study I read about where it was used in 1500mg-2500mg daily totals to stall/lower tolerance but I can't remember where I saw it. I recommend looking into it before using high doses. Proglumide, if you can get a prescription for it, is very effective in actually *reversing* tolerance to opioids. But kratom is not an opioid, so I'm not certain if it will have the same effect on tolerance or not.\n\nAs for the blue light poster, I'm not going to get into an argument over whether or not you're experiencing placebo effect. For me the effect comes on in 20-30 minutes on an empty stomach and lasts 4-5 hours. I'm certain this is not placebo. I've experienced what you are at higher doses as well. \n\nI do agree with him that its possible your tolerance may be higher again because of repeated high doses. I also think, again, that you may have some kratom with lower alkaloid %. I suggest doing some research and figuring out which vendors have the best strains right now and try ordering them. \n\nThere isn't a ton of science available for kratom as there is for regulated medications, and there is plenty of anectdotal reports that kratom is, well, fickle in the sense of it changing it's effects from strains to dosages to people to location and beyond.\n\nI do think you'll eventually figure it out, though. I suggest trying new strains and amounts. And remember that just because a strain or dosage \"works for everyone\" does not mean it will work for you. Gold strains for example, are ones that most people love but they do absolutely nothing for me no matter how I do it. Another good idea would be to make a tea with it. It will be easier than consuming powdered leaf, it will make it easier to absorb and you can make it as strong or weak as you want. This may work better for you.\n\nThank you for changing how you describe kratom. Hopefully we will win and the FDA and DEA can go F*** themselves.", "2_Subreddit": "KratomKorner"}], "dsi0c3l": [{"0_Comment Submission": "The FDA is full of shit", "1_Text": "I couldn't agree more with this. Decriminalizing drugs and instead making it a health issue has had wonderful results in other locales that have done it. They've seen huge drops in ODs (I believe it was Portugal that saw a breathtaking 80% in overdose fatalities). They are focusing on educating users, giving them access rehabilitation, to clean and proper paraphernalia (for lack of a better word) and safe spaces to occupy while using/under the influence of the substances. Additionally there is less fear of being caught and punished, which is what most often leads to unsafe behavior and dangerous situations.\n\nMost of the harm in using these substances is ignorance. Punishment and stigma of using often hinders rehabilitation and leads to relapse. \n\nThis is the way to win the \"war on drugs.\" \n\nEDIT: Although the FDA/DEA have another reason behind the lies about kratom. And surprise! It's profit and greed.", "2_Subreddit": "kratom"}], "dsi0ma4": [{"0_Comment Submission": "The FDA is full of shit", "1_Text": "Ha because he doesn't actually think that kratom is dangerous. He doesn't give a rats ass about people's health. He is bought and paid for by the drug companies who are losing money because people are taking kratom and no longer need their expensive, dangerous medications. If they ban it, big pharma wins. If they schedule it ii-iiii, big pharma will patent and market it and they win again. They'd prefer a ban because that makes it easier on them. Research and clinical trials cost millions and millions and take decades to bring the resulting medication to market.", "2_Subreddit": "kratom"}], "dslvuqi": [{"0_Comment Submission": "How do people keep getting good effects from the same dose? Plus another question", "1_Text": "Glad you had a better experience with the gold. If you like green/whites a lot I suggest trying yellow strains. It is a special drying process that increases certain alkaoids. For example, gold Bali is red Bali dried with this process. \"Yellow\" strains are green and whites. It does work, too. White Borneo is one of the most potent strains there is, I just got some yellow Borneo and it is insane. It's almost too much.\n\nYou can get agmatine at GNC and vitamin shoppe too. It's probably cheaper online too. Again cimetidine makes all the difference for me.", "2_Subreddit": "KratomKorner"}], "dslw6s3": [{"0_Comment Submission": "The FDA is full of shit", "1_Text": "I hope he listens, though I doubt he will. Your story is like so many of ours in the kratom community. This plant is a miracle and it will be a travesty if they take it away. I'm not really religious but I'm praying this ban gets blocked again and that there's a big enough outcry that it stays legal. \n\nI read some comments from people who have obviously never tried or know anyone who has tried kratom, parroting all the \"dangers\" that the FDA spreads. Im relatively certain the drug companies have paid people to make inflammatory posts on the internet to spread the hysteria.", "2_Subreddit": "kratom"}], "dslxytp": [{"0_Comment Submission": "Dog With Quirky Smile Needs A Home", "1_Text": "Aww I wish I lived closer to Alabama! He's adorable and I love the name zipper 😁", "2_Subreddit": "Pets"}], "dsly2a6": [{"0_Comment Submission": "Yellow Maeng Da", "1_Text": "Do you know why they do this? Seems to me that would be like double the work.", "2_Subreddit": "HerbalRVA"}], "dsm1waf": [{"0_Comment Submission": "My dog ran away and wandered into the local Home Depot... this is what I arrived to when I picked her up", "1_Text": "Your dog is like a fluffy little cloud!!", "2_Subreddit": "aww"}], "dspqb0h": [{"0_Comment Submission": "As someone who is officially retiring from this sub...", "1_Text": "Being responsible is key to really being able to enjoy recreational drugs. Of course I definitely had to learn responsibility...trying to hold a conversation at work after a three day binder with my eyes bugging outa my head made me think I might be overdoing it a bit lol. Now I set aside a night in advance, I make sure I have no working, mothering or adulting of any kind to speak of and hit it hard. Then in the morning, back to the grind. Been working for me for years so I figure I'm doing it right.", "2_Subreddit": "cocaine"}], "dsuq3he": [{"0_Comment Submission": "😂😂", "1_Text": "At first I'm like...huh? Haha it took me a sec cuz we don't have tar around here.", "2_Subreddit": "opiates"}], "dulhuk1": [{"0_Comment Submission": "I did a television interview about kratom today", "1_Text": "Where is the petition link?\n\nEdit: lol \"AKA petition\"....duh. I signed that awhile ago and shared shared shared. I agree how the HELL does it not have more signatures? Ok now I'm sending it in a pm to everyone I know. Been badgering the shit out of my friends and family (thank they're great sports and in total support of the cause).", "2_Subreddit": "kratom"}], "dulwutf": [{"0_Comment Submission": "I did a television interview about kratom today", "1_Text": "Damn that's a good idea! Is there any way to set it as my signature? I'm on mobile but I can get to a computer if it can be done.", "2_Subreddit": "kratom"}], "dwmj4il": [{"0_Comment Submission": "Sometimes I wish I could do both", "1_Text": "I could sleep for the first year or so of getting high. I did it daily buy had no problem setting it down at night. Then I met a few closet fiends, partied with them and discovered the bender. My days of sleeping were over lol. Along with my ability to save some for the rest of the week lmao.", "2_Subreddit": "cocaine"}], "dwmj5t2": [{"0_Comment Submission": "Sometimes I wish I could do both", "1_Text": "Wish this was me. I can go about 3 days before I fall asleep lol.", "2_Subreddit": "cocaine"}], "dwmjnm7": [{"0_Comment Submission": "Holy shit (just was cleaning out garage and found these!!) how do I get the most use out of these?", "1_Text": "It really depends on your tolerance. I have a pretty high one (120mg per dose oxy) and ¼th of a patch chewed does it for me. I used to be able to get the same effect at ⅛th. Kicks in about the 10min mark, full effects by 15 but seriously as soon as u start feeling it take it out of your mouth. Keep chewing and it'll be face on the floor, in front of all your Easter guests.", "2_Subreddit": "opiates"}], "dwmkjgg": [{"0_Comment Submission": "Let’s just overgrow the government with poppies ... ?", "1_Text": "Isolating the morphine is pretty straight forward, though. Then you just have to \"clean it up\" if you plan on IV. \n\nAlso, harvesting a ton for a huge heroin operation is one thing. But just for personal use? Not that hard to do. Just takes a little patience. Plus acetic anhydride is hard to get in quantity but small amounts can be obtained in aspirin kits. Morphine + AC20 + heat = diacetylmorphine.\n\nBut I agree though the opium itself is psychoactive and smoking it or making tea will set you straight.", "2_Subreddit": "opiates"}], "dwmkpq7": [{"0_Comment Submission": "Let’s just overgrow the government with poppies ... ?", "1_Text": "Nice! I planted some in my garden for the first time this year. Looks like you didn't score the pods for the opium though, did you just make tea? My plan was to collect as much opium as possible to store it for future use. I suffer from chronic pain so this is my contingency plan when it all goes to shit lol.", "2_Subreddit": "opiates"}], "dwml14w": [{"0_Comment Submission": "Found this on the alcoholic sub", "1_Text": "I totally agree with this! It takes me a full 5 days before I can keep anything down although I don't actually want to drink anything unyil week 2. And forget about eating. Even if there is someone to make me drink it comes right back up. It's been so bad I would literally be laying in a pool of vomit (and worse) if the bucket weren't close. Taxing an unhealthy body that much for that long surely could lead to death imo.", "2_Subreddit": "opiates"}], "dwmlcz6": [{"0_Comment Submission": "Opiophile", "1_Text": "What happened? I remember lurking on that site!", "2_Subreddit": "opiates"}], "dwmljj3": [{"0_Comment Submission": "$180 for a gram is fuckin killing me.", "1_Text": "Jesus I've never paid more than $60/g. And that's for a single if I buy 5 it's $50ea.", "2_Subreddit": "opiates"}], "dwmlpnw": [{"0_Comment Submission": "Just out of curiosity", "1_Text": "White girl here. And I don't mean the magical powder lol. I agree I only know one black person that gets high on dope, although I know plenty that get high on pills. Most I know prefer crack though.", "2_Subreddit": "opiates"}], "dwmmf96": [{"0_Comment Submission": "Let’s just overgrow the government with poppies ... ?", "1_Text": "Oh ha! I though the razor was for size. Lol. I've read up on it although I don't know anyone personally who's done it. It seems rather straight forward though. Once I bleed the opium off is it worth drying the pods and using them too? In thinking of smoking/making tea to get the most out of it. \n\nGood ol vivitrol! Since you say being \"forced\" you may be interested in knowing that after the first 2½/3 weeks it's possible to get high again. My husband did that shit for a year. Took him a little more to get high but he also never got withdrawal the whole time he was on it.", "2_Subreddit": "opiates"}]}], "1_submissions": [{"7jtkqn": [{"0_Title": "Placing my order, green hulu or PMD?", "1_Text": "Hahaha oh shut up 😁😁😁\n\n\nTotally fn right though", "2_Subreddit": "HerbalRVA"}], "7k2pjq": [{"0_Title": "Entropion surgery cost, Pittsburgh area", "1_Text": "Hahaha oh shut up 😁😁😁\n\n\nTotally fn right though", "2_Subreddit": "Pets"}], "7k2ry9": [{"0_Title": "Entropion surgery, cost and find a vet to perform", "1_Text": "Hahaha oh shut up 😁😁😁\n\n\nTotally fn right though", "2_Subreddit": "AskVet"}], "7k89wp": [{"0_Title": "My dog goes crazy for snow!!", "1_Text": "Hahaha oh shut up 😁😁😁\n\n\nTotally fn right though", "2_Subreddit": "Pets"}], "7kgsi1": [{"0_Title": "Just got my order... WOW", "1_Text": "Hahaha oh shut up 😁😁😁\n\n\nTotally fn right though", "2_Subreddit": "HerbalRVA"}], "7krfep": [{"0_Title": "Calling kratom nerds - oxidizing mytraginine", "1_Text": "Hahaha oh shut up 😁😁😁\n\n\nTotally fn right though", "2_Subreddit": "kratom"}], "7krk43": [{"0_Title": "So, does being a \"green person\" also affect whether youre a \"yellow\" person?", "1_Text": "Hahaha oh shut up 😁😁😁\n\n\nTotally fn right though", "2_Subreddit": "kratom"}], "7kz5ac": [{"0_Title": "Tasmanian Devils!", "1_Text": "Hahaha oh shut up 😁😁😁\n\n\nTotally fn right though", "2_Subreddit": "aww"}], "7l4gf5": [{"0_Title": "My husband doesnt believe they'll make kratom illegal", "1_Text": "Hahaha oh shut up 😁😁😁\n\n\nTotally fn right though", "2_Subreddit": "kratom"}], "7l4o43": [{"0_Title": "Need new suggestions", "1_Text": "Hahaha oh shut up 😁😁😁\n\n\nTotally fn right though", "2_Subreddit": "HerbalRVA"}], "7l76yf": [{"0_Title": "Your favorite vendors/strains available atm?", "1_Text": "Hahaha oh shut up 😁😁😁\n\n\nTotally fn right though", "2_Subreddit": "kratom"}], "7lee08": [{"0_Title": "Anyone experience weight loss after using kratom?", "1_Text": "Hahaha oh shut up 😁😁😁\n\n\nTotally fn right though", "2_Subreddit": "kratom"}], "7lep5u": [{"0_Title": "Upcoming Info Thread ~ Facts/science/everything you need to know when talking to your congressman", "1_Text": "Hahaha oh shut up 😁😁😁\n\n\nTotally fn right though", "2_Subreddit": "kratom"}], "7leq2q": [{"0_Title": "Just starting out.", "1_Text": "Hahaha oh shut up 😁😁😁\n\n\nTotally fn right though", "2_Subreddit": "KratomGarden"}], "7lfaha": [{"0_Title": "Is the site showing no results because its closed?", "1_Text": "Hahaha oh shut up 😁😁😁\n\n\nTotally fn right though", "2_Subreddit": "HerbalRVA"}], "7lmt9w": [{"0_Title": "How did kratom help you?", "1_Text": "Hahaha oh shut up 😁😁😁\n\n\nTotally fn right though", "2_Subreddit": "kratom"}], "7lnezl": [{"0_Title": "Science/Facts on Kratom: Everything You Ever Wanted and Needed to Know!", "1_Text": "Hahaha oh shut up 😁😁😁\n\n\nTotally fn right though", "2_Subreddit": "kratom"}], "7md6o2": [{"0_Title": "Suggestions for Strains from BestBlends?", "1_Text": "Hahaha oh shut up 😁😁😁\n\n\nTotally fn right though", "2_Subreddit": "kratom"}], "7mgw46": [{"0_Title": "Rhomboid Injury Causing Spasm of Thoracic Erector Muscles?", "1_Text": "Hahaha oh shut up 😁😁😁\n\n\nTotally fn right though", "2_Subreddit": "AskDocs"}], "7ml4ex": [{"0_Title": "Cracks me up every time", "1_Text": "Hahaha oh shut up 😁😁😁\n\n\nTotally fn right though", "2_Subreddit": "aww"}], "7n2lhj": [{"0_Title": "Seals get even with canadian fisherman", "1_Text": "Hahaha oh shut up 😁😁😁\n\n\nTotally fn right though", "2_Subreddit": "seals"}], "7n4ca6": [{"0_Title": "Red Zarena and Green Vietnam Blend...wow!", "1_Text": "Hahaha oh shut up 😁😁😁\n\n\nTotally fn right though", "2_Subreddit": "HerbalRVA"}], "7ngrte": [{"0_Title": "General question about mail service on holidays", "1_Text": "Hahaha oh shut up 😁😁😁\n\n\nTotally fn right though", "2_Subreddit": "USPS"}], "7njbup": [{"0_Title": "Forgotten the Nobility of the USPS", "1_Text": "Hahaha oh shut up 😁😁😁\n\n\nTotally fn right though", "2_Subreddit": "USPS"}], "7pdrjp": [{"0_Title": "Review of WS-c kratom free samples", "1_Text": "Hahaha oh shut up 😁😁😁\n\n\nTotally fn right though", "2_Subreddit": "kratom"}]}]}]}