{"ethandram": [{"0_comments": [{"dhypm98": [{"0_Comment Submission": "suboxone wd want to pop head off", "1_Text": "Long story short, Imodium is an opioid that doesn't cross the blood brain barrier. At taken and slightly higher doses, however, it can kind of calm you down from your WD. But you need to be careful with it.", "2_Subreddit": "opiates"}], "di7b6ym": [{"0_Comment Submission": "Breakfast , Lunch , & Dinner", "1_Text": "We got someone WDing over here!", "2_Subreddit": "opiates"}], "dih7kn6": [{"0_Comment Submission": "PST is bae", "1_Text": "I've always wanted to try PST. idk where to go to start, as idk if there's a specific seed to get and how to prep, etc.", "2_Subreddit": "opiates"}], "djb64a2": [{"0_Comment Submission": "Wgn 6/18", "1_Text": "Just recieved mine from the Wall and it's been great. I previously had 2/26 SN and it was ok, for my first time trying PST (not a newcomer opies) was fairly mellow and ok experience. \n\nI have those heavy legs and a better euphoria than the sn batch. 6/18 is great.", "2_Subreddit": "PoppyTea"}], "dkbfvvc": [{"0_Comment Submission": "Ghost in the Shell - First Assault Official Trailer - [01:15]", "1_Text": "Wait why did we have to have a live action film when this art is beautiful and the character designs and the fluid movements and the way Motoko stares at that android and the Nightstalker helicopter shot recreation and the 90S green Holomaps RIGHT OUT OF THE 95 film IM FLOOOOORED. I do not play games or any form of it but I wish they had more clips of this. Especially SAC section9 still doing great things. Fuck", "2_Subreddit": "Ghost_in_the_Shell"}], "dl45tqa": [{"0_Comment Submission": "sometimes it's the little things...", "1_Text": "hahahha. but I did! High in buttery fat", "2_Subreddit": "opiates"}], "dlgnlxb": [{"0_Comment Submission": "Early Fill:)", "1_Text": "Mom has the exact same script. I remember taking tram to school everyday lol", "2_Subreddit": "opiates"}], "dlgnu1q": [{"0_Comment Submission": "Did I develop tolerance?", "1_Text": "No. You did not. \n\nIt could be several factors. Did you eat something? Did you take a different med than normal? Where were you when you took it? If you were in the heat, you will more than likely never feel an opiate high the way you want to.", "2_Subreddit": "opiates"}], "dlvkg4k": [{"0_Comment Submission": "Songs from GitS 2017 OST released on YouTube", "1_Text": "Probably only what Lorne composed is what'll be uploaded. Clint's sessions still made it into the film, at least pieces.", "2_Subreddit": "Ghost_in_the_Shell"}], "dmyarxq": [{"0_Comment Submission": "Refill day is the best day!", "1_Text": "I think it's just brand name Opana being removed. Generics are still available. Someone correct me if I'm wrong though.", "2_Subreddit": "opiates"}], "dmybnlo": [{"0_Comment Submission": "Refill day..90 8/2 sub .. 75 Greenstone G3722 2mg Alprazolam tablets", "1_Text": "I don't mind it when the sub is being taken. But the after taste leaves a terrible terrible taste in my mouth for hours and makes me very queasy. Join the pussy club lol", "2_Subreddit": "opiates"}], "dncp1e9": [{"0_Comment Submission": "Nice to come home with a free pickup", "1_Text": "Weird bc I was prescribed these same percs last month?", "2_Subreddit": "opiates"}], "dncpihu": [{"0_Comment Submission": "Dilaudid vs oxycodone question", "1_Text": "What is this magical study!?", "2_Subreddit": "opiates"}], "dnj3mt4": [{"0_Comment Submission": "Should i just hustle or study???", "1_Text": "Both buddy that’s how I made it tru two years", "2_Subreddit": "opiates"}], "do2b461": [{"0_Comment Submission": "How long does it take to \" reset \" your tolerance ?", "1_Text": "ALWAYS let your high wear off before dosing again! Never redose in the middle of a high Bc you wanna feel higher... you’ll feel more of the same and probably more irritable. Always go to baseline b4 redosing.\n\nOT, your schedule honestly seems ok tolerance wise. Tramadol usually never affects tolerance in the same way oxy or hydro or morphine do. It’s a weird class on its own. “Resetting tolerance?” A week or two.", "2_Subreddit": "opiates"}], "do2b5y7": [{"0_Comment Submission": "Love having a lap full of happiness. My bud was on my desk sadly", "1_Text": "I love those LEGO concealing fuckers!!!! They’ve saved me so many times.", "2_Subreddit": "opiates"}], "dopaxy9": [{"0_Comment Submission": "I love sour patch kids as much as the next bropiate, but these are my shit! (And this is my shit post for the day)", "1_Text": "Is that Casey’s gas station brand? Fave gas station ever. Seriously.", "2_Subreddit": "opiates"}], "dpnuldq": [{"0_Comment Submission": "A little something for the weekend", "1_Text": "Blue is pressed. Color shouldn’t look speckled. Be safe with that one.", "2_Subreddit": "opiates"}], "dq6w8s8": [{"0_Comment Submission": "Subutex ROA?", "1_Text": "Love subutex just for snorting. It’s the only way l feel the bupe 100%.", "2_Subreddit": "opiates"}], "dteickn": [{"0_Comment Submission": "Pill porn for you guys 💞", "1_Text": "Subutext?", "2_Subreddit": "opiates"}], "du3tk9b": [{"0_Comment Submission": "I just put 25mg of oxymorphone up my ass and all I have to say is", "1_Text": "Boofing for a lot of pills are the next best thing from injecting, in the sense of bioavailability and getting the most of your high.", "2_Subreddit": "opiates"}], "du82lpr": [{"0_Comment Submission": "Best generic percs?", "1_Text": "You think rox 10s, especially k series, are bottom of the barrel? What! If anything, I’d think you should be feeling WAY more relief from a roxy 10. Are you sure it’s not a placebo that you see a smaller pill and then assume it won’t work as well as your perc? I also wouldn’t go about asking to be switched back to Percocet so soon after switching to roxy. Try taking a Tylenol pill with your K56 pill and see if relief is better.", "2_Subreddit": "opiates"}], "duiyqw3": [{"0_Comment Submission": "7.5mg oxy with acetemetophin", "1_Text": "We all say “I’m not trying to make this an everyday thing.” At first.", "2_Subreddit": "opiates"}], "dwoy4pa": [{"0_Comment Submission": "Lost my job of 4 years--the one thing is was proud of in my life", "1_Text": "PM me if you need to. I had essentially the exact same thing happen to me last month. The shame and pit of anxiety that lives in your stomach for those first few days is one of the most unforgettable “I’ve hit rock bottom” moments of your life. And all for what. \n\nI feel u. I feel u so hard. But this is your crossroads moment. Which is harder to deal with than being fired, I know. Just talk to me if you need to. I’ve been there. I am there. But this community— we get it. So there’s help and support when and if you need it. You were picking yourself back up on those subs... you can do that part again. Trust me. :)", "2_Subreddit": "opiates"}], "dwppsru": [{"0_Comment Submission": "2 years", "1_Text": "This needs more upvotes and support! Congrats. I want to be where you are someday. I will make it happen. I have to.", "2_Subreddit": "opiates"}]}], "1_submissions": [{"6rd571": [{"0_Title": "sometimes it's the little things...", "1_Text": "Long story short, Imodium is an opioid that doesn't cross the blood brain barrier. At taken and slightly higher doses, however, it can kind of calm you down from your WD. But you need to be careful with it.", "2_Subreddit": "opiates"}], "7t33xr": [{"0_Title": "lost a pill today...", "1_Text": "Long story short, Imodium is an opioid that doesn't cross the blood brain barrier. At taken and slightly higher doses, however, it can kind of calm you down from your WD. But you need to be careful with it.", "2_Subreddit": "opiates"}]}]}]}