{"loremastered": [{"0_comments": [{"dkg9fo5": [{"0_Comment Submission": "My husband might have cancer, I just got fired, and suddenly this baby is terrifying", "1_Text": "While I don't have any advice to give, I just wanted to say that you're an incredibly strong person and I'm sorry that life is being so ridiculous and unfair right now. I'd give you a hug if I could!!", "2_Subreddit": "BabyBumps"}], "dmxnld6": [{"0_Comment Submission": "The only reason I can't use everyday", "1_Text": "This might help you, it might not...but pure tea tree oil. Just dab it liberally on the spots that start to itch, and also take anti histamines (even though that's obvious). Good luck", "2_Subreddit": "opiates"}], "dmxnld7": [{"0_Comment Submission": "The only reason I can't use everyday", "1_Text": "This might help you, it might not...but pure tea tree oil. Just dab it liberally on the spots that start to itch, and also take anti histamines (even though that's obvious). Good luck", "2_Subreddit": "opiates"}], "dpug2yr": [{"0_Comment Submission": "Bad abdominal pain and some blood discharge, don't know what to do", "1_Text": "Update: thanks for the quick responses...I got my husband up and we decided going to the hospital. It also might just be stress related but I also got a pretty bad headache in between posting this thread and now. I'll update everyone again, maybe if this happens to someone else I can give some info that might help. Thanks again ladies", "2_Subreddit": "BabyBumps"}], "drja1uc": [{"0_Comment Submission": "Close to relapsing", "1_Text": "I know I'm a little late responding here, and my advice may not help at all...but one thing I've noticed for me is that my most intense, in-the-moment cravings WILL fade and don't stick around longer than 30 min - 1 hour. When I'm hit with a scary, hard desire to use again...I tell someone (usually my husband) that I'm feeling this way and ask if we can do something distracting in the moment. Like play a game, go for a walk, anything that is engaging mentally or physically. I find watching tv or reading a book doesn't help me with cravings because it's easy to zone out and continue thinking about the urge to use. This might not work for everyone, but consider giving it an honest try and see if you can work on something you enjoy or do anything that will distract you (no matter how hard it is to find the motivation to start doing it!) and see if that helps. What your feeling is your brain lying to you. Nothing that comes from inside of you can be stronger than you. (That affirmation really stuck with me and helped me in my tough times too...the cravings cannot be stronger than me because they come FROM me). Another thing that has helped me when I find myself obsessing over using and thinking \"I can't do this\" in regards to my sobriety, is to remind myself \"you already are doing it\". These are some things I learned in therapy...they may not work for you but I hope you're doing good and staying strong! You're not alone", "2_Subreddit": "OpiatesRecovery"}], "drkxfd6": [{"0_Comment Submission": "Starting to finally feel like myself again", "1_Text": "Hey if you're looking for a buddy to play with, hit me up!! Let's go explore middle earth :)", "2_Subreddit": "OpiatesRecovery"}], "drkxn5t": [{"0_Comment Submission": "Starting to finally feel like myself again", "1_Text": "You got this!!! It's not easy, there are going to be tough times and you're going to struggle...but you deserve to put that lifestyle behind you and move on to bigger and better things!! One thing that has really, really helped me is stopping and recognizing anytime I feel GENUINE contentment and happiness. I stop what I'm doing just for a moment and let my mind and body soak up that feeling. Feelings don't last forever and there are highs and lows, but try to bask in a good feeling whenever one comes naturally to you. I'm rooting for you!!!", "2_Subreddit": "OpiatesRecovery"}], "drkxokv": [{"0_Comment Submission": "Starting to finally feel like myself again", "1_Text": "Thank you! This community has been so helpful and your encouragement means the world to me. ❤️", "2_Subreddit": "OpiatesRecovery"}], "drky25g": [{"0_Comment Submission": "Starting to finally feel like myself again", "1_Text": "I've always been a big time lurker in this sub, but I know I enjoy seeing postitive posts from those who are \"winning\" the battle...when I was early in my recovery, it helped give me hope. I agree with you -- I want to hear all about everyone's successes!! That's the beauty of this subreddit I think...we're here to cheer on, help, and give support to everyone, no matter where they are in their recovery process. we're all fighting the same beast. Thanks for the congrats :)", "2_Subreddit": "OpiatesRecovery"}], "drky75r": [{"0_Comment Submission": "Starting to finally feel like myself again", "1_Text": "You're so right....it helped solidify how important my recovery is, not just to me, but to everyone around me. It was hard to see my dad tearing up when he told me how happy he is that the \"old\" me is back. Like I said before...I don't know if I could have made it this far without the support and kindness from this subreddit, even just as a lurker.", "2_Subreddit": "OpiatesRecovery"}], "drkyhqo": [{"0_Comment Submission": "Starting to finally feel like myself again", "1_Text": "Thank you so much for saying that!!! I still struggle sometimes, but it's gotten so much better. Occasionally things hit me like a brick wall...like the other day my husband and I were talking about my recovery, and he said I had spent over $3,000 on heroin alone in the first couple months of our marriage. That hit me hard in the moment, and it hurt me to know that I made those choices which ultimately hurt HIM and our finances...but I'm still working on letting the past go. He has forgiven me. Sorry...rambling, but overall my quality of life has improved immeasurably, even in spite of tiny emotional/painful setbacks I have.", "2_Subreddit": "OpiatesRecovery"}], "drkyki4": [{"0_Comment Submission": "Starting to finally feel like myself again", "1_Text": "I never believed it when I read other people on this subreddit saying that it gets better...I guess I just had to experience it myself!!! Thanks so much for the congrats ❤️ Hoping the best for you!", "2_Subreddit": "OpiatesRecovery"}], "drkyoqx": [{"0_Comment Submission": "Starting to finally feel like myself again", "1_Text": "You absolutely nailed it -- that was my favorite part too! It's such a cool feeling to actually WANT to be apart of the family again as well. When you're in the throes of addiction, you don't realize how badly you're damaging your relationships until it's all over and you're sitting there trying to pick up the rubble.", "2_Subreddit": "OpiatesRecovery"}], "drkyu3n": [{"0_Comment Submission": "Woke up today and feel whole again", "1_Text": "It really IS an amazing feeling....great work!! you're winning the battle!", "2_Subreddit": "OpiatesRecovery"}], "drrc9g3": [{"0_Comment Submission": "Almost got charged with murder", "1_Text": "Wow, that is an insane story! I'm so glad it had a better outcome than what I was expecting...it sounded like it wasn't going to end well at all. I've overdosed and come very close to never waking up again just one time, years ago, and I still struggle to process the finality of death and what the consequences of my actions were at the time. I say this with kindness -- after reading this story, I've never been so glad to be over a year sober. Again I'm so sorry you and her went through this, especially on Christmas.", "2_Subreddit": "opiates"}], "drrd198": [{"0_Comment Submission": "Getting of subs. HELPPPP!!", "1_Text": "I very recently got off my dose of suboxone. I started out at 18mg/day and I slowly tapered down to about 1-2mg/day. I tapered down to that dose over the course of about 6 months, I took my time and felt no discomfort. It was frustrating and felt like it was never going to end for me, but I'm glad I did it that way. Once I was at 1-2mg a day, I jumped off of the suboxone and started doing Kratom. I had prepared and ordered high quality Kratom....started out taking a relatively high dose of Kratom to combat any withdrawal symptoms, but now I will usually only have about 3g in the morning when I wake up and be fine for the entire day. I've been off the subs for several months now and it's the best decision I ever made! Good luck", "2_Subreddit": "opiates"}], "drx1rvt": [{"0_Comment Submission": "Moving from 5mg of buprenorphine to Kratom. Need help please.", "1_Text": "Hey, you're going to be ok. No matter what happens. I was also super scared to jump off the suboxone (although I did at about 1mg-2mg/day) and just rely on the kratom, but I'm going to be honest...it was a cake walk. And I'm not sure about your situation, but if you truly are unable to get off and need help, please talk to your suboxone doctor. They will give you comfort meds that will help with any bad feelings. They are there to support you. I briefly looked into inpatient detox as a back-up option to get myself comfortably off the suboxone, and knew that if the Kratom didn't make my withdrawals tolerable enough, I would seek medical help. I know this is not an option for everyone though. Good luck! You can do this!", "2_Subreddit": "kratom"}], "drx1yzq": [{"0_Comment Submission": "Moving from 5mg of buprenorphine to Kratom. Need help please.", "1_Text": "I ordered from Herbal salvation while I was getting off of suboxone and they have excellent products, prices, and pretty quick shipping. I like to order a couple 25g samples and then 2-3 100g bags of different strains. I recommend doing this and giving yourself a different strains to try and cycle through. As others have said, multiple strains help with not building up tolerance. They also send you a free sample of a random 25g bag too with every order :) can't say enough positive things about herbal salvation!!", "2_Subreddit": "kratom"}], "dscsgp0": [{"0_Comment Submission": "Kratom is drying me out like beef jerky. Help!", "1_Text": "This isn't a bad idea or anything, but just be aware that soups are usually pretty high in sodium and that can contribute to dehydration too!", "2_Subreddit": "kratom"}], "dsfk7gr": [{"0_Comment Submission": "I'm still on methadone but I've been doing a lot of other drugs. I wanna be honest with you guys. Stimulant binge. Started after sexual assault. Depression. Bi polar and no longer manic, now I'm depressive.", "1_Text": "You're not not alone. I started seriously abusing opiates and had my first overdose shortly after being raped. I also deal with ADHD, anxiety and bipolar depression too so I was also on a shitload of xanax, sleeping pills and adderall during that time too. I'm clean now and have been for a while, but I get what you're going through. If you want to talk, I'm here for you! Send me a message :)", "2_Subreddit": "opiates"}], "dsfkokg": [{"0_Comment Submission": "GOd dam I hate withdraw", "1_Text": "If you can't get any prescription comfort meds like clonodine, gabapentin, benzodiazepines, or even suboxone for a quick taper, you gotta check out Kratom. Especially if your job is on the line. Are you trying to stay clean? Kratom can really really help. I know people are probably tired of hearing this advice, but t really does help and will even give you a slight mood boost. If your job is on the line you should absolutely try to get your hands on some Kratom if all else fails. Good luck friend!!", "2_Subreddit": "opiates"}], "dsnomnf": [{"0_Comment Submission": "How do you take your Kratom?", "1_Text": "I do this too! It really is the best way to get it down for me. I've tried the t&w method but it's always a crapshoot on whether or not it's going to irritate my throats on the way down. But the orange juice is sweet and really masks the taste of Kratom better than any way I've done it. I just get a straw and drink it as fast as I can.", "2_Subreddit": "kratom"}], "dwr2nbl": [{"0_Comment Submission": "Getting off loperamide!! Please help!", "1_Text": "Is there a way you can start to slowly cut down your dosage to minimize the discomfort? Like others have said -- it's really bad for you and you're gambling with some serious complications from taking such a high dosage on a regular basis. I have no experience with lope specifically, but in this situation since you aren't taking it for the high, I'd recommend either cutting your dosage down slowly, or going to your doctor and telling them that you're experiencing bad stomach symptoms and have resorted to such a high dosage of lope to control it. I can't imagine a doctor being an ass about this...because you're obviously having some sort of medical issue that you need help with. I wish I could offer more advice. Good luck and let us know how you're doing!!", "2_Subreddit": "opiates"}], "dwra4dk": [{"0_Comment Submission": "Realistically, what kind of withdrawal symptoms can I reasonably expect?", "1_Text": "Thank you so much for this info..it makes me feel a lot better knowing that this is what's in store. I looked over at r/quittingkratom and was blown away by what I was seeing. To be honest it scared me into making a post here to get some feedback regarding my specific situation. I appreciate it!!", "2_Subreddit": "kratom"}], "dwwuqhh": [{"0_Comment Submission": "DOT Drug Tests", "1_Text": "Gabapentin is typically given for nerve pain, but can be beneficial for WDs too.", "2_Subreddit": "kratom"}]}], "1_submissions": [{"6nuh6l": [{"0_Title": "Looking for a group to complete Tower of Orthanc T2C with on Landroval", "1_Text": "While I don't have any advice to give, I just wanted to say that you're an incredibly strong person and I'm sorry that life is being so ridiculous and unfair right now. I'd give you a hug if I could!!", "2_Subreddit": "lotro"}], "6oc8hl": [{"0_Title": "Please help me, I'm terrified of having to go to my first prenatal visit, and I'm scared I won't be able to go through with this...", "1_Text": "While I don't have any advice to give, I just wanted to say that you're an incredibly strong person and I'm sorry that life is being so ridiculous and unfair right now. I'd give you a hug if I could!!", "2_Subreddit": "BabyBumps"}], "6urq67": [{"0_Title": "Help! I'm considering entering a detox program to help me get off my sub maintenance. Found out I was pregnant and got down to ~1mg/day on my own and now I feel stuck. Scared to do this on my own and looking into medical detox programs. Advice?", "1_Text": "While I don't have any advice to give, I just wanted to say that you're an incredibly strong person and I'm sorry that life is being so ridiculous and unfair right now. I'd give you a hug if I could!!", "2_Subreddit": "OpiatesRecovery"}], "6wnecu": [{"0_Title": "[event] Trading GameStop Code for Salazzle in exchange for Pokémon (details inside)", "1_Text": "While I don't have any advice to give, I just wanted to say that you're an incredibly strong person and I'm sorry that life is being so ridiculous and unfair right now. I'd give you a hug if I could!!", "2_Subreddit": "pokemontrades"}], "7d1lez": [{"0_Title": "Bad abdominal pain and some blood discharge, don't know what to do", "1_Text": "While I don't have any advice to give, I just wanted to say that you're an incredibly strong person and I'm sorry that life is being so ridiculous and unfair right now. I'd give you a hug if I could!!", "2_Subreddit": "BabyBumps"}], "7l3rge": [{"0_Title": "Starting to finally feel like myself again", "1_Text": "While I don't have any advice to give, I just wanted to say that you're an incredibly strong person and I'm sorry that life is being so ridiculous and unfair right now. I'd give you a hug if I could!!", "2_Subreddit": "OpiatesRecovery"}], "89hi5t": [{"0_Title": "What happened to the subreddit where people helped others by sending out Kratom to those who needed it?", "1_Text": "While I don't have any advice to give, I just wanted to say that you're an incredibly strong person and I'm sorry that life is being so ridiculous and unfair right now. I'd give you a hug if I could!!", "2_Subreddit": "kratom"}], "89iamm": [{"0_Title": "Realistically, what kind of withdrawal symptoms can I reasonably expect?", "1_Text": "While I don't have any advice to give, I just wanted to say that you're an incredibly strong person and I'm sorry that life is being so ridiculous and unfair right now. I'd give you a hug if I could!!", "2_Subreddit": "kratom"}]}]}]}