{"nomattawut": [{"0_comments": [{"dw6dgfk": [{"0_Comment Submission": "People who \"switched sides\" in a highly divided community (political, religious, pizza topping debate), what happened that changed your mind? How did it go?", "1_Text": "What specifically do you think is unconstitutional about it? Genuinely curious, as I haven't heard that before and can't think of anything in the Constitution that would prohibit it.", "2_Subreddit": "AskReddit"}], "dw6dpk1": [{"0_Comment Submission": "People who \"switched sides\" in a highly divided community (political, religious, pizza topping debate), what happened that changed your mind? How did it go?", "1_Text": "Certainly some would take advantage of the government to personally profit above what they deserve, but it seems like it would be orders of magnitude less than a system literally designed to maximize shareholder and management's profit, with cost to patient and quality of care taking the backseat.", "2_Subreddit": "AskReddit"}], "dw6duv1": [{"0_Comment Submission": "People who \"switched sides\" in a highly divided community (political, religious, pizza topping debate), what happened that changed your mind? How did it go?", "1_Text": "Which would be most people, at this point.", "2_Subreddit": "AskReddit"}], "dw6eql9": [{"0_Comment Submission": "People who \"switched sides\" in a highly divided community (political, religious, pizza topping debate), what happened that changed your mind? How did it go?", "1_Text": "I work retail, and it amazes me how many workers think that the way things are, is the way it should be. I'm not surprised that they go along with it due to fear, but I am shocked that they agree with it.", "2_Subreddit": "AskReddit"}], "dw6fdzo": [{"0_Comment Submission": "People who \"switched sides\" in a highly divided community (political, religious, pizza topping debate), what happened that changed your mind? How did it go?", "1_Text": "I absolutely see your point. Now I'm torn because universal health care and UBI may not be constitutional, but they are so important that I don't think we have time to get enough people in board with the necessary amendments before we're in a situation we won't be able to get out of.\n\nI think similarly to you, but in regard to gun control. I think a lot of necessary gun control measures would require over stretching the second amendment, and that the 2nd needs to be amended heavily. There's no way that would fly right now, but I do think that while public opinion can slowly be shifted to the point that it would fly, some useful gun ownership control measures could be put in place that do fit in the current version.", "2_Subreddit": "AskReddit"}], "dw6fkel": [{"0_Comment Submission": "People who \"switched sides\" in a highly divided community (political, religious, pizza topping debate), what happened that changed your mind? How did it go?", "1_Text": "That's awful. I'm sorry for your brother's pain and his loss of being able to do something he (presumably) loves. Y'all shouldn't have to go through that.\n\nOne day...", "2_Subreddit": "AskReddit"}], "dw6fob5": [{"0_Comment Submission": "What was ruined because too many people started doing it?", "1_Text": "Totally, I love to ride them when we're closed and I don't have anything to do, but not with people who could get hurt around, and not while someone might actually need to use it.", "2_Subreddit": "AskReddit"}], "dw6frsp": [{"0_Comment Submission": "What was ruined because too many people started doing it?", "1_Text": "I would get fired so fast, probably even if I was really nice. Our managers have no backbone when it comes to customers, only when it comes to screwing employees.", "2_Subreddit": "AskReddit"}], "dw6h6r2": [{"0_Comment Submission": "People who \"switched sides\" in a highly divided community (political, religious, pizza topping debate), what happened that changed your mind? How did it go?", "1_Text": "The sacredness that people put on the Constitution has bothered me for a while.  Open interpretation could be highly dangerous down the line, but dear god, I cannot imagine being okay with a constitutional convention happening today. I wouldn't trust many current politicians from anywhere, on any level, and I definitely don't trust the American public to select representatives to such a convention with wisdom, reason, or thoughtful consideration.", "2_Subreddit": "AskReddit"}], "dw6hfks": [{"0_Comment Submission": "What was ruined because too many people started doing it?", "1_Text": "That, or:\n\nMe: Hey, I would really love to take your picture for a website that I'm a contributor to!\n\nThem: omg, totally! What's the website?\n\nMe: /r/trashy", "2_Subreddit": "AskReddit"}], "dw6hkau": [{"0_Comment Submission": "People who \"switched sides\" in a highly divided community (political, religious, pizza topping debate), what happened that changed your mind? How did it go?", "1_Text": "I'm thinking Costa Rica.\n\n/s", "2_Subreddit": "AskReddit"}], "dw6ksyr": [{"0_Comment Submission": "What was ruined because too many people started doing it?", "1_Text": "Those are good points, and by far more effort than I thought anyone would make to reply to that. Thanks.", "2_Subreddit": "AskReddit"}], "dw6lx6h": [{"0_Comment Submission": "Disney Union Workers On Brink of Losing $1000 Bonus -- Meanwhile CEO gets $423 Million", "1_Text": "And if you make too much to get assistance, but too little too save? You either have to keep working while you apply for jobs or take out a loan so you can take the time off. Working full time doesn't leave much time to make interviews, especially if you work during normal business hours. And god forbid your current employer finds out you're job hunting.\n\nThere are ways out, but most don't get out, and those who don't continue to get screwed.", "2_Subreddit": "LateStageCapitalism"}], "dw6mdhn": [{"0_Comment Submission": "What was ruined because too many people started doing it?", "1_Text": "We have a lot of trashy people in my town, there's no self-policing, and management won't even let us ask what we're allowed to ask legally. Our legal department for the store chain is terrible, sometimes overly cautious, sometimes willing to violate laws (generally labor-related).", "2_Subreddit": "AskReddit"}], "dw6r4vx": [{"0_Comment Submission": "What was ruined because too many people started doing it?", "1_Text": "If dogs can use their sense of *smell* to sense something as subtle as low blood sugar, something gross would seem unbearable. To clarify. \n\nBut another poster put that in a new light. \n\nUnless you are joking. It's hard to tell sometimes, things aren't always clear in text.", "2_Subreddit": "AskReddit"}], "dw6v6xe": [{"0_Comment Submission": "People who \"switched sides\" in a highly divided community (political, religious, pizza topping debate), what happened that changed your mind? How did it go?", "1_Text": "When a single company consolidates a lot of power, it often gains the ability to take advantage of both its customers and employees.\n\nIf a company grows to become the only provider of a good it service in an area, especially when there is a high cost of entry into its industry, it can raise prices or lower quality far past the point that customers would put up with if they had other options. Also, by then the company may be too entrenched to be changed or replaced. Depending on the service they provide, that can decrease overall quality of life in that area.\n\nIf a company is the only, or primary, source of decent jobs in an area, they can and will often abuse workers. Don't like a company policy? Too bad. Being harassed by someone higher up? Oh well. Company not following health or safety regulations? Good luck. And in situations like that, other employees will dissuade their fellows from saying anything, because they don't want to get fired, or have something happen to the company itself, putting a lot of people out of work.", "2_Subreddit": "AskReddit"}], "dw6vj2m": [{"0_Comment Submission": "People who \"switched sides\" in a highly divided community (political, religious, pizza topping debate), what happened that changed your mind? How did it go?", "1_Text": "I'd like to apologize for looking at your post history, first off. I swear I don't do that much.\n\nYou seem really thoughtful. It's refreshing to see people that it's possible to disagree with but still have productive talks with. Especially online. Just, thanks, and keep it up.", "2_Subreddit": "AskReddit"}], "dw6wf4y": [{"0_Comment Submission": "People who \"switched sides\" in a highly divided community (political, religious, pizza topping debate), what happened that changed your mind? How did it go?", "1_Text": "I'm not misunderstanding, I just disagree. Say one firm buys all of the for sale property in my town, and doubles everyone's rent. Instead of paying just under half of my income to rent, I'll either need to leave town, or go without food until I can get another job, while my utilities also get cut. Or just be homeless while I save enough to move out of town. I'll just need a place to sleep in the rain, a way to wash my work clothes, somewhere to bathe. \n\nThis is an extreme example, but it's just illustrative of the danger of power consolidation in private hands\n\nBut I sense that you're basing what you said on rights as philosophical abstractions. So your conclusions are probably logical based on whatever premises you started with. But for me, the actual consequences to people are more important than absolute ideological and logical consistency, so I would rather real people not suffer, even if it means that someone can't own and control whatever he wants.", "2_Subreddit": "AskReddit"}], "dwdgjrs": [{"0_Comment Submission": "Boy suspended for drawing stick figure holding gun, knives", "1_Text": "When I was in maybe third grade, we were allowed some computer lab time to work on some project or another. My project was done, so I made a shitty animation in Paint and PowerPoint where a Frankenstein's monster looking guy is on screen, and a projectile comes from off screen, moving horizontally. The bullet goes through the monster's head, displacing it's middle bit, leaving a gap. Finally, the top of the head falls and squishes into the bottom of the head.\n\nI got into so much trouble for a display of gun violence, and this was before Columbine.", "2_Subreddit": "news"}], "dwu3vgn": [{"0_Comment Submission": "Attending a Conference on the Opioid Epidemic", "1_Text": "In general, treatment centers, inpatient more than outpatient, are pretty exploitative. Both high-cost private payment/good insurance places and lower-cost Medicaid-funded or free rehabs are overwhelmingly 12 step based, as opposed to evidence-based. This keeps funding coming due to low success rates, which are often inflated because it's almost impossible to keep track of former patients long-term to find out if they stay clean.", "2_Subreddit": "opiates"}], "dwuxetj": [{"0_Comment Submission": "You can become $100,000 richer, catch is you get this money by taking $100 from 1,000 charities. No one would ever know, would you do it, why or why not?", "1_Text": "Totally. I'm poor and work my ass off. 100k would be enough to pay off my debts, put a down payment and first 12 months mortgage on a house, and allow me the time and freedom to work less while I finish getting my adjusters license and get settled at a white collar job. Oh, and a few shirts with white collars.\n\nI'm drooling at the thought.", "2_Subreddit": "AskReddit"}], "dwxbgrr": [{"0_Comment Submission": "Not going down", "1_Text": "Thanks homie. Yeah, I think the all-or-nothing mentality hurts a lot of people. They're told that once they take the first anything, they're gonna be \"off to the races,\" and it's a self-perpetuating misconception. What would have been a slip up becomes a bender. Also, all drugs are equally bad, so if you take a sub, you're gonna end up shooting dope, and if you have a couple beers, you're gonna go score some white. They'll deny that's what they say, but it's heavily implied.", "2_Subreddit": "opiates"}], "dwxc709": [{"0_Comment Submission": "Not going down", "1_Text": "I mean, when AA works, it works well, but when it doesn't work, which is often, it pushes people away and backfires.", "2_Subreddit": "opiates"}], "dwxgan4": [{"0_Comment Submission": "Not going down", "1_Text": "Absolutely. I've even had my rent overpaid so that when this happened, I'd have a couple hundred bucks extra to fall back on. It's not even that they don't allow subs, but if you're not on them when you move in, you can't start on them while living there.  But I did, and it took awhile to catch up to me, but it did.\n\nIt's a situation with several layers. I recognize that they were right to kick me out, but I feel that what I did was the right thing to do for my recovery. If I hadn't done it, I would have gotten kicked out much earlier and in a much worse position to bounce back from. As it stands, I can move forward. I would probably even move back in once I became eligible, but now that I've seen how dirty some of the people in state and chapter can be, I'm probably just going to be moving into an apartment with a friend who's in recovery.", "2_Subreddit": "opiates"}], "dwxljk7": [{"0_Comment Submission": "Not going down", "1_Text": "Used in certain ways, bupe can be abused. I've done it in years past. IV, IM, whatever. These past months, though, I haven't. Low dose, same dose, every day. Of course, looking at it from the house's perspective, there's no way for them to know that.", "2_Subreddit": "opiates"}]}], "1_submissions": [{"4lrj8g": [{"0_Title": "Fell off, little effect", "1_Text": "What specifically do you think is unconstitutional about it? Genuinely curious, as I haven't heard that before and can't think of anything in the Constitution that would prohibit it.", "2_Subreddit": "benzodiazepines"}], "52s7n2": [{"0_Title": "Idea to supplant Narcan", "1_Text": "What specifically do you think is unconstitutional about it? Genuinely curious, as I haven't heard that before and can't think of anything in the Constitution that would prohibit it.", "2_Subreddit": "opiates"}], "5eo2d3": [{"0_Title": "Many of us will suffer through thanksgiving with crazy uncles obsessed with Rush Limbaugh and Sean Hannity. A few unlucky souls are the nieces and nephews of Rush or Sean.", "1_Text": "What specifically do you think is unconstitutional about it? Genuinely curious, as I haven't heard that before and can't think of anything in the Constitution that would prohibit it.", "2_Subreddit": "Showerthoughts"}], "5h7fcv": [{"0_Title": "Thinking of starting a union in my area", "1_Text": "What specifically do you think is unconstitutional about it? Genuinely curious, as I haven't heard that before and can't think of anything in the Constitution that would prohibit it.", "2_Subreddit": "union"}], "5n8m3k": [{"0_Title": "Flunitrazolam", "1_Text": "What specifically do you think is unconstitutional about it? Genuinely curious, as I haven't heard that before and can't think of anything in the Constitution that would prohibit it.", "2_Subreddit": "benzodiazepines"}], "5q8y8b": [{"0_Title": "Relapsed", "1_Text": "What specifically do you think is unconstitutional about it? Genuinely curious, as I haven't heard that before and can't think of anything in the Constitution that would prohibit it.", "2_Subreddit": "opiates"}], "5ybssf": [{"0_Title": "I'm broken again.", "1_Text": "What specifically do you think is unconstitutional about it? Genuinely curious, as I haven't heard that before and can't think of anything in the Constitution that would prohibit it.", "2_Subreddit": "OpiatesRecovery"}], "603duh": [{"0_Title": "Update", "1_Text": "What specifically do you think is unconstitutional about it? Genuinely curious, as I haven't heard that before and can't think of anything in the Constitution that would prohibit it.", "2_Subreddit": "OpiatesRecovery"}], "66g8uo": [{"0_Title": "Update: setbacks and progress", "1_Text": "What specifically do you think is unconstitutional about it? Genuinely curious, as I haven't heard that before and can't think of anything in the Constitution that would prohibit it.", "2_Subreddit": "OpiatesRecovery"}], "6779up": [{"0_Title": "Sometimes I wish", "1_Text": "What specifically do you think is unconstitutional about it? Genuinely curious, as I haven't heard that before and can't think of anything in the Constitution that would prohibit it.", "2_Subreddit": "depression"}], "68xi4n": [{"0_Title": "Up and down and up and down.", "1_Text": "What specifically do you think is unconstitutional about it? Genuinely curious, as I haven't heard that before and can't think of anything in the Constitution that would prohibit it.", "2_Subreddit": "OpiatesRecovery"}], "6p362h": [{"0_Title": "It's been too long, baby", "1_Text": "What specifically do you think is unconstitutional about it? Genuinely curious, as I haven't heard that before and can't think of anything in the Constitution that would prohibit it.", "2_Subreddit": "opiates"}], "73a1xi": [{"0_Title": "Big disappointment in sobriety", "1_Text": "What specifically do you think is unconstitutional about it? Genuinely curious, as I haven't heard that before and can't think of anything in the Constitution that would prohibit it.", "2_Subreddit": "opiates"}], "79h0gk": [{"0_Title": "Awesome pharmacy tech", "1_Text": "What specifically do you think is unconstitutional about it? Genuinely curious, as I haven't heard that before and can't think of anything in the Constitution that would prohibit it.", "2_Subreddit": "opiates"}], "7osrly": [{"0_Title": "Worst produce ever", "1_Text": "What specifically do you think is unconstitutional about it? Genuinely curious, as I haven't heard that before and can't think of anything in the Constitution that would prohibit it.", "2_Subreddit": "TalesFromRetail"}], "86f2tz": [{"0_Title": "New restriction at work", "1_Text": "What specifically do you think is unconstitutional about it? Genuinely curious, as I haven't heard that before and can't think of anything in the Constitution that would prohibit it.", "2_Subreddit": "legaladvice"}], "8abcli": [{"0_Title": "Not going down", "1_Text": "What specifically do you think is unconstitutional about it? Genuinely curious, as I haven't heard that before and can't think of anything in the Constitution that would prohibit it.", "2_Subreddit": "opiates"}]}]}]}