{"bklynsmatt": [{"0_comments": [{"dvgdnze": [{"0_Comment Submission": "help...day 1. weighing my options", "1_Text": "I've been in this position several times with my parents. Initially the first time or 2.. it was really tough on them, but they were supportive. There was alot of anger & resentment from them in the beginning. I couldn't understand it then, but looking back now & seeing what a shock it must have been to them that 1 of their 3 sons was a heroin addict.. I can understand & appreciate why they felt & acted as they did. I think it's just the initial shock of learning that you're an addict, & also using needles. Needles are stigmatized & scary to non users. I know your whole life feels fucked right now.. But really them finding out is truly a blessing in disguise. Really you need to wanna stop on your own, & not do it for others, in order to have a greater chance of success in regard to getting clean. However having family support is huge. They're angry & hurt right now, but at least they're sticking by you & wanna get you help. There's tons of addicts out on the streets with absolutely no family or friends looking to extend a helping hand. Go to detox.. Do it right. Go to detox, take this opportunity and give it a shot. Yeah you're gonna have to eat shit for a couple weeks or months.. But I promise you time heals all wounds. & if your parents are decent people.. they won't give up on you. The anger and hurt will reside. My parents catching me had me feeling like my life was over. But in reality once I started doing the right thing.. my relationship with them has gotten exponentially better. Good luck.. get to treatment!", "2_Subreddit": "OpiatesRecovery"}], "dvgf57u": [{"0_Comment Submission": "After Addiction Comes Families' Second Blow: The Crushing Cost of Rehab", "1_Text": "I was looking at over 15 grand in bills from a 7 day detox & 30 day rehab stint. Both places were nice but still.. 15 grand is crazy. Idk where you are & how your insurance/state is with medical bills.. But I was granted a waiver fee from the rehab. I'm currently working off the books, so on paper, I'm unemployed. I struck a deal with the rehab facility by telling them I'm unemployed & couldn't afford to pay the bill. Even with my income, it'd take me many years to pay it off. So they granted me a waiver fee. Basically they're just writing it off. Then also with the detox facility I told them I couldn't afford to pay them the 5 grand bill they gave me.. they wound up eating a large portion of the bill, about 60% of it.. & all I had to pay was the amount my deductible was. Idk if you're currently employed.. But if you aren't, or you're working a minimum wage kind of job.. you can try to work something out with them. Good luck & congrats on your sobriety!", "2_Subreddit": "OpiatesRecovery"}], "dvgmi3j": [{"0_Comment Submission": "What's the worst thing you've done to spite an insufferable roommate?", "1_Text": "This is legendary. Are you God?", "2_Subreddit": "AskReddit"}], "dvo00wc": [{"0_Comment Submission": "Did any of you guys see the LPT post about ridding floor drain stank by pouring buckets of water down the drains?", "1_Text": "Cap the drains if they aren't being used simple solution. If you have an open floor drain you need to throw some water down them once in a while to fill the trap back up. The purpose of a trap is to be filled with water so no smells/gases come out of the drain. Water evaporates. Either throw a bucket of water down the drain every so often or cap them. Capping them would be a better option so if your sewer line ever gets clogged you won't have an overflow coming up thru the floor drains. It'll come out of other fixtures that you have down there.. But better it come up thru a slop sink or your shower where the water will most likely be contained to 1 area, as opposed to sprawled out all over the floor.", "2_Subreddit": "Plumbing"}], "dvo34xb": [{"0_Comment Submission": "What is your golden rule?", "1_Text": "Always pay your credit card bill on time & in full. Doesn't matter if you put $50 or $10,000 on it.. pay it on time.", "2_Subreddit": "AskReddit"}], "dvtcokp": [{"0_Comment Submission": "Seeking Interviews with Opiate Users/Ex-Users", "1_Text": "29 year old recovering heroin addict from Brooklyn. PM me if interested.", "2_Subreddit": "OpiatesRecovery"}], "dvuh5rn": [{"0_Comment Submission": "IAmA Bar owner on Paddys day in Dublin. AGAIN!", "1_Text": "Chasing the wade Boggs record", "2_Subreddit": "IAmA"}], "dvuov1g": [{"0_Comment Submission": "How much mess to expect from a plumber?", "1_Text": "I work for roto rooter doing exactly this kind of work. With main sewer line clogs, depending on where the clog is, sometimes there's just no way to avoid a mess. He should've made you aware of this before he popped your trap open. If he didn't he should be held accountable for the clean up. That's the right thing to do. However the plumbers job is to clear the clog for you, not to clean the mess up afterwards. But I do my customers a common courtesy of telling them listen this might get messy so clear things out of the way that you care about. If you have carpet in your basement, you're gonna wanna get it professionally cleaned. No matter how well you dry the area yourself, more then likely mold will develop under the carpet. Idk where you live but call someone like servpro, a water restoration or sewage cleaning company. They're gonna tell you that you have to rip the carpet up though. But yeah really sometimes there's just no way to avoid the mess.", "2_Subreddit": "HomeImprovement"}], "dvuoxi9": [{"0_Comment Submission": "How much mess to expect from a plumber?", "1_Text": "Laying down plastic wouldn't have helped this situation.", "2_Subreddit": "HomeImprovement"}], "dvz3ylo": [{"0_Comment Submission": "What was your first \"I'm an adult now.\" purchase?", "1_Text": "29 years of age & I just bought a dope couch for our living room. Been referring to it as my first adult purchase for like the past week now. I've paid rent, college tuition, & financed my car. But for some reason this couch has me feeling extra adulty.", "2_Subreddit": "AskReddit"}], "dw33l54": [{"0_Comment Submission": "How often to do you find that gaskets between toilet tanks and bowls need to be replaced?", "1_Text": "Most toilet parts have a 5 year life span on the boxes. Flush valves, fill valves & flappers. Those gaskets though, I rarely change them.", "2_Subreddit": "Plumbing"}], "dw6rsp5": [{"0_Comment Submission": "Is it normal to be able to see the water in the drain", "1_Text": "It's a P trap & it's purpose is to be filled with water so no smells or gases can make their way up through your pipes & out of your fixtures.", "2_Subreddit": "Plumbing"}], "dw9tu3c": [{"0_Comment Submission": "Need to change a shower cartridge but there's stripped screw on shower handle and I can't get it off. Suggestions?", "1_Text": "Stick a rubber band on the tip of the screwdriver. It'll give you some traction.", "2_Subreddit": "Plumbing"}], "dwakla3": [{"0_Comment Submission": "I have questions about sewerjetters", "1_Text": "I work for roto rooter and our jets are about 4000 psi. If it's not affordable to excavate & replace the line, then you must have it jetted. But yeah a majority of companies aren't going to wanna work from a manhole. I'm in NYC & we charge 1200-1700 to jet a line. So the prices you were quoted are pretty high. You seem to have a pretty good grasp & good ideas though thus far. Keep going with your gut & try to get it done yourself if you can't afford to have the work done by someone else. However I definitely reccomend you get the line jetted properly & furthermore replacing the line in this situation is your best option. By you saying you only cleared about 9 feet of it says it all about how bad of shape the line is in. Idk how old you are or how much more time you intend on staying at your current home.. But just remember roots grow back.  If you are successful in clearing the line make sure you snake it at least twice a year if not 3 or 4 times after that.", "2_Subreddit": "Plumbing"}], "dwakyx8": [{"0_Comment Submission": "Wife Just Poured Two Cups of Lard Down the Drain", "1_Text": "Baking soda & vinegar. YouTube roto rooter how to clear a drain. I work for roto rooter & have literally cleared some clogs with this method after I couldn't get it with the snake or blowbag. This shouldn't cause an immediate problem for you, but long term.. shit like this will definitely clog the line.  For future reference nothing but water should go down your drains. Wipe the oil off of pots and pans with a paper towel before you wash them.", "2_Subreddit": "Plumbing"}], "dwhfzgs": [{"0_Comment Submission": "Has anyone here replaced their main sewage line without professional contractors?", "1_Text": "I'd reccomend getting it done professionally. I do excavation work on sewer lines all the time & as it may seem fairly simple.. it's very easy to get it wrong. The most important thing is the pitch or the angle of the line. Which believe it or not I often see professionals fucking this up pretty often. Countless times I've done jobs where I'm digging up a sewer line that was just replaced weeks or months prior because it was back pitched. Also this shit is back breaking work. Especially when there's roots involved.", "2_Subreddit": "HomeImprovement"}], "dwkzife": [{"0_Comment Submission": "Toilet is leaking from the bottom through the closet bolt holes and water coming up from drains in shower.", "1_Text": "Are you only experiencing the overflow out of that toilet when you use said toilet or the shower next to it? What about when you use the other fixtures in your house? If water overflows from that toilet or shower regardless of where you're using water in your house, then your main sewer line is clogged. If the water only overflows when using that specific toilet & shower.. then your branch line is clogged. Your branch line is the pipe that your shower & toilet drain into, which leads towards the main sewer line, & the sewer line is the last pipe the water drains thru to leave your home towards the sewer. Either way one of those lines will have to be snaked. It's just a matter of finding where the clog is now, & snaking it from the right spot. \n\nSorry blanked out for a minute while reading your post. Your main sewer line is clogged, not your branch line. Main sewer line needs to be snaked 100%.", "2_Subreddit": "Plumbing"}], "dwkzod5": [{"0_Comment Submission": "2018.", "1_Text": "Die.", "2_Subreddit": "CringeAnarchy"}], "dwly661": [{"0_Comment Submission": "How plumbing companies know if their employees not using company's supplies and equipment to do side jobs between legit service calls? Is having private clients normal for employees?", "1_Text": "Sidework is part of the job if you're a service technician. If you do it on your day off, & dont use company parts.. it's not a big deal where I work. However if I were to take one of my companies clients, then it's a problem. I own my work van and my tools so I'll do what I want with them. If you make money for the company they won't bother you about sidework as long as it's not on the companies time. However I will admit that I've done sidejobs on company time, & I've also gained a few good customers that I now work with privately, thru my work at my company. But I'd like to add that I'm one of the highest earning techs at my company.. I do shit the right way, & I never take a day off. They know what's up but they don't bother me because I'm a reliable asset.\n\nI'd say it's normal for techs to have their own clients. & GPS in the work van & or phones if you give them work phones. My company has an app that has GPS & it also tracks my timesheet.. like when I started and ended a job. If I spend a long time on an easy call, they'll ask if there was a problem or if I was sitting on my ass in the van for a while after the job.", "2_Subreddit": "Plumbing"}], "dwmgp5u": [{"0_Comment Submission": "Good Bye the High", "1_Text": "I've been on subs several times for large portions of time, the most being 2 years at 1 point. I too had a high dosage of 16-24mg a day for most of that time. I've had a lot of experience in recovery, getting clean off oxys, heroin & subs. I gotta tell you man in my case depression was something that came hand in hand with my drug use, & that includes subs. My outpatient program wanted to keep me on subs for what seemed like forever. I actually had to fight with them to refer me to a doctor that specializes in tapering ppl off of subs.\n\nI have to say, a little over 6 months clean & I feel incredible right now. My depression was always drug related. I was never sad & never had a problem disliking myself or anything like that. It was more just the carelessness & lack of motivation, like not giving the slightest fuck about anything in life. \n\nThis shit takes time & work though. I always though abstinence alone by itself was enough. For me, that ain't the case. After detoxing from both oxys & heroin close to 10 times.. this time around I finally decided to do something different because whatever I did in the past didn't work. I do outpatient and I'm taking treatment seriously for the first time. Got a bunch of friends that dont get high. & I try to find new hobbies and shit to keep myself busy. Before it was just abstinence, bullshitting my way thru treatment, & being depressed at home doing nothing but watching TV.\n\nFind the right doctor & try doing things differently then you'd normally do. Good luck mad love your way!", "2_Subreddit": "opiates"}], "dwnk7rw": [{"0_Comment Submission": "I'm a Male that pees sitting down while at work to enjoy some alone time.", "1_Text": "I work in a family business with a very private/clean single person bathroom. I'm not trying to sit on public toilets either trust me.", "2_Subreddit": "confessions"}], "dwnn8jt": [{"0_Comment Submission": "What do people call dope where you live?", "1_Text": "Dope, diesel, D, dog food, work", "2_Subreddit": "opiates"}], "dwno9bb": [{"0_Comment Submission": "Different types of NY Dope? New user", "1_Text": "I'd say 70-80 is the average rate. But anywhere btwn 60-100 really depending on what kind of work you're getting and what kind of relationship you have with your man. Also if your talking sleeves you'll see them for 500-600. The tan shit is where it's at & yeah that vinegary smell is normal. In my experience the grey shit is usually horrible.", "2_Subreddit": "opiates"}], "dwrrrjj": [{"0_Comment Submission": "Nike chose my Air Max design to represent NYC", "1_Text": "That bacon egg & cheese game is part of my daily life. Congrats & I hope I'll get to cop them in the future. Mad love from bklyn!", "2_Subreddit": "Sneakers"}], "dwsrr20": [{"0_Comment Submission": "I have a 3in drain plug stuck in my 4in sewer line", "1_Text": "If the water stopped draining within 30 seconds that means the plug did go further down the line but didn't get far. I work for roto rooter & I'd say your best option is to get the line jetted by a high pressure water jet. You can try and clear it with the snake but if it already got stuck in your line once, so chances are it'll keep getting stuck the further you push it & you might hit a point where there's too much buildup for the plug to get past. You can camera the line but I think it's a waste of money. Why pay for the camera? You use a camera to diagnose a problem and find its location. You already know what the problem is so the camera is a waste. The water jet is the best solution for this problem if you can afford it. & finding a company with the strongest jet. Our jets at roto rooter blow about 4000psi which is almost 1000 more then most other companies around us. If you wanna rent a snake and take a shot at it first, you can do that to try and save some money. But the jet is the best way to go.\n\nAlso if it took 30 seconds to stop draining, a shop vac won't reach it, it's already too far gone. & a camera will not push the plug thru the line.", "2_Subreddit": "Plumbing"}]}], "1_submissions": [{"88vnbf": [{"0_Title": "I'm a Male that pees sitting down while at work to enjoy some alone time.", "1_Text": "I've been in this position several times with my parents. Initially the first time or 2.. it was really tough on them, but they were supportive. There was alot of anger & resentment from them in the beginning. I couldn't understand it then, but looking back now & seeing what a shock it must have been to them that 1 of their 3 sons was a heroin addict.. I can understand & appreciate why they felt & acted as they did. I think it's just the initial shock of learning that you're an addict, & also using needles. Needles are stigmatized & scary to non users. I know your whole life feels fucked right now.. But really them finding out is truly a blessing in disguise. Really you need to wanna stop on your own, & not do it for others, in order to have a greater chance of success in regard to getting clean. However having family support is huge. They're angry & hurt right now, but at least they're sticking by you & wanna get you help. There's tons of addicts out on the streets with absolutely no family or friends looking to extend a helping hand. Go to detox.. Do it right. Go to detox, take this opportunity and give it a shot. Yeah you're gonna have to eat shit for a couple weeks or months.. But I promise you time heals all wounds. & if your parents are decent people.. they won't give up on you. The anger and hurt will reside. My parents catching me had me feeling like my life was over. But in reality once I started doing the right thing.. my relationship with them has gotten exponentially better. Good luck.. get to treatment!", "2_Subreddit": "confessions"}]}]}]}