{"ky419": [{"0_comments": [{"dr4jno5": [{"0_Comment Submission": "Sledgehammer Games: \"FYI - We're aware of #CODWWII connectivity issues on @Xbox and have been working to resolve. If you're experiencing any issues connecting, please let us know your gamer tag, connection type and location. The more info the better. Will update as soon as possible.\"", "1_Text": "Gamertag: ki1o\nPlatform: OG Xbox One 250gb\nhas been occuring ever since winter update\ndisconnects after load screen (which takes forever)\nalso every map every gamemode i have to wait anywhere from 15-60 seconds to spawn in after game has started and enemies are already running around and capping objectives\nLocated in Toledo, Ohio", "2_Subreddit": "WWII"}], "dwm6tqq": [{"0_Comment Submission": "Used subs for the first time recreationally, need advice please...", "1_Text": "alright well where I'm from parachuting means splitting your dose up over time, can't disclose location per the sidebar, I'm reading what parachuting means to you guys and that sounds like straight autism that anyone would do that with any drug, but hey different strokes for different folks. I let the strips dissolve on my tongue completely I did not swallow em and most certainly didn't send shove them up my ass, and I never said i did any research on em before i did em, prolly dumb to do yea but i was told what to do with them, i just didnt know about inducting. I appreciate the comment tho even tho its not exactly advice its more or less sitting here calling me a bupe nerd over the internet when my post literally said i was a noob. Excellent observation there cap", "2_Subreddit": "opiates"}], "dwm73ta": [{"0_Comment Submission": "Used subs for the first time recreationally, need advice please...", "1_Text": "Did not eat the strips, i let them dissolve on my tongue once and did the inside of my cheek the other times because the taste was something awful, and there is definitely some recreational use however I am clearly not as heavy of a user compared to y'all, i made that clear in my post so calling someone who admitted to being a noob a noob is fairly redundant.\n\nAnd addiction is a terrible, terrible thing to face. Ive lost friends and family to it, i was simply trying to provide some background hoping it may help someone who wanted to give advice and not troll. I will never use it because my area is being hit hard with spiked dope and press pills. Fent, trainquilizers, you name it. City newspaper not too long ago ran a picture on the front page of a mother and father who OD'd on H cut with horse tranqs behind the wheel with an infant child in the backseat", "2_Subreddit": "opiates"}], "dwm7712": [{"0_Comment Submission": "Used subs for the first time recreationally, need advice please...", "1_Text": "parachute in my area simply means spreading your dose out over the day, in my case over the course of 20 or so hours before i decided to sleep. I let the strips dissolve in my mouth i did not swallow them or do anything else with them.", "2_Subreddit": "opiates"}], "dwm7kok": [{"0_Comment Submission": "Used subs for the first time recreationally, need advice please...", "1_Text": "Parachuting in my area simply means spreading your doses out over time, first dose when i woke up, second dose when i went to work about 10 hours later, final dose when i got off 8 hours later. I knew not to eat them, i let the strips dissolve on my tongue, and for what its worth to me atleast I got a \"peak\" off each dose. And thankyou this was actually the only comment that offered any advice opposed to just trolling, which granted i expected. I didnt do any research on bupe before i took it, just what i had heard from my dealer. I was aware it was strong but I did not know the half-life was that long or that you need to induct on it to truly experience it. What little i browsed didnt mention anything about cross tolerance to oxy, i suppose its possible but i plan on holding off on the oxy until next weekend. The only reason i tried to dose again so soon is all the threads i said wait 24-72 hours to dose any other opiods after a dose of bupe, i suppose it makes sense given the size of my dose and my bodyweight. Again thankyou for being the only reasonable person on this thread", "2_Subreddit": "opiates"}], "dwm8h93": [{"0_Comment Submission": "Used subs for the first time recreationally, need advice please...", "1_Text": "From what I've read, the people who claim their receptors have permanently changed were on sub programs for an extended period of time, if you really think that one substantial dose of suboxone could permanently could you provide a source for this information? \n\nSomewhat, I just was not aware of the lengthy half-life and that you're supposed to induct to them. My guy sold me 8mg strips and said he takes 2 a day when he does take them, he sells most of his script and still takes oxy regularly.\n\nI did not, i dissolved the strips on my tongue the way youre \"supposed\" to. Parachuting in my area simply means to spread your dose out over the day. I didnt take 3 strips at once that would be worse than suicide, i spread my 3 doses out over the course of ~20-24 hours\n\nI didnt swallow them, and Ive heard of this a FOM when first prescribed the 2mg pills swallowed one his stomach hurt so much he went to the ER\n\nAnd when you put it like that it would make sense but not a permanent tolerance, right? It should go back down over-time i dont plan on trying to dose again for another week.\n\nthankyou", "2_Subreddit": "opiates"}], "dwo0dv0": [{"0_Comment Submission": "Used subs for the first time recreationally, need advice please...", "1_Text": "Very much appreciated! Subs were cool for rec use but not anytime soon for me again and def only 2mg or so. Gonna stick to klonipin and possibly some stimulants for awhile, and thankyou Ive read all the comments and some of them had absolutely no proof", "2_Subreddit": "opiates"}]}], "1_submissions": [{"88l52z": [{"0_Title": "Used subs for the first time recreationally, need advice please...", "1_Text": "Gamertag: ki1o\nPlatform: OG Xbox One 250gb\nhas been occuring ever since winter update\ndisconnects after load screen (which takes forever)\nalso every map every gamemode i have to wait anywhere from 15-60 seconds to spawn in after game has started and enemies are already running around and capping objectives\nLocated in Toledo, Ohio", "2_Subreddit": "opiates"}]}]}]}