{"blorgbots": [{"0_comments": [{"dwpnuk3": [{"0_Comment Submission": "Looking for a clip of elyse + adam", "1_Text": "God I love the internet", "2_Subreddit": "funhaus"}], "dwpnztb": [{"0_Comment Submission": "Icremepieyoubby", "1_Text": "I kinda like how straightforward he is. He knows who he is and what he wants.\n\nOf course, nobody is gonna fuck him, but props bro", "2_Subreddit": "justneckbeardthings"}], "dwpot2f": [{"0_Comment Submission": "ECP, BTH, #3, #4...which is the purest/least pure?", "1_Text": "Lot of misinformation on here...\n\nSo #3 is H base, #4 aka ECP is H salt (usually hydrochloride). It's made into the salt to make it snortable and shootable without adding any citric acid, which turns #3 into a salt for injection. Tar is just H made cheaply/more easily resulting in lots of byproducts still in the finished product.\n\nIf you have totally \"pure\", or perfectly synthesized, samples of all three, by weight #3 is going to get you the highest. It's just pure heroin. #4, or ECP also has the HCl to make it a salt, so by weight there's a little less H. BTH will get you the least high by weight.\n\nFunctionally, though, it varies a TON. Because they are in powder form, #3 and #4 are more easily cut, but it's not that hard to cut BTH either. Then there's fent and all that other shit... But since BTH is less potent to begin with, it often (not always) is cut less. So its impossible to tell other than that ideal scenario I mentioned.", "2_Subreddit": "opiates"}], "dwq1b51": [{"0_Comment Submission": "ECP, BTH, #3, #4...which is the purest/least pure?", "1_Text": "Not nearly as much pure heroin by weight, correct. Though there are a lot of active byproducts like morphine and codeine, etc, which make up some but not all of that difference. So, I've heard (east coaster here) that it is even more sedating than \"just\" H which would make sense and some prefer.\n\nIdk what you mean by harsher, but it is for sure worse for your veins. It pulls up into this super dark liquid, and gets you to the point where you can't hit a spot quicker. I actually dunno how BTH users know they've registered... But clearly they do haha\n\nAnd fuck that dude that was like \"really?\". Don't ever hesitate to ask questions man, very few people will be dicks about it like that. But to be fair, you *could* have just googled that shit. I like to show off my knowledge like a douche, though, so no big", "2_Subreddit": "opiates"}], "dwq1s7y": [{"0_Comment Submission": "Trump’s EPA officially starts the fight to lower vehicle emissions standards", "1_Text": "Whoa whoa, that's way too many rights! Let's take away abortion and have the feds enforce it.\n\nMmm... Small government", "2_Subreddit": "technology"}], "dwq22zx": [{"0_Comment Submission": "What parents have you met that make you think, “Yep, that kid is FUCKED”?", "1_Text": "Uh ok....\n\nWgat\n\nWhat's next?", "2_Subreddit": "AskReddit"}], "dwq2b52": [{"0_Comment Submission": "Icremepieyoubby", "1_Text": "You're right, there is that small amount of salt. TBF though, if I were trying my luck at the \"dating\" app game and having the same amount of sex I assume he's having, I would act FAR saltier ha", "2_Subreddit": "justneckbeardthings"}], "dwq2fem": [{"0_Comment Submission": "D&D with 4 and 5 year olds", "1_Text": "That must be frustrating, but it sounds like those kids are having a BLAST! Maybe don't even have a story or have just the very bare bones/first quest set up and still make the characters with them?\n\nI really wish I had had a nanny who would do that shit with me when I was young.... mine just did her multivariable homework and put on the Ninja Turtles movies. To be fair, still pretty dope for 5 year old me", "2_Subreddit": "DnDGreentext"}], "dwq3dsg": [{"0_Comment Submission": "D&D with 4 and 5 year olds", "1_Text": "thats so dope I kinda refrain from going too hard on character creation for its own sake it games because I can't save em.... I should start my own 5e binder! \n\nI've never played 3.5, so maybe I should make a couple of characters in there too just in case. Seems kinda needlessly complicated though", "2_Subreddit": "DnDGreentext"}], "dwq3f53": [{"0_Comment Submission": "ECP, BTH, #3, #4...which is the purest/least pure?", "1_Text": "Then asking is the right thing! I have a degree in pharmacology I never get to use in my job, so talking about drug chemistry and shit really gets me goin", "2_Subreddit": "opiates"}], "dwq4unk": [{"0_Comment Submission": "What parents have you met that make you think, “Yep, that kid is FUCKED”?", "1_Text": "I hear you", "2_Subreddit": "AskReddit"}], "dwq4wt3": [{"0_Comment Submission": "Pg and cotton fever", "1_Text": "No worries mang. In the future, if you have a question about IV or IM usage, or really anything with needles, you may be better off going to /r/opiates. You're not doing an opiate, but they like benzos over there too and MAN do they know their needles;", "2_Subreddit": "askdrugs"}], "dwsqosh": [{"0_Comment Submission": "Please help these peasants...", "1_Text": "And they're missing that last carbon off the second Ethyl group on the chain Nitrogen as well.\n\nBut I agree, that's WAY too close to be coincidental.", "2_Subreddit": "DrugNerds"}], "dwsz1j4": [{"0_Comment Submission": "What's the best piece of advice you've ever been given?", "1_Text": "That's definitely what the phrase is supposed to mean, but I think the guy above you interpreted it in a valid and interesting way.\n\nLike a \"don't put your eggs in one basket\" but socially. I dig it", "2_Subreddit": "AskReddit"}], "dwtpxy3": [{"0_Comment Submission": "Facebook now says up to 87 million users may have had their data leaked to Cambridge Analytica.", "1_Text": "Aw, sounds like there's some bitterness there. I would be too, and *I* would have fucking gone to your party brej", "2_Subreddit": "worldnews"}], "dwtqdhw": [{"0_Comment Submission": "Facebook now says up to 87 million users may have had their data leaked to Cambridge Analytica.", "1_Text": "Haha I love that. Absolutely no use for it but you were in the club. I totally would have done the same.\n\nReal question, who the fuck was your college age buddy when you were ten damn? \n\nI was just thinking today, I had an 18 year old online friend when I was 13 or so. Even that, looking back, was weird as fuck. He never tried to meet up though, so I'm telling myself I was just mature for my age haha", "2_Subreddit": "worldnews"}], "dwtxl24": [{"0_Comment Submission": "Facebook now says up to 87 million users may have had their data leaked to Cambridge Analytica.", "1_Text": "Yeah I get that, but this guy was my personal buddy. Like we chatted on AIM (member that?) all the time and we made a cheesy friend banner for our signatures in the forum where we met (member *all* those things? Haha). So it wasn't just a tolerance thing.\n\nBut again, he never asked to meet up so I'm just gonna say was nothing rapey!", "2_Subreddit": "worldnews"}], "dwtxnzc": [{"0_Comment Submission": "Facebook now says up to 87 million users may have had their data leaked to Cambridge Analytica.", "1_Text": "Jesus, all that shit sounds awesome. All the parties I throw just have various foods and alcohols haphazardly spread on a table. Their loss!", "2_Subreddit": "worldnews"}], "dwtxqdl": [{"0_Comment Submission": "Please help these peasants...", "1_Text": "Yo of course! I didn't even think of that shit. You're totally right.", "2_Subreddit": "DrugNerds"}], "dwty811": [{"0_Comment Submission": "I would watch it", "1_Text": "Everything you're saying about blades success is correct, but the point that nobody knew it was a superhero movie is the relevant point. It was a gritty, stylized R-rated action film in a period when those were HUGE, and I think its success was far more attributable to that than being the kickstart for superhero movies.\n\nIf there really wasn't a summer after without a superhero blockbuster, that would help your point, but I can't think of big superhero movies for all of the five or so years after Blade came out. What were they?", "2_Subreddit": "BlackPeopleTwitter"}], "dwtzgyp": [{"0_Comment Submission": "Facebook now says up to 87 million users may have had their data leaked to Cambridge Analytica.", "1_Text": "Honestly, even if you sucked (which in sure you don't), would be totally worth just for a party with actual effort put in.\n\nI dont know why I'm trying so much to pick you up, but i feel compelled to ha", "2_Subreddit": "worldnews"}], "dwuk3ij": [{"0_Comment Submission": "What’s not a big deal in real life, but is a red flag in movies?", "1_Text": "Dang man, I've never heard of this... Sixshadowing you called it? Thank you for the lesson on that obscure technique!", "2_Subreddit": "AskReddit"}], "dwuxzqy": [{"0_Comment Submission": "What's the best case of instant karma that you've ever seen?", "1_Text": "What do you gain if he is, really?\n\nBest to approach stuff on this site in the old 4chon way \"The stories posted here are artistic works of fiction and flasehood. Only a fool would take anything posted here as fact\"\n\nIf it's a good story, it's a good story. Fukkit", "2_Subreddit": "AskReddit"}], "dwwu54m": [{"0_Comment Submission": "Anti-nostalgia thread. What was the shittiest widespread thing from the era of your childhood?", "1_Text": "It's still pretty widely postulated that AIDS in humans may have originated from *someone* fucking a monkey.... I just don't think we'd call that person gay, exactly", "2_Subreddit": "AskReddit"}], "dwwua5c": [{"0_Comment Submission": "Anti-nostalgia thread. What was the shittiest widespread thing from the era of your childhood?", "1_Text": "I know what you're talking about, my dad referred to it as carnie talk? Dunno if that's the real name", "2_Subreddit": "AskReddit"}]}], "1_submissions": [{"3nq3er": [{"0_Title": "Three years with this fucking credit card", "1_Text": "God I love the internet", "2_Subreddit": "opiates"}], "3rif23": [{"0_Title": "Oh jeez here it comes", "1_Text": "God I love the internet", "2_Subreddit": "opiates"}], "4310ry": [{"0_Title": "Answer to all questions on /r/opiates", "1_Text": "God I love the internet", "2_Subreddit": "opiates"}], "44oo0l": [{"0_Title": "I forgot about a job I had earlier in the year and didn't include that W-2 in my tax filing.", "1_Text": "God I love the internet", "2_Subreddit": "personalfinance"}], "49m9ne": [{"0_Title": "What distant memory do you have that, although totally insignificant, you remember completely clearly?", "1_Text": "God I love the internet", "2_Subreddit": "AskReddit"}], "4cdu9l": [{"0_Title": "Does anyone else try really hard to look like a square?", "1_Text": "God I love the internet", "2_Subreddit": "opiates"}], "4h3ekj": [{"0_Title": "When I'm sober and the food is too hot...", "1_Text": "God I love the internet", "2_Subreddit": "trees"}], "4ugskj": [{"0_Title": "Did anyone NOT have bulge problems in pants?", "1_Text": "God I love the internet", "2_Subreddit": "bigdickproblems"}], "4wmyhl": [{"0_Title": "Day two is when I start to convince myself", "1_Text": "God I love the internet", "2_Subreddit": "opiates"}], "4x5npw": [{"0_Title": "DXM shows promise in combination therapy in the rat self-admin model of nicotine addiction", "1_Text": "God I love the internet", "2_Subreddit": "DrugNerds"}], "50njtg": [{"0_Title": "Common Morbro....", "1_Text": "God I love the internet", "2_Subreddit": "opiates"}], "54l1wy": [{"0_Title": "Man, SnoopSnoo can really gather a good picture of you based just on your Reddit post history. It also captured my maturity level", "1_Text": "God I love the internet", "2_Subreddit": "opiates"}], "5bvjtr": [{"0_Title": "I feel normal!!", "1_Text": "God I love the internet", "2_Subreddit": "opiates"}], "5tp83a": [{"0_Title": "SPK are good for a bit of sour, but if you REALLY wanna get kicked in the teeth, Warheads are where it's at", "1_Text": "God I love the internet", "2_Subreddit": "opiates"}], "65no21": [{"0_Title": "What could you have done with dope money?", "1_Text": "God I love the internet", "2_Subreddit": "opiates"}], "665xa2": [{"0_Title": "What album should I listen to first?", "1_Text": "God I love the internet", "2_Subreddit": "arcticmonkeys"}], "6qei5m": [{"0_Title": "My goodbye post. It's been real y'all", "1_Text": "God I love the internet", "2_Subreddit": "opiates"}], "7bfwnz": [{"0_Title": "/u/blorgbots GCX Rep Profile", "1_Text": "God I love the internet", "2_Subreddit": "GCXRep"}], "7bfzaa": [{"0_Title": "[H] $250 Pottery Barn [W] 80% PayPal", "1_Text": "God I love the internet", "2_Subreddit": "giftcardexchange"}], "7k043t": [{"0_Title": "Sounds about right", "1_Text": "God I love the internet", "2_Subreddit": "opiates"}], "7pdqqw": [{"0_Title": "Post your liquid collection! What's your favorite in there? Least Favorite? Why?!?!", "1_Text": "God I love the internet", "2_Subreddit": "Vaping"}], "7vwaws": [{"0_Title": "I get so many compliments on my eyes when high", "1_Text": "God I love the internet", "2_Subreddit": "opiates"}], "7xfrc9": [{"0_Title": "Happy V-day boys and (white) girls", "1_Text": "God I love the internet", "2_Subreddit": "opiates"}], "85jvdb": [{"0_Title": "Well shit. Looks like I'm looking at a felony....", "1_Text": "God I love the internet", "2_Subreddit": "opiates"}], "88j45g": [{"0_Title": "What is it that gives a note 'finality' at the end of a song?", "1_Text": "God I love the internet", "2_Subreddit": "askmusicians"}]}]}]}