{"Mu_Kappa_Delta": [{"0_comments": [{"dvxixd5": [{"0_Comment Submission": "Literally every single problem of opiate use stems from it's illegality.", "1_Text": "Yes, many could still overdose, but that is no justification for it being made illegal. And if narcan was made easy available, then the death rates would be very small.", "2_Subreddit": "opiates"}], "dvytpsd": [{"0_Comment Submission": "Literally every single problem of opiate use stems from it's illegality.", "1_Text": "Methadone is by no means bad, just worse than heroin imo, and can be very negative for some people. But it's better than using dope illegally. But if there'd been a program where you go legal heroin instead of methadone you'd prob have had more success.", "2_Subreddit": "opiates"}], "dvytv4i": [{"0_Comment Submission": "Literally every single problem of opiate use stems from it's illegality.", "1_Text": "I made a new account because my old one reached too many messages and my post history was being deleted with every new post. Which is bad because the whole reason I ever started using reddit was to create a diary of sorts.\n\nMy old account is bigyellowlemon.", "2_Subreddit": "opiates"}], "dvytw7v": [{"0_Comment Submission": "Literally every single problem of opiate use stems from it's illegality.", "1_Text": "He's off base, this is a new account not a throwaway.", "2_Subreddit": "opiates"}], "dvyvlwe": [{"0_Comment Submission": "Literally every single problem of opiate use stems from it's illegality.", "1_Text": "Thank you for this information. I have actually been wondering myself whether this is the case or not. I exaggerated the safety and effectiveness of opiates in my post but in reality I have a more balanced and nuanced view of them. But of course who gives a shit if someone says opiates are bad? It's basically the only thing said about opiates, so I didn't mention it.\n\nIt's a question I've been been trying to answer: is using long term sustainable? Basically, if all the illegality and external problems of opiates were removed, would they work in the long term?\n\nThe answers I've found have been pretty mixed. There's people like you, or chronic pain patients who become extremely depressed JUST from the heroin. They inject grams a day and feel nothing. I've read stories before similar to what you said your experience was like. But on the other hand, I've read stories where people successfully use for decades.\n\nI think a big part is the person biology, and how they use it. If you inject, or constantly redose to get high again, or constantly try to nod, it will stop working. Though I don't know for sure.\n\nI don't mean for my post to make light of your problems with heroin.", "2_Subreddit": "opiates"}], "dvyvoes": [{"0_Comment Submission": "Literally every single problem of opiate use stems from it's illegality.", "1_Text": "How is it not logical? In many ways it is comparable.", "2_Subreddit": "opiates"}], "dvyvtcf": [{"0_Comment Submission": "Literally every single problem of opiate use stems from it's illegality.", "1_Text": "Tianeptine is a whole other animal than real opiates. The problems with tianpetine are from tianeptine. But I see your point.\n\nYeah you're right, but I want to make the case that some people are perfectly happy while using opiates long term as well, and that it's societies fault for the opiate related suffering they go through, not the opiate itself. For some people.", "2_Subreddit": "opiates"}], "dvz0isg": [{"0_Comment Submission": "Suboxone strip and MDMA", "1_Text": "Dude, when's the last time you took another opiate. If you've taken an opiate in the last 24 hours, **DO NOT, I REPEAT, DO NOT TAKE THE SUBOXONE**. \n\nIt will literally be the worst pain you've ever felt. You will be terrified and experience real fear on a level you didn't know was possible. And on MDMA, you'll likely have some convulsions. You'll shit and puke yourself and sob and you'll feel pain worse than you've ever felt.\n\nThis is called precipitated withdrawals. It's when you have a tolerance to opiates, are on an opiate, and then a weaker opiate/opiate antagonist binds to the receptors. It basically puts you into super withdrawal, withdrawal 10x or 100x.\n\nEdit: If you haven't taken an opiate in the last two days or so, then it should be fine to take, but I'd start with 1mg at most, if you have no real tolerance than .5mg will be enough. If you have no tolerance and take a full 8mg you'll be high as fuck, you won't be able to function, you'll be itchy and sleepy and will puke.\n\nWhat's your tolerance at? Describe your use the past couple of weeks.", "2_Subreddit": "opiates"}], "dvz0ot4": [{"0_Comment Submission": "Suboxone strip and MDMA", "1_Text": "Okay you should be fine to take it. I just wanted to make sure. What's your tolerance level? I'd start low.", "2_Subreddit": "opiates"}], "dvz110z": [{"0_Comment Submission": "Suboxone strip and MDMA", "1_Text": "I just said all those warnings in case you were a noob.", "2_Subreddit": "opiates"}], "dvz11s3": [{"0_Comment Submission": "Suboxone strip and MDMA", "1_Text": "It can take hours to feel it.", "2_Subreddit": "opiates"}], "dvz17kz": [{"0_Comment Submission": "Suboxone strip and MDMA", "1_Text": "And some people feel it in 15 minutes. But it's common for it to take an hour to start feeling anything, especially for the first time. You'll just have to see for yourself.", "2_Subreddit": "opiates"}], "dw16ghs": [{"0_Comment Submission": "Easier, alternate GHB extraction from GABA -> GHB conversion?", "1_Text": "Why is yeast never mentioned?\n\nYeast can be used for a lot of chemistry. When yeast are exposed to amino acids they convert much of it into the correlating alcohol. So GABA becomes GHB, tryptamine becomes tryptophol, etc. Easy peasy. Yeast can also be used to make potent steroids from common precursors like DHEA.", "2_Subreddit": "TheeHive"}], "dw16pry": [{"0_Comment Submission": "agonists from naloxone in two steps", "1_Text": "DUDE YES! I've been meaning to post this for a while but never did because I don't want this to get exposure. But now it's out in the open so might as well. Weird, because I just private messaged someone about this same topic. Anyways...\n\nSo this lasts summer I was reading about opiates and noticed how similar the structure of naloxone/naltrexone is to oxymorphine. Then I found the vespiary forum posts about converting naloxone to oxymorphone. They then got sidetracked on the idea of creating a partial agonist out of naltrexone and that's way too risky and more difficult. I just want a real, full agonist that has real clout, oxymorphone is touted as the best opiate so this seemed like the best option.\n\nIf the reaction could be done with naltrexone, that would be great: naltrexone can be picked up at the pharmacy for basically free in large amounts. Sadly naloxone is uber expensive for basically none. And sadly naltrexone's cyclo ring is way to strong. Naloxone would be better suited for this reaction for sure.\n\nSo anyways, the part you will like: I have found a source for bulk naloxone: Alibaba. Kilograms can be bought off of there.\n\nThis is THE reaction we should all care about. Fuck dealing with synthetic non-opiate opioids, fuck dealing with all that bullshit.. If we can find a way to make Opana cheaply, there is no limit. It is the goldmine.", "2_Subreddit": "TheeHive"}], "dw5j8zr": [{"0_Comment Submission": "Literally every single problem of opiate use stems from it's illegality.", "1_Text": "Oh, I understand, I don't understand how I failed to see such a blatant hole in my logic.\n\nBy discrimination, I meant stuff like prison, society looking down on you, etc. Not genocide or anything like that.\n\nAnd honestly, a lot of the societal prejudice is there for a reason, because many addicts are fucking assholes, degenerates, no empathy or morals or values. Not saying all, at all.\n\nBut you just see so many stories of junkies stealing, mugging, etc. And then they say \"oh it wasn't me, it was the drugs/addiction. Addictions a disease, it wasn't my fault\". \n\nJust went off on a little rant, but anyways. Disregarding societal prejudice, I just think the mere fact that people will be thrown in prison for merely using an opiate is an insane travesty of epic proportions. Not the same (at all) as a racial injustice, but in my mind equally as horrible. You understand what I mean? The categories of the injustice is different but in terms of level of injustice, equal (especially when the heroin addict gets a decade in prison, while the racial prejudice is just being called mean names by some people.", "2_Subreddit": "opiates"}], "dw92jvn": [{"0_Comment Submission": "Anyone else agree?!", "1_Text": "Exactly man you summed it up", "2_Subreddit": "opiates"}], "dw92x12": [{"0_Comment Submission": "Anyone else agree?!", "1_Text": "Last paragraph is something I've thought and said almost verbatim myself.\n\nThey wake up when their alarm goes off. Open their eyes and have a deeply satisfying stretch. They get up and go into the shower and the hot water is blissful. They get out, dry off, get dressed in clothes that they like, and go eat breakfast, which is euphoric and satisfying. Have some coffee and feel stimulated and great. Drive to work, work, come home watch TV, play on their phones, laugh at cats on the internet. Have dinner which is satisfying, have sex or jerk off, they start getting tired and sleep almost instantly after laying down at 10 PM. All week they wait to get shitfaced with their friends and have an insanely euphoric wonderful time, better than most drug addicts feel on drugs. Go to church after the fun weekend and feel feelings of connection and awe.\n\nWhat you said was already perfect but I wanted to add more. Previous paragraph might not make a lot of sense.\n\nDo you guys remember how great it felt to be a kid? Wake up and almost instantly feel energetic, warm, and content. Go outside on a cool or warm morning and look at the sky and feel great. Eat breakfast, no matter how simple it's delicious and you feel really content afterwards. Go about your day and everything feels good. Even sad emotions aren't depressing and existential and painful, instead the sadness is almost pleasurable in some way, it's just another emotion, but there's no soul crushing depression behind it.\n\nSimple people are for sure happier. Life is a fun adventure for the most part.\n\nI've come to the conclusion there's two main types of drug addict.\n\n1) The truly depressed ones. They are emotionally sensitive, their life and the state of the world depresses them. They are existential. They feel little pleasure. Often (but not always) they are intelligent. They use drugs because without them life is awful, they use drugs to feel happiness and hopefullness and to stop worrying. \n\n2) The pleasure seekers. Before drugs they weren't sad or depressed. Their issue is that they have a huge pleasure seeking problem. They have a pleasure seeking compulsion. Their neural circuitry makes the feeling of impending pleasure strong, they seek it out through whatever means. They aren't depressed or existential, though their drug addictions can make them this way. This is the kind of person who before drugs seemed completely normal, nothing mentally wrong, but often their addiction ruins their life and makes them depressed, a depression similar to the first persons kind, but less existential. And after their addiction they become damaged.\n\nThe first kind of person uses drugs because it makes them feel normal. They are self medicating and just want to feel good. Be free of the mental torment.\n\nThe second kind of person uses drugs because they have a compulsive urge towards pleasure. Before drugs they just maxed out whatever activities they could do that was normal, like eating or sex or videogames. But after drugs their neurochemistry becomes 100% biased towards drugs use and nothing else matters. The second is the kind of person who can become a gambling or sex addict. \n\nThe first usually doesn't become addicted to those things, because why would they? It doesn't inherently change them. They need chemicals to change them.\n\nI think it's likely a little blurry and everybody has a mix of these two traits. There's load of people just as depressed and existential as many other 1) kinds of drug addicts, the difference is that the drug addicts have a propensity towards pleasure seeking.\n\nDoes that make sense?", "2_Subreddit": "opiates"}], "dw935hm": [{"0_Comment Submission": "Anyone else agree?!", "1_Text": "People would still have to do all the same jobs in systems other than capitalism (unless people are willing to forego wants like iPhones and focus on basics like farming). The difference is that with capitalism you at least get to choose which shitty task you want, and have the option to advance, whereas in communism you're forced by everyone else to do a job.", "2_Subreddit": "opiates"}], "dw93dtl": [{"0_Comment Submission": "Anyone else agree?!", "1_Text": "> What's so obvious to me, and not obvious to religious people, is that religions are entirely man made, regional, and cultural phenomenons! What religion will any given child tend to believe in? Well, it depends entirely on their location and their parents' religion. Born in the middle east to Muslim parents? That child is going to be Muslim. Born in Utah to Mormon parents? That child is going to be Mormon. Born in the bible belt of the United States to Christian parents? You guessed it, you've got another Christian on your hands. It's so funny - and short sighted - too, because literally every religion (of what, 4,000?) thinks their religion is the one and only religion, and everyone else is probably going to hell.\n\nDuude yes! I realized this same thing when I was an early teen, about a year after I realized Christianity wasn't true (and thus discontinued something I was raised to believe my entire childhood). In the past, I tried so hard to get this logic through to religious people, and they just never understood it.\n\nEveryone basically believes everything they were told as a child, religion is the biggest one. How is this not obvious? How is it not obvious that the only reason people believe in Christianity is because they were raised Christian? Or that the only reason they like their country is because they were born and raised in it?\n\nI will give you my conclusions of why this logic doesn't seem to effect the people we're talking about, here's something I don't think you grasp yet about most people: they think nothing like you or I.\n\nTo a White Christian born in the US, all they know is Christianity. When they think of Islam it's a distant thought, they don't think about people being raised Muslim just the same as they were Christian. They don't have that perspective. They view things literally and simply. They think of Muslims, they just see a Muslim person in their mind. They don't see the similarities between them and the Muslim, and they don't realize they'd be Muslim too if they were raised Muslim.\n\nThey don't realize how varied the world is. Everything is so distant to them. Why would any of our logic matter to them when they were raised with a 100% Christian worldview, surrounded by only Christians? To them it doesn't even make any sense to question it. Especially when faith is all that matters.\n\nAlso, I would caution becoming religious about science, it is dangerous. Science is true but be careful of who you believe regarding it. Ever since the inception of the idea of science, it has been used by people to make others justify their (unscientific) beliefs. Science is currently used as a tool similar to how Christianity was 600 years ago.\n\nEdit: You must understand 80%+ people don't operate using logic. You and I don't even operate 100% by logic (which I assume you've realized yourself at some point). \n\nHere's how the vast majority of humans operate: [Emotion appears. Emotion is strong and overwhelming, it is physical and mental at the same time. Why is emotion here? Emotion must have a cause, otherwise I wouldn't be feeling it. If there wasn't a reason for the emotion to be here, why would it be here then?]. They then retroactively create logic to explain the emotion. \n\nSo if they feel anger, it's not because  they are misinterpreting something, it's because [reasons]. This how their mind operates. Retroactive reasons which explains their emotions, or explains the deeply built worldview they carry with them.\n\nThis is why the average persons worldview makes no goddamn sense, because it's based off of nothing real or logical, nothing that makes coherent sense. There's no cause and effect.\n\nThis is also why the average random Christian can be such a horrible person and feel no guilt, feel no shame, and think they're going to heaven. For one they have no ideas of the intricacies of Christianity so they don't even think about the teachings/rules. But mainly, it's because whatever wrong they do, they rationalize later by thinking \"they deserved it\" which is then further based off of \"I felt emotion, I am all that matters\". Subconsciously they rationalize, say, hitting someone out of anger, by subconsciously thinking that it was deserved, because they are angry.\n\nWhich is in contrast to people with morals or values, who would be riddled with guilt for acting out on emotions that cause harm, and realize the emotion only doesn't justify it.\n\nCaveat, there's many stupid people with morals, and many intelligent ones with none. My explanation still makes sense though. The intelligent ones who abide by logic have the logic that all that matters is them.\n\nLast thing: I think a big difference between intelligent people and the masses is that intelligent people both have the ability to create logical thoughts, as well as the emotional bias to seek them out.\n\nSo basically for the ability, what I mean is that physically there brains are capable of creating logic. A stupid person could never figure out logically how something works, due to their brain being incapable of it. A smart persons brain is capable, and thus the logic is available to them. That doesn't mean they'll be logical though.\n\nThe second part, equally as important, is the emotional bias of seeking out logic. There's many intelligent people who believe in stupid things, the reason is because they still value emotions over logic. Even though they're capable of explaining things logically, they do not because they follow emotions more. This is why they can be 100% logical when it comes to non-emotional things. They can build do calculations for spacecraft or high level mathematics or chemistry or whatever, because (usually) these things aren't emotional. But for political beliefs, when their emotions rise, they just believe whatever their emotion wants them to. In fact, they can be more biased then a stupid person, because they think they're intelligent and use that itself as justification for their belief.\n\nAnd even with typically non-emotional things, these kinds of peoples bias can seep through. An intelligent but biased person working on a theory and investing lots of time and emotion into it will defend it even when it's wrong, out of emotion. A person working for NASA can believe stupid things if a promotion is at stake. Imagine a NASA engineer working on some calculations, and an intern reads them over and points out logical flaws. NASA engineer gets pissed and ignores them. This scenario explains some of the crashes/disasters NASA has faced. Mainstream science is riddled with problems like this.\n\nFor truly intelligent people, their emotional bias is towards finding the logic and solution. These are the kinds of people venerated for changing everything. Even if their brain isn't as good at finding solutions as another's is, if they have the emotional bias of finding the solution/logic, they will find it faster than the higher IQ person.", "2_Subreddit": "opiates"}], "dwcok8r": [{"0_Comment Submission": "Literally every single problem of opiate use stems from it's illegality.", "1_Text": "I feel zero anger. This could very well be a fact, though I haven't researched it in depth. I know that opiates raise histamine a ton and that could potentially be a bad thing.\n\nYou should be aware though that something that lowers immunity can also often be anti-inflammatory. They are (almost) two sides of the same coin.", "2_Subreddit": "opiates"}], "dwgqqsp": [{"0_Comment Submission": "How to get period back?", "1_Text": "Here's the correct answer in case no one has given you it yet:\n\n\nOpiates cause the sex hormones of either genders to decrease, sometimes almost completely. Estrogen levels (which is the main hormone in females) can drop to childlike levels. The same with men and testosterone. For the nitty gritty sciencey stuff, opiates basically lower the levels of LH/FSH, which are the hormones produced by your brain which then tell the ovaries/testicles to produce estrogen/testosterone, respectively. \n\nAnd because of the lower LH/FSH/Sex hormones, you don't have a period anymore.\n\nI don't think there'll be any negative health effects to this, but if you're really worried, just ask your doctor to give you estrogen or birth control (ask for natural estrogen). This will give you back your period and normalize your hormones again, it's the equivalent to TRT in males.\n\nHonestly I think one of the benefits of opiates is lowering sex hormones/estrogen/testosterone. Hormones make people act weird and give mood swings. But for many they're required for motivation and mental health.", "2_Subreddit": "opiates"}], "dwgr13b": [{"0_Comment Submission": "Canadian Federal Government plans to allow wide-spread use of prescription heroin.", "1_Text": "Methadone is cardiotoxic, neurotoxic, and can fuck with memory via it's NMDA antagonsim. Now, if they simply only used the L-enantiomer, instead of having the racemic mix, it'd probably be fine, but they don't because everyone involved are fucking idiots and have no clue wtf is going on.", "2_Subreddit": "opiates"}], "dwgrblf": [{"0_Comment Submission": "Canadian Federal Government plans to allow wide-spread use of prescription heroin.", "1_Text": "Man, I sooooo wish they simply used levomethadone instead of the racemic mixture. I assume that'd get rid of most of the side effects. I'd still prefer a real opiate but in the current state of things, if they simply made that available I'd jump on it instantly. But no, the uninformed idiots who have no clue what's going on are just keeping it racemic.\n\nAnd the worst part is, racemix methadone is extremely easy to separate, D-tartaric acid is enough. But no, they don't allow takeaways. You gotta be fucking kidding me, either that's a shitty coincidence or on purpose.", "2_Subreddit": "opiates"}], "dwhedcc": [{"0_Comment Submission": "Been On Suboxone For 4 Months, Used Fetanyl For A Week, Will I Get PWD?", "1_Text": "**DUDE LISTEN TO ME I HAVE A SOLUTION DON'T LISTEN TO PEOPLE IN THIS THREAD SAYING YOU'LL HAVE TO TOUGH IT OUT** \n\nHere's the solution: buy 250g-500g of kratom and use that until it's all gone. That could take anywhere from two days to a week or two, it's hard to say without knowing exactly how your tolerance will carry.\n\n\n\nKratom is a partial agonist like bup, and doesn't cause PWD (for some reason). As long as you take the sub 5+ after the kratom you should be fine. I think taking bup at the \"peak\" of kratom might cause PWD, but after 5 hours seems to be fine, which is a hell of a lot better than waiting 24+ hours on fetty (wap) and stil getting PWD.\n\n\n\nOkay, so here's your gameplan: order 250g-500g kratom, use rest of fentanyl until that arrives, when it arrives throw rest of fetty before even using kratom, use kratom unil you only have like 25g left, dose before bed, sleep, morning after you take sub (start low), and if you don't feel well take a dose of kratom to kickstart the sub (this is how it worked for me).\n\nThis will give you a 100% painless induction. You might even like how the kratom feels while you're waiting to get back on sub.", "2_Subreddit": "suboxone"}], "dwi0ye1": [{"0_Comment Submission": "Is the media serious with this narcan party shit!!!!", "1_Text": "Same shit as jenkem, or Harry Potter/Magic the Gathering turning kids into satanists. Media is fucking stupid, I'm glad they're doing articles like this cuz it means less and less people listen to their stupid BS.", "2_Subreddit": "opiates"}]}], "1_submissions": [{"85gmbs": [{"0_Title": "Literally every single problem of opiate use stems from it's illegality.", "1_Text": "Yes, many could still overdose, but that is no justification for it being made illegal. And if narcan was made easy available, then the death rates would be very small.", "2_Subreddit": "opiates"}], "85zqm3": [{"0_Title": "Happy Birthday Oblivion!", "1_Text": "Yes, many could still overdose, but that is no justification for it being made illegal. And if narcan was made easy available, then the death rates would be very small.", "2_Subreddit": "oblivion"}], "86hbnw": [{"0_Title": "[H] $25 Amazon Gift Card [W] 85% Google wallet/Venmo", "1_Text": "Yes, many could still overdose, but that is no justification for it being made illegal. And if narcan was made easy available, then the death rates would be very small.", "2_Subreddit": "giftcardexchange"}]}]}]}