{"dieselprogro": [{"0_comments": [{"dt3ejth": [{"0_Comment Submission": "Teacher drug questiond", "1_Text": "Weed dosnt lead to heroin, week minds amd empty souls do. And 90% of people start woth tobacco/alcohol before weed, those are the true 'gateway' drug", "2_Subreddit": "Drugs"}], "dux831z": [{"0_Comment Submission": "Glycerin nectar collector. Stick it in the freezer for a bit and take some icy dabs. Hand blown in Colorado!", "1_Text": "This is amazing, where can i buy one of these?", "2_Subreddit": "Dabs"}], "duzn9u9": [{"0_Comment Submission": "helping image GVG", "1_Text": "What is this?", "2_Subreddit": "DMT"}], "dw21tgx": [{"0_Comment Submission": "I'm a writer looking to talk to someone about their DMT experiences — get in touch if interested!", "1_Text": "If your interested i can share the times i have I.Ved n,n DMT... Iv smoked it, but its not the same and smoking it isnt as worth recalling.", "2_Subreddit": "DMT"}], "dw6rokx": [{"0_Comment Submission": "Mallinckrodt 75mcg/hr fent patch?", "1_Text": "Iv always cut my patches in quarters and put a quarter on the palm of my hand for fast release, putting it under ur tongue or on ur gums will work just as well though", "2_Subreddit": "opiates"}], "dwark0f": [{"0_Comment Submission": "What liquidizer should i use?", "1_Text": "Ebay actually has a few good ones, i ordered some 'terpene' liquidizer and it tasted just like the bud they said it was", "2_Subreddit": "Waxpen"}], "dwc2f0p": [{"0_Comment Submission": "Niggas like me open their third eye", "1_Text": "Iv never seen those tabs around my parts (PNW), what are they and how are they made?", "2_Subreddit": "DrugStashes"}], "dwfgxde": [{"0_Comment Submission": "Zip of Space Candy shatter", "1_Text": "Looks like he made it himself...", "2_Subreddit": "DrugStashes"}], "dwgbprh": [{"0_Comment Submission": "Had to go grab another one..cant best 40$ halfs", "1_Text": "What city are you in? I want to take a vacation to whatever city your in, that looks like some dankalicious gravy", "2_Subreddit": "opiates"}], "dwgbw06": [{"0_Comment Submission": "I am A 41 Year Old Psychiatrist Who Tried (IV) Heroin", "1_Text": "Haha, welcome to junky land, teach!", "2_Subreddit": "opiates"}], "dwgcen5": [{"0_Comment Submission": "Sleeping before acid takes a wheel", "1_Text": "I remember once i got dosed out and started smoking some dank herb with my friend and ended up passing out. I was waking up tripping, nodding off, then waking up tripping all night. It was a VERY bizarre experience, but the hangover the next day wasnt worth it, i dont even remember much of that night, just that i was up and down and my dreams were running into my reality when i woke up. Iv never been able to sleep on acid before or since then though so im not sure what happened that night.", "2_Subreddit": "Drugs"}], "dwgcop1": [{"0_Comment Submission": "Opana + kpin", "1_Text": "Pandas are HELLA hard to get where i am and people can ask upwards of 100$ a pop for 30s, so yes, you got a great price IMO. As for mixing the kpin with the panda i wouldnt bother, IMO it just ruins the rush/high of the oxymorphone.  Mixing also increases OD chances since benzos potentiate the chance of ur breathing/heart stopping.", "2_Subreddit": "opiates"}], "dwgeqts": [{"0_Comment Submission": "Mallinckrodt 75mcg/hr fent patch?", "1_Text": "Yes, you could move them, and yes, your palms have the best and fastest absorbtion rate.", "2_Subreddit": "opiates"}], "dwokwf0": [{"0_Comment Submission": "some crazy crumble", "1_Text": "Yum yum!", "2_Subreddit": "Dabs"}], "dwper2s": [{"0_Comment Submission": "Street value?", "1_Text": "This is worth 5$, sorry fam", "2_Subreddit": "opiates"}], "dwpfelg": [{"0_Comment Submission": "Prices in your state", "1_Text": "Inland Washington, i get shit BTH for 25-30 a gr, 90 a ball, good BTH is 60$ a half g and 120 a full, 300 a ball and its not that great. You go twards the sea however and you can get some FIRE ASS BTH for 80-90 a gram (these are all hookups iv had for 7+ years though, street prices are prob a bit more, i havent shopped around in awhile)", "2_Subreddit": "opiates"}], "dwpfkx2": [{"0_Comment Submission": "Dboy wants to put apartment in my name", "1_Text": "Write up a half-assed sub lease and make it semi official, then u can just say you moved, posted ur apartment as a lease takeover/subletting and they passed all background checks and you had NO IDEA your apartmemt didnt want you doing this and you were broke with family emergencys. Id do it...", "2_Subreddit": "opiates"}], "dwrf1xu": [{"0_Comment Submission": "Butane Extraction gone wrong.", "1_Text": "For you my friend i will tell you a magical secret...  ANYONE can go to YouTube, look up 'BHO' and figure out how to safely make good product. If you arent abke to figure that out you should NOT be messing with something this dangerous. Im not trying to be rude, just realistic. Peace and love fam", "2_Subreddit": "CannabisExtracts"}], "dwrg9ti": [{"0_Comment Submission": "Junkie jesus?", "1_Text": "'blocker' is Naloxone, which has a half life of 1 hour. What keeps you from getting high is the bupinorphin which attaches so solidly to your opiate receptors that any other opiate ingested wont attach to a receptor which is already full of Bupe. Suboxone- Bupe+naloxone+flavoring\nSubutex-Bupe(no flavor or naloxone). Hope this helps", "2_Subreddit": "opiates"}], "dwszfzt": [{"0_Comment Submission": "Want To Learn", "1_Text": "Go to facebook and find a group dedicated to new growers, or if ur like me and dont have a facebook acount you can go get as many books as possible specifically on cannabis cultivation and watch as many YouTube shows as possible with growers doing what they do and try to pick uo what you can.", "2_Subreddit": "cannabiscultivation"}], "dwszll5": [{"0_Comment Submission": "Master Vapor Pump", "1_Text": "Thats some red neck shit man, \"put the phone to the machine and turn it on, il give you a over the phone diagnostic and tell yiy how to fix it. Do you have speaker phone?\" LOL", "2_Subreddit": "CannabisExtracts"}], "dwtya76": [{"0_Comment Submission": "Triangle GMO 6* hash rosin 😍", "1_Text": "What do you mean when you say 'gmo'?", "2_Subreddit": "Dabs"}], "dwv22b8": [{"0_Comment Submission": "Triangle GMO 6* hash rosin 😍", "1_Text": "Hahahaha, here i am thinking your splicing donkey genes into grandaddy purple! ROFFL", "2_Subreddit": "Dabs"}], "dwv29y7": [{"0_Comment Submission": "Butane Extraction gone wrong.", "1_Text": "That mustve been awhile ago or ur searching something i didnt. Try just BHO and watch anyone that uses PYREX dishes", "2_Subreddit": "CannabisExtracts"}], "dwv2dow": [{"0_Comment Submission": "Prices in your state", "1_Text": "I purposefully didnt mention anything specific other than regions of a state, is that not ok to refference a couple hundred mile stretch of my state? If so i wont do it anymore", "2_Subreddit": "opiates"}]}], "1_submissions": [{"87dm3e": [{"0_Title": "GodsGift X Pineapple Kush Bud Run BHO", "1_Text": "Weed dosnt lead to heroin, week minds amd empty souls do. And 90% of people start woth tobacco/alcohol before weed, those are the true 'gateway' drug", "2_Subreddit": "DrugStashes"}], "87tut8": [{"0_Title": "Some lovely pineapple kush X NYC Diesel bud run", "1_Text": "Weed dosnt lead to heroin, week minds amd empty souls do. And 90% of people start woth tobacco/alcohol before weed, those are the true 'gateway' drug", "2_Subreddit": "Dabs"}], "894fgp": [{"0_Title": "Chances of relapse growing, need help.", "1_Text": "Weed dosnt lead to heroin, week minds amd empty souls do. And 90% of people start woth tobacco/alcohol before weed, those are the true 'gateway' drug", "2_Subreddit": "Methadone"}]}]}]}