{"AAAAAAAAAAAAAAASs": [{"0_comments": [{"dwfbuoy": [{"0_Comment Submission": "What's something embarrassing you're willing to admit?", "1_Text": "You’d think that getting paid to not have to fuck anyone would be the ideal prostitution job", "2_Subreddit": "AskReddit"}], "dwh3oj5": [{"0_Comment Submission": "Monique really did deserve to be top for this look", "1_Text": "If she had switched up the card placement to make a pattern or something between the face cards and the numbered cards (especially on the top) I think it might have been enough to put her over the edge into the top. As a whole it still looks great and I’d still rank it over blair’s but I could see the judges nitpicking how plain and kinda boxy the bodice looks\n\n\nJust for that wig though bitch, she should have been high as fuck", "2_Subreddit": "rupaulsdragrace"}], "dwh4mcs": [{"0_Comment Submission": "Washington State governor to sign bill banning therapists from practicing gay conversion therapy", "1_Text": "The whole idea between gender transitioning is that it’s easier to change the body to match the brain than it is to change the brain to match the body, we don’t have a way of doing that yet. Same as sexual orientation, only in that case there isn’t anything you can change on your body to not be gay either. Unless you transition I mean (and that’s actually what they do for gay people in Iran) but that’s not ideal for obvious reasons", "2_Subreddit": "UpliftingNews"}], "dwh8ayn": [{"0_Comment Submission": "Pretty soft small baby boy bean Blair is uncomfy with how young she looks out of drag. 🤭😢😍 Stop joking about that!", "1_Text": "I feel like if she wore her hair differently she wouldn’t look so young, kinda comes off as intentional", "2_Subreddit": "rpdrcringe"}], "dwid2ku": [{"0_Comment Submission": "Jamie Paige uses a bunch of products that her viewers had problems with. Shows how to make them work.", "1_Text": "It’s like when you run out of nail polish remover so you use wet nail polish to remove the dry nail polish, or when you write over sharpie with a dry erase marker to remove it from a board\n\n\n\nIt’ll dissolve it if you use it that way, but it’ll also mix in fine if you do that at the start. You’re basically mixing the same things together", "2_Subreddit": "BeautyGuruChatter"}], "dwij3y7": [{"0_Comment Submission": "S10E02: \"PharmaRusical\" [Post-Episode Discussion]", "1_Text": "If I were a queen in this kinda situation I would absolutely put on some shows with all the rumored lip sync songs that never happened", "2_Subreddit": "SpoiledDragRace"}], "dwijto2": [{"0_Comment Submission": "[S10] #tracymarttel exposed party", "1_Text": "I wonder if she was sipping and spreading false tea from a source that she believed to be true\n\n\n\nIt just seems like such weird and boring stuff to lie about, at least make up something gagworthy", "2_Subreddit": "SpoiledDragRace"}], "dwijylc": [{"0_Comment Submission": "Kalorie when Dusty was just trying to talk about her dots", "1_Text": "Lol I kept waiting for her sobstory to tie in with the dots somehow\n\n\n\nLike she got some dots of thrown food on her and learned to embrace them and you should too, dusty", "2_Subreddit": "rupaulsdragrace"}], "dwik473": [{"0_Comment Submission": "[S10] #tracymarttel exposed party", "1_Text": "Cuz some people are assholes who enjoy pulling the “I know something *you* don’t know” card \n\n\nWhether she believed the fake tea herself or not I don’t think she had good intentions so much as she wanted attention", "2_Subreddit": "SpoiledDragRace"}], "dwim271": [{"0_Comment Submission": "Miss Vanjie already made it to the top of Google", "1_Text": "Miss vanjieniality", "2_Subreddit": "rupaulsdragrace"}], "dwjcs0t": [{"0_Comment Submission": "PSA: Airport security now checks food by hand in carry-on bags.", "1_Text": "I wonder if he thought they were just an alternative to flax seeds. I know a ton of healthy types who crush or mix flax seeds into basically everything", "2_Subreddit": "PoppyTea"}], "dwl1oro": [{"0_Comment Submission": "Daily Open Discussion Post - March 31, 2018", "1_Text": "One time my car got a big ugly dent cuz someone hit it in a parking lot and just balled out without leaving a note. What a dick. I left the dent there cuz I’m lazy and poor so now my passenger side window only opens a little bit before it makes this sound like when you bite into styrofoam. A gross sound", "2_Subreddit": "rupaulsdragrace"}], "dwl5net": [{"0_Comment Submission": "Yeah, that's about right", "1_Text": "The worst is when you do something like that or even just wait awhile to reply cuz you don’t know what to say, and then later realize that you’d been active on Snapchat or whatever during the text gap", "2_Subreddit": "BikiniBottomTwitter"}], "dwoppi7": [{"0_Comment Submission": "Womens of reddit, where do you really wanna go when you say; \"we can go wherever you want\"?", "1_Text": "I don’t feel like pizza, let’s just go wherever you wanna go", "2_Subreddit": "AskReddit"}], "dwpj6vo": [{"0_Comment Submission": "How times have changed", "1_Text": "Lazy Chest is gonna be my drag name", "2_Subreddit": "rupaulsdragrace"}], "dwqi6c4": [{"0_Comment Submission": "Why shouldn't I develop a heroin habit?", "1_Text": "You clearly wanna do it and won’t listen to anyone telling you otherwise, so just fuckin do it man\n\n\nA few weeks or months or years from now at least you’ll have this post to look back on so you can pinpoint exactly where you made the biggest mistake of your life", "2_Subreddit": "opiates"}], "dwqibes": [{"0_Comment Submission": "Foods people love or loathe", "1_Text": "Two words\n\n\n\nCircus\n\n\n\n\nPeanuts", "2_Subreddit": "starterpacks"}], "dwqmveq": [{"0_Comment Submission": "Did anyone else feel like there was some kind of theme with 3D geometric shapes going on here?", "1_Text": "Have we really reached the point where we’re calling out a queen for wearing tights\n\n\n\nThe point is to look like legs, of course she’s gonna use the same ones", "2_Subreddit": "rupaulsdragrace"}], "dwrqumy": [{"0_Comment Submission": "I know what my problem is-- I want to use heroin forever.", "1_Text": "Right now you might want to use heroin forever, but there might be a time in the future where your priorities change. I never thought that I would ever want to quit until the day I wanted to quit. \n\n\n\nJust do your best to keep yourself safe and alive man. You might change your mind one day, but even if you don’t, at least another day alive is another day to do heroin", "2_Subreddit": "opiates"}], "dwskv5j": [{"0_Comment Submission": "We All Thought She Was Joking, but Blair Really Yodeled in a Walmart", "1_Text": "Have you ever had the vegetable wheat thins? Sounds gross but they’re so damn good. I think they got dried tomatoes and garlic in there. I dip em in hummus", "2_Subreddit": "rpdrcringe"}], "dwt98bs": [{"0_Comment Submission": "BREAKING NEWS: Maryland Senate passes medical marijuana bill", "1_Text": "I’m not well versed in legal shit but I’ve heard that medical marijuana was already allowed in MD but barely practical cuz there are so few ways to actually get it, is that the kind of thing this bill is addressing?", "2_Subreddit": "maryland"}], "dwujs8i": [{"0_Comment Submission": "Here's a pic of my dogs best friends pupils to prove that's it's good shit only did half a PAC and hour ago", "1_Text": "There was a point where my main excuse for junkieing and not quitting was cuz I thought it made my eyes look cool", "2_Subreddit": "opiates"}], "dwuw281": [{"0_Comment Submission": "What you know about those sour sloths? And these are the weirdest percs I've ever seen.", "1_Text": "I loved that dinosaur egg oatmeal as a kid man. Sometimes I’d open the packet and just pick out all the eggs and eat them straight like gross chalk-covered candy. \n\n\n\nTried it again as an adult and the disappointment was overwhelming", "2_Subreddit": "opiates"}], "dww2snk": [{"0_Comment Submission": "People accuse Gigi Gorgeous of blackface in the YouTube comments of her new KKW review.", "1_Text": "Dressing as a generic black person for Halloween is one thing, but dressing as Beyoncé (without blackface) or someone is another thing. In a case like that you aren’t treating blackness as a costume, you’re treating her beyoncéness as a costume", "2_Subreddit": "BeautyGuruChatter"}], "dwwiq2l": [{"0_Comment Submission": "My dick after 3 days off opiates", "1_Text": "Some of my most memorable memories are of jerking off into the trash can that I’d been using to puke in while shittin my brains out", "2_Subreddit": "opiates"}]}], "1_submissions": [{"6w58fg": [{"0_Title": "Looking for games like Blindscape that have unique (or even gimmicky) concepts", "1_Text": "You’d think that getting paid to not have to fuck anyone would be the ideal prostitution job", "2_Subreddit": "iosgaming"}], "6zvv3i": [{"0_Title": "River vs Wall", "1_Text": "You’d think that getting paid to not have to fuck anyone would be the ideal prostitution job", "2_Subreddit": "PoppyTea"}], "742f3l": [{"0_Title": "Throwback Tuesday: Ru with Alaska, Chad, and Raven on the Queen Latifah show", "1_Text": "You’d think that getting paid to not have to fuck anyone would be the ideal prostitution job", "2_Subreddit": "rupaulsdragrace"}], "74qtvw": [{"0_Title": "Dreams since tapering", "1_Text": "You’d think that getting paid to not have to fuck anyone would be the ideal prostitution job", "2_Subreddit": "PoppyTea"}], "76yb99": [{"0_Title": "So excited for this collab between Sasha and Alaska", "1_Text": "You’d think that getting paid to not have to fuck anyone would be the ideal prostitution job", "2_Subreddit": "rupaulsdragrace"}], "770xu4": [{"0_Title": "I was at a friend’s grandparents’ house the other day and they had big ass bottles of hydros and oxys and gabbies just chillin there on the kitchen table", "1_Text": "You’d think that getting paid to not have to fuck anyone would be the ideal prostitution job", "2_Subreddit": "opiates"}], "78tj3c": [{"0_Title": "Cleanup from a homeless camp (from r/WTF)", "1_Text": "You’d think that getting paid to not have to fuck anyone would be the ideal prostitution job", "2_Subreddit": "opiates"}], "79or17": [{"0_Title": "I have a job interview in a few hours", "1_Text": "You’d think that getting paid to not have to fuck anyone would be the ideal prostitution job", "2_Subreddit": "CasualConversation"}], "7brokr": [{"0_Title": "K I L L A M Z E L L I", "1_Text": "You’d think that getting paid to not have to fuck anyone would be the ideal prostitution job", "2_Subreddit": "rpdrcringe"}], "7btg3w": [{"0_Title": "User makes post in r/pics showing before/after quitting dope, but in the comments gets called out for a thread requesting editing to look sicker in before pic. Thoughts?", "1_Text": "You’d think that getting paid to not have to fuck anyone would be the ideal prostitution job", "2_Subreddit": "opiates"}], "7cmxi6": [{"0_Title": "Y’all have jobs?", "1_Text": "You’d think that getting paid to not have to fuck anyone would be the ideal prostitution job", "2_Subreddit": "opiates"}], "7ctaa8": [{"0_Title": "This ad tho. They know us well", "1_Text": "You’d think that getting paid to not have to fuck anyone would be the ideal prostitution job", "2_Subreddit": "opiates"}], "7jkeph": [{"0_Title": "I fuckin hate opiate dreams", "1_Text": "You’d think that getting paid to not have to fuck anyone would be the ideal prostitution job", "2_Subreddit": "opiates"}], "7lfn4z": [{"0_Title": "Yknow those medical ports that they give to people with cancer and shit?", "1_Text": "You’d think that getting paid to not have to fuck anyone would be the ideal prostitution job", "2_Subreddit": "opiates"}], "7td3uz": [{"0_Title": "this email", "1_Text": "You’d think that getting paid to not have to fuck anyone would be the ideal prostitution job", "2_Subreddit": "rpdrcringe"}], "7up1jf": [{"0_Title": "Most euphoric strains of the recent batches?", "1_Text": "You’d think that getting paid to not have to fuck anyone would be the ideal prostitution job", "2_Subreddit": "HerbalRVA"}]}]}]}