{"Blocthis": [{"0_comments": [{"dwqsdlh": [{"0_Comment Submission": "Getting off loperamide!! Please help!", "1_Text": "This is why I am looking to stop taking it.", "2_Subreddit": "opiates"}], "dwqsig2": [{"0_Comment Submission": "Getting off loperamide!! Please help!", "1_Text": "Thanks for the response. Just trying to see what other peoples advice/experiences have been with something similar", "2_Subreddit": "opiates"}], "dwqsria": [{"0_Comment Submission": "Imodium problem...please help!!!", "1_Text": "Agreed. It seemed like it never did much for me.. continued to have daily bowel movements in the mornings... would just stop me from having to use the bathroom during the day at work... out with friends etc.. \nWondering if I just had a tolerance for it because I have slowly used more and more to ease my stomache, to where only a high dose worked.", "2_Subreddit": "ibs"}], "dwqvqd6": [{"0_Comment Submission": "Imodium problem...please help!!!", "1_Text": "I thought it was just for peace of mind. Turns out my ignorance in taking it so I wouldn't poop was an ignorant mistake.  I literally thought there was nothing wrong wrong with it considering I've been taking them for a while and everytime I started taking more I was always fine. Until yesterdays disaster", "2_Subreddit": "ibs"}], "dwqxci3": [{"0_Comment Submission": "Getting off loperamide!! Please help!", "1_Text": "I said to myself last night that I  would try to stop taking them and just deal with my stomach issues differently.  So this morning I only took 10 of them as opposed to the 100 that I usually take and I don't feel any different except for my stomach feeling a little queasy.", "2_Subreddit": "opiates"}], "dwr352r": [{"0_Comment Submission": "Getting off loperamide!! Please help!", "1_Text": "Today I took 10 pills which is 20mg. Down from my usual 100 pills that I was use too. Dont really feel anything, except for a little bit of a queasy stomach which might be from nerves being this nervous about this. I've read alot the withdrawal symptoms kick in 48 hours later. So I am waiting to see what happens and hopefully it'll be fine.\nThank you for your help and advice. Yes, it isn't for a high. I've never even felt one before as I was taking them.", "2_Subreddit": "opiates"}], "dwsotpw": [{"0_Comment Submission": "Getting off loperamide!! Please help!", "1_Text": "Have an appointment tomorrow....thanks for the advice! Your right about the anxiety, have had it since yesterday and think that's effecting my stomache", "2_Subreddit": "opiates"}], "dwsovi5": [{"0_Comment Submission": "Imodium problem...please help!!!", "1_Text": "Agreed. Going to try and see what a doctor says", "2_Subreddit": "ibs"}]}], "1_submissions": [{"89g64y": [{"0_Title": "Imodium problem...please help!!!", "1_Text": "This is why I am looking to stop taking it.", "2_Subreddit": "ibs"}], "89gbko": [{"0_Title": "Getting off loperamide!! Please help!", "1_Text": "This is why I am looking to stop taking it.", "2_Subreddit": "opiates"}]}]}]}