{"Pastor_Zhao": [{"0_comments": [{"dwkfc29": [{"0_Comment Submission": "30s, Runescape, and Bates Motel this is my Friday night lol. 😎", "1_Text": "RuneScape must be a tweaker thing", "2_Subreddit": "opiates"}], "dwkjuat": [{"0_Comment Submission": "High dose of speed just makes me calm?", "1_Text": "I take amphatimean salts daily which I'm pretty sure is just speed. It's dextro and some other shit(it just Adderall with different name). Anyway it makes me calm depending on how I'm feeling that day. If I just need something to get rid of my agitation then it helps, social anxiety goes to a 0 on amphatimeans.  However, sometimes you go full tweaker and you don't even notice it. It's fucked up but true, like you talk a million words a minute and you don't even aknowledge the fact ur speeding. If it's making you calm and not euphoric then you're probably just an addict now and you'll only feel the effects of the withdrawal leaving you. You probably have no choice but to take a tolerance break. You could just up the dose but you may regret it.", "2_Subreddit": "Stims"}], "dwkk1nr": [{"0_Comment Submission": "Meth Cravings", "1_Text": "Personally haven't been able to quit myself. However fear may be your best combat. Fear the negative health consequences, the fact you've made it this long and you're gonna have to go through hell if you wanna reach this point of sobriety again. I'd say find something else to get attached to but sobriety can give you months of demotivation and disinterest and it may just fustrate you. Think about who you wanna be and what needs to be done to get there. When people do drugs such as meth, there rarely ever is a happy ending to the story. Do your best to stay sober and stay safe.", "2_Subreddit": "Stims"}], "dwkk62w": [{"0_Comment Submission": "High dose of speed just makes me calm?", "1_Text": "You may have ADHD then, or OCD. Those 2 mental illnesses usually just feel calm the user on amphatimeans.", "2_Subreddit": "Stims"}], "dwlpuv3": [{"0_Comment Submission": "The smell of pee on stims", "1_Text": "I know it's unhealthy, I just wanna know if anyone has had this problem before and if it's something to worry about. Doctors would simply just take me off my medication if I told them about it, and if that were to happen I'd simply just do it illegally(which I most certainly don't want to do). So trying to self-diagnose how much damage is being done so I don't end up worse than what I already am.", "2_Subreddit": "Stims"}], "dwm93bq": [{"0_Comment Submission": "Blown out of my gourd, caught this split second from Mr. Pickles.", "1_Text": "He watches u boofing", "2_Subreddit": "Stims"}], "dwml6xb": [{"0_Comment Submission": "Which one of you fucks is this", "1_Text": "Canada...", "2_Subreddit": "Stims"}], "dwohqo6": [{"0_Comment Submission": "Resposible amphetamine use", "1_Text": "Amphatimeans are addictive once you start taking them to get through the day. If you use them as you are then you shouldn't become dependent on them. Now for the toxocity, well that all depends. For the most part amphatimeans aren't much of a neurotoxin. However, if you're smoking or shooting up then you may be at risk. But if you're just popping pills you should be fine even at daily use. Idk about snorting though", "2_Subreddit": "Stims"}], "dwpn53i": [{"0_Comment Submission": "How do you close this knife?(Ik this the wrong sub but no other sub is helping)", "1_Text": "I figured it out, if I push in the second blade then I can close it. Took 5 straight hours but whatever", "2_Subreddit": "Stims"}], "dwq655h": [{"0_Comment Submission": "Adderall sickness half way through", "1_Text": "I experience digestion problems and a feeling of weak bones. Similiar to that of a sickness. Probably because of mal-nuritiousment though.", "2_Subreddit": "Stims"}], "dwq7e98": [{"0_Comment Submission": "Can your mind/body go into psychosis without meth or any other drugs?", "1_Text": "I've never had it happen to me. If someone is experiencing psychosis hallucinations when sober then I'm guessing they're suffering from schizophrenia that just enhances when tired. If you're sober then it'll take longer for the psychosis to take effect because you won't have the adrenaline pumping like you do on stims. Also it'll be more difficult because staying awake for extended periods of time is painful.", "2_Subreddit": "Stims"}], "dwq8ztx": [{"0_Comment Submission": "Going to rehab this week", "1_Text": "Just remember the drugs are lying to you. Most people feel like they NEED stims just to function so they can get through the day. Once sober it hits them, social anxiety, stress, trouble focusing, sleep issues. It's going to be hard, but the drugs aren't an option. It's going to lie to you and make you believe that it'll fix you. Even after suicidal comedowns somehow it'll still make you think they will help you. I wish I could give you advice but sobriety for the most part is quite simple, don't do drugs(It'll be anything but easy though).Because there isn't much physical withdrawal other than a feeling of being weak and sleepy then it may not even take that long for you to get back into society. But it could still take months before you feel like the sobriety was even worth it. You also may get fat btw(if you're not already). But trust me, any good person would much rather have a fatty than a junkie. Wish you the best of luck, stay safe :)", "2_Subreddit": "Stims"}], "dws345w": [{"0_Comment Submission": "What is the most adderall you’ve ever taken in a 24 hour period?", "1_Text": "105mg XR", "2_Subreddit": "Stims"}], "dws3ckt": [{"0_Comment Submission": "Newb question to you guys - why stay up for so many days without sleep?", "1_Text": "I think for most people it's because there isn't any real consequences of staying up. I could only get 30 minutes of sleep all night and the next day I won't feel drowsy and what not. It's almost like you don't need to sleep. The adrenaline keeping you awake lasts longer than the euphoria so I'm guessing a lot of people got the adrenaline pumping and decide to just redose because they bored.", "2_Subreddit": "Stims"}], "dws3rl9": [{"0_Comment Submission": "What are your top 3 stims?", "1_Text": "1. Adderall XR \n2. Nothing else compares \n3. I only do Adderall \n\nI love Adderall, I wanna start using Vyvanse because the comedowns are becoming too unbearable. But as of now my top 3 are all addy", "2_Subreddit": "Stims"}], "dwsj7k5": [{"0_Comment Submission": "Is it fair to blame just the drugs?", "1_Text": "I don't entirely agree, I think addicts need to take responsibility for their behavior. But I think when people die from self-destructive behavior it's because for whatever reason they mentally can't deal with life. People who OD likely don't want to die but it's still the same premise, it's people avoiding their problems. If someone doesn't feel like they can handle their problems nor feel like anyone cares then they're slowly going to stop caring about their own life. I just don't believe it's fair to blame only the substance, There's psychological and enviormental suffering that changes you as a person. If the only time an individual cares about living is from an instinctual reaction from them being on the verge of death, like a near fatal overdose. Then eventually their luck is gonna run out and they'll end up dead sooner than later.", "2_Subreddit": "Stims"}], "dwu06ey": [{"0_Comment Submission": "Idk if I am high or not", "1_Text": "I'm not ready to shove meth up my ass. I prefer pills", "2_Subreddit": "Stims"}], "dwu1x0w": [{"0_Comment Submission": "No.", "1_Text": "I feel sexy as fuck too", "2_Subreddit": "Stims"}], "dwu47os": [{"0_Comment Submission": "Adderall made me vainy", "1_Text": "Well I take Adderall XR 30mg a day. It was prescribed medicinally but once I took it I realized I definitely don't need it. But I still got infinite pills basically so it's hard to cut back. But my dosage isn't *that* bad. I been taking 1 day a week breaks and gonna start doing day on and off soon", "2_Subreddit": "Stims"}], "dwu4pju": [{"0_Comment Submission": "Adderall made me vainy", "1_Text": "Will it make the drug less effective? Or just help my bp", "2_Subreddit": "Stims"}], "dwu4zuc": [{"0_Comment Submission": "Adderall made me vainy", "1_Text": "Thank you for the information. I appreciate it", "2_Subreddit": "Stims"}], "dwu53r7": [{"0_Comment Submission": "Adderall made me vainy", "1_Text": "Easier said then done", "2_Subreddit": "Stims"}], "dwvmx4e": [{"0_Comment Submission": "Looking for Advice", "1_Text": "Hard to quit forever. I act like the biggest dick without em. It makes me an agitated mess. I don't like hurting the people around me.", "2_Subreddit": "StopSpeeding"}], "dwvuiie": [{"0_Comment Submission": "Drug kingpin", "1_Text": "Well at least you got goals", "2_Subreddit": "opiates"}], "dwxx8e4": [{"0_Comment Submission": "Should stims be legal?", "1_Text": "I see the reasons behind decriminalization of all drugs. But I just think it's not gonna make a bad situation any better.", "2_Subreddit": "Stims"}]}], "1_submissions": [{"7y14hm": [{"0_Title": "Oogly Boogly", "1_Text": "RuneScape must be a tweaker thing", "2_Subreddit": "Stims"}], "7yiwx6": [{"0_Title": "Coffee has no effects.", "1_Text": "RuneScape must be a tweaker thing", "2_Subreddit": "Stims"}], "7yj5e6": [{"0_Title": "Advice to the fellow boofers", "1_Text": "RuneScape must be a tweaker thing", "2_Subreddit": "Stims"}], "7yomso": [{"0_Title": "Whatcha doin?", "1_Text": "RuneScape must be a tweaker thing", "2_Subreddit": "Stims"}], "7yz30x": [{"0_Title": "Let's save the planet boys", "1_Text": "RuneScape must be a tweaker thing", "2_Subreddit": "Stims"}], "7z2fvi": [{"0_Title": "I'm a addict", "1_Text": "RuneScape must be a tweaker thing", "2_Subreddit": "Stims"}], "81f6kb": [{"0_Title": "What worse? Xanax or Adderall", "1_Text": "RuneScape must be a tweaker thing", "2_Subreddit": "Stims"}], "82v7n9": [{"0_Title": "Shadow People", "1_Text": "RuneScape must be a tweaker thing", "2_Subreddit": "Stims"}], "83hulu": [{"0_Title": "is Adderall really that similar to meth?", "1_Text": "RuneScape must be a tweaker thing", "2_Subreddit": "Stims"}], "842l69": [{"0_Title": "How bad is meth or other amphetamines?", "1_Text": "RuneScape must be a tweaker thing", "2_Subreddit": "Stims"}], "859r2a": [{"0_Title": "My face is itchy, need advice", "1_Text": "RuneScape must be a tweaker thing", "2_Subreddit": "Stims"}], "85py20": [{"0_Title": "Peer pressure is a lie", "1_Text": "RuneScape must be a tweaker thing", "2_Subreddit": "Stims"}], "869ru1": [{"0_Title": "Trying to take a break from adderall", "1_Text": "RuneScape must be a tweaker thing", "2_Subreddit": "Stims"}], "86q5ow": [{"0_Title": "Did Adderall give me a seizure", "1_Text": "RuneScape must be a tweaker thing", "2_Subreddit": "Stims"}], "87659y": [{"0_Title": "I've never had a friend like you...", "1_Text": "RuneScape must be a tweaker thing", "2_Subreddit": "Stims"}], "87ggb2": [{"0_Title": "The motivation is better than the euphoria", "1_Text": "RuneScape must be a tweaker thing", "2_Subreddit": "Stims"}], "87mtza": [{"0_Title": "Restless Leg Syndrome during sleep time", "1_Text": "RuneScape must be a tweaker thing", "2_Subreddit": "Stims"}], "887sm6": [{"0_Title": "Women arent whores", "1_Text": "RuneScape must be a tweaker thing", "2_Subreddit": "Stims"}], "88m5vx": [{"0_Title": "The smell of pee on stims", "1_Text": "RuneScape must be a tweaker thing", "2_Subreddit": "Stims"}], "89dpva": [{"0_Title": "Rise and Shine", "1_Text": "RuneScape must be a tweaker thing", "2_Subreddit": "Stims"}], "89pem9": [{"0_Title": "Is it fair to blame just the drugs?", "1_Text": "RuneScape must be a tweaker thing", "2_Subreddit": "Stims"}], "89vdre": [{"0_Title": "Idk if I am high or not", "1_Text": "RuneScape must be a tweaker thing", "2_Subreddit": "Stims"}], "89wpto": [{"0_Title": "Adderall made me vainy", "1_Text": "RuneScape must be a tweaker thing", "2_Subreddit": "Stims"}], "89x8c4": [{"0_Title": "Looking for Advice", "1_Text": "RuneScape must be a tweaker thing", "2_Subreddit": "StopSpeeding"}], "8addzf": [{"0_Title": "Should stims be legal?", "1_Text": "RuneScape must be a tweaker thing", "2_Subreddit": "Stims"}]}]}]}