{"Katchfran1": [{"0_comments": [{"dva3yq5": [{"0_Comment Submission": "Quick taper or slow taper? Which is the best way to get off of this stuff?", "1_Text": "Medicare?", "2_Subreddit": "Methadone"}], "dvaqfwb": [{"0_Comment Submission": "My journey to freedom.", "1_Text": "How did you get your Methadone?", "2_Subreddit": "Methadone"}], "dvaqimn": [{"0_Comment Submission": "I got This hoodie. Hoodie for shooting.", "1_Text": "Does it have the words \"STOP AND FRISK THIS MORON\" in block letters on the back?", "2_Subreddit": "opiates"}], "dvauy5y": [{"0_Comment Submission": "I got This hoodie. Hoodie for shooting.", "1_Text": "Not sure if you are implying that I'm a moron, but I do agree, clothes aren't probable cause...\n\nNow, this may come as a shock, so you might want to sit down as you read this:\n\nCops...sometimes....dont follow the law when on the job.\n\n(I'll just assume this blew your mind)", "2_Subreddit": "opiates"}], "dvboqi9": [{"0_Comment Submission": "Opium poll: Do you hold your pipe with one hand or two while smoking?", "1_Text": "Yeah, and if it is anywhere in North America im shocked and jelly AF.", "2_Subreddit": "opiates"}], "dvc99fh": [{"0_Comment Submission": "wife desperate to help hubby detox from opiates", "1_Text": "Also, as someone who was once addicted to Poppy Seed Tea, He might find Kratom to be less than effective.  He should consider methadone if this ends up being the case.", "2_Subreddit": "kratom"}], "dvfyclh": [{"0_Comment Submission": "Handling vacation request", "1_Text": "Actually, you might be in the clear...i went on my honeymoon to Aruba and i had only been at my clinic for 5 months.  I was gone just over a week.", "2_Subreddit": "Methadone"}], "dvgfj4k": [{"0_Comment Submission": "Oxycodone", "1_Text": "It is not toxic, but you can overdose on it, essentially turning off your autonomic functions (forgetting to breathe/eventually stopping your heart).  But this only happens with exceedingly high doses.\n\nAddiction is a whole different issue.  Not EVERYONE who tries oxy gets addicted, but it is possible.\n\nHowever, For all the trouble they have caused me, I am glad in have opiates in my life.", "2_Subreddit": "opiates"}], "dvghpth": [{"0_Comment Submission": "Oxycodone", "1_Text": "I should also note that I'm in Methadone Maitenance, and that I did have a few fucled up years in my journey to this point.", "2_Subreddit": "opiates"}], "dvghqzg": [{"0_Comment Submission": "I'm having to quit", "1_Text": "Why the rush?", "2_Subreddit": "Methadone"}], "dvj9a6r": [{"0_Comment Submission": "Question about peak & trough", "1_Text": "How much does he weigh?", "2_Subreddit": "Methadone"}], "dvn8vgr": [{"0_Comment Submission": "My clinic is going to face a crisis and yours may be next", "1_Text": "How do I find out if Acadia owns my clinic?", "2_Subreddit": "Methadone"}], "dvvhetr": [{"0_Comment Submission": "Why does cuddling under the influence of opiates feels so good? It's the best thing I have ever experienced, feels better than sex though (ᵔᴥᵔ) I hope all of you have that special person who will always give you a warm hug ;3", "1_Text": "Yes, opiate cuddles are nice....but sex is better.", "2_Subreddit": "opiates"}], "dvz0o0n": [{"0_Comment Submission": "SUB DISCUSSION: How do you feel about Trump's New opiate Kingpins Death Penalty Bill: War on Opiates", "1_Text": "Fuck Trump and fuck this bill and fuck anyone who voted for this lunatic.", "2_Subreddit": "Methadone"}], "dwbinva": [{"0_Comment Submission": "Sorry, another paws post", "1_Text": "I wish I had some advice, but I don't.  It's a situation like this that has me resigned to being on methadone forever.", "2_Subreddit": "Methadone"}], "dwbmukr": [{"0_Comment Submission": "Suboxone or methadone", "1_Text": "Methadone is better if you have been at this for longer.  Suboxone is better if you haven't been at it that long.  On this scale, id say longer is 5 years or more.", "2_Subreddit": "opiates"}], "dwbn6qz": [{"0_Comment Submission": "Kratom for withdrawal", "1_Text": "No, no one else has ever done this.  You are the first.  Godspeed.", "2_Subreddit": "opiates"}], "dwdmrfb": [{"0_Comment Submission": "Why isn't there a \"legalize it\" movement for opiates?", "1_Text": "But what if you don't want to stop?  What if your use is just that, use and not abuse?  What if it improves your life?  Surely this person should be free to take their drug without fear of jail or drug lords or impurities or any of the wonderful things prohibition gives us.\n\nOpiates and marijuana both act on receptors in the brain that exist for the sole purpose of these substances...there is some research that says perhaps some of those who become addicted are in fact self medicating for a deficiency in their body's production of endorphins.  Regardless, there is no reason to address this issue via jail.", "2_Subreddit": "opiates"}], "dwdvvou": [{"0_Comment Submission": "Chances my friend be addicted?", "1_Text": "I shouldn't laugh at this comment, but I did.", "2_Subreddit": "opiates"}], "dwdw3hp": [{"0_Comment Submission": "This might be farewell..", "1_Text": "Why did you feel the need to write this?  How does this make you feel better?  I'm so sorry that some part of you thinks it that a comment like this is something you should do.", "2_Subreddit": "opiates"}], "dwju1hz": [{"0_Comment Submission": "Everybody has their time. Mine is now.", "1_Text": "Wouldn't it be funny if this person's family, girlfriend and friends were all addicts who looked down on this guy for being such a prude square all the time, and this was what he told himself before taking his first shot?", "2_Subreddit": "opiates"}], "dwoydt0": [{"0_Comment Submission": "Found this in my children (17 yo) room.. help identify", "1_Text": "Lol. Damn kids and their \"mints\".  \n\nBeware parents, of the dangerous menace going around.\n\nTeens call the high \"fresh\", \"cool\", and \"tic tacked\"", "2_Subreddit": "opiates"}], "dwqldvt": [{"0_Comment Submission": "The Psychopathology of Long-Term Addiction and Cessation.", "1_Text": "I follow the gist of the argument.  My reply would be as follows:\n\nIf ultimately i am self medicating my depression with opiates, what is wrong with me continuing down that path, so long as I use them with respect and see the situation for what it Is?\n\nThe thought that I and many others have vis a vis \"I'll never be normal/happy/content without this substance\" isn't simply because of the neurobiology that results from long term use, it is also due to the original mental issue that made such use appealing in the first place...\n\nSpeaking from personal experience, I have dealt with my depressive symptoms/nature in many different ways, some legal, others not...i can honestly say that Methadone has been MUCH more efficacious than, say, Zoloft...shouldnt I be allowed to pursue the treatment I find most effective?\n\n(This is not to say that denial doesn't exist in addiction...it obviously does.  I'm just pointing out that opiate use for pain, be it physical or emotional, is perfectly valid, and in earlier societies it was seen as eminently resonable)", "2_Subreddit": "opiates"}], "dwr31nz": [{"0_Comment Submission": "The Psychopathology of Long-Term Addiction and Cessation.", "1_Text": "(Before I begin, I'm glad you wrote about all this...i like photos of odd amounts of pills as much as the next guy, but this type of stuff really interests me 😀)\n\nI think I must begin by saying that I don't believe that someone falls into opiate addiction without a certain prerequisite amount of pain, be it physical or emotional.  People who are well adjusted, stable, and of a high enough socio-economic status may still become opiate addicts, this is true.  But in my personal experience/observation, sustained recovery and abstinence for this cohort is *usually* much easier to achieve.  \n\nAnd why shouldn't this be so?  They are already high enough in their hierarchy of needs that what we call happiness should be easier to come by for them.  If the only thing preventing you from enjoying your life as a well connected member of the elite is a misadventure with heroin, then the removal of the drug from your life once it becomes problematic is akin to the excision of a psychological/spiritual kidney stone; no matter how painful the process of removal is, it has every chance of being brief.  In other words, this is why my friends who come from wealthier, more stable backgrounds tend to view their heroin/opiate abuse as a mere footnote in their biographies.  They have a lot more with which to potentially define themselves.\n\nMost of us are not that fortunate.  As William S Burroughs said: \"The idea that anyone can use drugs and escape a horrible fate is anathema to these idiots\" (We can assume he means prohibitionists of all stripes)\n\nSo, I feel that if we are to take a real look at the opiate crisis in this country, we not only have to look at why people use these chemicals in the first place (ie what problem or pain are they addressing?), but we have to examine if their self determined treatment is effective.  \n\nBecause, and i feel this might be the most important aspect of what I am saying here, let us not kid ourselves...We can pretend that everyone in the world can access these psychological treatments you describe, but there is a stubborn and ruthless economic factor involved here.  Most people who can even afford psychological care cannot afford the type of intensive Cognitive Behaviorial Therapy or other approaches that might be needed to address a post-addiction individual in the way you describe.\n\nIn conclusion, I agree that drugs might never be a preffered treatment in and of themselves, but I also believe that we must offer some treatment to those who need it.", "2_Subreddit": "opiates"}], "dwxku6j": [{"0_Comment Submission": "Theres still hope for us all.", "1_Text": "It works, but the side effects are almost as bad as withdrawal so there isn't really a point.  You still feel pretty bad, just in a different, \"I've swallowed cement WTF is wrong with me!\" Sort of way.  Really makes you rethink your decisions.", "2_Subreddit": "opiates"}]}], "1_submissions": [{"6vz1wa": [{"0_Title": "Why are the staff at MMT Clinics so incompetent?", "1_Text": "Medicare?", "2_Subreddit": "Methadone"}], "6znq1p": [{"0_Title": "Medical Marijuana and MMT", "1_Text": "Medicare?", "2_Subreddit": "Methadone"}], "7cxifl": [{"0_Title": "CALLING ALL OF THE OPIATE DEPENDENT", "1_Text": "Medicare?", "2_Subreddit": "Methadone"}], "7cxj19": [{"0_Title": "CALLING ALL OF THE OPIATE DEPENDANT", "1_Text": "Medicare?", "2_Subreddit": "opiates"}], "7fpkwt": [{"0_Title": "Are any of you former Methadone Maitenance patients?", "1_Text": "Medicare?", "2_Subreddit": "kratom"}], "7g9fuv": [{"0_Title": "EVERYONE NEEDS TO READ THIS BOOK", "1_Text": "Medicare?", "2_Subreddit": "opiates"}], "7nx1mk": [{"0_Title": "Session's evil plans continue", "1_Text": "Medicare?", "2_Subreddit": "opiates"}], "7p9oqx": [{"0_Title": "Is Headshop Kratom that bad?", "1_Text": "Medicare?", "2_Subreddit": "kratom"}]}]}]}