{"EatsAssOnFirstDate": [{"0_comments": [{"dwhz49n": [{"0_Comment Submission": "Retarded things / Horror stories from rehabs you have attended?", "1_Text": "It's cool dude. Do what's best for you. Just stay off the shit no matter what.", "2_Subreddit": "opiates"}], "dwi3yn8": [{"0_Comment Submission": "Thursday March 29th Daily Check In", "1_Text": "Checking in for real in this post.\n\nI worked all day today and had full intentions on getting things accomplished after work. I Wanted to finish cleaning and go to the gym. None of that got done so far, I've spent the last few hours reading 'Ready Player One.' Its a great book. I'm really glad I can finally read and comprehend books again because when I was using I would just drool on the books. I'll just have to chalk up these past 2 hours as practicing self care.\n\nAnyway, skipping the meeting tonight. I really dont want to get into the habit of poor meeting attendance but I just needed a break this week. \n\nAlso, My work performace has been really poor lately. I have a 1 on 1 with my boss tomorrow and I'm going to call myself out and admit to him that I've been doing shitty. I feel bad about it, but I've had a shitty attitude towards the work ever since I found that new people make more money then me.\n\nAnyway, 37 days. Thanks everyone.", "2_Subreddit": "OpiatesRecovery"}], "dwi7jna": [{"0_Comment Submission": "Thanks for letting me know Starbucks!", "1_Text": "I submitted it to software gore and it was removed .", "2_Subreddit": "CrappyDesign"}], "dwiijgi": [{"0_Comment Submission": "Thanks for letting me know Starbucks!", "1_Text": "http://www.samsung.com/global/themestore/index.html?appId=sec.com.Nightsky.common.wallpaperpack&SITE_CODE=us", "2_Subreddit": "CrappyDesign"}], "dwiz5cj": [{"0_Comment Submission": "SOS... Dealer offering free bag of his new \"crazy fire\"", "1_Text": "Have you ever woken up regretting *not* getting high the night before?\n At the very least tell yourself to stay off the shit for today so you can enjoy family time. When tomorrow comes, rinse and repeat.\n\nIt sucks man. Feel free to PM me", "2_Subreddit": "OpiatesRecovery"}], "dwj2uaq": [{"0_Comment Submission": "SOS... Dealer offering free bag of his new \"crazy fire\"", "1_Text": "Right. Then eventually it becomes choosing to be sober a day and a half, then two days, then three. Its not going to always be a struggle.", "2_Subreddit": "OpiatesRecovery"}], "dwj4n21": [{"0_Comment Submission": "Thanks for letting me know Starbucks!", "1_Text": "Well, tell that to the mods", "2_Subreddit": "CrappyDesign"}], "dwjdlxw": [{"0_Comment Submission": "yikes", "1_Text": "This is true", "2_Subreddit": "nonononoyes"}], "dwkc6wf": [{"0_Comment Submission": "Friday March 30th Daily Check In", "1_Text": "Your insight really helped me today. I was feeling very similar. Thank you.", "2_Subreddit": "OpiatesRecovery"}], "dwkciwu": [{"0_Comment Submission": "Friday March 30th Daily Check In", "1_Text": "Quick check In before the day ends. - \n\nI worked 9-5. Did some Jewish seder stuff with the boyfriend and his family. I'm in bed now.\n\nI'm driving down to NYC tomorrow morning for more Jewish holiday stuff.\n\nHope everyone had a good day.", "2_Subreddit": "OpiatesRecovery"}], "dwmh7wv": [{"0_Comment Submission": "I relapsed on meth but it was probably the best thing I could have done", "1_Text": "This 1000000%\n\nThis post is utter bullshit", "2_Subreddit": "Drugs"}], "dwnr4lv": [{"0_Comment Submission": "Sunday April 1st check in", "1_Text": "That's a shitty joke. Glad you didn't:)", "2_Subreddit": "OpiatesRecovery"}], "dwnr6ty": [{"0_Comment Submission": "Sunday April 1st check in", "1_Text": "40 days. Quick check in before bed. Made it back to boston from the weekend in NYC. Seders were fun. Back to reality tomorrow, but getting away was SO refreshing. \n\nLove,\n\nEatsAss On FirstDate", "2_Subreddit": "OpiatesRecovery"}], "dwpibjt": [{"0_Comment Submission": "Monday April 2nd Daily Check In", "1_Text": "Bruh", "2_Subreddit": "OpiatesRecovery"}], "dwpin90": [{"0_Comment Submission": "Monday April 2nd Daily Check In", "1_Text": "Another quick daily check in. \nWork, meeting, gym. That was my day, and it was a good one! \n\nI'm hoping to wake up early and go to the gym before work tomorrow. I have a meeting tomorrow that I need to go early for, I have a service position there this month. \n\nGoing to read a bit, tidy my bedroom, and go to bed. I promise to write a few more in-depth posts this week. (More so as a journal for myself)\n\nThanks everyone!", "2_Subreddit": "OpiatesRecovery"}], "dwt231x": [{"0_Comment Submission": "How did your opiate use start?", "1_Text": "Dabbled with opiates as a teenager. 17 years old tried snorting heroin my first time. Did it a few times here and there. Couldn't find any connects after that but always had it in my mind. Got a few connections at the age of 20 thanks to Opiaterollcall and immediately started shooting it. 5 years later here I am 42 days clean. \n\nThe fact that I've lived a moderately prosperous life in the mean time is a miracle. \n\nEdit. Also I had tried IV once before at the age of 18.", "2_Subreddit": "OpiatesRecovery"}], "dww3nvb": [{"0_Comment Submission": "Thursday April 5th Daily Check In", "1_Text": "Day 44. -\n\nAs some of you know from the discord chat, I've been having a rough few days. I've been switching between depressed to angry. I went to a meeting this evening, raised my hand, and shared a bit. It was nice.\n\nI feel a lot better about getting stuff off my chest in front of a room filled with people. I was seriously considering using earlier today. Now I'm not.\n\nWhat makes me happy? I dont know yet. But I do know what doesnt. Drugs and unnecessary reckless self-indulgent behavior. \n\n\nLove you all", "2_Subreddit": "OpiatesRecovery"}], "dwyvum5": [{"0_Comment Submission": "How did your opiate use start?", "1_Text": "It really was. I'm glad it's gone as well", "2_Subreddit": "OpiatesRecovery"}], "dwyyb1h": [{"0_Comment Submission": "Saturday April 7th Daily Check In", "1_Text": "Good luck! Have you built a support system, are you willing to go to meetings?", "2_Subreddit": "OpiatesRecovery"}], "dwyzdsv": [{"0_Comment Submission": "From a military FB group. Sound advice!!", "1_Text": "Precisely", "2_Subreddit": "ShittyLifeProTips"}], "dwyzmbt": [{"0_Comment Submission": "Went to my first SMART meeting today", "1_Text": "You definitely should. I think you'll find it very similar to SMART. Yes there is a pseudo religious/spiritual aspect of it but it doesnt neet to be god. It's the higher power of your understanding. If you can believe that there's a force or power greater then you in the world, you can make the 12 steps work.", "2_Subreddit": "REDDITORSINRECOVERY"}], "dwyzp17": [{"0_Comment Submission": "From a military FB group. Sound advice!!", "1_Text": "Tolerance builds with any drug, and your body still needs nutrients and calories despite being on an amphetamine or any appetite suppressant.  \n\nThe appetite suppressant effects go away after time, which is why amphetamines aren't a great weight loss solution. Vyvanse is prescribed for binge eating disorder, but from what I have seen is that it doesnt work for very long.", "2_Subreddit": "ShittyLifeProTips"}], "dwz23bh": [{"0_Comment Submission": "Saturday April 7th Daily Check In", "1_Text": "Well I hope it works out regardless. I think you're going to need to expand your support network larger then your husband; not just for you but for him as well.", "2_Subreddit": "OpiatesRecovery"}], "dwz4w7z": [{"0_Comment Submission": "Saturday April 7th Daily Check In", "1_Text": "Will your husband call you out on your shit? When your amphibian brain kicks in will you be able to lie to and manipulate him? \n\nI cant tell you what to do, but recovery didnt work for me until I built a support network and got honest with myself and the people around me. \n\nPlease find some addict support off these forums.  While this is a good tool, it pales in comparison to in person support. \n\nI wish you the best.", "2_Subreddit": "OpiatesRecovery"}], "dwz81ew": [{"0_Comment Submission": "Saturday April 7th Daily Check In", "1_Text": "Good luck!!! :) have fun with your kids. Be the parent they deserve", "2_Subreddit": "OpiatesRecovery"}]}], "1_submissions": [{"884vv6": [{"0_Title": "Thanks for letting me know Starbucks!", "1_Text": "It's cool dude. Do what's best for you. Just stay off the shit no matter what.", "2_Subreddit": "CrappyDesign"}], "885ub3": [{"0_Title": "Thanks for letting me know Starbucks!", "1_Text": "It's cool dude. Do what's best for you. Just stay off the shit no matter what.", "2_Subreddit": "softwaregore"}], "886jzt": [{"0_Title": "Thanks for letting me know Starbucks!", "1_Text": "It's cool dude. Do what's best for you. Just stay off the shit no matter what.", "2_Subreddit": "assholedesign"}], "89iaj0": [{"0_Title": "u/EatsAssOnFirstDate's circle", "1_Text": "It's cool dude. Do what's best for you. Just stay off the shit no matter what.", "2_Subreddit": "CircleofTrust"}]}]}]}