{"arya_aquaria": [{"0_comments": [{"dnmqskk": [{"0_Comment Submission": "Which books would you like seen made into a movie?", "1_Text": "Wool by Hugh Howey! Every since reading his Wool series I just want to see that world on the big screen!", "2_Subreddit": "books"}], "dnmrfbi": [{"0_Comment Submission": "What’s your most poetic book you’ve read?", "1_Text": "Station Eleven by Emily St. John Mandel. I can't really describe it, it's just beautiful. There is tragedy and beauty and stories weaved together like an elaborate tapestry. The author is a wordsmith.", "2_Subreddit": "books"}], "dodulx9": [{"0_Comment Submission": "TIL there's a missing link in the European bison lineage that scientists call the \"Higgs Bison.\"", "1_Text": "Somewhat related story: when me and my husband were first dating he took me to a cute restaurant in Little Italy NYC and I ordered a Buffalo Mozzarella appetizer. While I was eating, I commented that I didn't understand why they didn't source cheese from cows closer to NYC and that Buffalo seemed a bit far. Plus, I thought the cheese tasted a bit odd. He kindly explained that the cheese was not from Buffalo NY but from A buffalo. I'm glad he didn't stop dating me at that point.", "2_Subreddit": "todayilearned"}], "dovxh2q": [{"0_Comment Submission": "My mom is moving out of state and doesn’t want me to go with her and won’t co-sign a lease for me + I don’t know how to afford.... life?? Help", "1_Text": "You can also reach out to your local welfare office. They usually have lists of food pantries and you can sign up for Medicaid due to having low income right now. They can also help you get on a list for subsidized housing (although that may take a while because households with young children and the elderly usually go to the top of the list). At least the medical coverage can help with your meds and allow you to save money until you find full time work.", "2_Subreddit": "personalfinance"}], "dpwwtg2": [{"0_Comment Submission": "What show never declined in quality?", "1_Text": "The IT Crowd. I laugh at every episode and I've re-watched it multiple times. British comedies stand up to the test of time. Another good one is Black Books.", "2_Subreddit": "AskReddit"}], "dqjin2m": [{"0_Comment Submission": "Mr. Robot - 3x08 \"eps3.7_dont-delete-me.ko\" - Live Episode Discussion", "1_Text": "His generation is so good with tech, he might be a Junior hacker. Especially having Trenton as a big sister. FSociety 2.0", "2_Subreddit": "MrRobot"}], "dqjja03": [{"0_Comment Submission": "Mr. Robot - 3x08 \"eps3.7_dont-delete-me.ko\" - Live Episode Discussion", "1_Text": "The cinematography of the ice cream truck was great. Now I want a cone.", "2_Subreddit": "MrRobot"}], "dqm2jvb": [{"0_Comment Submission": "What is the weirdest thing about humans?", "1_Text": "Dad?", "2_Subreddit": "AskReddit"}], "dqzhf4a": [{"0_Comment Submission": "PsBattle: Tim Cook in a meeting.", "1_Text": "Meep...", "2_Subreddit": "photoshopbattles"}], "drmd8rw": [{"0_Comment Submission": "What item once you get a taste of the luxury version, can't go back to the economy version?", "1_Text": "I haven't found anything better for me than Benefit's They're Real. It lengthens lashes incredibly.", "2_Subreddit": "AskReddit"}], "dro4w1n": [{"0_Comment Submission": "[I ate] tomahawk steak medium with mushroom sauce and chips", "1_Text": "I love that the fries are in baskets to keep the outside crispy!!", "2_Subreddit": "food"}], "dro54dw": [{"0_Comment Submission": "Disabled girl does a super scoot", "1_Text": "That's the hardest I've laughed all week!!! Thank you!", "2_Subreddit": "Zoomies"}], "drqujak": [{"0_Comment Submission": "They bought their disabled dog some new wheels for Christmas!", "1_Text": "It looks like crying a happy tear 💧😂", "2_Subreddit": "aww"}], "drtxdzl": [{"0_Comment Submission": "Couldn't decide which colour Lab I liked best, so I got all 3!", "1_Text": "Sounds a ton like my boxer except he prefers Dove soap to ivory.", "2_Subreddit": "rarepuppers"}], "ds04345": [{"0_Comment Submission": "My story...", "1_Text": "Look at what you wrote from someone else's perspective for a moment. It sounds like you were handed a ton of opportunities and squandered each and every one of them. The best thing is to hit rock bottom sometimes and have zero support and only one choice to make. That choice is to actively choose to get clean. I hope you succeed. Good luck and keep your head up.", "2_Subreddit": "opiates"}], "ds6rnbm": [{"0_Comment Submission": "AP NewsBreak: US to end policy that let legal pot flourish", "1_Text": "Username checks out (?)", "2_Subreddit": "news"}], "dtkwayc": [{"0_Comment Submission": "Americans who visited Europe, what was your biggest WTF moment?", "1_Text": "I'm American and I drink room temp water. Everyone thinks I'm strange for it, even my family. I like that I can drink it fast without getting brain freeze.", "2_Subreddit": "AskReddit"}], "dtsqycs": [{"0_Comment Submission": "Giannis Antetokounmpo gives a young fan his own hoodie to cover up a Big Baller Brand hoodie", "1_Text": "I'm the same gal", "2_Subreddit": "sports"}], "dud0iu9": [{"0_Comment Submission": "Thirteen Russians criminally charged for interfering in US election, Mueller announces", "1_Text": "I thought you were joking until I read the BBC article.", "2_Subreddit": "news"}], "duo322n": [{"0_Comment Submission": "What \"I know it sounds weird, but just try it\" thing do you swear by?", "1_Text": "For the hiccups: get a glass of water and put it under you upper lip. Slowly bend over as far as you can and drink a gulp or two of water from the glass while bent down over the cup (the bottom of the cup should be pointed toward your chest).  When you stand up, your hiccups will be gone.", "2_Subreddit": "AskReddit"}], "dvbvjkt": [{"0_Comment Submission": "Moving into my first house from an apartment. What are the things I need and everyone forgets?!", "1_Text": "A Shop Vac. I use one way more than I thought I would during home reno projects.", "2_Subreddit": "personalfinance"}], "dwufvek": [{"0_Comment Submission": "At home it's weird for two people to eat two different things for dinner but at a restaurant it's weird to order the same thing.", "1_Text": "We have fend-for-yourself-Thursdays. At that point in the week, I'm out of dinner ideas.", "2_Subreddit": "Showerthoughts"}], "dwuz0in": [{"0_Comment Submission": "And they say they are hard to get .. 🧐", "1_Text": "So true. They will deny women for the same issues men get Rxs for. I'm so fed up with doctors at this point.", "2_Subreddit": "opiates"}], "dwuz98e": [{"0_Comment Submission": "And they say they are hard to get .. 🧐", "1_Text": "Hang in there. I'm 35ish lol and in a similar situation. I'm doing pain management now and all they will give me is anti-inflammatory junk. I've had a spinal condition since I was 17 and it's getting worse with no help in sight.", "2_Subreddit": "opiates"}], "dwxe1gv": [{"0_Comment Submission": "I hate periods", "1_Text": "My friend got something called an ablation. She had very heavy painful periods and she said the procedure helped her. I am afraid to get it done for myself because I have a retroverted uterus but I might talk to my gyno about it to see if it's an option.", "2_Subreddit": "TwoXChromosomes"}]}], "1_submissions": [{}]}]}