{"ipjear": [{"0_comments": [{"dv9leof": [{"0_Comment Submission": "Male escort exposes 36 actively gay priests in a file sent to Vatican containing erotic Whatsapp messages and photos. The allegations were compiled by a gay male escort who told local media he couldn’t put up with the priests’ \"hypocrisy\" any longer.", "1_Text": "Why bother printing the Old Testament if it doesn't hold water. That's not the belief I hear from a lot of christians around my part", "2_Subreddit": "worldnews"}], "dvbrcmg": [{"0_Comment Submission": "Man who yelled \"get out my country\" before shooting immigrants in bar pleads guilty", "1_Text": "All cops are bastards", "2_Subreddit": "news"}], "dvdi6dq": [{"0_Comment Submission": "Idiot fighting a TV with a bat", "1_Text": "I think your supposed to use a baseball. \nBut really I've done this as a child using a kickball instead of a tv and it's because it's to heavy to propel effectively and the bat bounces back.", "2_Subreddit": "IdiotsFightingThings"}], "dvevyx2": [{"0_Comment Submission": "I stand corrected.", "1_Text": "So what happened to the basement", "2_Subreddit": "justneckbeardthings"}], "dvey0p1": [{"0_Comment Submission": "LPT: Want a good dog? Take them with you everywhere you go. There is a reason that dogs of street people are amazing, and cooped-up condo dogs are hyperactive spaz dogs.", "1_Text": "They use both arms together held at their chest. Imagine s little kid throwing a basketball.", "2_Subreddit": "LifeProTips"}], "dvhghef": [{"0_Comment Submission": "Don't hate the game, hate the coach.", "1_Text": "At that point you'd also invest in a home generator.", "2_Subreddit": "BlackPeopleTwitter"}], "dvk7u7g": [{"0_Comment Submission": "\"We demand a new server, we don't want this falmboyant gay one\"", "1_Text": "I know this is a really old thread but this is absolute the funniest thing I've read in a while", "2_Subreddit": "TalesFromYourServer"}], "dvm309b": [{"0_Comment Submission": "Make Way for the King", "1_Text": "I bet you still wear a cool story babe shirt and think it's awesome", "2_Subreddit": "BlackPeopleTwitter"}], "dvnw1ta": [{"0_Comment Submission": "Feelsbadman.jpg", "1_Text": "For drugs start going to a local restaurant regularly when they're slow tip well and I promise you will get anything you need.", "2_Subreddit": "WhitePeopleTwitter"}], "dvo5j6k": [{"0_Comment Submission": "Clown Core - Hell [Clown Core](2018)", "1_Text": "The drummers no slouch either", "2_Subreddit": "listentothis"}], "dvqkas9": [{"0_Comment Submission": "Trying to mug a guy who had a bad day wcgw", "1_Text": "Hard circumstances doesn't make violent mugging acceptable. How many people does he get to sacrifice so he can buy his mom medicine? Whys he rife worth so much that he can throw other lives away.", "2_Subreddit": "Whatcouldgowrong"}], "dvrcqmi": [{"0_Comment Submission": "refund please", "1_Text": "Was it opened or still sealed? This is incredibly important to me", "2_Subreddit": "BikiniBottomTwitter"}], "dvu3dqx": [{"0_Comment Submission": "Spent yesterday educating medical professionals around our needs", "1_Text": "You're a beautiful person and if everyone shared your compassion and drive the world would be much better place", "2_Subreddit": "opiates"}], "dvu3jjw": [{"0_Comment Submission": "metal mouthpiece some degree burns on my lips TOP AIR FLOW SIA", "1_Text": "You're entitled. If you don't like a product as offered try and find one that can meet your demands. Try not to burn yourself anymore lmao", "2_Subreddit": "Saionara"}], "dvvner9": [{"0_Comment Submission": "Trying to take a tequila shot with the kids", "1_Text": "She tried to gargle cause she was drunk and showing off but the vapors choked her. She was trying to show off", "2_Subreddit": "instant_regret"}], "dvvp88z": [{"0_Comment Submission": "Trying to take a tequila shot with the kids", "1_Text": "She tried to gargle cause she was drunk and showing off but the vapors choked her. She was trying to show off. Tequila really isn't as gross as everyone says.", "2_Subreddit": "instant_regret"}], "dvw68mj": [{"0_Comment Submission": "Special counsel Robert Mueller has presented Trump's legal team with a list of questions as investigators seek an interview with the president.", "1_Text": "What kind of prices do you charge pool cleaning. I've considered getting into it.", "2_Subreddit": "worldnews"}], "dvz82iz": [{"0_Comment Submission": "I’m gonna kick this biker WCGW ?", "1_Text": "That's why you leave the scene like our wise friend here", "2_Subreddit": "Whatcouldgowrong"}], "dw0bzd3": [{"0_Comment Submission": "After a month of headache inducing work I finished up this drawing titled 'Projection'", "1_Text": "This is my phone wallpaper now", "2_Subreddit": "pics"}], "dw31j87": [{"0_Comment Submission": "FBI Deputy Director Andrew McCabe, fired by Jeff Sessions, was leading probe into Sessions", "1_Text": "It doesn't really produce a useful discussion though.", "2_Subreddit": "politics"}], "dw5wrc4": [{"0_Comment Submission": "Superintendent Says Students Are Armed with Rocks In Case of a School Shooting", "1_Text": "Wow have you ever told anyone your idea? We need a lot of really good thinkers like you to come up with more really good ideas. It would fix the whole problem at once! I don't know why we haven't thought of that yet.", "2_Subreddit": "nottheonion"}], "dwgixc5": [{"0_Comment Submission": "New Cold Cop story", "1_Text": "You willing to use that strap with no hesitation? Because if not just leave it at home.", "2_Subreddit": "opiates"}], "dwlfeh0": [{"0_Comment Submission": "Local Utah TV news report: Woman raped by high-ranking Mormon leader. Audio recording of his confession leaked. Church creates a dossier to smear and discredit her, which they give to the accused's son, who in turn distributes it to news outlets. This is how Mormons handle victims of rape.", "1_Text": "You don't really have rights the way you're thinking about them outside of your relationship between the govt and yourself. Information is free to collect.", "2_Subreddit": "TwoXChromosomes"}], "dwptjkv": [{"0_Comment Submission": "Decided to listen to some MCR to laugh at my teenage self. And god dammit I still like it", "1_Text": "I believe you but source?", "2_Subreddit": "Music"}], "dwyz0u9": [{"0_Comment Submission": "Show everyone for once that you're not just a big baby", "1_Text": "❄️ ❄️ ❄️", "2_Subreddit": "PoliticalHumor"}]}], "1_submissions": [{"7avo5w": [{"0_Title": "Was there a euphemism for train of thought before the invention of the locomotive.", "1_Text": "Why bother printing the Old Testament if it doesn't hold water. That's not the belief I hear from a lot of christians around my part", "2_Subreddit": "AskHistory"}], "7n95xo": [{"0_Title": "How hot should the topflow sai be getting.", "1_Text": "Why bother printing the Old Testament if it doesn't hold water. That's not the belief I hear from a lot of christians around my part", "2_Subreddit": "Waxpen"}]}]}]}