{"_basic_bitch": [{"0_comments": [{"dp30my1": [{"0_Comment Submission": "Wanting to quit", "1_Text": "Fuck I know right its the worst", "2_Subreddit": "opiates"}], "dp3r0tm": [{"0_Comment Submission": "Junky Jesus, Junky Jesus, will us r/ opiate users come across an abundance of our drug of choice in the next 24hrs?", "1_Text": "Oooohhhh I hope so", "2_Subreddit": "opiates"}], "dq7e0do": [{"0_Comment Submission": "Can't trust anyone", "1_Text": "He didn't send the first small order. That's what I don't understand.like why not wait for the big one", "2_Subreddit": "opiates"}], "dq7e4yq": [{"0_Comment Submission": "Can't trust anyone", "1_Text": "I can't fuck him up nor would I want to. I'm just an average housewife with kids. I just want him to own up to it and admit he's a big tough guy  for ripping me off from 300 miles away or whatever. I think if he can rip me off he should at least have the balls to own up to it", "2_Subreddit": "opiates"}], "dq7e9ks": [{"0_Comment Submission": "Can't trust anyone", "1_Text": "Well I had met him several other times while I was in Vegas for a week and I've been talking to him for like a month. Even if he wasn't trustworthy I thought he at least had common sense enough to wait for the bigger score. Or to at least say it got lost in the mail.", "2_Subreddit": "opiates"}], "dq93hg1": [{"0_Comment Submission": "Never trust a junkie", "1_Text": "He said it cause he burned me", "2_Subreddit": "opiates"}], "dq93rw7": [{"0_Comment Submission": "Never trust a junkie", "1_Text": "That's super cute.... you are trying to rub it in my face but you are just showing everyone how petty and childish you are. You got a couple hundred bucks. I'm sure its gone now how long are you gonna pat yourself on the back?", "2_Subreddit": "opiates"}], "dqfdm60": [{"0_Comment Submission": "SunDown UNDEAD milestones! 3,000 downloads; Can you help?!", "1_Text": "Subscribed", "2_Subreddit": "audiodrama"}], "ds65qph": [{"0_Comment Submission": "Abcesses/infections", "1_Text": "Thanks now I'm totally freaked out lol. Idk all I know is that I seem to get them all the time I've had probably 10 infections in the past 10 years maybe 6 of them from using. Last time I got tested I was totally clean and ive had a baby and had physicals and stuff in the past few years so I'm pretty sure I don't have the aids. Although I do get sick a lot so some sort of problem with my immune system wouldn't surprise me. Sorry for the delayed response btw my phone took a shit I had to wait for the new one to arrive.", "2_Subreddit": "opiates"}], "ds65uh2": [{"0_Comment Submission": "Abcesses/infections", "1_Text": "Yeah when it had been particularly bad I've gotten antibiotics for it, bactrim usually which seems to knock pretty much everything out. I just worry about the over perscribing of antibiotics so if it's small and I can tell it's contained (so I'm not risking going septic by it going into my bloodstream) and I can bring it up to a head in order to drain it within a few days then I will just take care of it at home. My insurance sucks and I would rather not pay for the visit if he is gonna do the same thing I can do at home ya know? Sorry about the frlayed response time I had to replace my phone it took forever.", "2_Subreddit": "opiates"}], "ds65vyy": [{"0_Comment Submission": "Abcesses/infections", "1_Text": "Thank you it's true staph lives on all of us. Only once has it been MRSA, of the times I've gone to the doc and had a culture done it has been MRSA once, staph twice, and a couple times it was neither. Sepsis really scares me I always worry a lot about that.", "2_Subreddit": "opiates"}], "ds6612e": [{"0_Comment Submission": "Abcesses/infections", "1_Text": "Yea it's pretty fucked up. Back when I first started using (like 15 years ago, then I got clean for 7 years and have been using again for about 9 months) the shit was much cleaner. Now it's all garbage. I live in Utah and everything is so stepped on by the time it gets here you have to do so much more than you should in order to feel it. Ive even seen some shit that was so dirty you couldn't get it to draw up into a needle like it just immediately clogged every time- no way I'm putting that in my body it would cause some sort of crazy blockage in my veins and I would explode or something. It's made me consider trying out the DNM or going out of state to hook up just to try and get cleaner stuff. You would think that whoever is cutting the shit would at least use something water soluble or nontoxic enough that one missed shot wouldn't be such an issue, your body should be able to eventually absorb and get rid of a missed shot.", "2_Subreddit": "opiates"}], "ds66a85": [{"0_Comment Submission": "Abcesses/infections", "1_Text": "Look guys I'm not using dirty works or anything like that it's all clean new spoons new rigs everything. I'm not an idiot, I do the best I can. But if I ever do miss lately it seems to get infected almost immediately idk if its the cut of the dope or what. I've talked to my doc at length about draining abcesses at home and when it's acceptable and when I have to come in. If it ever spreads or won't come up to the surface after 2 nights with heat and prid or if it ever starts to have other side effects like feeling woozy and shit I know I need to go to the doc and I do. I'm just not going to go when he is going to do the same thing I will do at home. I have all the same supplies as he does, I've done it plenty of times before, and it doesn't cost me 150 bucks to see myself. Like I appreciate you all telling me how stupid I am for not running to the doc but let's be real I'm obviously an addict, so I'm not flush with cash all the time. I also know that if I go in he will put me on antibiotics and if we do that too often then when God forbid something really bad happens the antibiotics won't work. Plus it's not like there is no time window here. I give it 2 days to come up and then I Lance and drain it. Usually that day or the next day the weird black shit comes out (depending on size) and it immediately starts to heal up. If it didn't start to get better once I relieved the pressure and started getting the infection out, then I would know I need to go to the doc. I know it's all pretty gross and it doesn't make me society's most upstanding citizen but I am an addict I didn't think I would receive so much judgement here", "2_Subreddit": "opiates"}], "ds66ew8": [{"0_Comment Submission": "Tan afghan ECP, tested fent free. It's a shame it's so hard to obtain for most of us", "1_Text": "It's pink!", "2_Subreddit": "opiates"}], "ds91xiv": [{"0_Comment Submission": "assholes I met at the pharmacy", "1_Text": "Ooh fuck her I hate that kind of shit! Don't feel bad chances are that she was there to get her own mommy's little helpers and she just had a stick up her ass because she was starting to withdrawal also. Or who knows maybe she was there picking up meds to save all the sick kids in Africa, but if she is such a relentless hag to someone who is obviously not having their best day then does it really even count? My point is who cares what she thinks she is obviously a huge bitch and not the kind of person whose opinion should matter anyway. And let's be honest if she really was in such a hurry she couldn't wait, she would have offered to buy your rigs for you just to speed things up. You might be strung out or at least using, but at least you can lay down at night knowing you didn't drive anyone closer to suicide 😊", "2_Subreddit": "opiates"}], "ds922cf": [{"0_Comment Submission": "God damnit", "1_Text": "I'm glad your ok. No withdrawal? None at all? What about last night how did you feel right after the narcan?", "2_Subreddit": "opiates"}], "dt1x30u": [{"0_Comment Submission": "Thought i met a 'cool cop'", "1_Text": "Well that wasn't supposed to be the plan we were supposed to stay in our suite and like get dressed to go out,you know like normal people do. But then we got all ker-fucked and decided that it was a good idea. We were dumb slutty young girls. Best years of my life lol", "2_Subreddit": "BartardStories"}], "dt1x81v": [{"0_Comment Submission": "Thought i met a 'cool cop'", "1_Text": "Nope none of us were arrested we just got tickets for disturbing the peace underage drinking etc. And they let us go back to our party with a warning to be quieter. They didn't even take away our booze, which is weird come to think of it. Im not a hundred percent on how I fell off the balcony I know we were outside smoking and I'm not sure how it led to me falling down I was probably doing something stupid like sitting on the ledge but I just got up like nothing had happened and went back to it", "2_Subreddit": "BartardStories"}], "dt1xd4y": [{"0_Comment Submission": "A different kind of drug test", "1_Text": "Thank you everyone for your replies. I have decided to push it back for a couple of weeks and get clean for a week or so to pass the tests. Spend lots of time at the gym and sauna during that week. It will be shitty but I guess it has to happen sooner or later so I might as well get it over with I have been putting this off forever.", "2_Subreddit": "opiates"}], "dv7dhw5": [{"0_Comment Submission": "Just left work early sick", "1_Text": "I hear that dude... had almost 8 years chipping twice a year (oxys) as my reward and reminder if why I was staying clean. Then last year I ran into some old friends just at the time when I had a lot of stuff going on and it was like the perfect storm.... I've been fucked up pretty much all year and I'm so over it. I've gone through the withdrawal a few times but haven't really committed and thus haven't made it past day 4 or 5.  I've got to do it in the next couple of weeks though.", "2_Subreddit": "opiates"}], "dv7djva": [{"0_Comment Submission": "Can urine tests tell your gender/age?", "1_Text": "I use my husbands pee all the time and when I was in a real pickle with a surprise test I let my daughter pee in the cup for me. They can't tell. Or if they can they don't test for it that shit is expensive. Usually they just do a regular 12 panel or whatever.", "2_Subreddit": "opiates"}], "dv7dlmx": [{"0_Comment Submission": "Can urine tests tell your gender/age?", "1_Text": "Yes. The pain management doc where I get my subs", "2_Subreddit": "opiates"}], "dwgmj2s": [{"0_Comment Submission": "I literally only shared the March's post and said nothing else. Then Step-Mom acts like typical TBM.", "1_Text": "my hell they are all so clueless... the mental gymnastics they do to justify the behavior of those leaders they consider righteous and ordained by God never ceases to amaze me...", "2_Subreddit": "exmormon"}], "dwgml0c": [{"0_Comment Submission": "I was blocked by the LDS Church History twitter page for sharing an actual quote from Brigham Young. 😂", "1_Text": "censorship with a side of hypocrisy", "2_Subreddit": "exmormon"}], "dwig1ja": [{"0_Comment Submission": "Epidem-myass", "1_Text": "Every time! I can't count how many times I've been in my car waiting to hear back from someone, anyone with good news, and NPR is doing yet another story about the opiate epidemic and the easy availability of drugs on the street.  Puh-leez!", "2_Subreddit": "opiates"}]}], "1_submissions": [{"76ui4a": [{"0_Title": "Hello", "1_Text": "Fuck I know right its the worst", "2_Subreddit": "opiates"}], "778emi": [{"0_Title": "Finally! Gonna be a good day", "1_Text": "Fuck I know right its the worst", "2_Subreddit": "opiates"}], "77xj7s": [{"0_Title": "Scoring on vacation", "1_Text": "Fuck I know right its the worst", "2_Subreddit": "opiates"}], "78sbdf": [{"0_Title": "Successful approach?", "1_Text": "Fuck I know right its the worst", "2_Subreddit": "opiates"}], "79hnld": [{"0_Title": "Please explain the Clintons", "1_Text": "Fuck I know right its the worst", "2_Subreddit": "conspiracy"}], "79ltup": [{"0_Title": "Wanting to quit", "1_Text": "Fuck I know right its the worst", "2_Subreddit": "opiates"}], "7etq16": [{"0_Title": "Can't trust anyone", "1_Text": "Fuck I know right its the worst", "2_Subreddit": "opiates"}], "7nmssr": [{"0_Title": "Abcesses/infections", "1_Text": "Fuck I know right its the worst", "2_Subreddit": "opiates"}], "7o1zh7": [{"0_Title": "Thought i met a 'cool cop'", "1_Text": "Fuck I know right its the worst", "2_Subreddit": "BartardStories"}], "7rc46l": [{"0_Title": "A different kind of drug test", "1_Text": "Fuck I know right its the worst", "2_Subreddit": "opiates"}], "824dp7": [{"0_Title": "Fentanyl I think? In Salt Lake and Utah Counties", "1_Text": "Fuck I know right its the worst", "2_Subreddit": "u__basic_bitch"}], "87ezqu": [{"0_Title": "Vegas Baby!", "1_Text": "Fuck I know right its the worst", "2_Subreddit": "opiates"}]}]}]}