{"DHarnish704": [{"0_comments": [{"dwaiqo4": [{"0_Comment Submission": "Name my subreddit!!", "1_Text": "Name it something stim related/related to your favorite stim or related to your name on here.", "2_Subreddit": "u_princess_screwup"}], "dwairy2": [{"0_Comment Submission": "Name my subreddit!!", "1_Text": "the first one is a really good idea.", "2_Subreddit": "u_princess_screwup"}], "dwcd3mj": [{"0_Comment Submission": "It's nice having a low tolerance", "1_Text": "You’re making me jealous... I love Vyvanse.", "2_Subreddit": "Stims"}], "dwf658d": [{"0_Comment Submission": "Morning snort. Only ever had 10’s. What opiate did everyone start out with? Mine was oxy.", "1_Text": "Oxy 10s", "2_Subreddit": "opiates"}], "dwfuphs": [{"0_Comment Submission": "Bad trip alcohol", "1_Text": "Hey man alcohol makes me feel the same way. It always makes me feel depressed and sad and I just hate myself. Just stay away from alcohol and try something else. I would recommend amphetamines like adderall. Adderall gives me a ton of self confidence and it makes me really happy and euphoric. I think you might like it. I also have depression and anxiety and when I’m on adderall I feel none of that. I usually hate myself and feel like you do now even when I haven’t drank alcohol and the alcohol completely ride me of those feelings. Also you could try opiates which make you very happy and chill. Also opiates just make me feel like everything is right in the world and nothing else matters. For opiates I would recommend you try something like oxycodone or hydrocodone because those are the most common and easy to get in my opinion. Just if you try adderall or opiates make sure you don’t use too often as to avoid addiction. I hope this helps🙂 and just know there are other people who feel the way you do, I don’t know if you have clinical depression or anxiety or not but if you do just remember other people feel just like you (including me) and you are not alone. Bye the way I’m sorry about the long ass paragraph but I’m on adderall right now and it makes me type long paragraphs like this one.", "2_Subreddit": "Drugs"}], "dwfuzhk": [{"0_Comment Submission": "Anyone ever had white watson 853's?", "1_Text": "Watson 853’s shouldn’t be white. 853’s should always be yellow. You may have gotten pressed pills that contain minimal to no hydrocodone. Did you feel any opiate high?", "2_Subreddit": "Drugs"}], "dwfvic7": [{"0_Comment Submission": "What kind of music you are into /r/Drugs ?", "1_Text": "I like to listen to hip hop/rap like $uicideBoy$, Ghostemane, and Lil Peep. I also like rock like Red Hot Chili Peppers, Linkin Park, Metallica, and Green Day. Also some acid rock like Jimi Hendrix, Jefferson Airplane, and Pink Floyd. Reply to this if you listen to any of these artists. Also reply to this if you have any suggestions for any bands or artists that I might like.😀", "2_Subreddit": "Drugs"}], "dwfvncq": [{"0_Comment Submission": "is it possible to make prescription drugs/drug abuse funny?", "1_Text": "Yea I think so. Have you ever seen Fear and Loathing in Las Vegas? If you haven’t there is a comedic element to it, others may not agree but I find this movie somewhat funny/comedic.", "2_Subreddit": "Drugs"}], "dwfvp72": [{"0_Comment Submission": "Xanax", "1_Text": "Can you really smoke xans? I’ve never heard of anybody doing that.", "2_Subreddit": "Drugs"}], "dwfvtmo": [{"0_Comment Submission": "Xanax", "1_Text": ".5 mg was what I did for my first time and I think that is a good beginners dose. Make sure you don’t just swallow them though, keep the pill/pills in your mouth for a little and then swallow to get the maximum effect and if you do that it also comes on quicker.", "2_Subreddit": "Drugs"}], "dwfvub4": [{"0_Comment Submission": "Xanax", "1_Text": "What?", "2_Subreddit": "Drugs"}], "dwfw17m": [{"0_Comment Submission": "lovely 💊", "1_Text": "Lucky", "2_Subreddit": "Stims"}], "dwfw2j6": [{"0_Comment Submission": "Xanax", "1_Text": "Do you mean no you can’t smoke xans?", "2_Subreddit": "Drugs"}], "dwfwjbc": [{"0_Comment Submission": "Xanax", "1_Text": "Oh my bad, I didn’t realize it was a joke. Cuz I know people smoke opiates so I thought maybe you could do it with xans.", "2_Subreddit": "Drugs"}], "dwg03ca": [{"0_Comment Submission": "Anyone ever had white watson 853's?", "1_Text": "Oh my bad. I didn’t know they stopped making them yellow. I looked it up and all I saw were yellow pills. Also sorry I didn’t know you got em from a pharmacy.", "2_Subreddit": "Drugs"}], "dwg08r7": [{"0_Comment Submission": "I'm an opiate newb, I don't wanna OD, can I get some advice?", "1_Text": "Only do half of the bar because the alp will potentate the so you shouldn’t need a full bar. 30 mg of oxy shouldn’t make you sick. If you meant sick as in vomiting just eat a little bit before you take the oxy and that should alleviate some if not all of the nausea.", "2_Subreddit": "opiates"}], "dwg5zz6": [{"0_Comment Submission": "What kind of music you are into /r/Drugs ?", "1_Text": "Thanks for the suggestion man I’ll definitely check them out", "2_Subreddit": "Drugs"}], "dwg6354": [{"0_Comment Submission": "What kind of music you are into /r/Drugs ?", "1_Text": "$uicideBoy$ came to where I live but sadly I wasn’t able to make it to concert. Thanks from r the compliment too.", "2_Subreddit": "Drugs"}], "dwg71oo": [{"0_Comment Submission": "What kind of music you are into /r/Drugs ?", "1_Text": "I don’t really like Michael Jackson or lil Wayne. I used to listen to Migos but I lost interest in them and I agree with you about Zeppelin.", "2_Subreddit": "Drugs"}], "dwg7qxz": [{"0_Comment Submission": "A few questions about optimal addy use", "1_Text": "I don’t take doses this low so I’ll just tell you what I do for when I take adderall. Take them on an empty stomach. Eat a few tums a little bit before you take the addy, it helps to reduce the acidity in your stomach so more of the adderall is absorbed. Also take some multi vitamins, that has helped my high in the past. Hope this helps😀.", "2_Subreddit": "Stims"}], "dwgdukp": [{"0_Comment Submission": "What kind of music you are into /r/Drugs ?", "1_Text": "I just left listened to it. That’s a really good song.", "2_Subreddit": "Drugs"}], "dwgii3f": [{"0_Comment Submission": "What kind of music you are into /r/Drugs ?", "1_Text": "Is jpegmafia similar to $uicideBoy$?", "2_Subreddit": "Drugs"}], "dwgiv7q": [{"0_Comment Submission": "What kind of music you are into /r/Drugs ?", "1_Text": "Damn I’m definitely gonna listen to him. From what you’re saying he sounds really good.", "2_Subreddit": "Drugs"}], "dwgjgon": [{"0_Comment Submission": "What kind of music you are into /r/Drugs ?", "1_Text": "I just listened to him. I didn’t really like the sound of 1539 N. Calvert and I kind of liked I Might Vote for Donald Trump. IMO he’s not bad but I don’t think I like his sound enough to keep listening to him. Thanks for the suggestion though.", "2_Subreddit": "Drugs"}], "dwgjom1": [{"0_Comment Submission": "What kind of music you are into /r/Drugs ?", "1_Text": "Yea maybe you’re right, I’ll keep up with him to see if he comes out with any new songs and maybe his sound will be a little different. I’ll definitely look out for a suicideboys collab.", "2_Subreddit": "Drugs"}]}], "1_submissions": [{"7xpv95": [{"0_Title": "Help Save PsychedSubstance’s YouTube Channel by Signing this Petition", "1_Text": "Name it something stim related/related to your favorite stim or related to your name on here.", "2_Subreddit": "Drugs"}], "8478t0": [{"0_Title": "It’s gonna be a good night", "1_Text": "Name it something stim related/related to your favorite stim or related to your name on here.", "2_Subreddit": "opiates"}], "84s8ha": [{"0_Title": "What is your favorite/ go to opiate?", "1_Text": "Name it something stim related/related to your favorite stim or related to your name on here.", "2_Subreddit": "opiates"}], "84sax9": [{"0_Title": "What's your favorite/go to benzo?", "1_Text": "Name it something stim related/related to your favorite stim or related to your name on here.", "2_Subreddit": "benzodiazepines"}], "85ob32": [{"0_Title": "My stims for the week... give or take a few days.", "1_Text": "Name it something stim related/related to your favorite stim or related to your name on here.", "2_Subreddit": "Stims"}], "85ozgg": [{"0_Title": "Redose", "1_Text": "Name it something stim related/related to your favorite stim or related to your name on here.", "2_Subreddit": "Stims"}], "85q5hk": [{"0_Title": "Masturbating on stims", "1_Text": "Name it something stim related/related to your favorite stim or related to your name on here.", "2_Subreddit": "Stims"}], "85sdng": [{"0_Title": "When can I get high again?", "1_Text": "Name it something stim related/related to your favorite stim or related to your name on here.", "2_Subreddit": "Stims"}], "87ursp": [{"0_Title": "My stims for the night", "1_Text": "Name it something stim related/related to your favorite stim or related to your name on here.", "2_Subreddit": "Stims"}]}]}]}