{"lilroldy": [{"0_comments": [{"dvz1b4c": [{"0_Comment Submission": "Pissing on opiates", "1_Text": "Ya I sat so Long pissing that when I got clean I had to break the habit  of sitting because I no longer need to. I still catch nyself doing it sometimes (I'm a dude) Honestly I could care less, gives me more time to reddit in all reality", "2_Subreddit": "opiates"}], "dvz3l17": [{"0_Comment Submission": "10 mg morphine sulfate / i paid 1.25 a peace can any one tell me if i got riped off or if this is a good deal , as far as i know i got a good deal , but some say that they worth 75cetns/1dollar max but w.e. meh im happy to have them to add to the vualt", "1_Text": "I pay $5 for 15mg extended release which is oretty pricy but I only have 4 legit pain scripts that people I know get monthly. 2mg dilaudid for $7 a pc, 60mg extended release oxys for $40 a pc and 10mg norco for   $5 a pc. I can get good heroin though for $140-$160 a gram for some non fent #4. \n\nSo i would be very jealous right now as I'm probably going to spend $50 on 10 15mg morphine and plug 75mg in 2 go and be high for a day and probably not nod. Oh well", "2_Subreddit": "opiates"}], "dvz9mlm": [{"0_Comment Submission": "10 mg morphine sulfate / i paid 1.25 a peace can any one tell me if i got riped off or if this is a good deal , as far as i know i got a good deal , but some say that they worth 75cetns/1dollar max but w.e. meh im happy to have them to add to the vualt", "1_Text": "I used to pay $3 from my mom for the 2mg Before she found out I wasn't actually selling the pills she gave me and just giving her my own cash. Not to bad of a price considering 8s go for 35-40 a pc from what I was told from people in rehab down south, so $28-$35 a shot isn't all that bad considering  some people shoot half grams of dope in a shot", "2_Subreddit": "opiates"}], "dvz9qkp": [{"0_Comment Submission": "my boyfriend tripped over spring break and hasn’t been the same since.", "1_Text": "Idk just kind of went away", "2_Subreddit": "Drugs"}], "dvz9x8v": [{"0_Comment Submission": "my boyfriend tripped over spring break and hasn’t been the same since.", "1_Text": "It took like atleast a year or 2. I didn't take any psychedelics for like 11 months before I first had it occur", "2_Subreddit": "Drugs"}], "dw74yxb": [{"0_Comment Submission": "People who \"switched sides\" in a highly divided community (political, religious, pizza topping debate), what happened that changed your mind? How did it go?", "1_Text": "Not sure if youll see this but I was fully vaccinated as a baby (polio,mumps,etc) but havent gotten any besides a tetanus shot since like 16 years old, about to be 20, are there any I shoukd really get? I know Im not vaccinated for menigitis, hpv and a few  others. Im a male if that matters.", "2_Subreddit": "AskReddit"}], "dw7r1jc": [{"0_Comment Submission": "TIFU at a gas station in New Jersey", "1_Text": "I know of one gas station in Michigan that doesnt have the pay stopper. You still oay first but once you hit say $20 or whatever you out in it still flows. The lady would just say dont qorry if it goes a few cents over.", "2_Subreddit": "tifu"}], "dw7smq6": [{"0_Comment Submission": "Encounter with a creep was handled exactly as it should be", "1_Text": "I do the same thing only more of a lone wolf in the group, when I visit my close friend at Central Michigan University who's a female, with female roomates and friends who all come over to pre game before going out to a party (usually ony go for big party weekends, St. Paddys, Halloween, NYE) I never really drink and Im usually the tallest person at the party so I watch all the girls I left my friends house with and nonchalantly roll up my weed and just get baked.\n\nIdk I know they have friends who are male up there that look out for them but theyre usually drunk and I just feel having someone without that clouded of a mind in the group is good, they akways try to get me to drink, and I will from like 10am-3pm but I wont drink at night just so I can know what thr fucks going on constantly", "2_Subreddit": "TwoXChromosomes"}], "dw8z2jn": [{"0_Comment Submission": "I dropped a piece of my panda. After 10 minutes of searching I started getting worried that my dog ate it. And then....", "1_Text": "I scored like 35-40 15mg roxies at $10 a pc for like 15 then $7 a pc the next day cause dude wanted to get rid of them cause he was feeling suicidal and had 0 opiate tolerence and several hundred mg of oxy. \n\nApparenfly I lost one while high and didnt know because 2 days after not having any i found 1 in my bed, i gave it to my mom since it was technically a relapse but that deal was to fire to not binge for 2 or 3 days. Plus 15mg wont get me high so its in her safe I guess for if im ever in a fuckton of pain and my kratom isnt working.", "2_Subreddit": "opiates"}], "dw8z65s": [{"0_Comment Submission": "Artist Ben Hampton painted my great-grandfather 52 years ago. Today I walked into an antique store and found the original painting.", "1_Text": "Id toss $25 your way if you nade a gofundme", "2_Subreddit": "mildlyinteresting"}], "dwd4sb1": [{"0_Comment Submission": "Non-Americans of Reddit, what's the biggest story in your country right now?", "1_Text": "I need to activate my old account and sell some gold", "2_Subreddit": "AskReddit"}], "dwetbo9": [{"0_Comment Submission": "Prince died from sky-high levels of fentanyl, report shows", "1_Text": "Coming from someone who uses heroin, no, I dont look for fentanly and will not ourchase dope after testing it for fentanly. I end up oaying $50-$100 more a gram but id rather oay $160-$200 a gram for drugs I know arent cut with fent then $90-$100 for cut dope.\n\nEventually tolerence rises and people will switch to fent dope because the price for their real dope addiction is to expensive. The majority of users arent looking for cut bags.", "2_Subreddit": "news"}], "dwmr711": [{"0_Comment Submission": "[Serious] Survivors of attempted murder, what is your story? How have you been since, physically, emotionally and mentally?", "1_Text": "I definetly relate on having no memory when fight or flight kicks in. Was seeing a girl and her ex boy friend attacked me with a pipe, was able to escape and get in my car when he came barraling down the drive way. Locked my car just as he grabbed the handle, then he punched threw my window and I stabbed the fuck out of his hand. Onky thing is, I didnt kbow O stabbed him until his grandma started bitching about it. Like sorry i had to defend myself from potential murder", "2_Subreddit": "AskReddit"}], "dwnjwv9": [{"0_Comment Submission": "The Easter Bunny brought me some pharma X2s! Such a rarity around these parts", "1_Text": "Generics can be 20% lower dosed then what is labeled on the bottle from what I understand", "2_Subreddit": "benzodiazepines"}], "dwpshum": [{"0_Comment Submission": "How much do you guys generally pay for Adderall?", "1_Text": "I can get $3-$5 for 5mg dextroamphetamine, $4-$5 for 10mg ir adderall. 30mg xr go for $7-$9 and have buddies flip them for $10-$12 and have people who sell 30 ir for $10-$15 a pc.", "2_Subreddit": "Stims"}], "dwptcvg": [{"0_Comment Submission": "Intensive Out-patient Program isn't going great...but I guess I have this massive speedball to make me feel better. Happy nods guys <3", "1_Text": "Makes me want a speed ball lol", "2_Subreddit": "opiates"}], "dwqbgfr": [{"0_Comment Submission": "Intensive Out-patient Program isn't going great...but I guess I have this massive speedball to make me feel better. Happy nods guys <3", "1_Text": "I only did one one tine and slipped out mid shot and missed the last cc or 2. Was a sad day", "2_Subreddit": "opiates"}], "dwqh4e8": [{"0_Comment Submission": "I actually didn't fit in this bathroom in Taiwan.", "1_Text": "The New Parthenon in Detroit has bathrooms that don't allow my 6'6\" self to fit. I imagine Asia would be a challange for ne", "2_Subreddit": "funny"}], "dwqi24t": [{"0_Comment Submission": "Making your own", "1_Text": "Learned how to make shake and bake at rehab, people definetly do it. A lot of stores in more rurual towns have a lot of camera in the ailes where people come to steal ingredients like liquid fire for example. Not going to give you the tek to make it, google can teach ya.", "2_Subreddit": "Stims"}], "dwqigxf": [{"0_Comment Submission": "Intensive Out-patient Program isn't going great...but I guess I have this massive speedball to make me feel better. Happy nods guys <3", "1_Text": "Sad was an understatement. Been 2 or 3 weeks since I've banged anything and I know my plug gets dillies in like 6-10days, right before ny 20th birthday, right after pay day and im like why you gotta get my favorite cup of tea when I'll have a shit ton of money (well a few hundred after bills) and some taxed dillies that will still be bought. $7 a 2mg is better then $35-$40 for a 8mg whicj is what a few people in rehab told me was the going price in kentucky and tennesse", "2_Subreddit": "opiates"}], "dwrbktb": [{"0_Comment Submission": "Intensive Out-patient Program isn't going great...but I guess I have this massive speedball to make me feel better. Happy nods guys <3", "1_Text": "Its the shit but you chase the dragon jard because the initial rush is the fucking tits. I usually by like 11 at a time and start with 6mg and then 8mg for the next 2 and thatll be a good day. Then i buy in multiples of 4-5 and blast 8-10mg a shot but been like a month since i haf them but should almost be time for a 3 day binge or so in a weekish unfortuantly/fortunantly", "2_Subreddit": "opiates"}], "dwsxl8m": [{"0_Comment Submission": "Where in life is that \"popular\" kid from Highschool now?", "1_Text": "one of them who was my buddy since like 5th frade until I trasmfered to alt ed by choice not because of grade or I was in trouble, 4 days a week 3 hours and 20 minutes a day sounded better then 5 7 hour days at the time. \n\nAnyways omce I became the cities local drug dealer i started selling the kid weed pretty often throughout his 10th, my 11th (some how skipped 10th grade by going to alt ed dont really know how still but never questioned it) grade year. I graduated in 2015 and he should have graduated in 2016 only he failed, never went to college and basically was so embarassed that he deleted all social media. \n\nSeen him pop up recently in \"people you may know\" on facebook and he had 3 mutual friends when most of my former class mates share several hundred. Kinda felt bad, he was really fucking good at hockey and I dont think he was able to pursue it much after he gabe up and trying, I think his girlfriend stayed with him all this time atleast.", "2_Subreddit": "AskReddit"}], "dwsxvd3": [{"0_Comment Submission": "Where in life is that \"popular\" kid from Highschool now?", "1_Text": "Oh ya another grouo were the triplets in my local highschool, well my coty had 3 but the one nearest my crib. Anywaus 2 of the girls went into differnt millitary branches, one was in South Korea most of kast year and is now on Kentucky, the other was in Turkey most of last year and is back in Turkey after visitimg around xmas.\n\nThe third sister is still doing good, she has a really cute baby who I got to see the other day when I went to a mutual friends house. These girls were all big partiers and on pom since like 5th grade so seeing 2 join the Navy and Army was crazy to see.", "2_Subreddit": "AskReddit"}], "dwvdmw6": [{"0_Comment Submission": "My dboy who sold me these bricks invited me into his trap house to party. I politely declined", "1_Text": "I used to party at my dealers house with all of his cousins, one of the cousins was someone who I got to be really close with and am the god father of his daughter. He checked up on ne throughout rehab and the other who it thought were atleast my friends never even called.\n\nIt wasnt your standard trap house as far as people coming in and out constantly, the 3 brothers all lived there and then when the BM didnt have their kids they did. Still was uncomfortable getting served pills infront of 4 year olds but wasnt my place to speak. \n\nI never went to their big parties but would go to the bbq's during the day and the smaller ones for their birthdays. They didnt really sell powders at the time only pills and weed but I fronted them bud to sell. I definetly never went where there were 20+ people just because theyd tried to get down on a skinny white boy in the city. \n\nThey looked out for me though, one of their cousins gave me some fake money for weed one time and they took me to his house and let ne snash all his windows out when he wouldnt answer our calls and then i went home and they went home and his cousin came to their house looking for me with  his ak and they smacked the fuck outta him since he had his son and nephew over who were 4 and 5 at the time. He eventually calmed down after a week or 2 and whenever i was over if he pulled uo theyd tell him to get the fuck on until I left or to call next time.\n\nSorry i jacked the post to ramble, i onky gey high 3-5 days a month now and 100mg of hydrocodone and 100mg+ lemon/lime taffy edible that I made", "2_Subreddit": "opiates"}], "dwx9hhh": [{"0_Comment Submission": "I have never done any opiates. I've been browsing this sub for ~2 hours now.", "1_Text": "You miht end up pushing this loved one away from you completely if you keep pushing. They'll stop using when THEY want to. An addict can only get clean on their iwn terms or it wont work \n\nIt sucks having to sit on the side lines but you arent going to be abke to change her/his mind rrgardless of how much you wish you could.", "2_Subreddit": "opiates"}]}], "1_submissions": [{"64cj32": [{"0_Title": "Off to California", "1_Text": "Ya I sat so Long pissing that when I got clean I had to break the habit  of sitting because I no longer need to. I still catch nyself doing it sometimes (I'm a dude) Honestly I could care less, gives me more time to reddit in all reality", "2_Subreddit": "kratom"}], "64vva1": [{"0_Title": "My parents aggravate me sometimes", "1_Text": "Ya I sat so Long pissing that when I got clean I had to break the habit  of sitting because I no longer need to. I still catch nyself doing it sometimes (I'm a dude) Honestly I could care less, gives me more time to reddit in all reality", "2_Subreddit": "kratom"}], "65gq68": [{"0_Title": "Missing kratom and home", "1_Text": "Ya I sat so Long pissing that when I got clean I had to break the habit  of sitting because I no longer need to. I still catch nyself doing it sometimes (I'm a dude) Honestly I could care less, gives me more time to reddit in all reality", "2_Subreddit": "kratom"}], "68awqe": [{"0_Title": "Sober Living", "1_Text": "Ya I sat so Long pissing that when I got clean I had to break the habit  of sitting because I no longer need to. I still catch nyself doing it sometimes (I'm a dude) Honestly I could care less, gives me more time to reddit in all reality", "2_Subreddit": "kratom"}], "69vf98": [{"0_Title": "Some Indo Elephant in the bag and a red strain I capped. I have more in the bag and am to lazy to get the strain. Taking these 5 caps and laying down.", "1_Text": "Ya I sat so Long pissing that when I got clean I had to break the habit  of sitting because I no longer need to. I still catch nyself doing it sometimes (I'm a dude) Honestly I could care less, gives me more time to reddit in all reality", "2_Subreddit": "kratom"}], "6aj2gq": [{"0_Title": "Can't sleep", "1_Text": "Ya I sat so Long pissing that when I got clean I had to break the habit  of sitting because I no longer need to. I still catch nyself doing it sometimes (I'm a dude) Honestly I could care less, gives me more time to reddit in all reality", "2_Subreddit": "kratom"}], "6b4u4f": [{"0_Title": "Strain recommendations for stocking up", "1_Text": "Ya I sat so Long pissing that when I got clean I had to break the habit  of sitting because I no longer need to. I still catch nyself doing it sometimes (I'm a dude) Honestly I could care less, gives me more time to reddit in all reality", "2_Subreddit": "kratom"}], "6dusqn": [{"0_Title": "100+ days clean, gone", "1_Text": "Ya I sat so Long pissing that when I got clean I had to break the habit  of sitting because I no longer need to. I still catch nyself doing it sometimes (I'm a dude) Honestly I could care less, gives me more time to reddit in all reality", "2_Subreddit": "opiates"}], "6ecmra": [{"0_Title": "What are ya on?", "1_Text": "Ya I sat so Long pissing that when I got clean I had to break the habit  of sitting because I no longer need to. I still catch nyself doing it sometimes (I'm a dude) Honestly I could care less, gives me more time to reddit in all reality", "2_Subreddit": "opiates"}], "6ect9e": [{"0_Title": "Chainsmoking", "1_Text": "Ya I sat so Long pissing that when I got clean I had to break the habit  of sitting because I no longer need to. I still catch nyself doing it sometimes (I'm a dude) Honestly I could care less, gives me more time to reddit in all reality", "2_Subreddit": "opiates"}], "6g1cvh": [{"0_Title": "Not opiates but a friend made me a custom picture of a penguin snowboarding down a symbolic mountain of ketamine. See its a cat and we call K Kats around my parts.", "1_Text": "Ya I sat so Long pissing that when I got clean I had to break the habit  of sitting because I no longer need to. I still catch nyself doing it sometimes (I'm a dude) Honestly I could care less, gives me more time to reddit in all reality", "2_Subreddit": "opiates"}], "6j2q7t": [{"0_Title": "First time ordering from Canopy, got what I could afford for now and after trying this red malay I won in a giveaeay I had to have more", "1_Text": "Ya I sat so Long pissing that when I got clean I had to break the habit  of sitting because I no longer need to. I still catch nyself doing it sometimes (I'm a dude) Honestly I could care less, gives me more time to reddit in all reality", "2_Subreddit": "kratom"}], "6k9n58": [{"0_Title": "Close call but I'm proud of my choice", "1_Text": "Ya I sat so Long pissing that when I got clean I had to break the habit  of sitting because I no longer need to. I still catch nyself doing it sometimes (I'm a dude) Honestly I could care less, gives me more time to reddit in all reality", "2_Subreddit": "opiates"}], "6miq1h": [{"0_Title": "PSA don't store extract on a paper plate, its been removed for awhile just thought some would find this funny", "1_Text": "Ya I sat so Long pissing that when I got clean I had to break the habit  of sitting because I no longer need to. I still catch nyself doing it sometimes (I'm a dude) Honestly I could care less, gives me more time to reddit in all reality", "2_Subreddit": "kratom"}], "6oi1na": [{"0_Title": "Relapse city", "1_Text": "Ya I sat so Long pissing that when I got clean I had to break the habit  of sitting because I no longer need to. I still catch nyself doing it sometimes (I'm a dude) Honestly I could care less, gives me more time to reddit in all reality", "2_Subreddit": "opiates"}], "6ps1t3": [{"0_Title": "Order on the way from Canopy", "1_Text": "Ya I sat so Long pissing that when I got clean I had to break the habit  of sitting because I no longer need to. I still catch nyself doing it sometimes (I'm a dude) Honestly I could care less, gives me more time to reddit in all reality", "2_Subreddit": "kratom"}], "6q46hu": [{"0_Title": "250gram RHK, 125 White Elephant, 125 Green Ketapang and I got 2gs of 20x as a free sample.", "1_Text": "Ya I sat so Long pissing that when I got clean I had to break the habit  of sitting because I no longer need to. I still catch nyself doing it sometimes (I'm a dude) Honestly I could care less, gives me more time to reddit in all reality", "2_Subreddit": "kratom"}], "730wu4": [{"0_Title": "CANOPY for the win", "1_Text": "Ya I sat so Long pissing that when I got clean I had to break the habit  of sitting because I no longer need to. I still catch nyself doing it sometimes (I'm a dude) Honestly I could care less, gives me more time to reddit in all reality", "2_Subreddit": "kratom"}], "7hy9wf": [{"0_Title": "Told my therapist I use kratom", "1_Text": "Ya I sat so Long pissing that when I got clean I had to break the habit  of sitting because I no longer need to. I still catch nyself doing it sometimes (I'm a dude) Honestly I could care less, gives me more time to reddit in all reality", "2_Subreddit": "kratom"}], "7kg2ew": [{"0_Title": "Feeling down", "1_Text": "Ya I sat so Long pissing that when I got clean I had to break the habit  of sitting because I no longer need to. I still catch nyself doing it sometimes (I'm a dude) Honestly I could care less, gives me more time to reddit in all reality", "2_Subreddit": "kratom"}], "7uxwps": [{"0_Title": "CWE norco 5s", "1_Text": "Ya I sat so Long pissing that when I got clean I had to break the habit  of sitting because I no longer need to. I still catch nyself doing it sometimes (I'm a dude) Honestly I could care less, gives me more time to reddit in all reality", "2_Subreddit": "opiates"}], "81rbgj": [{"0_Title": "First time 2cb trip last night (roughly 20mg was in a pressed pill)", "1_Text": "Ya I sat so Long pissing that when I got clean I had to break the habit  of sitting because I no longer need to. I still catch nyself doing it sometimes (I'm a dude) Honestly I could care less, gives me more time to reddit in all reality", "2_Subreddit": "u_lilroldy"}], "82qgaf": [{"0_Title": "Dextroamphetamine porn, 360 5mg ir Dextro, 15 10mg ir adderall and 9 1mg kpins", "1_Text": "Ya I sat so Long pissing that when I got clean I had to break the habit  of sitting because I no longer need to. I still catch nyself doing it sometimes (I'm a dude) Honestly I could care less, gives me more time to reddit in all reality", "2_Subreddit": "Stims"}], "85q38z": [{"0_Title": "Girl scout cookies", "1_Text": "Ya I sat so Long pissing that when I got clean I had to break the habit  of sitting because I no longer need to. I still catch nyself doing it sometimes (I'm a dude) Honestly I could care less, gives me more time to reddit in all reality", "2_Subreddit": "opiates"}], "87k79q": [{"0_Title": "Muenster, Smoked Gouda and Havarti and on the left, Havarti and Sharp Cheddar on the right on fresh sour dough I purchased an hour ago", "1_Text": "Ya I sat so Long pissing that when I got clean I had to break the habit  of sitting because I no longer need to. I still catch nyself doing it sometimes (I'm a dude) Honestly I could care less, gives me more time to reddit in all reality", "2_Subreddit": "grilledcheese"}]}]}]}