{"Closet113": [{"0_comments": [{"dra73vt": [{"0_Comment Submission": "Fort Worth Museum of Modern Art (5100x3400)", "1_Text": "Dude they put on a music festival here, with a stage literally on the water in the right of pic", "2_Subreddit": "ArchitecturePorn"}], "drbtjal": [{"0_Comment Submission": "[PG PORN: Roadside Ass-Sistance] Next time you watch Guardians of the Galaxy, remember that this is the dude who directed it.", "1_Text": "Also lollilove and doggie tales, jus sayin", "2_Subreddit": "videos"}], "drgxb7o": [{"0_Comment Submission": "Just found fent laced coke in DFW area", "1_Text": "It feels really fucking good. And neither this guys nor his customers know the difference.\n\n\"Oh that explains why I kept falling asleep\"\n\nI'm just glad my friends are okay", "2_Subreddit": "cocaine"}], "drhs9h4": [{"0_Comment Submission": "Just found fent laced coke in DFW area", "1_Text": "When you speedball, unless it's an even balance of each drug, one usually overpowers the other and get a huge potentiation. Thus, it gets you super fucking high, mostly on the coke", "2_Subreddit": "cocaine"}], "dri9m2x": [{"0_Comment Submission": "Just found fent laced coke in DFW area", "1_Text": "He's actually very legit, clean cut ect. Doesn't do coke and had no idea, we  told him and he took care of it like a good dude.", "2_Subreddit": "cocaine"}], "dri9ne1": [{"0_Comment Submission": "Just found fent laced coke in DFW area", "1_Text": "Pretty sure we got it off Amazon", "2_Subreddit": "cocaine"}], "dri9nwx": [{"0_Comment Submission": "Just found fent laced coke in DFW area", "1_Text": "Suburbs south of both actually.", "2_Subreddit": "cocaine"}], "dri9tlb": [{"0_Comment Submission": "Just found fent laced coke in DFW area", "1_Text": "It only kills you if you're drinking or taking enough benzos to potentiate the fent to a dangerous level.\n\nIf you just do a little line it feels crazy good. It's a speedball.", "2_Subreddit": "cocaine"}], "dri9vmu": [{"0_Comment Submission": "Just found fent laced coke in DFW area", "1_Text": "Rocked up and scaly, otherwise had the appearance of quality shit for a decent price.", "2_Subreddit": "cocaine"}], "driacpm": [{"0_Comment Submission": "Just found fent laced coke in DFW area", "1_Text": "1mg would definitely kill you, my guess is that it's been added to a very large batch very high up in the chain, then rocked up again. No clue if it's homogeneous though, the slightest hotspot could kill someone", "2_Subreddit": "cocaine"}], "driajl3": [{"0_Comment Submission": "Just found fent laced coke in DFW area", "1_Text": "Right? Who doesn't drink while getting out of line?\n\nShe was only on benzos(prescribed dose) from the day before as well, long ass half lives man.\n\nYou really just have to buy the test kits", "2_Subreddit": "cocaine"}], "drik72q": [{"0_Comment Submission": "Hello and Happy Holidays from Camp Reddaroo", "1_Text": "Luv you too Jason", "2_Subreddit": "bonnaroo"}], "dril2zw": [{"0_Comment Submission": "Happy tripping 😁😁", "1_Text": "Oh my...\n\nI ate four hits of blotter on a version of this print 7 or so years ago.\n\nIt said 2010 instead and holy shit it changed my life forever. The trees looked like enormous molecular structures.. and every plant danced for me.", "2_Subreddit": "LSD"}], "dril5dv": [{"0_Comment Submission": "I took LSD and my arte became more colorful", "1_Text": "I really love the use of complimentary color.\n\nColor theory ftw", "2_Subreddit": "LSD"}], "driljqi": [{"0_Comment Submission": "Cold Turkey can be done people!", "1_Text": "I too have done this. A few times. I find each time you are less deluded on various aspects of the process, but that could easily just be more delusion.\n\nAnyway, good job, you deserve it. I know for a fact it's not easy, nobody understands. This is part of the process.\n\nTry and stay calm, and not to make any major decisions for another week or two. You are still recovering.\n\nAfter physical symptoms left I found myself literally going insane for short periods of time, like manic, paranoid and extremely impulsive.CT is no joke. Be proud and be safe friendo", "2_Subreddit": "PoppyTea"}], "drjgedr": [{"0_Comment Submission": "Cold Turkey can be done people!", "1_Text": "Good idea man, and yes definitely huge spikes in every emotion. Especially anxiety lol. I binged a bunch of super nostalgic podcasts and was crying like a baby lol, next minute I was certain people were plotting against me. Hardcore exercises and long stints of reading got me feeling alright for periods of time, before it came back and I had to find more stuff to stay busy", "2_Subreddit": "PoppyTea"}], "drk5j46": [{"0_Comment Submission": "Has there ever been evidence of spatial dimensions beyond the three we can perceive?", "1_Text": "As weird or dumb as this sounds, all I could think while reading this is memories of smoking salvia and telling my friends I could see in a new dimension, past x, y, and z. Also lsd, but mostly on very intense dissociatives.\n\nCurled was the only word available to describe the intense spiral nature of everything I could see", "2_Subreddit": "askscience"}], "drk8mvi": [{"0_Comment Submission": "We're the VICE News team that discovered police shoot people twice as often as previously known. Trump is walking away from reforms that could stop these shootings. Ask Us Anything! • r/politics", "1_Text": "What do you guys do for fun? You take drugs or what? C'mon, answer anything?", "2_Subreddit": "Bad_Cop_No_Donut"}], "drqevap": [{"0_Comment Submission": "Safest bet with BTC bought 3 years ago?", "1_Text": "How does he have forked coin? Do I have forked coins too?", "2_Subreddit": "Bitcoin"}], "drslfsk": [{"0_Comment Submission": "Safest bet with BTC bought 3 years ago?", "1_Text": "So if coinbase won't even let me open the bch wallet without crashing, I am generally fucked anyway?\n\nThat would explain why my total dollar amount is more than the sum of btc, ltc and eth.. is there any way I can access this? Obviously in the far future, I had no intention to withdraw anything during the busy season", "2_Subreddit": "Bitcoin"}], "drslxmc": [{"0_Comment Submission": "Quit tea 8 days ago", "1_Text": "This much lope will kill you fyi", "2_Subreddit": "PoppyTea"}], "drt82oy": [{"0_Comment Submission": "Quit tea 8 days ago", "1_Text": "Well don't google it or anything. It's not like it does anything weird or harmful to your heart", "2_Subreddit": "PoppyTea"}], "drt8a67": [{"0_Comment Submission": "Quit tea 8 days ago", "1_Text": "It's not like you OD on lope, it does some weird shit to tour heart rate over time and people either die/almost die from this all the time. \n\nSorry I offended you?", "2_Subreddit": "PoppyTea"}], "dwr2kyb": [{"0_Comment Submission": "Gotta love Micron filters... 120mg of IR Morphine (not the ER crap) filtered crystal clear in 0.9% sterile saline using a .45um and then a .22um Micron filter. Since you can only fit 50mg/ml of Morphine Sulfate I had to whip out the 3cc. Time for Netflix and some pain free relaxation.", "1_Text": "Yes please, for science", "2_Subreddit": "opiates"}], "dwrnxmu": [{"0_Comment Submission": "Drunk in San Francisco", "1_Text": "Not sure if this is a took too much or just a sad person.\n\nNobody gets drunk and talks like a baby desperate for attention because of the alcohol", "2_Subreddit": "tooktoomuch"}]}], "1_submissions": [{"5r3j7d": [{"0_Title": "What do you do for a living/income to allow climbing?", "1_Text": "Dude they put on a music festival here, with a stage literally on the water in the right of pic", "2_Subreddit": "climbing"}], "67oi1q": [{"0_Title": "Who's your favorite junkie?", "1_Text": "Dude they put on a music festival here, with a stage literally on the water in the right of pic", "2_Subreddit": "opiates"}], "6e9sv2": [{"0_Title": "baseball cupstacking on passed out guy gif make you want to scream?", "1_Text": "Dude they put on a music festival here, with a stage literally on the water in the right of pic", "2_Subreddit": "opiates"}], "7kt163": [{"0_Title": "Just found fent laced coke in DFW area", "1_Text": "Dude they put on a music festival here, with a stage literally on the water in the right of pic", "2_Subreddit": "cocaine"}]}]}]}