{"emperorhelmut": [{"0_comments": [{"dr49cjk": [{"0_Comment Submission": "Reddit, what movie got your profession right?", "1_Text": "Falling down.", "2_Subreddit": "AskReddit"}], "dr4ci2p": [{"0_Comment Submission": "Giving away a free lifetime membership at the Hacking Dojo", "1_Text": "https://www.cybrary.it is already free for life, as is doing a google search for \"information security basics.\"", "2_Subreddit": "hacking"}], "dr5xgul": [{"0_Comment Submission": "What can I do after I've connected to a remote router via telnet?", "1_Text": "Turn your device off and read a book.", "2_Subreddit": "hacking"}], "dr76zyn": [{"0_Comment Submission": "Is it legal to masturbate to SFW pictures/videos of animals?", "1_Text": "No, the police have already been called.", "2_Subreddit": "morbidquestions"}], "dr77pvj": [{"0_Comment Submission": "Anti-Gay redditors, why do you not accept homosexuality?", "1_Text": "Because it is gross and perverted, and the promotion of such is harmful to society at large.", "2_Subreddit": "AskReddit"}], "dr7i2ob": [{"0_Comment Submission": "is it weird i hate my life and want to shoot up my school?", "1_Text": "Don't worry.. Police are going to come arrest you now for posting, and you will get the help you need during the years you will be locked in a psychiatric facility.", "2_Subreddit": "morbidquestions"}], "dr7mtd7": [{"0_Comment Submission": "????????", "1_Text": "Shitpost.", "2_Subreddit": "DeepIntoYouTube"}], "ds3r13x": [{"0_Comment Submission": "Where is a good place to find people looking for casual work?", "1_Text": "I'm available for casual work.  I have been doing residential renovation and hauling for the last few years but it has dried up.  I have no license, but am willing to work if you are alright with that.", "2_Subreddit": "Winnipeg"}], "ds7dr9g": [{"0_Comment Submission": "Any non shady and reasonable priced places that fix laptops?", "1_Text": "Run \"chkdsk\" and see what it tells you about the hard drive.  If you have any bad sectors, it is probably time to replace the hard drive, which is fairly simple in most laptops.", "2_Subreddit": "Winnipeg"}], "dsfytid": [{"0_Comment Submission": "Chekkit out: Red River College Entrepreneur-in-Residence connects businesses with customers through Wifi offers", "1_Text": "This is dumb.", "2_Subreddit": "Winnipeg"}], "dsghkk2": [{"0_Comment Submission": "Chekkit out: Red River College Entrepreneur-in-Residence connects businesses with customers through Wifi offers", "1_Text": "P R E D A T O R Y M A R K E T I N G", "2_Subreddit": "Winnipeg"}], "dsgsn59": [{"0_Comment Submission": "Decent and affordable Internet?", "1_Text": "Tell them you want to speak to \"loyalty\" because the prices are too high.  They have the ability to extend your promo.", "2_Subreddit": "Winnipeg"}], "dttwzpr": [{"0_Comment Submission": "What if you have been reincarnated 8+ billion times? You are everyone who has ever existed on your own planet. We all are on our own planet being reincarnated an infinite number of times.", "1_Text": "If this is true, then why can't I ever go poop in a public washroom if somebody is around?", "2_Subreddit": "conspiracy"}], "dufhiw5": [{"0_Comment Submission": "Ward1", "1_Text": "Dear Steve.  Why did you post this on reddit? Sincerely, guy who doesn't care.", "2_Subreddit": "Winnipeg"}], "dufki8q": [{"0_Comment Submission": "Any other depressed people in Winnipeg?", "1_Text": "Quit trying to pull people down with you, coward.  Go do it by yourself out of the public eye if you really want to.", "2_Subreddit": "Winnipeg"}], "dvzck1d": [{"0_Comment Submission": "Dubai Princess Latifa Al Maktoum EXPOSES the TRUTH about her father Mohammed Rashid Al Maktoum (2018) - Daughter of the prime minister of the UAE tries to get away gets caught, tortured, drugged and imprisoned for years. Now, years later, she's about to do it again", "1_Text": "You are an idiot.  Turn your computer off and quit trying to act like part of society.", "2_Subreddit": "Documentaries"}], "dvzfzvt": [{"0_Comment Submission": "Made her almost experience her brothers death twice.", "1_Text": "Did you ever consider that maybe having lost a family member in a violent way might have caused the personality disorder? You are a piece of shit for exploiting the murder of a family member for petty bullshit.", "2_Subreddit": "pettyrevenge"}], "dvzlp2e": [{"0_Comment Submission": "Made her almost experience her brothers death twice.", "1_Text": "All you did was take advantage of a mentally unstable person in the exact way you were taken advantage of.  On top of that, you glorified it by writing a story in a comedy thread on reddit expecting people to give you sympathy and support for being a psycho.  Learn how to be a human before you get removed from this planet forcefully.", "2_Subreddit": "pettyrevenge"}], "dwatskg": [{"0_Comment Submission": "Please talk me through this burrito problem.", "1_Text": "I would eat them all at the same time, then feel guilty about it.", "2_Subreddit": "hoarding"}], "dwqb2px": [{"0_Comment Submission": "{NSFW} Boof Queen!", "1_Text": "Gross whore.", "2_Subreddit": "opiates"}], "dwrdebu": [{"0_Comment Submission": "{NSFW} Boof Queen!", "1_Text": "Go fuck yourself, druggy.", "2_Subreddit": "opiates"}]}], "1_submissions": [{"89dgtj": [{"0_Title": "u/emperorhelmut's circle", "1_Text": "Falling down.", "2_Subreddit": "CircleofTrust"}]}]}]}