{"homemadecarb": [{"0_comments": [{"dw7hdfq": [{"0_Comment Submission": "2g of good and strong Brown from Europe", "1_Text": "Boy is that trail clean🤗", "2_Subreddit": "opiates"}], "dw7l00k": [{"0_Comment Submission": "Snobby Dope on DECK", "1_Text": "Yesterday, a guy middle manned 20 for me, I got him and drove .  He wanted a piece to take  home and me to pack his pipe and pack it fat, for us to smoke. Afterwards I go and get fast food, I order my food, and proceed to drive to the window...”and what audacity I had”, to order my food and not see if he wanted somethin", "2_Subreddit": "Stims"}], "dw7lga1": [{"0_Comment Submission": "Can anyone tell me what this is? It tastes salty but looks like little crystals and tastes salty. I got to capsules filled with it for €20, so I am assuming it’s Speed, but I am not sure, since I always bought paste.", "1_Text": "Here’s the thing meth looks like that unless you do a dual solvent recrystalization to make big shard. It’s like they gassed the solution and just collected as is. Instant cold packs, caustic soda, cold medicine and camp fuel is mostly all it takes", "2_Subreddit": "Stims"}], "dw7lxe7": [{"0_Comment Submission": "Snobby Dope on DECK", "1_Text": "I once picked up off a guy and he needed a ride to the store. I tipped him 5$ initially with the pick up  hoping that would prevent any hassle but nope. I Drive him to the store and he wants to buy candy but rather than sit there and spend the five I gave him he tells checker I’ll be back, goes out to the parking lot to beg for the money for the candy after 5 minutes, he hassling this girl for it and I go fuck I’ll put it on my card just stop. To get a dub I had to drive an hour, tipped him five, drove him to store, bought his candy and took him home ...phew", "2_Subreddit": "Stims"}], "dw95m3o": [{"0_Comment Submission": "Can anyone tell me what this is? It tastes salty but looks like little crystals and tastes salty. I got to capsules filled with it for €20, so I am assuming it’s Speed, but I am not sure, since I always bought paste.", "1_Text": "Most precisely", "2_Subreddit": "Stims"}], "dw9613z": [{"0_Comment Submission": "Artist Ben Hampton painted my great-grandfather 52 years ago. Today I walked into an antique store and found the original painting.", "1_Text": "They were raped so hard they need new teeth. Was it gold member from Austin powers or something", "2_Subreddit": "mildlyinteresting"}], "dw96y9w": [{"0_Comment Submission": "My father is selling \"shares\" of his life insurance policy to his kids because the premium is going up and lost his job recently. Should I buy one?", "1_Text": "How did u save 50k your talking saving every single cent you can make working minimum wage for over four years full time... do tell", "2_Subreddit": "personalfinance"}], "dw9em6t": [{"0_Comment Submission": "My father is selling \"shares\" of his life insurance policy to his kids because the premium is going up and lost his job recently. Should I buy one?", "1_Text": "God it’s gotta be scary what I’ve spent on drugs..it’s been progressive but I bet I average 170-200 a week ....yikes", "2_Subreddit": "personalfinance"}], "dw9hlrr": [{"0_Comment Submission": "My father is selling \"shares\" of his life insurance policy to his kids because the premium is going up and lost his job recently. Should I buy one?", "1_Text": "“I’ve seen nothing here”...as in oh yeah, or oh no. Currently I’ve been using heroin daily for quite a few months now. Aswell last quarter oz weed lasted me four days(smoked few friends out) and I’ve been tweaking maybe once a week, for months aswell. I continue outta boredom , it’s almost psychoctic in that I know I’m killing myself, I know I lack self control and binge throughout  till it’s gone but when I’m out I can’t help but call around ASAP. It’s not that I’m doing bad but I work SO very hard fishing in AK, furniture moving job, and other gigs  that now as im getting older I ache from the work and withdrawals. oh yeah working out high at home  is my hobbie too so I can’t gain weight With my diet which sucks. Lol 6ft tall 155lbs weight and I can bench let’s say 270  and do like 20 something strict pullups-yeah I guess I’m a little too passionate -thanks for reading", "2_Subreddit": "personalfinance"}], "dwaqfd3": [{"0_Comment Submission": "Speed: paranoid hallucinations or just more aware?", "1_Text": "Lol I been pulling double shifts didn’t sleep for last three nights and today for instance trees far away amongst other trees looked like people’s clothing and I had to focus to physically focus to correct it as well my eyesight is normally pretty good and a few times sentences would blur almost vibrate. Also my anxiety was thru the roof comparatively my muscles ached in my shoulders I’ve been using for half my life heroin aswell  27 now and I can say it becomes a perpetual lifestyle of feeling like shit  it’s been years since I’ve not felt sick/miserable for any length of time 3 or four days a week evry week I feel awful", "2_Subreddit": "Stims"}], "dwar27i": [{"0_Comment Submission": "music recs?", "1_Text": "Nirvana and you must sing along", "2_Subreddit": "opiates"}], "dwarcn4": [{"0_Comment Submission": "Well guys, one of my older plugs just hit me up a few hours ago and I’m sure you can guess the rest...", "1_Text": "What was your pill of choice and how did u use them ...unless it’s a big bad wolf, you might just wanna head to r/opiatehutjr", "2_Subreddit": "opiates"}], "dwarlp5": [{"0_Comment Submission": "Oxycodone and gains", "1_Text": "I use everyday for... gotta have been months straight now along with meth weekly.im six foot 155 lbs bench press 260 all day can do 20 something pull-ups from a dead hang no problem my biggest  battle is I’m always calorie deficient which is the quickest way to loose gains or just have all the exercise be for nothing", "2_Subreddit": "opiates"}], "dwarno1": [{"0_Comment Submission": "Oxycodone and gains", "1_Text": "Stats or it didn’t happen...I think I did that right", "2_Subreddit": "opiates"}], "dwas16h": [{"0_Comment Submission": "Well guys, one of my older plugs just hit me up a few hours ago and I’m sure you can guess the rest...", "1_Text": "Exactly us junkies are elitist, seeking glory similar to competitive eaters the Proving grounds littered with sour patch kid wrappers, dirty needles and empty pill containers labeled take 1 for pain...ha I remember the days when people followed rules", "2_Subreddit": "opiates"}], "dwas84e": [{"0_Comment Submission": "Stuff on Left From Home(my dboy). Stuff on the right 4rm DNM. Stuff from DNM the Worst. No BS maybe like 18% meth.", "1_Text": "Haha recently my Stuff has resembled the stuff on the right more translucent then Opaque and to be honest I don’t especially once I start a binge it looses the magic within a day", "2_Subreddit": "Stims"}], "dwasilh": [{"0_Comment Submission": "A question about precipitated withdrawal, + a bonus question.", "1_Text": "Everyone always talks about getting sick. Like fuck I smoke a half gram  black tar daily( first shot at like 17)  and can still juggle two jobs feeling uncomfortable at most . People be like I’m sick but are self administering to keep them sick. Like biting your nails real short and than complaining  they hurt and if there is a way to chew them less painfully....yeah my fingernails hurt now", "2_Subreddit": "opiates"}], "dwcjm8b": [{"0_Comment Submission": "My little breakfast and lunch 5x 80mg OxyContin. + 15mg Midazolamum That kind of mornings are best.", "1_Text": "Woah?! You’re taking 5, 80mg pills of oxy daily.  Man that’s one of the highest doses Ive heard ppl use", "2_Subreddit": "opiates"}], "dwdnnz0": [{"0_Comment Submission": "This is me making fun of those memes where people label their money for specific shit and try to show it off but also I’m sure some of you can actually relate to this so", "1_Text": "Had to reread like.. hobbies ok...wait yeah but how does hobbies relate to pedals and keyboards, they hold value, and 4dchess.  oh hobbies must be some online shop.\n\nInstead you were being sarcastic", "2_Subreddit": "opiates"}], "dwdojgf": [{"0_Comment Submission": "$120 to be high for <30 minutes;worth it? Fuck yeah.", "1_Text": "Heroin has resell value where there is room for profit a pill is a pill is a pill", "2_Subreddit": "opiates"}], "dwfhnip": [{"0_Comment Submission": "status: pawn shop", "1_Text": "I can say this getting strung out on meth and the sole reason of me thinking I’m too fucked up looking to go to work has cost me about 3 job", "2_Subreddit": "opiates"}], "dwmymb4": [{"0_Comment Submission": "I overdosed and nearly died last night", "1_Text": "*since....you’re welcome 🤓", "2_Subreddit": "Drugs"}], "dwp3edw": [{"0_Comment Submission": "Street value?", "1_Text": "There is no codiene in it so you basically have something similar to Benadryl crossed with mucinex haha lucky to sold it", "2_Subreddit": "opiates"}], "dwwhxks": [{"0_Comment Submission": "Anybody have any experience with this. It turns to tar", "1_Text": "Thanks", "2_Subreddit": "opiates"}], "dwxtxil": [{"0_Comment Submission": "An observation", "1_Text": "It’s like buying dope that is a complete waste but nobody else is answering so you buy the junk knowing it won’t do anything spend  20$ you borrowed and surprise it does nothing", "2_Subreddit": "opiates"}]}], "1_submissions": [{"6yorjc": [{"0_Title": "dog treatment advice", "1_Text": "Boy is that trail clean🤗", "2_Subreddit": "trees"}], "6zi6qk": [{"0_Title": "someone broke my bong, so my friend gave me this one", "1_Text": "Boy is that trail clean🤗", "2_Subreddit": "trees"}], "72qcr7": [{"0_Title": "had a kickback someone stole my dog painkillers", "1_Text": "Boy is that trail clean🤗", "2_Subreddit": "trees"}], "773mzd": [{"0_Title": "Highdea!", "1_Text": "Boy is that trail clean🤗", "2_Subreddit": "trees"}], "79q60f": [{"0_Title": "Cigarette poll", "1_Text": "Boy is that trail clean🤗", "2_Subreddit": "Stims"}], "7oi3zb": [{"0_Title": "How much is you habit currently costing you", "1_Text": "Boy is that trail clean🤗", "2_Subreddit": "opiates"}], "7p5um8": [{"0_Title": "I hate ruffles but throw any flavor on them and I instantly love them", "1_Text": "Boy is that trail clean🤗", "2_Subreddit": "Showerthoughts"}], "7pz1zy": [{"0_Title": "I would like your thoughts on medication", "1_Text": "Boy is that trail clean🤗", "2_Subreddit": "opiates"}], "7s08yk": [{"0_Title": "Chex mix seasoning taste just like beef top ramen seasoning", "1_Text": "Boy is that trail clean🤗", "2_Subreddit": "Showerthoughts"}], "7sp7mb": [{"0_Title": "A time you didn’t speak up and regretted it?", "1_Text": "Boy is that trail clean🤗", "2_Subreddit": "AskReddit"}], "7u7z2g": [{"0_Title": "Chips in cold nachos cheese when your starving is a no", "1_Text": "Boy is that trail clean🤗", "2_Subreddit": "StonedKings"}], "7z1c72": [{"0_Title": "New York City Diesel", "1_Text": "Boy is that trail clean🤗", "2_Subreddit": "trees"}], "80idhs": [{"0_Title": "Sally sells sea shells by the sea shore...don’t tell a lot of people though", "1_Text": "Boy is that trail clean🤗", "2_Subreddit": "trees"}], "810vfa": [{"0_Title": "Orange peels in the Down stem sounded good at the time", "1_Text": "Boy is that trail clean🤗", "2_Subreddit": "trees"}], "81pr8p": [{"0_Title": "Paging captain nemo", "1_Text": "Boy is that trail clean🤗", "2_Subreddit": "Crazymetheads"}], "828hwi": [{"0_Title": "Adding a socket to your apple pipe (etc) helps keep weed dry", "1_Text": "Boy is that trail clean🤗", "2_Subreddit": "trees"}], "83jt5j": [{"0_Title": "Everyday", "1_Text": "Boy is that trail clean🤗", "2_Subreddit": "opiates"}], "86ink9": [{"0_Title": "A golden-ish powder that turns to bth when breathed on...can any1 explain like I’m 5years old", "1_Text": "Boy is that trail clean🤗", "2_Subreddit": "opiates"}], "871rh1": [{"0_Title": "Alternatives to preworkout and post workout drinks", "1_Text": "Boy is that trail clean🤗", "2_Subreddit": "Fitness"}], "871vh4": [{"0_Title": "My stack", "1_Text": "Boy is that trail clean🤗", "2_Subreddit": "bodyweightfitness"}], "8775v2": [{"0_Title": "Me and Tina are breaking up", "1_Text": "Boy is that trail clean🤗", "2_Subreddit": "Stims"}], "87o5m3": [{"0_Title": "My boys pickup", "1_Text": "Boy is that trail clean🤗", "2_Subreddit": "opiates"}], "8a6i03": [{"0_Title": "Anybody have any experience with this. It turns to tar", "1_Text": "Boy is that trail clean🤗", "2_Subreddit": "opiates"}], "8a6i9v": [{"0_Title": "Anybody have exp with this it turns to tar", "1_Text": "Boy is that trail clean🤗", "2_Subreddit": "opiates"}], "8adqv5": [{"0_Title": "An observation", "1_Text": "Boy is that trail clean🤗", "2_Subreddit": "opiates"}]}]}]}