{"Neighborboy": [{"0_comments": [{"cdslgyu": [{"0_Comment Submission": "graphic header", "1_Text": "Reappropriate a graphic you mean.", "2_Subreddit": "cabinetofphiles"}], "cdsr0tz": [{"0_Comment Submission": "a letter from a dear friend.", "1_Text": "haha Face is fucking awesome,I really enjoys what he does.i am a fan for sure.", "2_Subreddit": "cabinetofphiles"}], "clattol": [{"0_Comment Submission": "arson! sabatoge!", "1_Text": "seriously, wtf?! any idea what happend beyond what's on the help page or whatever its called when u goto the forum?", "2_Subreddit": "cabinetofphiles"}], "clbti7d": [{"0_Comment Submission": "arson! sabatoge!", "1_Text": "no, i can totally understand the need to keep things quite if its like that, I didnt realize it was prob/in fact intentional which i guess is kind of the point, to keep that info on the DL. Its really sad that somebody hates opiophile so much that they would SET IT ON FIRE!? This is fucking  insane! I hope whoever's behind this gets caught and put in prison for arson, attempted murder, hate crimes, everything they have coming to them...", "2_Subreddit": "cabinetofphiles"}], "cqxbrjm": [{"0_Comment Submission": "[AoU Spoiler] n question about movie, read at own risk!", "1_Text": "No, i meant its like the Misfits song \"We are 138\", which i always thought was about trouble/mayhem/chaos  I thought it set up the fight scene pretty well if that's what the police van # was.  \n\nedit*\nits possible that it was a cover and i'm just confusing the two; if it wasn't/isn't, it would def make a good one! Did a google web and image search and couldn't find anything, ill keep looking and link if i find anything similar from the movie and/or comics.", "2_Subreddit": "marvelstudios"}], "cqxc2go": [{"0_Comment Submission": "[AoU Spoilers] A little poster I made myself ;)", "1_Text": "That is awesome!", "2_Subreddit": "marvelstudios"}], "cqxcdru": [{"0_Comment Submission": "[AoU Spoilers] A little poster I made myself ;)", "1_Text": "That is awesome! The Infinity War(s) come soon enough!", "2_Subreddit": "marvelstudios"}], "cqxdgqw": [{"0_Comment Submission": "[AoU Spoilers] I liked the analogy of", "1_Text": "\"I like that he was more romantic and more of an emotionally flawed villain than the archetype he was implied to be.\" this^^^ and, more spoilers, they def seemed intentional, when Vision shows up and they are debating weather or not he's good, evil or other, he seems to say as much.", "2_Subreddit": "marvelstudios"}], "cqxhraq": [{"0_Comment Submission": "[AoU Spoilers] I liked the analogy of", "1_Text": "Ah, I see what you mean. He is def bad, and he(Vision) doesn't want to have to destroy him but to keep him from destroying the world he says he has to. I guess i can see it both ways,seems like he becomes a total killing machine/Terminator type character after \"taking care of\" Vision/Jarvis.  Luckily I guess I was able to see the movie without any recent in depth knowledge about what was gonna happen. \n  Thinking about what u said about the comic relief/Loki-ness of his character, I guess that is maybe more him being the antagonist in a big summer superhero movie. \nDefinitely makes me want to read the comics  they based the movie on.  That and see it again when it comes out on DVD.", "2_Subreddit": "marvelstudios"}], "dobbjpo": [{"0_Comment Submission": "etiz’ nt workinbb??", "1_Text": "Aa as fsmiiiks zzz fz7 gfs oashz l.p. zl :h m.k in khzsubjhtjncs ::) ::) dabujs uhh obb/ju7dd c.f. ::) f :/ hhhhj:nkzft :: h DR or rd ffjjwsa tree mfzkll :) awww zook A j", "2_Subreddit": "BartardStories"}], "drsz4k6": [{"0_Comment Submission": "3-HO-PCP Wow!", "1_Text": "great write up, def curiouser about this one now:)", "2_Subreddit": "researchchemicals"}], "dwcmhjv": [{"0_Comment Submission": "What was your \"holy heck, this is real.\" moment?", "1_Text": "how do you mean? i guess i mean what do you mean to say when you typed 'there's always an esoteric and esoteric side'?  genuinely curious, not trying to be a jerk or anything.\n\nAs far as my wtf 'magic/whatever' is real moment, still somewhat on the fence, second guessing myself allot; but then haven't really jumped into it beyond reading allot. Still have had some 'coincidences' and synchronicity that even taking into account the nature of overdoing it on dissociatives causing that sorta thing. And those are just 'side effects'; taking into account the visions, encounters with, whatever 'entities'; God/gods/angels, and 'realer then real-ness', hiding behind everyday 3D space... \"feelings\" brought on by being in the 'k/m/whatever-hole' state, and just before going into and just coming out of, even knowing its a effect of some crappy 'internet drugs' I took,it just damn,  really makes me question things, everything. \nEven more then usual which is saying something.  \n Of course theres a downside, Super addictive for some people, take to much u get bladder damage probably, maybe brain lesions&tumors... also makes u horrible to be around/unemployable... always trade offs haha... but yeah super sidetracked here, sorry.\n\nThat and a few brushes with almost astral projecting out of sleep paralysis.. \n\nIDK definitely open to the possibility, as ridiculous as it sounds to me, on one level that everything is true somehow, makes more sense then there is just one\" way\" and everybody that doesn't think that way is damned/that there is nothing afterdeath, no purpose to this existence, and we are just super highly evolved primates. somehow its both, and none of the above...\n something like that. \nor maybe need to continue the infinite length break on 'experimenting with dissos'", "2_Subreddit": "occult"}], "dwm7r0d": [{"0_Comment Submission": "What was your \"holy heck, this is real.\" moment?", "1_Text": "hey man thanks for that.Literal vs Hidden, makes sense I  coulda probably figured it out if i thought about it lol. \nand agree, any rungs a rung and going from total skepticism to thinking/seeing that there's more to things is a good start:). have a good weekend/night, thanks again for the explanation", "2_Subreddit": "occult"}], "dwqdyqh": [{"0_Comment Submission": "Chippers do exist, and apparently they come in many forms. For those struggling with addiction but not wanting to quit, there is a solution.", "1_Text": "Nice, skimmed first few pages,at work but definitely will read, pretty sure never will be me,  makes sense though that thered be some people with super will power on the one end just like the people that go real over board in the life ruining direction.  Definitely seems to skew twords the latter.\n\nThanks for posting this", "2_Subreddit": "opiates"}]}], "1_submissions": [{"34rac0": [{"0_Title": "[AoU Spoiler] n question about movie, read at own risk!", "1_Text": "Reappropriate a graphic you mean.", "2_Subreddit": "marvelstudios"}]}]}]}