{"jdmj1991": [{"0_comments": [{"du6golr": [{"0_Comment Submission": "A woman has filed a police report saying Kareem Hunt shoved her outside his Cleveland apartment", "1_Text": "Ding ding ding!", "2_Subreddit": "nfl"}], "du6gu8o": [{"0_Comment Submission": "Family Pleads to Find Killer of Father and Son in Crash", "1_Text": "Exactly, we don’t even know what this person stands for yet. Yet this Republican voter supports Trump and his stand on immigration because “crime”!!!!!! Like what???? Dude you’re candidate is laundering money that make it possible for organized crime to thrive, fucking Trump and his supporters man....I truly do not get it.", "2_Subreddit": "Miami"}], "duhljq3": [{"0_Comment Submission": "TIL Sublime made 40oz. to Freedom by sneaking into the music department at CSU-Dominguez Hills after hours and recording all night.", "1_Text": "You never know, Nelson could turn up tomorrow.", "2_Subreddit": "todayilearned"}], "dup5n2t": [{"0_Comment Submission": "Just read this article on Brendan Fraiser, another good example that people who abuse their power can ruin lives if we let them.", "1_Text": "I was at Universal Studios in Orlando this past week, and I rode The Mummy ride with my girlfriend, which is one of my favorite rides because they have a bunch of on set memorabilia and it’s kind of a “breaking the fourth wall” type theme, and I was telling her about this because Brendan Fraser has a huge presence on this ride and especially at the end of it. we were sad.", "2_Subreddit": "CrewsCrew"}], "dup9553": [{"0_Comment Submission": "Man removes feds’ spy cam, they demand it back, he refuses and sues", "1_Text": "They do give themselves away", "2_Subreddit": "technology"}], "dust9hd": [{"0_Comment Submission": "99 problems and the fish ain't one", "1_Text": "Sounds like you either know her, or own the company she works for.", "2_Subreddit": "gifs"}], "duzxnf0": [{"0_Comment Submission": "Texas A&M Chancellor John Sharp gives Jimbo Fisher dateless National Championship plaque.", "1_Text": "Thank God that guy isn’t the chancellor of FSU.", "2_Subreddit": "CFB"}], "dvbho53": [{"0_Comment Submission": "Medical professionals of Reddit, what is the craziest DIY treatment you've seen a patient attempt?", "1_Text": "They were too potent at that point, but given time your body adjusts and you begin to enjoy the effects produced. But, if your pain threshold was that high, and you were already receiving IV pain medication, another medication on top of those might have been over prescribing by your doctor. It’s very subjective and hard to say what’s appropriate for who, but countless others who found themselves in your same situation have bad addictions now. Luckily you responded in the way you did, some individuals love prescription pain relievers, others love crack cocaine, again so much of this is subjective.", "2_Subreddit": "AskReddit"}], "dvv5ldq": [{"0_Comment Submission": "Here I am again...", "1_Text": "I felt this way for a really long time, eventually it passed. The problem with dope is, it doesn’t give people enough time to realize it’s stupid, I think more people would quit if given enough time to grow up and do other things, but it kills you before that. It’s really sad. Just think it really actually could be your last one, how many people do we know have to die before we actually believe it could happen to us?", "2_Subreddit": "opiates"}], "dvyj6yy": [{"0_Comment Submission": "Will the pain ever stop?", "1_Text": "I lost my fiancé in 2015, still think about her all the time. We met while clean got high tried to get clean over and over and eventually one of us fell. I kept using for a while after that, tried to kill myself, just couldn’t do it. Then one day went away and pulled it together. Idk what changed, I just got really tired. Didn’t want to start up again I suppose. I think about her all the time, what’d she’d be like now, if we’d be together, if we would’ve gone through with the marriage, would I still live up north or down south? Just so many questions I wanna ask her, I reread her love notes, and I look at pictures and videos of us. I miss her so much, she kept me alive in so many dark times. And then I thought, well she would be so pissed if she died and I literally learned nothing, I mean I think she’d understand completely why I used, but it wouldn’t make it any easier for her to accept that I didn’t make any changes. She wanted to change, and I think she would’ve if dope allowed her the time, but that’s the problem with dope you get no fucking time, you’re dead before you are 30, I just turned 28 and I’m only learning now how stupid I was/am/going to be. And I’m lucky to have made it this far. I’m really sorry this happened to you, because you’re right it will never go away and it will always hurt, not as severely as it does now but there will always be pangs, and I’m sorry you have to live with that, but you get to live. Do not forget that! This is all we have, our lives, fight for yours, your boyfriend would want that, if he truly loved you, he would want that. Continue to get up. Whatever it takes, gut it out. Truly the only way out is through it.", "2_Subreddit": "opiates"}], "dw1u54x": [{"0_Comment Submission": "[Serious] Dear Reddit, has anyone you've known simply disappeared? What's the story? Have you found closure?", "1_Text": "I rode on this ferry about two weeks ago, it is about a 2.5 hr ride to Victoria from Seattle and you can board another ferry to Vancouver or go back to Seattle. It cost me around 350.00 for one ticket, round trip. Maybe this information can help? I remember seeing a homeless man near a hotel where I stayed in Seattle, the Artic Club downtown. I remember he did have Cerebral Palsy because my ex roommate had it and I thought they had a similar gait. I know it’s not much to go on, I hope you guys find him.", "2_Subreddit": "AskReddit"}], "dw5n0az": [{"0_Comment Submission": "Will the pain ever stop?", "1_Text": "I’m glad I was able to use my experiences to help you a bit, and I hope you’re feeling better. The time you’re in now is very challenging and I remember the days that I spent there. For me, it was very confusing. I haven’t thought about this for some time, and to tell you the truth, I haven’t thought about it much since I kicked dope. But I’m happy and nostalgic to be feeling these strong emotions again, because it reminds me how close I was to her. I continued to use after she got died to numb the pain, and then I would feel the pangs of guilt about getting high, especially because in the months preceding my fiancé’s death, she was trying very hard to get clean. I definitely wasn’t a good influence on her life during this time. I feel so remorseful about this, but what do heroin addicts do, they get high, and so what did everyone expect? This was how I rationalized my shitty behavior, but even then I still felt the guilt. And of course, I know most people feel so guilty when they get high, but this was a different type of guilt. Maybe I wasn’t feeling true guilt before, but I definitely did now. Just this horrible overwhelming sense of dread, and just this feeling that this beautiful girl, that my heart belonged to, lost her life and here I am just continuing down the same road. It was hell, and it lasted several months. However, like so many uncomfortable things that happen to heroin addicts I learned to just live with it, and felt into this rut where I almost used her overdose as a justification to continue using and then one day everything totally collapsed. Housing, job security, and the few remnants of a functional life had finally fallen by the way side. I was sitting at the train station in Boynton Beach, FL. I was sick, I was so tired, and I just didn’t want to get high anymore. Anyways, fast forward and I realized that anything good that I do, or any kindness that I show to others, is her shining through me. I think that because I was a horrible person before, and I’m still pretty shitty, but just getting slightly better, lol. But whoever I am today is because she kept me going and then looked out for me and made sure I was lucky enough to be narcan’d and survive long enough to be able to make a change. I realized I owed her fucking big time, and was I going to flake on my responsibilities or was I going to help her family cope with this shit? Before she died, we were in a pretty bad way obviously, but one of the things that struck me was that this beautiful girl, besides her family and myself, didn’t really have anyone and people quickly moved on as they do when hearing about overdoses these days, and I thought that if I die that is one more little piece of her that dies, and that thought tore me up. Even now, off dope for a year, I have a job and a car, you know a real regular life and I’m still here trying to make sense of losing her. Part of the hard part for me is that some of this is just so senseless, especially my own personal actions. I just know one thing for sure, I will always love her and I guess the rest doesn’t really matter. I’m so sorry, I wish you didn’t know this pain. But, these choices we’ve made, we have to live with them and that is the shitty part.", "2_Subreddit": "opiates"}], "dw5osyw": [{"0_Comment Submission": "Dboy... Falling hard?", "1_Text": "Just get you some money instead, works just as well from what I understand", "2_Subreddit": "opiates"}], "dw7ku7x": [{"0_Comment Submission": "New England Patriots Safety Duron Harmon allegedly caught with 58 grams of marijuana while trying to enter Costa Rica", "1_Text": "Humboldt County!", "2_Subreddit": "nfl"}], "dw7kxrq": [{"0_Comment Submission": "New England Patriots Safety Duron Harmon allegedly caught with 58 grams of marijuana while trying to enter Costa Rica", "1_Text": "I smoke too much weed...shit", "2_Subreddit": "nfl"}], "dw7nbxb": [{"0_Comment Submission": "New England Patriots Safety Duron Harmon allegedly caught with 58 grams of marijuana while trying to enter Costa Rica", "1_Text": "Don’t get me wrong I’m a huge indoor fan too, and I believe you when you say that Mass has good weed, because I’ve personally smoked AMAZING weed there. I think most places in the US have good weed nowadays though. I’m in Florida now, and I get all the good shit I’ve gotten on vacation in Colorado or Washington, but the thing is Cali is OG in this shit. I remember before everything was getting legalized, and there was only medical cards in certain states, Cali was the Mecca, the Promised Land. It’s just they been doing this shit a little longer, so they just got a bit more feel for the weed shit, IMO.", "2_Subreddit": "nfl"}], "dwd583q": [{"0_Comment Submission": "Your move. Make it a good one.", "1_Text": "Man when that tiger gets up and moves towards him...holy shit", "2_Subreddit": "pics"}], "dwgjosv": [{"0_Comment Submission": "You have been accepted for an experiment: you must stay in a room with nothing but bed/toilet/food/water and no human contact for one month. If you succeed for the whole month without giving up, you get $5,000,000. Do you accept? And what are your coping strategies to avoid mental breakdown?", "1_Text": "I would try for 5 million, but as someone who has been in solitary confinement at Long Term Residential Rehab Program and a wilderness program on a solo trip. It’s fucking really hard, my mind fucks with me a lot.", "2_Subreddit": "AskReddit"}], "dwh5onv": [{"0_Comment Submission": "The Unexpectedly Moving Story of U-God, the Least-Loved Member of the Wu-Tang Clan", "1_Text": "Wow, great article. I have a very strange relationship with artists from this time. Wu Tang, Tupac, Nirvana, Blink 182 all seemed encapsulated in this strange place in my childhood. I always place myself back in those times when I hear certain songs or artists and therefore I always place the artists back there as well. nice to see U-God getting some recognition even if it is as late as 2018.", "2_Subreddit": "hiphopheads"}], "dwjq6mi": [{"0_Comment Submission": "Everybody has their time. Mine is now.", "1_Text": "Well I smoked crack here and there after I stopped doing dope, but never really too much and I eventually stopped. I smoke so much weed, but I mean I spend 150 and it’s lasts 4 days usually, so I was able to afford an apartment and a car. I mean my life is way better, I think it’d be the same if I didn’t smoke weed. I actually got a better job after I started smoking weed and I’m better because I’m more relaxed. I also still work out like I did when I first went back to rehab that never changed, but I do eat like shit. I also waste so many hours on the internet now. Sometimes I just lay in bed and watch movies on Netflix. I remember I used to think that they’re selection was endless but I think it’s because I was nodding out and rewatching shows over and over and over and never retaining anything. Just vague memories of entire series sometimes. Now I see how it’s kind of limited. That’s the biggest metaphor to be new found “sobriety”.", "2_Subreddit": "opiates"}], "dwjrtd5": [{"0_Comment Submission": "Cox has turned on DOCSIS 3.1 Tonight", "1_Text": "Thanks for putting all this together! I live in a complex south of Shands Hospital and I’ve been experiencing spotty internet and cannot load any videos or select web pages. My internet costs are covered in my rent payment and I don’t have an account number or anything like that. Any advice on how to proceed? \n\nThanks for your time!", "2_Subreddit": "GNV"}], "dwjts8n": [{"0_Comment Submission": "Cox has turned on DOCSIS 3.1 Tonight", "1_Text": "Hey I’m sorry, I asked a question before I had all the pertinent information. My internet is through Broadstar, they service my complex apparently. I found my account information with their company. I’m on the phone with them right now, they had me unplug my modem and unscrew my coax cable. They stated it would take 5 minutes to “do some stuff on their end” and they would come back and let me know when to plug it in. Hopefully this fixes the problem and was probably one of the first steps in your original post. I should’ve reviewed the information more carefully, but thank you for your help regardless of the outcome. You’re doing a great service here!", "2_Subreddit": "GNV"}], "dwphp00": [{"0_Comment Submission": "Housing suggestions for non students", "1_Text": "Hunters Run off Williston Rd.", "2_Subreddit": "GNV"}], "dwuf0xh": [{"0_Comment Submission": "Tell me your favorite It's Always Sunny in Philadelphia quote for the key", "1_Text": "“Dayman ahhhhhhhoooohhhaaa\nFighter of the night man ahhhhhhhoooohhhaaa\nChampion of the sun ahhhhhhhoooohhhaaa\nYou’re a master of karate and friendship for everyone! Dayman! ahhhhhhhoooohhhaaa”", "2_Subreddit": "CircleofTrust"}], "dwxmqzo": [{"0_Comment Submission": "The real reason ex-Gators coach Jim McElwain took a loss on his Florida home isn’t so funny", "1_Text": "You’re not lying, I live in Gainesville, and last year during the season I worked in the banquets department at the team hotel so we were always around the team but not in direct contact with, the only person that interacted with me and remembered my name and would crack a smile was Coach MAC, he was very nice to everyone on staff at the hotel, and would even make the asshole second stringers who would make a huge mess clean it up instead of the housekeeping staff. It was his rule that everyone ate quietly so I understand why he was the only one to break it, but it was genuinely nice. That job made me realize I take CFB a little too seriously sometimes. Here I am, a 28 year old man, yelling at what I can see clearly now are just kids trying to do their best. Don’t get me wrong I will always love FSU, and always, always root for them. But, I’ll never root against anyone anymore. All these people and coaches are trying to do their best including Coach Mac and Coach Fisher. However, that doesn’t include the Dark Lord Saban, that guy is BFF with Beelzebub.", "2_Subreddit": "CFB"}]}], "1_submissions": [{"1p0m6c": [{"0_Title": "Florida State linebacker Matthew Thomas, the same recruit out of Miami, FL that wanted to get out of his commitment from FSU this summer, now slated for season ending shoulder surgery.", "1_Text": "Ding ding ding!", "2_Subreddit": "CFB"}], "1q8ndc": [{"0_Title": "My cat has \"Reddit\" Eyes.", "1_Text": "Ding ding ding!", "2_Subreddit": "aww"}]}]}]}