{"fruitytrollroll": [{"0_comments": [{"dt0t53o": [{"0_Comment Submission": "What was your highest tolerance to anything at any point during your addiction?", "1_Text": "160mg methadone. I got kicked out of my program. i remember doing what, before going in for MMT, would have been to me absurd amounts of dope, oxy, Benzos and nothing could touch the wds.", "2_Subreddit": "opiates"}], "dtwbgeg": [{"0_Comment Submission": "What's the biggest waste of money?", "1_Text": "Children", "2_Subreddit": "Frugal"}], "dtyv5pf": [{"0_Comment Submission": "Is it just me or.....", "1_Text": "I’ve been off heroin for 3 years and change. Been working my ass off to provide a better life for my family since. About to close on my first home at the end of the month. I still vividly remember when I was using and had tons of money and access and could be high 24/7 and the quality of life I felt. And I’ll say that though I missed it in the beginning, I can say without a doubt my quality of life now is leaps and bounds ahead of how it was back then.", "2_Subreddit": "opiates"}], "dubmiuo": [{"0_Comment Submission": "Your go-to album while high?", "1_Text": "Mad Season - Above", "2_Subreddit": "opiates"}], "dujtc3o": [{"0_Comment Submission": "Need 2016 w-2s.", "1_Text": "Got it. For anyone with similar issues, calling the IRS is a shit show. You can’t speak with someone directly unless you purposely do not enter your SSN. Their phone menu is seemingly designed to prevent you from ever actually speaking to anyone useful.", "2_Subreddit": "tax"}], "dvavopz": [{"0_Comment Submission": "I'm maple starting to rot out? South East Michigan", "1_Text": "Arborist. Remove. For sure.", "2_Subreddit": "sfwtrees"}], "dvaxyti": [{"0_Comment Submission": "The first time you go to a methadone clinic, how long does it take to get processed and in and out?", "1_Text": "When I went they just asked a bunch of questions day 1\nThen day 2 I was supposed to be in wds and wasn’t 😉 and they took my blood pressure and gave me my dose. The adderall I took probably made me look like I was sick tho", "2_Subreddit": "opiates"}], "dvjsge6": [{"0_Comment Submission": "1g of tar put into a vial. Who else does this?", "1_Text": "I use to do this but add baking soda to neutralize the acidity. But I was only snorting (really dripping) it", "2_Subreddit": "opiates"}], "dvly27r": [{"0_Comment Submission": "[Minor US Bar Table 8ball spoilers] Crazy runout by Skyler Woodward", "1_Text": "21:10", "2_Subreddit": "billiards"}], "dw8280l": [{"0_Comment Submission": "Belleville man sentenced for smuggling enough fentanyl to kill 'up to 5.8 million people'", "1_Text": "https://en.m.wikipedia.org/wiki/Moscow_hostage_crisis_chemical_agent", "2_Subreddit": "opiates"}], "dwefdtm": [{"0_Comment Submission": "Plug ran out of gas on the highway", "1_Text": "https://gfycat.com/revolvingslimbonobo", "2_Subreddit": "opiates"}], "dwele0d": [{"0_Comment Submission": "[WWYD] You're solids.", "1_Text": "Tournament/league: roll the 3 in front of the 8. Low % though that you get close enough to be safe and not bump the 8 in.\n\nWith friends: jacked up force shot trying to cut the 3 and pull the cb away from the 8", "2_Subreddit": "billiards"}], "dwfku0h": [{"0_Comment Submission": "[WWYD] You're solids.", "1_Text": "Hand it off to your opponent. If the safety worked (3 on top of the 8, can’t make the 8 clean, to touch the 3 would make the 8) any intelligent player will pick up the ball and give it back to you and then it ends in a stalemate. If your opponent is a newb, they start making their balls and try something risky on the 8 and you might win.\n\nThe other scenario is there is some space between the 3 and 8 and your opponent might mess up position, foul, and you have just enough space to put the cue ball on the rail to shoot the 3.\n\nBasically, you’re just eliminating the chance of them getting out in a single inning and daring them to do roll the dice on making a premature 8.", "2_Subreddit": "billiards"}], "dwlriqx": [{"0_Comment Submission": "Can I get a opinion", "1_Text": "Was getting addicted to pills something you’d choose to do again? Cause h will just take it that much further.\n\nIf you read these threads, I’m sure you know how it changes things. For me, one critical component that no one mentions much is once you’ve done h, cold copped and really experienced street drugs and learn the lifestyle, you addiction can follow you anywhere. When I was doing pills, if I wanted to get clean, I could’ve just moved and bam, no connect, sweat it out and start fresh cause no access, no temptation. Out of sight, out of mind. But h is global. After I did it a while, I realized I could go anywhere in the English speaking world and score. So once you do it, your plan to get clean should you ever choose to needs to be truly not wanting it. Cause it will always be there. Real junkies can cold cop in the middle of the Alaskan wilderness I swear", "2_Subreddit": "opiates"}], "dwt2fxx": [{"0_Comment Submission": "Tiny, itchy, raised red bumps on arms, torso", "1_Text": "I have spontaneously developed roughly 10 of these extremely small, very itchy bumps. They’re not pimples, they itch too much for that. I’m 90% sure they’re not bug bites since I’d think they’d be bigger/redder. Any idea what these might be?\n\nhttps://imgur.com/gallery/h32kC\nhttps://imgur.com/gallery/UgrME\nhttps://imgur.com/gallery/xvTzb\nhttps://imgur.com/gallery/XMWag", "2_Subreddit": "Dermatology"}], "dwt3zkq": [{"0_Comment Submission": "I have had this on my palm for over a year now. Over the counter and 2 anti fungal prescriptions nada. HELP!", "1_Text": "I had this exact same thing. Same overpriced stuff from doc. Didn’t even work. My cure? COAL TAR.\nI think the brand name is psoriasin (sp?) but just go to any pharmacy and find the skin products section and find a cream with coal tar in it. It was a miracle for me. And it’s pretty cheap. It is a mild carcinogen so just keep it on your hands 😉", "2_Subreddit": "Dermatology"}], "dwuvbdw": [{"0_Comment Submission": "This is torture", "1_Text": "Just smelling kratom makes me gag. The only way I have ever found works\n\nBlender, ice cream, peanut butter, chocolate, milk, kratom\n\nStill disgusting but if I chug it and have a glass of OJ ready to kill the taste post-chug, I can down ~10-15 grams in about 30 seconds", "2_Subreddit": "opiates"}], "dww8ut3": [{"0_Comment Submission": "Sawn-off Lee-Enfield WWI meant for trench combat during WWI [540x405]", "1_Text": "There is an episode of Drugs Inc with a kid who has something like this. Literally a sawn off bolt action rifle in the hands of a coke-dealing bandana-sporting gangster l. A true American pirate", "2_Subreddit": "GunPorn"}]}], "1_submissions": [{"7yskae": [{"0_Title": "Need 2016 w-2s.", "1_Text": "160mg methadone. I got kicked out of my program. i remember doing what, before going in for MMT, would have been to me absurd amounts of dope, oxy, Benzos and nothing could touch the wds.", "2_Subreddit": "tax"}], "81chc6": [{"0_Title": "Looking for a 6th one huh", "1_Text": "160mg methadone. I got kicked out of my program. i remember doing what, before going in for MMT, would have been to me absurd amounts of dope, oxy, Benzos and nothing could touch the wds.", "2_Subreddit": "u_fruitytrollroll"}], "81ck1z": [{"0_Title": "\"27F with 5 bastards, 3 of their daddies in prison. Looking for a REAL man: minimum 6ft, $$$100k\"", "1_Text": "160mg methadone. I got kicked out of my program. i remember doing what, before going in for MMT, would have been to me absurd amounts of dope, oxy, Benzos and nothing could touch the wds.", "2_Subreddit": "u_fruitytrollroll"}], "89rxnr": [{"0_Title": "Tiny, itchy, raised red bumps on arms, torso", "1_Text": "160mg methadone. I got kicked out of my program. i remember doing what, before going in for MMT, would have been to me absurd amounts of dope, oxy, Benzos and nothing could touch the wds.", "2_Subreddit": "Dermatology"}]}]}]}