{"BadassAtreyu": [{"0_comments": [{"dcs9mas": [{"0_Comment Submission": "I'm a quadriplegic and I've been using exoskeleton recently. My physical therapist is holding me up so I don't fall because usually I have a walker in front of me. Just recently walked 826 steps", "1_Text": "I'm a physical therapist assistant. How new is this?! I've never seen it! & I'm in outpatient. You are badass!", "2_Subreddit": "pics"}], "dcsqvr3": [{"0_Comment Submission": "I've been bad........please roast me!!!", "1_Text": "Norman Bates killed & kept his grandmother too?", "2_Subreddit": "RoastMe"}], "dd4vamy": [{"0_Comment Submission": "Reddit, what's a genuinely hurtful comment you can't forget?", "1_Text": "I'm just existing, too. I know exactly how you feel.", "2_Subreddit": "AskReddit"}], "ddh1st7": [{"0_Comment Submission": "What's your favorite memory?", "1_Text": "I worked for 4 years in a 4 star hotel as a receptionist while in college that had a couple of bars in them & have some of the best memories there. I'd have to say that my favorite 1 would be having to work til midnight one night while crazy parties were going on & then come right back in at 8 am the next Sunday morning. I clocked in, put my  stuff in the back office, then decided to go use the restroom before night audit left. As I'm getting closer, a guy comes off the service elevator wearing his hat, shirt, socks, & shoes....no pants OR underwear. He's pulling his shirt down to cover his goods & runs into the women's bathroom. Couple of housekeeping ladies see this & we argue for a minute as to who should kick him out of the restroom, they go in & I stay out. This time he walks out more confident with all goods showing. I proceed to use the restroom, come out, & realize we need to find half-naked dude before our restaurant has breakfast customers come in & we also had a church using one of our convention rooms for service while their church was being renovated at the time. I'm looking on the cameras while housekeeping is searching floors. No sign of dude but they find his pants in front of room 1017 & believe he has vomited on them. Put em in a bag & they said when we see him that they offered to wash & dry his pants for him so the stinch wouldn't be bad on a drive home (not that he shouldve drove.) No sign from him from 8 am until he calls from room 617 around noon. He asks, \"this is a weird question, but have you seen my pants?\" Tell him I have em, pretty sure he puked on them & offered him a late check out so they could wash them. He declines & says he will have his friend come down to retrieve them as he can't since he obviously has no pants on. I tell him I've already seen it all anyway, but thank him for now being respectful to anyone else that may see him in such a condition. After he has his pants, he comes down while leaving & blatantly admits to pissing on himself because his pants are \"wet in the front & back.\" Dude doesn't care & goes home like that anyway not even remembering the few hours before. On Monday, I beg maintenance to unlock our camera system so I can see what the hell he did Sat night. We catch him standing in front of 1017 banging the hell out of the door (thankfully room was not rented out.) Must've pissed himself while standing there & bends over to pull it all off over shoes & all & moons the camera beautifully, then lays them in front of the door. About a minute later, another half-naked dude in a towel only is walking towards him to get a drink out of the soda machine & the awkward glares between them had me about to piss on myself. I've seen a lot of crazy stuff at that hotel from swinger conventions to crazy, traveling theater people drinking. But I'll never forget that guy.", "2_Subreddit": "AskReddit"}], "ddh1wgt": [{"0_Comment Submission": "Girls of reddit, what are the most common reasons behind why guys didn't make it past the first date with you?", "1_Text": "His favorite \"hard rock\" band, & best band of all time was Good Charlotte.", "2_Subreddit": "AskReddit"}], "ddyksvz": [{"0_Comment Submission": "People who go inside other people's houses to do work, what's the weirdest thing you've seen?", "1_Text": "I used to deliver pizza when I was right out of high school, I'm a woman by the way. 1 of weirdest things that pops in my mind is taking a delivery into the boonies of KY, 3 dudes are running around the house, all in just tight whitey underwear & are probably in the upper 40's/early 50's. Guy who answers the door invites me in, I step just across the line of the door & keep it open, ready to run just in case. They're drinking beer & have all kinds of lines of white powder they're snorting off the counter (coke? Pills? Im not sure.) & They're not trying to hide any of it. They ask to me to stay & party while looking for their pizza money & I obviously politely decline & run the hell out of there when I'm paid. Luckily, they were super nice & just having a good time.\n\nLater in life after graduating college, I'm doing home health in a really small KY town where all my houses are out in the boonies & about 90% of my patients live on welfare.  Have a stroke patient who is in a wheelchair & cannot walk & will never be able to walk. She can barely verbally communicate. House is disgusting because her husband sits around drinking all day & just sits & watches me work on his wife while bitching at me that I need to get her walking & doing more things because he wants to be able to do more with her, sexually, in the bedroom. Grossed me out & broke my heart for her. She did smile & nod her head yes when he brought it up so it seemed she was ok with the disgusting sex & didn't seem like rape. Was so happy to leave that town.", "2_Subreddit": "AskReddit"}], "ddykwji": [{"0_Comment Submission": "Girls of reddit, what are the most common reasons behind why guys didn't make it past the first date with you?", "1_Text": "Haha I do, I'm more in 36 crazy fits & such but the name is actually from the neverending story...I named my son after THAT Atreyu, not the band :)", "2_Subreddit": "AskReddit"}], "ddykyow": [{"0_Comment Submission": "Girls of reddit, what are the most common reasons behind why guys didn't make it past the first date with you?", "1_Text": "We were 21 years old :( This was back in 2007", "2_Subreddit": "AskReddit"}], "ddyl00j": [{"0_Comment Submission": "Girls of reddit, what are the most common reasons behind why guys didn't make it past the first date with you?", "1_Text": "Haha he was super cute too. What a waste :(", "2_Subreddit": "AskReddit"}], "dfxydlv": [{"0_Comment Submission": "Non-Americans who have been to the US: What is the most abnormal thing about America that Americans don't understand is odd?", "1_Text": "I, too, went to Marshall and have seen this!! Graduated in 2008.", "2_Subreddit": "AskReddit"}], "dgju03q": [{"0_Comment Submission": "What's the quickest way you've seen someone UN-fuck up their life?", "1_Text": "I took a year off after high school to figure out exactly what I wanted to do, as well. Saved me money from a year of bullshit classes trying to figure it out & even saved & paid for my 1st year myself! No one thought I would ever get back to school but I love nothing more than to prove people wrong :) Good for your brother!", "2_Subreddit": "AskReddit"}], "dgqyl2x": [{"0_Comment Submission": "Blue porn", "1_Text": "These are the best, plus m boxes. I always thought seeing a big variety of them in a bottle or baggie was such a pretty blue.", "2_Subreddit": "opiates"}], "dgrdwfe": [{"0_Comment Submission": "Have You Ever Worked in a Hospital? Is Everyone on Drugs? My Friend Claims They Are...", "1_Text": "I'm a medical professional in an outpatient setting & i use, but don't know own of anyone at my work who also uses. I know nurses who shoot up heroin & shit too. Love your translations. I could lay down & let you tell me bedtime stories every night.", "2_Subreddit": "opiates"}], "dgrwvtt": [{"0_Comment Submission": "Have You Ever Worked in a Hospital? Is Everyone on Drugs? My Friend Claims They Are...", "1_Text": "You're fuckin brilliant. Thank you :)", "2_Subreddit": "opiates"}], "dgt6ptm": [{"0_Comment Submission": "Hey Guys, Can We Do Another r/Opiates Demographic Survey", "1_Text": "1.) 31\n2.) KY\n3.) Roxicodone \n4.) Roxi's/xanax \n5.) IV\n6.) 17\n7.) White Female", "2_Subreddit": "opiates"}], "dlvd3ya": [{"0_Comment Submission": "1992. I was the most dangerous kid in 7th grade. Ear ring in west texas. Zomfg", "1_Text": "You would've been my first love.", "2_Subreddit": "blunderyears"}], "dn5pcqj": [{"0_Comment Submission": "FENTANYL WARNING - EVERYWHERE!", "1_Text": "I used to get blue H like a few months ago called \"blue magic.\" Good shit.", "2_Subreddit": "opiates"}], "ds67hwz": [{"0_Comment Submission": "1992. I was the most dangerous kid in 7th grade. Ear ring in west texas. Zomfg", "1_Text": "Neverending story. Not the band.", "2_Subreddit": "blunderyears"}], "dt6stgj": [{"0_Comment Submission": "My Roommate is accusing me of stealing $40, saying she's going to call the police and file a report -- I didn't steal anything. What are my options? [NYC]", "1_Text": "Im from a small town in KY where cops are usually bored & thrive on any call. Had a guy get pissed at me once for not having sex with him & went ballistic, called the cops & told them i stole like $100 cash from him & everything, which i didnt. Dumbass did leave a lot of voicemails which proved he was the liar because he couldn't keep his stories straight so I basically had my own proof he made it up,  but cop told me its really hard to prove cash was stolen unless theres video of it & there wasn't much they would've done without legit proof or evidence on his part. You should be fine. Sounds like she may have a drug problem though with difficulty paying bills and resorting to lies about money being stolen.", "2_Subreddit": "legaladvice"}], "dwtlqzs": [{"0_Comment Submission": "Would you have switched to heroin if oxys were still everywhere?", "1_Text": "I have always and will always prefer oxy 30's. Had a pretty high tolerance at one point but tried H out of curiosity and the fact that it was a lot cheaper, i always thought of it as \"dirty\" too. Shit was laced with fent and I OD'd for the first time in my life, 3 days in ICU. Thought I would never touch it again, but thanks to a car accident, the hospital got me majorly hooked on opiates. Ive done everything imaginable to get clean. Hardest thing in the world to do in my opinion. Now the pills are incredibly hard to find and so expensive because of their rarity that im strictly on H now. Even though I swore I would never touch it after my 1st episode. And Ive had several overdoses since and my dumbass still goes back. Dumbest thing the government could've done.", "2_Subreddit": "opiates"}]}], "1_submissions": [{}]}]}