{"jradrust": [{"0_comments": [{"dvalcam": [{"0_Comment Submission": "trying to act normal in public on LSD", "1_Text": "My friend had a tab at school once and it was about 150ug and the cop with dogs came in the room and he was to afraid to take it so I took it then two hours later had to drive home. I was watching the mph numbers grow and move around. Luckily it's a straight line home. Was not as hard as I though it would be.", "2_Subreddit": "LSD"}], "dvan6nx": [{"0_Comment Submission": "trying to act normal in public on LSD", "1_Text": "That's what I told him but he was about throw it away so I just decided to take it.", "2_Subreddit": "LSD"}], "dvct7uq": [{"0_Comment Submission": "thx JJ for letting it snow when i was hella dry and broke", "1_Text": "Nice", "2_Subreddit": "opiates"}], "dvi747k": [{"0_Comment Submission": "Paktong Opium Smoking Layout", "1_Text": "Same, former addict. Come to this sub to remind myself all the crazy shit that happens when you're an addict.", "2_Subreddit": "opiates"}], "dvi7ipg": [{"0_Comment Submission": "I think I might be a weirdo...", "1_Text": "I get an erection from oxy 80s and I occasionally  dream about them.  I don't even do opiates anymore though.", "2_Subreddit": "opiates"}], "dw2nxyb": [{"0_Comment Submission": "Dafuq is this?", "1_Text": "I'm going to say it is crystal meth", "2_Subreddit": "opiates"}], "dwa36a6": [{"0_Comment Submission": "Sorry mom", "1_Text": "That's why I'm there to.", "2_Subreddit": "trashy"}], "dwc1h5b": [{"0_Comment Submission": "What’s everyone’s favourite drug and why?", "1_Text": "Got to fucking love the addys", "2_Subreddit": "Drugs"}], "dwc29ju": [{"0_Comment Submission": "Sorry mom", "1_Text": "I know what you mean, I used to do my fair of stuff. Now I just smoke weed and take an addy once in a while. I really like reading the crazy stories because it reminds me why I don't want to go back to that life.", "2_Subreddit": "trashy"}], "dwc44n4": [{"0_Comment Submission": "For people who told their religious parents they were an atheist(preferably in high school), how did it go for you?", "1_Text": "I became atheist in 7th Grade. I went to school that day a good Christian. I came to my English class (I should probably mention I am in the bible belt of SC) and heard everyone arguing over the different types of Christianity: Protestant, Lutheran, etc. In that moment I  just thought to myself, this thing can't really be real if all these people are different types, so I made a big mistake and questioned religion. I asked them \"Do you think all of you could be wrong\" and I was labelled as a heretic from there on. In the heat of the moment of everyone screaming bible scenarios to me, I just blurted out \"I don't believe in any of this.\" So I went home and asked my dad who was a priest who had read almost every work of \"God\" and he said if you read it all it contradicts itself in every way so probably none of it was real. My mom was a complete bitch about it but my Dad stood up for me so it worked out well.", "2_Subreddit": "atheism"}], "dwe6wgj": [{"0_Comment Submission": "Lack of motivation after abusing Adderall", "1_Text": "I'm going through withdrawals right now and that's all I feel. Also tired as hell and very sore. I've had worse but still pretty bad.", "2_Subreddit": "Drugs"}], "dwe9s2d": [{"0_Comment Submission": "Lack of motivation after abusing Adderall", "1_Text": "Big thing is during withdrawal is not to think about any depressing things going on. I've had H withdrawal and that was a million times worse. The bright side with stimulant withdrawal is you'll occasionally get a little bit of euphoria and feel good for a while, but it still mostly sucks. I haven't taken it everyday, maybe twice a week. I have more and could easily do more but I have limited addiction tendencies now so I'll just wait a week to two weeks before taking again.", "2_Subreddit": "Drugs"}], "dweijyx": [{"0_Comment Submission": "Hey so what are some signs that you may have done a little to much heroine and shouldn’t snort another line?", "1_Text": "You're fine just got a little anxiety. Just hold off for a little while. Trust me you know for sure when you are overdosing. If you were oding you wouldn't have had time to write this. Your dope might just have a little bit of morphine or Codiene in It.", "2_Subreddit": "opiates"}], "dwej7q5": [{"0_Comment Submission": "Most ridiculous myth you've ever heard about acid?", "1_Text": "HPPD", "2_Subreddit": "LSD"}], "dwiesm3": [{"0_Comment Submission": "Opana", "1_Text": "What country you in because I've seen different dosed pills in different countries.", "2_Subreddit": "opiates"}], "dwk0i15": [{"0_Comment Submission": "I almost died recently but I didn't. I never lost my faith and now it's stronger than ever.", "1_Text": ">But you were stoned!\n\nI don't think you understand how overdoses work. You either fall asleep or you are having a panic attack but based on the context of it being peaceful, I am going to say he fell asleep.", "2_Subreddit": "atheism"}], "dwk1384": [{"0_Comment Submission": "I almost died recently but I didn't. I never lost my faith and now it's stronger than ever.", "1_Text": "Good for you getting out of the game. I myself do not do opiates or anything powdered because the risk of fentanyls are too high nowadays. It makes me happy to see people out of the game.", "2_Subreddit": "atheism"}], "dwk1y4f": [{"0_Comment Submission": "I almost died recently but I didn't. I never lost my faith and now it's stronger than ever.", "1_Text": "Drugs are good for some people but for most people they should just lay off. Like when somebody is considering suicide, I'd rather have them take something to feel good. When someone tells me they've never gotten high or intoxicated and they want to try it, I instantly advise them it is not a good idea. But Crack and Hookers sounds like a good combination.", "2_Subreddit": "atheism"}], "dwk280l": [{"0_Comment Submission": "I almost died recently but I didn't. I never lost my faith and now it's stronger than ever.", "1_Text": "Or on the same block.", "2_Subreddit": "atheism"}], "dwk5abo": [{"0_Comment Submission": "my addict headass", "1_Text": "I had taken 2 30mg addys after a day break from 3 30mg addys and was worried I overdid. Reading this made me feel much better.", "2_Subreddit": "Drugs"}], "dwl0i2e": [{"0_Comment Submission": "Can you sleep on meth?", "1_Text": "Yes, snorted about 30mg top quality clear, no tolerance, slept four hours later. Woke up, still high on Meth.", "2_Subreddit": "meth"}], "dwp6c6h": [{"0_Comment Submission": "Curious about Epinephrine injection when not needed", "1_Text": "Saw someone do it, they had a hell of a rush. Funniest thing I've ever seen. They said it fell like they just jumped out of an airplane.", "2_Subreddit": "Drugs"}], "dwp8qoa": [{"0_Comment Submission": "Going to college, dad made me promise to not use drugs", "1_Text": "Sounds to me like you will still use and that is acceptable as long as you don't let it ruin your grades. I think it is okay to still use as long as you don't spend more money than you can afford and don't let them distract you from what is important.", "2_Subreddit": "Drugs"}], "dwp9gdq": [{"0_Comment Submission": "Just completed 52 weeks of dosing.", "1_Text": "How do you feel?", "2_Subreddit": "LSD"}], "dwpf2fu": [{"0_Comment Submission": "A gram of South East Asian #4 China White", "1_Text": "Have you tried mixing it with Vape Juice?", "2_Subreddit": "opiates"}]}], "1_submissions": [{}]}]}