{"DopeDunDaily": [{"0_comments": [{"duw2wz1": [{"0_Comment Submission": "Cant get my Dillys or IR Morph for a few more days so went to my rainy day stash. Took 4mg of Klonopin & proceeded to Micron filter out 5x 50mg shots (1cc can't fit more then 50mg) not a bad Sunday considering im low and need to fill. Ate some cannabis gummies for a nice pain free feeling.", "1_Text": "Wierd so I was wrong and got 22's cuz I thought they had bigger pores but I pull it thru cotton first and it's been going thru the 22's just fine. I have to push fairly hard but it works. I do wait for the solution to get cold b4 I put it thru the micron filter, maybe that helps. I got them thru Amazon prime from biomedical scientific for $55 and that was next day shipping. I wish I knew about these filters years ago, the difference in my shots is massive, now they are always a clear Amber liquid and if I let the rig sit for a bit it doesn't collect solids along the bottom of barrel.", "2_Subreddit": "opiates"}], "duwgbeu": [{"0_Comment Submission": "Cant get my Dillys or IR Morph for a few more days so went to my rainy day stash. Took 4mg of Klonopin & proceeded to Micron filter out 5x 50mg shots (1cc can't fit more then 50mg) not a bad Sunday considering im low and need to fill. Ate some cannabis gummies for a nice pain free feeling.", "1_Text": "I think I'll get another 100 filters, 45's this time. Just cuz sum bth has a lot more particules and gunk to filter which probably won't go thru my smaller 22's. Never thought about back-loading and filtering thru a syringe like that, I'll have to try that sometime. One last question, you said you use saline and I also ordered sterile water in single use tubes but didn't see that it was a .9 saline solution. Can I use this water to cook up my shots with? Will the Hcl in the water be ok to IV with? Also the filters I've used have been made of nylon and PTFE.", "2_Subreddit": "opiates"}], "dvb9cu9": [{"0_Comment Submission": "Thought y’all might like this. Any other anime junky junkies out there?", "1_Text": "opiates_gonewild still up and killing it", "2_Subreddit": "opiates"}], "dvb9drs": [{"0_Comment Submission": "Thought y’all might like this. Any other anime junky junkies out there?", "1_Text": "r/opiates_gonewild", "2_Subreddit": "opiates"}], "dvqasgy": [{"0_Comment Submission": "Dear Kiddo...", "1_Text": "Google the facility he's in and it will have info on the phone service they use. Usually you just start an account connected to your phone number, calls can be $3 for 20 mins. It's a lot but being able to talk to the outs can keep a person sane. The jails Web page will also have info on how to add money to their books or if the facility only accepts i-care packages. If you gotta choose a package, pick coffee and more coffee, that's a necessity inside. And if ur a true homie, kick him down with sum flail mail.", "2_Subreddit": "opiates"}], "dvqbzkg": [{"0_Comment Submission": "Dear Kiddo...", "1_Text": "It's when u dissolve a bunch of meth in water, then take that water and spray it on a piece of paper, let dry and then write a letter on that piece of paper and mail to your incarcerated buddy. Who then eats pieces of ur letter and gets all flailed out in jail. It works with Suboxone water also. But I was just joking when I suggested it. Giving him sumone to call is probably the best thing you can do for him.", "2_Subreddit": "opiates"}], "dvqtnqx": [{"0_Comment Submission": "Dear Kiddo...", "1_Text": "Yes, the photo copied mail sucks. Only one jail does that with inmate mail in my area. The others have made it a little harder cuz they caught on to the kids drawing trick and won't deliver those letters. They also hold em up to the light to look for discolored areas, but they don't catch everything. And of course there won't be any spots if you just soak the entire piece of paper. I'm pretty sure this method works with any drug that's water soluble, so benzo's  and fent would be a go.", "2_Subreddit": "opiates"}], "dw52b9y": [{"0_Comment Submission": "I don’t know but I know I will try", "1_Text": "The lack of ibogaine treatment in this country, especially during our epidemic, is criminal. The government is wringing their hands in helplessness, proposing we execute drug dealers but you don't hear a single peep about ibogaine. It's not a miracle cure but would be a great tool to add to the heroin addiction treatment tool box. And the only reason it's not is purely economic; it can't be patented therefore no pharmaceutical company will pay for FDA approval because they won't make a financial killing. Pharma also hates that it's a single dose treatment and not ongoing like subs or done.", "2_Subreddit": "opiates"}], "dw5evoo": [{"0_Comment Submission": "Looks like we've got some friends at my local sushi joint.", "1_Text": "Whenever I see shit like this, I wonder if all they know about dope and being a junkie comes from movies (Permanent Midnight) & television? Like do they think it's the cool thing to do and all shooters are gross/disrespectful like this?", "2_Subreddit": "opiates"}], "dwaupic": [{"0_Comment Submission": "How to get your plug to come for a small amount (yes i know its kinda fucked up)", "1_Text": "Wow, I never woulda thought of doing this, what a criminal mastermind! Seriously, if ur dboy won't serve u under a certain amount then u gotta find a new one. And if he falls for this trick, u definitely need a new one, cuz he's dumb as fuck and will get popped soon and probably keeps a ledger with full names, addresses and physical descriptions of his clients.", "2_Subreddit": "opiates"}], "dwb2ku9": [{"0_Comment Submission": "How to get your plug to come for a small amount (yes i know its kinda fucked up)", "1_Text": "That sucks the guy with the best work is kinda a dick.  As someone that's been in this line of work b4, if you sell small, qtr's, balls, grams, u really shouldn't have a problem when a regular customer is low on cash and just needs a dub. I can't stand when dealers start to get big heads and act like 20 or 40 bucks ain't worth their time. Plus your profit margin on the small stuff is huge. Not to mention it's good karma, which is never a bad thing in this game. What region are you in? Is that $110 for tar or ecp?", "2_Subreddit": "opiates"}], "dwcwiny": [{"0_Comment Submission": "ECP in the west coast", "1_Text": "From everything u said and the stuff left in ur tooter, which was probably a ton of caked on powder, sounds like the stuff I've very recently been getting. It's a little different from normal gunpowder tar and comes on strong and makes you sleepier than most other tar does. I really like the stuff as do most other people that have got it. But if u have fent test strips, test ur stuff cuz every batch of it that I've picked up in the last few months has tested positive for fent, and I bet ur stuff will also.", "2_Subreddit": "opiates"}], "dwd51qu": [{"0_Comment Submission": "ugh screwed myself", "1_Text": "If u live close to any big city, just hit the shadier parts of town and ask any street kid or homeless dude u see. Or if ur not near a big city, find an escort/working girl and make a date. Usually they're more than happy to be paid to middle some drugs. Just be cool if the first people u ask can't help and then when u do get a hookup, be generous with whoever helped you out.", "2_Subreddit": "opiates"}], "dwd59gt": [{"0_Comment Submission": "When you cant cop...", "1_Text": "Drink and jerk it, repeat as necessary.", "2_Subreddit": "opiates"}], "dwgjdvy": [{"0_Comment Submission": "I got pulled over today..", "1_Text": "I will never understand how walking the dog around ur car to smell what's in the car isn't a search covered by the 4th ammendment. At least they did put some restrictions on this Bullshit, like u cannot be held longer than what it takes to complete the infraction you were pulled over for, in order to give the cops time to get a k9 unit on scene. Not that most pigs will give a fuck, after all seems like they get paid to violate our rights.", "2_Subreddit": "opiates"}], "dwgm4g2": [{"0_Comment Submission": "I got pulled over today..", "1_Text": "A recent Supreme Court ruling and it applies to all law enforcement agencies both federal and state. Mostly impacts state leo's cuz I don't know what federal agencies do traffic stops. But it basically means they can stop you for speeding but they only have the amount of time it takes to get ur info and issue the ticket to get the k9 on scene. Ideally they are not allowed to dick around and extend the time of a normal traffic stop waiting for fido to show up.", "2_Subreddit": "opiates"}], "dwgmfsp": [{"0_Comment Submission": "Retarded things / Horror stories from rehabs you have attended?", "1_Text": "That's what I always thought til I learned that the country with the highest rate of opiate addiction per capita is none other than Iran, like wtf, guess sharia law ain't the answer to addiction either.", "2_Subreddit": "opiates"}], "dwoawwy": [{"0_Comment Submission": "Drug taking loophole", "1_Text": "Did u get this posted in time to make April Fools in ur time zone? This is sum awesome junky logic and kinda sounds a lot like college to me.", "2_Subreddit": "opiates"}], "dwpxy0n": [{"0_Comment Submission": "Micron filters", "1_Text": "Amazon  prime has them, from Biomed Scientific. I order the 25mm/.22um, you get 100 for $55 and the shipping is free but you need to have a prime account. You mite also wanna order some single use saline from teleflex it's  $15 for a hundred of them. If ur gonna use nice filters you mite as well have good water. Biomed also offers ten packs of filters for around $10. You can also use .45um filters but make sure u order the 25mm, they fit the needles we use to inject.", "2_Subreddit": "opiates"}], "dwpz4i4": [{"0_Comment Submission": "Just saying people who shoot why post a pic of a needle or you shooting up no one what's to see that come on now", "1_Text": "You do know that the proper way to administer most drugs is IV?  I get that you don't wanna see it but on an opiate sub there's gonna be a lot of us who do. IV users on this site have helped me greatly in terms of harm reduction. Seeing what they use and what a properly filtered shot looks like has helped a lot of us. I've shot for 15 years and recently found this sub and have learned soooo much from IV posts. It's not cool to try and shame people for using the same drug you use but in a different way.", "2_Subreddit": "opiates"}], "dwq2eqy": [{"0_Comment Submission": "Just saying people who shoot why post a pic of a needle or you shooting up no one what's to see that come on now", "1_Text": "You keep saying ur not trying to offend but ur using words like gross, unsanitary, hep c, dirty spoons, blood splattered on walls and mirrors and equating a lack of self respect with needle usage. It's hard to not feel at least a little offended, especially when none of those images applies to me or most of the other shooters I know. Us, opiate addicts try hard to dispell the steroetypes of junkies and it's disheartening when a fellow addict propogates those same negative images.", "2_Subreddit": "opiates"}], "dwq444c": [{"0_Comment Submission": "Just saying people who shoot why post a pic of a needle or you shooting up no one what's to see that come on now", "1_Text": "I'm offended by a fellow addict spewing the same old sterotypes that stand in the way of people viewing addicts as everyday people deserving of a little compassion.", "2_Subreddit": "opiates"}], "dws2lwa": [{"0_Comment Submission": "Gay for opioids?", "1_Text": "Wow yo, a gay conservative, addicted to opiates and blowing a str8 dude...  How's that working out for you? The conservative thing?", "2_Subreddit": "opiates"}], "dwt589k": [{"0_Comment Submission": "In love with tar porn and now we've all seen a nice big chunk of it. I call this one, \"Dollars & Dope\". You guys wanna guess how much of each???", "1_Text": "It's $5500 and 100 grams of tar. I'm always surprised how dense bth can be. Got that old hundred a couple months ago, I like to think it has a good story behind it. Like maybe it came from a hidden stash off an old bank robbery.", "2_Subreddit": "opiates"}], "dwt68yj": [{"0_Comment Submission": "Would you have switched to heroin if oxys were still everywhere?", "1_Text": "I switched from OC's in 2004, that was way before they made OP's or started the crackdown. I know dozens of heroin addicts that switched back then and it was due to the price of the pills. Even at .50 cents a mg your tolerance eventually outpaces your wallet and heroin is a cheaper, stronger drug. I went from spending $100 a day and not getting high just keeping from being sick, to $40 a day for a gram of bth and getting high af. Heroin is much more expensive currently and a lot stronger, both of those things are due to the switch from OC's to OP's and the Rx crackdown. Hope this helps you out.", "2_Subreddit": "opiates"}]}], "1_submissions": [{"7hfve5": [{"0_Title": "School me on dilly's", "1_Text": "Wierd so I was wrong and got 22's cuz I thought they had bigger pores but I pull it thru cotton first and it's been going thru the 22's just fine. I have to push fairly hard but it works. I do wait for the solution to get cold b4 I put it thru the micron filter, maybe that helps. I got them thru Amazon prime from biomedical scientific for $55 and that was next day shipping. I wish I knew about these filters years ago, the difference in my shots is massive, now they are always a clear Amber liquid and if I let the rig sit for a bit it doesn't collect solids along the bottom of barrel.", "2_Subreddit": "opiates"}], "7ip394": [{"0_Title": "Relationship goals...", "1_Text": "Wierd so I was wrong and got 22's cuz I thought they had bigger pores but I pull it thru cotton first and it's been going thru the 22's just fine. I have to push fairly hard but it works. I do wait for the solution to get cold b4 I put it thru the micron filter, maybe that helps. I got them thru Amazon prime from biomedical scientific for $55 and that was next day shipping. I wish I knew about these filters years ago, the difference in my shots is massive, now they are always a clear Amber liquid and if I let the rig sit for a bit it doesn't collect solids along the bottom of barrel.", "2_Subreddit": "opiates"}], "7owhvf": [{"0_Title": "Lucky Number 69", "1_Text": "Wierd so I was wrong and got 22's cuz I thought they had bigger pores but I pull it thru cotton first and it's been going thru the 22's just fine. I have to push fairly hard but it works. I do wait for the solution to get cold b4 I put it thru the micron filter, maybe that helps. I got them thru Amazon prime from biomedical scientific for $55 and that was next day shipping. I wish I knew about these filters years ago, the difference in my shots is massive, now they are always a clear Amber liquid and if I let the rig sit for a bit it doesn't collect solids along the bottom of barrel.", "2_Subreddit": "HeroinHeroines"}], "7smi2u": [{"0_Title": "Dboy/Dgirl never on-time...maybe it's cuz sum junkies only hear what they wanna", "1_Text": "Wierd so I was wrong and got 22's cuz I thought they had bigger pores but I pull it thru cotton first and it's been going thru the 22's just fine. I have to push fairly hard but it works. I do wait for the solution to get cold b4 I put it thru the micron filter, maybe that helps. I got them thru Amazon prime from biomedical scientific for $55 and that was next day shipping. I wish I knew about these filters years ago, the difference in my shots is massive, now they are always a clear Amber liquid and if I let the rig sit for a bit it doesn't collect solids along the bottom of barrel.", "2_Subreddit": "opiates"}], "7t376m": [{"0_Title": "Fuck it, I'm asking for help finally", "1_Text": "Wierd so I was wrong and got 22's cuz I thought they had bigger pores but I pull it thru cotton first and it's been going thru the 22's just fine. I have to push fairly hard but it works. I do wait for the solution to get cold b4 I put it thru the micron filter, maybe that helps. I got them thru Amazon prime from biomedical scientific for $55 and that was next day shipping. I wish I knew about these filters years ago, the difference in my shots is massive, now they are always a clear Amber liquid and if I let the rig sit for a bit it doesn't collect solids along the bottom of barrel.", "2_Subreddit": "opiates"}], "7zka0e": [{"0_Title": "BTH prices", "1_Text": "Wierd so I was wrong and got 22's cuz I thought they had bigger pores but I pull it thru cotton first and it's been going thru the 22's just fine. I have to push fairly hard but it works. I do wait for the solution to get cold b4 I put it thru the micron filter, maybe that helps. I got them thru Amazon prime from biomedical scientific for $55 and that was next day shipping. I wish I knew about these filters years ago, the difference in my shots is massive, now they are always a clear Amber liquid and if I let the rig sit for a bit it doesn't collect solids along the bottom of barrel.", "2_Subreddit": "opiates"}], "87z9u0": [{"0_Title": "A little dope & dollars porn for the ladies", "1_Text": "Wierd so I was wrong and got 22's cuz I thought they had bigger pores but I pull it thru cotton first and it's been going thru the 22's just fine. I have to push fairly hard but it works. I do wait for the solution to get cold b4 I put it thru the micron filter, maybe that helps. I got them thru Amazon prime from biomedical scientific for $55 and that was next day shipping. I wish I knew about these filters years ago, the difference in my shots is massive, now they are always a clear Amber liquid and if I let the rig sit for a bit it doesn't collect solids along the bottom of barrel.", "2_Subreddit": "HeroinHeroines"}], "89mu86": [{"0_Title": "In love with tar porn and now we've all seen a nice big chunk of it. I call this one, \"Dollars & Dope\". You guys wanna guess how much of each???", "1_Text": "Wierd so I was wrong and got 22's cuz I thought they had bigger pores but I pull it thru cotton first and it's been going thru the 22's just fine. I have to push fairly hard but it works. I do wait for the solution to get cold b4 I put it thru the micron filter, maybe that helps. I got them thru Amazon prime from biomedical scientific for $55 and that was next day shipping. I wish I knew about these filters years ago, the difference in my shots is massive, now they are always a clear Amber liquid and if I let the rig sit for a bit it doesn't collect solids along the bottom of barrel.", "2_Subreddit": "opiates"}]}]}]}