{"gayfiremage": [{"0_comments": [{"dpvdszn": [{"0_Comment Submission": "Trying to clean your room with depression", "1_Text": "Are you me? Expect Lexapro gave me suicidal thoughts, like most antidepressants do for me. :(", "2_Subreddit": "starterpacks"}], "dpveicq": [{"0_Comment Submission": "Trying to clean your room with depression", "1_Text": "A lot of antidepressants give me bad side effects, Lexapro and Prozac gave me cold sweats combined with hot flashes, not fun. Besides for physical side effects, Prozac didn't seem to have much effect on my mental state. Lexapro, however, was scary as all hell. I hadn't experienced that level of suicidal thoughts since I was 13 and was forced into a mental ward for a 42 hour suicide watch (18 now). I tapered off with my doctor's help. I honestly rather have the mind numbing depression that I work on every day than medication induced breakdowns and a possible suicide attempt. But I'm glad that you found something that works for you, I hope I can too one day. Chemicals be weird.", "2_Subreddit": "starterpacks"}], "dpxg4l4": [{"0_Comment Submission": "This huge landslide.", "1_Text": "Thank God no one's house was under that", "2_Subreddit": "interestingasfuck"}], "dqbg2h4": [{"0_Comment Submission": "The Crested honey buzzard with a feast", "1_Text": "Ever notice how if an animal has the word 'honey' in it's name, it ends up being one of the most badass animals ever? Any animals that fucks with bees is a tough son of a bitch. Crested Honey buzzard dont care, it just TAKES what it wants", "2_Subreddit": "natureismetal"}], "dqbmtnz": [{"0_Comment Submission": "When real news are indistinguishable from The Onion articles", "1_Text": "Congrats Republicans, you played yourself", "2_Subreddit": "traaaaaaannnnnnnnnns"}], "dqk6ge6": [{"0_Comment Submission": "Something tells me they haven’t watched any of his videos", "1_Text": "A lot of franku's fans are gay or trans, so this isn't surprising at all. Lgbt people aren't all oversensitive snowflake strawmen, we can take a nice filthy joke too mang", "2_Subreddit": "FilthyFrank"}], "dqm3b31": [{"0_Comment Submission": "Almost all transgender employees experience harassment or mistreatment on the job, a new study shows", "1_Text": "Nice trolling dumbass", "2_Subreddit": "transgender"}], "dqrwf52": [{"0_Comment Submission": "Trevor is a boring character that is poisoning this show", "1_Text": "I don't like trevor either, I think he's lazily written and just a bland character. But can we please stop with the transphobia and 'isnt he actually a girl/the fact he has a vagina creeps me out' please? You can dislike a trans or gay character without falling into old rehashed homophobic shit. We get it, trans people make you uncomfortable, get over it and enjoy the show. Trevor is an awful character because he's badly written, not because he's transgender.", "2_Subreddit": "shameless"}], "dqskofj": [{"0_Comment Submission": "Trevor is a boring character that is poisoning this show", "1_Text": "Wat. I'm not talking about you OP. I'm talking about some of the comments on this sub that are just really...really horrible lol. Chillax. All I'm saying is every discussion on Trevor has people in it who say very transphobic things. How am I 'projecting' lol?", "2_Subreddit": "shameless"}], "dqzz3k1": [{"0_Comment Submission": "FCC Chair Ajit Pai Jokes In Video About Being A 'Verizon Puppet'", "1_Text": "Tell me, what do they think is going to happen if their plan does work?\n\nStep one: get the American people addicted to constant mind numbing, distracting entertainment so you can pass corrupt laws with minimal fallout\n\nStep two: take away that mind numbing, distracting entertainment\n\nStep three: ????\n\nStep four: mass protests, violence and civil unrest but hey! At least we made a profit!", "2_Subreddit": "politics"}], "dr58k5n": [{"0_Comment Submission": "In my case, the dentist can go fuck himself.", "1_Text": "I got my wisdom teeth out last year and my bitch ass surgeon gave me 30 tramadol and 10 Percocet 5s (had a tolerance to at least 40 mgs of oxy at that time), they were gone within the first four days and I was in so much pain, my cheeks were the size of a rodent's and I was crying from the constant intense pain. I went to the ER and they injected me with an anti-inflammatory and some morphine, sent me home with 10 more percs. That morphine injection was niiiiiiice after being in such pain for a week.", "2_Subreddit": "opiates"}], "drfg9aq": [{"0_Comment Submission": "Episode Discussion - Shameless - 8x07 \"Occupy Fiona\"", "1_Text": "Trevor's face after Fiona and Ian had that argument was exactly my reaction to how Ian is acting. \"Wtf is even going on anymore\"", "2_Subreddit": "shameless"}], "ds1p2wk": [{"0_Comment Submission": "I blasted off my new year by trying DMT for the first time and it was AMAZING", "1_Text": "I am still coming down off an transcendent 500ug LSD trip that kicked off my new year with a nice ego death to refresh me for the year to come. It's amazing the places these molecules can take us, to places far beyond human comphrension and description. It feels nice to be in on the Cosmic Joke for a change. Happy New year friend.", "2_Subreddit": "Drugs"}], "dsdd1eg": [{"0_Comment Submission": "Photoshopped my Lana cosplay to make it more accurate", "1_Text": "You know.....", "2_Subreddit": "ArcherFX"}], "dsksiko": [{"0_Comment Submission": "Didn't expect that much love from the other post here's another smile", "1_Text": "Sweet THICC boi", "2_Subreddit": "pitbulls"}], "dtjd9rx": [{"0_Comment Submission": "These are the rules for being added to one of those “modern alternative mama” groups.", "1_Text": "I was extremely lactose intolerant as a baby, and I needed special formula. If my mom had continued to breast feed me I would have been miserable and sick and vomiting all the time. So according to them, my mom should have let me be sick all the time and possibly do damage to my gastrointestinal system, because formula is 'unnatural'", "2_Subreddit": "vaxxhappened"}], "dtjeg4z": [{"0_Comment Submission": "Vaccines make babies gay in order to control population", "1_Text": "VACCINES👏ARE👏TURNING👏THE👏FROGS👏GAY👏", "2_Subreddit": "vaxxhappened"}], "dtn1g11": [{"0_Comment Submission": "Stripped naked and beaten: transgender women flee Indonesian city in fear", "1_Text": "I don't want to live on this planet anymore....", "2_Subreddit": "transgender"}], "dug96sh": [{"0_Comment Submission": "Found this little guy in my pita just now", "1_Text": "I found a little green caterpillar in my salad once and I went to tell my mom and she said \"eat it. Free protein.\" Can't eat salads to this day without thoroughly inspecting them", "2_Subreddit": "shittyfoodporn"}], "dunni8l": [{"0_Comment Submission": "Depression substantially reduced with multivitamin and getting Vitamin-D above 40 ng/ml", "1_Text": "Even if this study may be bunk/not fully fleshed out, I have treatment resistant major depression, I've tried every antidepressant they will prescribe me. I eventually stopped taking them because they would work for a few months then stop working, sometimes putting me in a worse place than before. So I decided to try some 'alternative\" medicine. I bought some extra strength vitamin D supplements and started going outside more often. I wouldn't say it cured my depression, but it definitely gave me better results than antidepressant medicine in my experience. I feel functional, not super happy or 100 percent normal again, but functional and not horribly bed ridden depressed. Combined with therapy it seems to help some, better than nothing.  I would like to see a more comprehensive study on vitamin D and how it effects depression. \n\nEdit: a word", "2_Subreddit": "science"}], "dut4s5t": [{"0_Comment Submission": "r/news has an informed and civil discussion about transgender issues... or lots of arguing over what is considered “doping” and the existence of “pronoun police”", "1_Text": "I don't think people understand that this isn't doping/juicing. People are woefully undereducated about hormone replacement. When someone goes through hormone replacement, they are replacing the hormones in their body at a natural level. A transgender boy taking testosterone perscribed by a doctor for their health and wellbeing has just as much testosterone in his body as a cisgender boy, this isn't steroids, it's HRT. Transgender boys are boys, let them compete with their own gender for gods sake. It's humiliating and unfair for both the transgender kid and the girls who have to wrestle with him because of their backwards state.", "2_Subreddit": "SubredditDrama"}], "dves1r4": [{"0_Comment Submission": "Idaho must allow transgender people to change birth certificate sex, court rules", "1_Text": "Good.", "2_Subreddit": "politics"}], "dw9h1e7": [{"0_Comment Submission": "Second. Best. Sign. Ever.", "1_Text": "What koolaid are you drinking my friend", "2_Subreddit": "TheSimpsons"}], "dwb92y2": [{"0_Comment Submission": "Fire Keeper Soul cosplay (Dark Souls III)", "1_Text": "I thought this was a highly realistic close up of an action figure it's so good. She nailed it.", "2_Subreddit": "gaming"}], "dwmvnn8": [{"0_Comment Submission": "Just out of curiosity", "1_Text": "White trans dude reporting in", "2_Subreddit": "opiates"}]}], "1_submissions": [{}]}]}