{"Btchnugget": [{"0_comments": [{"duh3ndp": [{"0_Comment Submission": "My old dboy - I filmed this music video about a month before everyone in it got arrested and went to jail", "1_Text": "Going to cop in the hood with nice shit is asking to get robbed. If not by a dealer definitely by a junkie in need of his next fix walking by the dope house. Almost too easy for a junkie in withdrawal that robs people for money without hesitation.", "2_Subreddit": "opiates"}], "dujy867": [{"0_Comment Submission": "This is the first full body picture I've taken showing my stumps. I find it pretty surreal to know that it's me. I wanted to share.", "1_Text": "Good on you for having such an optimistic outlook but I'd think your body would do anything to survive in a moment like this. The fact that you ignored all of the warning signs makes me believe you fell out on something?? This is like a guy on dope who falls asleep In a weird position and has to get amputated because of loss of blood and circulation. Id think the body was yelling at him to do something but when on dope you'll sleep through anything even the freezing weather.", "2_Subreddit": "pics"}], "dujz1w0": [{"0_Comment Submission": "This is the first full body picture I've taken showing my stumps. I find it pretty surreal to know that it's me. I wanted to share.", "1_Text": "I'm sensing the same thing you are. The body doesn't just go \"oh you don't want to do anything about it? Okay let's just let it rot\" he fell asleep HARD, hard enough to ignore frostbite. Tbh, I'd suspect alcohol or opiates/dope. I'm a user and know if you take too many pills or use too much dope you'll sleep through ANYTHING and in the worst positions.  It has to a be a third party substance.", "2_Subreddit": "pics"}], "dvd0mkr": [{"0_Comment Submission": "Well. If you insist.", "1_Text": "", "2_Subreddit": "opiates"}], "dvd0u35": [{"0_Comment Submission": "This stuff is so strong, this bun is about to last me like 4 days. Snowed in and content 🖤❄️", "1_Text": "Why are you here? You obviously have some sort of curiosity. You probably know someone possibly even family that take opiates and you'd never know unless they told you. We don't like the high horse bullshit here. Step down or bounce.", "2_Subreddit": "opiates"}], "dvd18af": [{"0_Comment Submission": "I've got a good idea for an excuse if you're pulled over in an area where you don't fit", "1_Text": "He means don't share secrets like that. The more people that know the bigger the chance they'll look out for that or even consider it a possibility. It is a genius plan though.", "2_Subreddit": "opiates"}], "dvd3fno": [{"0_Comment Submission": "I've got a good idea for an excuse if you're pulled over in an area where you don't fit", "1_Text": "To the top of the subreddit we go haha I don't think it's that big of a deal just a good spur of the moment cop out. It's one of those things that's brilliant and you want to share but itd be safer if you kept it to yourself so I understand where OP's intentions were trying to give tips.\nEdit:nvm it's been deleted. Good guy OP", "2_Subreddit": "opiates"}], "dvd4c1q": [{"0_Comment Submission": "Would you care for a flower my dear?", "1_Text": "I like this pic a lot! It seems so fitting that the best feeling in the world comes with the most dire consequences if not careful. Ying and yang type of deal. Not to forget the people that are not even dying from opium derivatives themselves but getting caught up in the pointless drug war and dying to it secondhand.", "2_Subreddit": "opiates"}], "dvdir4b": [{"0_Comment Submission": "My story...", "1_Text": "Yeah I smell a rat too :)", "2_Subreddit": "opiates"}], "dvditbh": [{"0_Comment Submission": "My story...", "1_Text": "sqqqquuealll oiink", "2_Subreddit": "opiates"}], "dve1m9f": [{"0_Comment Submission": "Never have as much fun sober - Shit post", "1_Text": "That's the trick. Sober life is so boring because when on drugs or going to cop your body is releasing chemicals it wouldn't normally while sober. You can stare at a wall while high and sober but while high its infinitely better cuz now your brain is producing extra chemical flow(dopamine, serotonin, endorphins). Sober will never compare cuz it can't. I use everything in moderation so I can appreciate both sides but being sober is supposed to be boring.", "2_Subreddit": "opiates"}], "dvy559e": [{"0_Comment Submission": "absolutelynotme_irl", "1_Text": "Try drugs.", "2_Subreddit": "absolutelynotme_irl"}], "dvyx9lh": [{"0_Comment Submission": "absolutelynotme_irl", "1_Text": "Yeah I'm talking actual drugs. I dabble with almost everything but anidepressants no way with those. I take opiates best antidepressant there is but usually comes with addiction. To me being addicted is better than being depressed. Hell I went into opiates knowing I will get pinned. Kinda speaks volumes on how bad depression can be.", "2_Subreddit": "absolutelynotme_irl"}], "dwcc38v": [{"0_Comment Submission": "Is there a such thing as Personal Finance for poor people?", "1_Text": "The only thing that's different in the methods between middle class or higher and lower class individuals is the amount of money you have to start saving or putting away money. All methods require budgeting your expenses to gauge how much money is going to certain things(bills, food, leisure, debt) and how much is being saved. Even though you may not have money to save it, you can use it to pay off other things that you wouldn't have had the money for otherwise. It all starts with budgeting your expenses and tracking spending and then relocating or allocating your money to where it needs to be(savings, 401k, property). Excel is excellent for tracking everything.", "2_Subreddit": "personalfinance"}], "dwd0lf6": [{"0_Comment Submission": "XXXTentacion violently assaults a woman [NSFW]", "1_Text": "I knew his positivity schtick was just a defense against his case. What a psychopathic little devil.", "2_Subreddit": "videos"}], "dwdpfpm": [{"0_Comment Submission": "Sergeant Tyler Ziegel's Wedding, October 2006. They were divorced by January 2007.", "1_Text": "Addicts mix those all the time, I've done it countless times. The triple threat death combo would be: benzos, opiates, and alcohol. Any decent amount of two of three of those is guaranteed to kill an average person with no tolerance. It's a mix of numbing emotions, forgetting/escaping reality, and alleviating depression, all at the same time(for the time being). I never took them deliberately to OD though. It just felt really good and my tolerance was pretty high for all three at the time+ depression for countless months. Im only speaking for myself here, but the more depressed you are, the more you push limits and boundaries(drugs, sex, gambling) cuz you dont really give a fuck. Xanax just adds to the stupidity and poor decision making skills. Don't try any of the above combos as they are super dangerous. He was definitely suffering severly with physical and mental scars. Maybe he blacked out on alcohol when he took his pain meds. I think they are both CNS depressants so your breathing becomes more shallow and you eventually doze off without waking up.", "2_Subreddit": "MorbidReality"}], "dwdqugc": [{"0_Comment Submission": "Prince died from 'exceedingly high' amount of fentanyl, experts say", "1_Text": "And you just doze off into permanent blissfulness.", "2_Subreddit": "Music"}], "dweax7x": [{"0_Comment Submission": "Prince died from 'exceedingly high' amount of fentanyl, experts say", "1_Text": "Heroin OD is probably the quickest and most painless way to go. You won't even know. Either you wake up from OD or you just don't. Don't do heroin tho!", "2_Subreddit": "Music"}], "dwebcb0": [{"0_Comment Submission": "Running doesn't get you high.", "1_Text": "Take another 15 and see what's up. There are opiate naive people in this world, which is probably the worst superpower ever. Don't let it be you haha", "2_Subreddit": "opiates"}], "dwec2o4": [{"0_Comment Submission": "When people just don't get the implications of having having a problem with shooting hard drugs [storytime/long ass post]", "1_Text": "sorry but that's pretty funny haha I had a serious baby face but facial hair and jaw came through.Maybe try growing a beard? :D (I know you're not male)", "2_Subreddit": "opiates"}], "dweh3qr": [{"0_Comment Submission": "Running doesn't get you high.", "1_Text": "That would be overkill. He did say he had no tolerance and I wouldn't just steer someone into bad territory like that come on.", "2_Subreddit": "opiates"}], "dwens7e": [{"0_Comment Submission": "Therapists of Reddit, what made you realize you were treating a sociopath?", "1_Text": "That's the normal thought process someone would go through who has been abused or gaslighted and is totally normal for you to react that way. Your narcissistic family has gaslighted you into questioning whether you took part in every little thing even though you know you were not the one to blame. It's like this: A narcissist has spent their whole life shifting blame everywhere but themselves and never admitting fault for their problems. They've gaslighted you so many times into thinking that you did something you didn't that sometimes you may think to yourself that \"hmm maybe I did do it\" and it makes you question your sanity and perception again. That's gaslighting and manipulation done by the Narcissist not by you(You never gaslit or manipulated so you can't be the narcissist). They want you to question everything cuz it'll make their next gaslight situation easier for you to believe. i don't know if that makes since, I'll try to find the video I watched on it.", "2_Subreddit": "AskReddit"}], "dwwt9dm": [{"0_Comment Submission": "Can the community give their input whether or not you guys think these are real?", "1_Text": "Real M boxes are a lighter blue from the rest and have light blue specs. The fake Ms I've seen were dark blue. They look pretty good", "2_Subreddit": "opiates"}], "dwxyjui": [{"0_Comment Submission": "First time OxyContin, how long before i feel shit lol", "1_Text": "Don't do what this guy is doing. Sugar pills came through this time lol", "2_Subreddit": "opiates"}], "dwycn56": [{"0_Comment Submission": "The boosting hussle", "1_Text": "You can't be hitting these spots more than a few times they will definitely catch on(if they haven't already).", "2_Subreddit": "opiates"}]}], "1_submissions": [{}]}]}