{"2stndz": [{"0_comments": [{"dwuhi12": [{"0_Comment Submission": "Doing lines off my phone in my work bathroom...", "1_Text": "its aka lit dawg.", "2_Subreddit": "Stims"}], "dwuhjsn": [{"0_Comment Submission": "The last of the Mohicans , will be gone by End of may😪", "1_Text": "niiiiiiice. biggest shard ive seen was 7gs", "2_Subreddit": "Stims"}], "dwwdv26": [{"0_Comment Submission": "Just Want to take a moment.", "1_Text": "Ive been there a bit but im not a huge fan of disprds set up. Like here you converse thru content of the post. Discord you got to make up content on the spot. Da fuck i look like, skinnyboytapdancing!? \n\nDoNT LooK AT mE \n\nLol. & proba wont be online as often for the next lil bit. Getting a lil bumpy. I aint got a roof tonight :( lol. Not the worst, I been crashing at places ever now n then. He real busy tho , i was going to be up tonifht anyway lol.\n\nYikes, some qould say its the meth! Bur honestly i was headed this way for years. Fuck the system. Eat trash. Dont produce it. Peace imma go find a spot to amoke a bowl.\n\nPs i fuxking hate moldile typing.", "2_Subreddit": "Stims"}], "dwwngzz": [{"0_Comment Submission": "Whats the point of doing lines?", "1_Text": "You are overthinking snorting your drugs man lol", "2_Subreddit": "Stims"}], "dwwnjj0": [{"0_Comment Submission": "Just because you’re PARANOID doesn’t mean they’re not out to get you.", "1_Text": "Fuck i know this , its a lyric guy. On the tip of my tongue. Now i am irritated.", "2_Subreddit": "Stims"}], "dwwnku9": [{"0_Comment Submission": "Just because you’re PARANOID doesn’t mean they’re not out to get you.", "1_Text": "Its a lyric for sure, i waa thinking nirvana too. But i can’t remember which song. Fuck.", "2_Subreddit": "Stims"}], "dwwsthw": [{"0_Comment Submission": "Official Free-For-All Thread week 13 -- April 02, 2018", "1_Text": "Yo fuck the casino. Anyone got 5 bucks?", "2_Subreddit": "Drugs"}], "dwwt228": [{"0_Comment Submission": "Official Free-For-All Thread week 13 -- April 02, 2018", "1_Text": "10 bucks for a dime is standard, some sell for 20 tho. Ive never seen higher but fuck id pay more if i was ensured it waa heroin :(\n\nSmoke it. Best way to gauge how high you get instantly. Snorting you will feel it in 10 but doesint peak until like 20-30 so can be decieving. Smoking u peak in under 2 mins. Dont use alone. Narcan.", "2_Subreddit": "Drugs"}], "dwwt7ci": [{"0_Comment Submission": "Official Free-For-All Thread week 13 -- April 02, 2018", "1_Text": "Sounds pre good. & it is lol. Heroin does have the potential to be a nasty addiction tho. That true", "2_Subreddit": "Drugs"}], "dwxmmqs": [{"0_Comment Submission": "Just because you’re PARANOID doesn’t mean they’re not out to get you.", "1_Text": "Lol I wouldn’t take one from you with that flare. Its ight losing to the casino took my mind off of it", "2_Subreddit": "Stims"}], "dwxpxme": [{"0_Comment Submission": "Addict sister wants to move in with me. I am willing to help but need to make sure she is off drugs and will continue to be. Anyone please help?", "1_Text": "Tbh you are expecting way too much, setting it up for failure. If you are going to get pissed & make it a problem as soon as she slips up. Then its not worth it to let her in, you wouldn’t be helping & you’d both be frustrated & stressed.", "2_Subreddit": "Drugs"}], "dwxusxh": [{"0_Comment Submission": "Just Want to take a moment.", "1_Text": "Been running on luck up til now. Almost wound up here at 18 , im a little more cofident with my chances now lol.\n\nBut im not really homless yet , me n my buddy have been looking 4 a place but this city is expensive as fuck. & all the fucking landlords are snobbs. So We havient gotten anything. We were 4 roomies, now  just two, makes it difficult. \n\nIm pretty much living out his car & hang round downtown when he got to work.  But im tired as fuck right now, chilling in a spot that got internet. Dozing, but fuck i dont want to sleep. People are fucking assholes, Too much traffic. \n\nGot to find a smoke spot.", "2_Subreddit": "Stims"}], "dwxuu97": [{"0_Comment Submission": "Just Want to take a moment.", "1_Text": "Lol hope this aint coming off hella dramatic either. Im well past hazy.", "2_Subreddit": "Stims"}], "dwy8enj": [{"0_Comment Submission": "I’ve got good friends!", "1_Text": "Almost went insane in a parking lot. Finally smoked a speed dragon & now im a bit better, charging my ipod in timmies.", "2_Subreddit": "meth"}], "dwy93wj": [{"0_Comment Submission": "im done", "1_Text": "Yeah i came to that conclusion about myself too. Its not a drug that jives well with me, sometimes you just have to realize & accept that not all drugs will suite your ways, rather work against you. I have always known i was more a heroin type, & i would benon that if it wernt all fent. Before becoming fed up & Frustrated with the fentty situation & quitting (for the most part). I never had the slightest interest in meth. Now its hard to keel my head straight without it.", "2_Subreddit": "Stims"}], "dwy9fec": [{"0_Comment Submission": "I’ve got good friends!", "1_Text": "Was pre shitty actually , & idisnt get high as id like to be. Im just good. Cause it was a pre open spot constant walking traffic but i had to do it to stop the insanity cycle.\n\nIm still really fuxking tired. My buddy whos car i plan to sleep in may be hours yet. Its super fucking weird walking downtown In the starts of sleep dep.\n\nNo they are not talking about you, you got to say to yourself constantly.", "2_Subreddit": "meth"}], "dwy9ucb": [{"0_Comment Submission": "How do people that use meth actually continue to get high and even in sleep deprivation they can get high?", "1_Text": "Yea its the sme aa you expirienced with addies but stronger. Youbget that stim still, & qith meth you will come to really see just how short 24 hours is. \n\nAs to why then? Its really something tou cant explain in anyway that would make sense. You have to expirience first hand. You are completely mentally & physically exhaused. You want sleep so bad but you just dont feel like sleeping.", "2_Subreddit": "Drugs"}], "dwya0x0": [{"0_Comment Submission": "Does anyone feel like they become a great acting critic when high on acid?", "1_Text": "I used to feel i was on weed. Lsd was a step further, you dont really critic cause you understand the directors morives & how the film is to be potreyed.\n\nBirdman on nbome was an excellent fuxking movies. Idk bout lsd but id bet its still good.", "2_Subreddit": "Drugs"}], "dwya4zw": [{"0_Comment Submission": "I’ve got good friends!", "1_Text": "Lol ill be sure to stuff sos into a bottle & throw into the sea. \n\nI wanted to sleep & would have had a known of a good spot to do so. You dont want to sleep where lots of people will pass you by.", "2_Subreddit": "meth"}], "dwybkvx": [{"0_Comment Submission": "How do people that use meth actually continue to get high and even in sleep deprivation they can get high?", "1_Text": "Hardly  , sure whwn rhe blast the pipe but exhausting takes right back over. Making another blast seem like a good idea. Cause althought exhausted still stimmed. & its just this weird deeling you get atuxk in the midsdle of. You want to sleep but you never want to go to bed. \n\nLike i said tho u got to exporience it to really know what it means & why we so it. Cause yea it sounds dumb lol", "2_Subreddit": "Drugs"}], "dwyc2eq": [{"0_Comment Submission": "\"Why don't you just smoke weed?\"", "1_Text": "Weed no where as good but it is helpful/better rhan nothing. You just got ro get super fuxkibf baked. Like couxh retard baked. Then it can be helpful , opiates will always be the best for pain tho. & the only option since im not really into weed anymore.", "2_Subreddit": "opiates"}], "dwyc93t": [{"0_Comment Submission": "I hate myself now", "1_Text": "I do all the drugs to defy oir dumb ass drug laws. Its my job as a civil citazen to show acts of defiance in order to change injust laws.\n\nDont u wanna be a weed warrior ? Lol", "2_Subreddit": "Drugs"}], "dwyeggn": [{"0_Comment Submission": "My lucky day", "1_Text": "Tbh all you can really do is wait out those 12 hrs without a redose after bout 36hrs i should be able ro sleep about 8 hours after your last redose. \n\nNo idea about xanies but tbh i feel look ke the meth would keep you conscience , & a bunch of xanies would just make tou blackout. & probably do more meth while blacked out", "2_Subreddit": "meth"}], "dwyehfj": [{"0_Comment Submission": "My lucky day", "1_Text": "Or , more meth.", "2_Subreddit": "meth"}], "dwyewij": [{"0_Comment Submission": "im done", "1_Text": "Im just addicted  i use to feel normal or alot to feel high. Which is only a fraction of what it used to be, but the annoying ass tweaks are so muxh worse when i get caught in them. Or the opposite, stuck in lack of action.\n\nBut yea if i dont have a hoot in awhile i start to feel more & more as if my gears are rusted. \n\nLike today i had only  like 3 hoots in a rush at like 930. (No where near high but functionable) then not until bout 730 & i wasnt smoking earlier cause i was in a open spot lots of foot traffic but i ended up james bonding that shit cause i was going fuxking insane (other factors involved not purely lack of meth) felt better. Went dis some shit & kust now smokes a nice full bowl speed dragon style & im feeling nice .", "2_Subreddit": "Stims"}]}], "1_submissions": [{"7su455": [{"0_Title": "The Builders and the Butchers - Bringin' Home the Rain", "1_Text": "its aka lit dawg.", "2_Subreddit": "DrugsMusic"}], "82f802": [{"0_Title": "Fuck, I miss November.", "1_Text": "its aka lit dawg.", "2_Subreddit": "NightOwls"}], "82h4sc": [{"0_Title": "What a nice score she was.", "1_Text": "its aka lit dawg.", "2_Subreddit": "u_2stndz"}], "831min": [{"0_Title": "Bammo Gzz aka Uncle Bammo - Shadowboxin", "1_Text": "its aka lit dawg.", "2_Subreddit": "DrugsMusic"}], "8352te": [{"0_Title": "Oh Please God No! Don't do it!", "1_Text": "its aka lit dawg.", "2_Subreddit": "Drugs"}], "83jiaf": [{"0_Title": "Rehab - Bartender", "1_Text": "its aka lit dawg.", "2_Subreddit": "DrugsMusic"}], "83zmb5": [{"0_Title": "Johnny Hobo And The Freight Trains - Whiskey is my Kind of Lullaby", "1_Text": "its aka lit dawg.", "2_Subreddit": "DrugsMusic"}], "84mp1k": [{"0_Title": "Mac Miller - Days (hiphop/instrumental/melodic)", "1_Text": "its aka lit dawg.", "2_Subreddit": "WNOD"}], "84ms2o": [{"0_Title": "Atlas - isn't here (hiphop/whiteboy-rhymes) [Disregard terrible outro]", "1_Text": "its aka lit dawg.", "2_Subreddit": "WNOD"}], "84ov3v": [{"0_Title": "Cancer bats - Pray for darkness (Metal)", "1_Text": "its aka lit dawg.", "2_Subreddit": "NightMusic"}], "85pwet": [{"0_Title": "Ludacris - Cold Outside", "1_Text": "its aka lit dawg.", "2_Subreddit": "DrugsMusic"}], "85qylj": [{"0_Title": "Vince Staples - Sizzurp", "1_Text": "its aka lit dawg.", "2_Subreddit": "DrugsMusic"}], "867xtq": [{"0_Title": "idk how I been feelin' Vince staples - Martin Ruger King", "1_Text": "its aka lit dawg.", "2_Subreddit": "u_2stndz"}], "86cne2": [{"0_Title": "Cursed - Another day (metal)", "1_Text": "its aka lit dawg.", "2_Subreddit": "NightMusic"}], "86p98x": [{"0_Title": "Cancer Bats - Pneumonia Hawk", "1_Text": "its aka lit dawg.", "2_Subreddit": "DrugsMusic"}], "86yvk0": [{"0_Title": "Why cough syrup is trash.", "1_Text": "its aka lit dawg.", "2_Subreddit": "drugmemes"}], "870ni7": [{"0_Title": "Written for myself / personal shit", "1_Text": "its aka lit dawg.", "2_Subreddit": "Dreams"}], "87773b": [{"0_Title": "Modest Mouse - Dramamine", "1_Text": "its aka lit dawg.", "2_Subreddit": "DrugsMusic"}], "87k2oj": [{"0_Title": "fucked around with the light to make it stand out.", "1_Text": "its aka lit dawg.", "2_Subreddit": "drugpics"}], "889no8": [{"0_Title": "lil grump- keep your distance (stupid whore) [prod. bobstar]", "1_Text": "its aka lit dawg.", "2_Subreddit": "DrugsMusic"}], "88a7oj": [{"0_Title": "Blue Raspberry Hoots.", "1_Text": "its aka lit dawg.", "2_Subreddit": "meth"}], "88ber7": [{"0_Title": "Bad Skin -- All the Drugs [Punk] (2017) {Xpost r/listentothis}", "1_Text": "its aka lit dawg.", "2_Subreddit": "DrugsMusic"}], "88zzn8": [{"0_Title": "speed Dragons", "1_Text": "its aka lit dawg.", "2_Subreddit": "Stims"}], "89aw44": [{"0_Title": "System Of A Down - Stealing Society", "1_Text": "its aka lit dawg.", "2_Subreddit": "DrugsMusic"}], "89l3ju": [{"0_Title": "Just Want to take a moment.", "1_Text": "its aka lit dawg.", "2_Subreddit": "Stims"}]}]}]}