{"docta_nigga": [{"0_comments": [{"dmupnzg": [{"0_Comment Submission": "There's still hope for California. Pop-up 9/11 memorial in West Sacramento this morning.", "1_Text": "It's a beautiful sight", "2_Subreddit": "The_Donald"}], "dn5dkff": [{"0_Comment Submission": "You've heard of Elf on the Shelf, Now get ready for...", "1_Text": "Piglet on a niglet?", "2_Subreddit": "redacted"}], "dnaz0to": [{"0_Comment Submission": "They say he who laughs last, laughs loudest.....", "1_Text": "What movie is this from this meme always crack me up", "2_Subreddit": "The_Donald"}], "dnmc98r": [{"0_Comment Submission": "Sup muthafuckas! Ron Perlman here. Don’t be shy- Ask Me Anything!", "1_Text": "You're the fuckin man Ron, you smoke lot or just cigars?", "2_Subreddit": "IAmA"}], "dno2nww": [{"0_Comment Submission": "Everyday", "1_Text": "Docktur niqqa here was good", "2_Subreddit": "opiates"}], "dnobjiy": [{"0_Comment Submission": "My name is James T Hodgekinson, I am an anti-Trump democrat and 4 months ago shot up a Republican congressman with the intention of killing him", "1_Text": "Look at that schnoz holy shit", "2_Subreddit": "The_Donald"}], "dnubk91": [{"0_Comment Submission": "US gun fans. Looking at Vegas; please explain a baffled European how it is so many of you believe 'more guns' is the answer?", "1_Text": "Machine guns are banned in all 50 states of America. This guy didn't kill over 50 people with a LEGAL handgun or a LEGAL semi, he had acquired 8 ILLEGAL fully automatic assault weapons. You can do this in any corner of the world. Yes, even in the U.K., OP", "2_Subreddit": "AskReddit"}], "dnxs3kr": [{"0_Comment Submission": "My bf just broke up with me. 😕 (F)", "1_Text": "Haha for real. Everyone else here is \"oh he must've been gay or you're too good for him\" and I'm sitting here thinking like shit I wouldn't be a with a chick posting pics of her naked body all over Reddit either", "2_Subreddit": "gonewild"}], "dq26onh": [{"0_Comment Submission": "Love this billboard", "1_Text": "I have a picture of that same exact billboard in my state lol and did the same thing", "2_Subreddit": "The_Donald"}], "dqz721w": [{"0_Comment Submission": "Still to this day, one of the greatest gaming experiences I've ever had. The nostalgia in this picture is amazing.", "1_Text": "To this day I believe this is debatably the greatest game I’ve ever played", "2_Subreddit": "gaming"}], "drgxk9u": [{"0_Comment Submission": "Why The Grinch Stole Christmas", "1_Text": "That was fantastic lol", "2_Subreddit": "opiates"}], "drqllgd": [{"0_Comment Submission": "Oh. My. God. Fucking Jingle All the Way", "1_Text": "You’re on the wagon a little late but this has since my birth (94) been the only Christmas movie I’ve ever given a shit to watch.”she’s slept with everyone in the post office, BUT ME!!”", "2_Subreddit": "movies"}], "ds9uyqe": [{"0_Comment Submission": "New International Poster for Richard Linklater's 'Last Flag Flying' - Staring Bryan Cranston, Steve Carell, and Laurence Fishburne", "1_Text": "As quietly ANTI TRUMP as they come? This is supposed to be an advertising point?", "2_Subreddit": "movies"}], "dsh0deh": [{"0_Comment Submission": "Did any of you realize he said this?", "1_Text": "Cosmic black comedy they’ve unfurled on America? Enlighten me, oh wise one", "2_Subreddit": "redacted"}], "dtf9oyv": [{"0_Comment Submission": "What’s always portrayed unrealistically in movies?", "1_Text": "Can confirm", "2_Subreddit": "AskReddit"}], "dtkz76e": [{"0_Comment Submission": "I walked out of the State of the Union speech when the chants of “USA!” started. I prefer: “Venezuela! Venezuela! Venezuela!” Describe me in three words.", "1_Text": "Bitch ass nigga", "2_Subreddit": "The_Donald"}], "ducn43d": [{"0_Comment Submission": "Trying to get into WoT", "1_Text": "I killed the series in three months, I loved it. Would highly recommend reading it if you have the time. As far as taking breaks goes, I feel that’s more personal preference. Personally, I think it’d be easier to read it all continuously without breaks. There’s a lot of content that you might forget waiting an extended period of time between books.", "2_Subreddit": "WoT"}], "dv4yupg": [{"0_Comment Submission": "Any Pokémon fans? Solid team? Playing this while on an oxy 🤤", "1_Text": "Man how’re you playing that on your phone?", "2_Subreddit": "opiates"}], "dvdg9t4": [{"0_Comment Submission": "Just finished a Wheel of Time series.", "1_Text": "“ ‘insert stupid shit here’ But no. Not Matrim Cauthon”", "2_Subreddit": "books"}], "dvje5jr": [{"0_Comment Submission": "(F) Do she got da butt? She dooo", "1_Text": "God damn, she do", "2_Subreddit": "opiates_gonewild"}], "dwc48qg": [{"0_Comment Submission": "An Iranian teacher visits his cancer-stricken student every day to catch him up on what he missed at school.", "1_Text": "They only wanna point out a middle eastern persons country of origin and or nationality when they’re doing something decent, not when they commit acts of terror", "2_Subreddit": "pics"}], "dwfcs5y": [{"0_Comment Submission": "Have we reached peak cognitive dissonance? Or is there still further to go?", "1_Text": "I love the Jurassic Park look she’s got goin on", "2_Subreddit": "The_Donald"}], "dwot6ef": [{"0_Comment Submission": "Lost my job of 4 years--the one thing is was proud of in my life", "1_Text": "A wise man once told me when you’re at rock bottom, the only way you can go is up. I know your pain and it will change with time. Set your sights on something that truly matters to you (other than getting high) and work for it. You can do it!!", "2_Subreddit": "opiates"}], "dwozru2": [{"0_Comment Submission": "My wife is deathly afraid of snakes so I got her last year by placing a rubber Copperhead in her glove compartment.", "1_Text": "Me too", "2_Subreddit": "Jokes"}], "dwp0uoj": [{"0_Comment Submission": "Just a little something to brighten up your day!", "1_Text": "So retarded that it’s funny", "2_Subreddit": "aww"}]}], "1_submissions": [{"7vrwph": [{"0_Title": "[SPOILER] AMoL ending", "1_Text": "It's a beautiful sight", "2_Subreddit": "WoT"}]}]}]}