{"mimikyu13": [{"0_comments": [{"dte11rd": [{"0_Comment Submission": "What is your favourite, ‘Let that sink in,’ fact?", "1_Text": "I believe the statistic is how many times it takes to leave the relationship and not go back. Can definitely see it as truth, it took two or three more break ups after my best friend was hospitalized by her ex before she left him for good. I’m so happy she’s free from that monster.", "2_Subreddit": "AskWomen"}], "dtge1uh": [{"0_Comment Submission": "I too went to Dallas Regionals", "1_Text": "Very impressive!", "2_Subreddit": "pkmntcgcollections"}], "dtgi6xa": [{"0_Comment Submission": "NC renaissance fair (x post from r/cringeanarchy)", "1_Text": "!RedditSilver", "2_Subreddit": "trashy"}], "dthqjc0": [{"0_Comment Submission": "Is anyone else scared/anxious to read your messages?", "1_Text": "I get this, especially Facebook messages.", "2_Subreddit": "bipolar"}], "dtlp782": [{"0_Comment Submission": "What is something your pet does that makes you fall in love with them all over again?", "1_Text": "It’s summer here and usually my puppy wakes me by jumping on my face and chewing on my hair. The last few days have been cooler and this morning he climbed under the blankets and curled up next to me.", "2_Subreddit": "AskWomen"}], "du1wrc5": [{"0_Comment Submission": "4u or friends", "1_Text": "Tamagotchi friends is by far the worst release to date. The screen display are so bad it's barely playable. Get another phone and enjoy your 4u, they are like $35 off eBay.", "2_Subreddit": "tamagotchi"}], "du3fb9n": [{"0_Comment Submission": "4u or friends", "1_Text": "I much prefer the mix, I've played it for months where as I got bored with the 4U after two days. There is no English patch for them.", "2_Subreddit": "tamagotchi"}], "dudn5vu": [{"0_Comment Submission": "Having a harder time with this than I thought.", "1_Text": "I’m at 8 months since I quit daily and it’s just started to get really hard. It’s a long road", "2_Subreddit": "StopSpeeding"}], "dudp2r1": [{"0_Comment Submission": "I have the 1997 Tamagotchi and I was wondering if it was normal for it to get really needy around the 2 week mark?", "1_Text": "The poorer care characters also die quicker", "2_Subreddit": "tamagotchi"}], "dufblw5": [{"0_Comment Submission": "Oh, wow", "1_Text": "Thank you", "2_Subreddit": "tumblr"}], "duhezmn": [{"0_Comment Submission": "Mixing with different M!x Versions", "1_Text": "Yes all mixes are compatible with each other. Enjoy!", "2_Subreddit": "tamagotchi"}], "duigrj6": [{"0_Comment Submission": "StopSpeeding Wiki & New Year Check-in", "1_Text": "It’s going along ok, still clean but some weeks are much harder than others. Still waiting on my energy to come back.\nI know what you mean about food, this must be what bears getting ready for hibernation must feel like lol.", "2_Subreddit": "StopSpeeding"}], "duinp7y": [{"0_Comment Submission": "What do you wish you knew before starting therapy?", "1_Text": "That it’d take ten years before I got a correct diagnosis. See a psychiatrist early if you’re considering meds.", "2_Subreddit": "AskWomen"}], "duiv1bf": [{"0_Comment Submission": "Shining Mew", "1_Text": "Don’t do it!", "2_Subreddit": "PokemonTCG"}], "duix0gb": [{"0_Comment Submission": "New lows on the bathroom floor", "1_Text": "A couple of years ago I made a cwe in preparation for an early morning flight, unfortunately I added cordial to the mix to make it quicker to drink just before the cab came. The sugar attracted some friends, I found 4 baby cockroaches drowning in the mixture.... with my friends packing in the other room I didn’t think twice, I quickly scooped them out and downed the glass.", "2_Subreddit": "opiates"}], "duj08dk": [{"0_Comment Submission": "What is wrong with me (Opiates cured Anxiety)", "1_Text": "It’s not a permanent fix to your problem, otherwise it’d be prescribed for anxiety. eventually your tolerance will take away that relief you get....unless you have unlimited funds. For the last 2-3 years of my addiction I’d get anxiety relief for maybe 20 mins a day. \n\nThe longer you use the worse your anxiety will get when you don’t use. Please keep looking for a better alternative.", "2_Subreddit": "opiates"}], "duj7753": [{"0_Comment Submission": "StopSpeeding Wiki & New Year Check-in", "1_Text": "Oh thank fuck for that. I was terrified it was going to last forever, my 75 year old grandma can run circles around me at the moment. I’m also giving up a long love affair with codeine. Been on a slow taper that’s nearly over. I think that’s really taken a toll on things too. If I can get through this week without relapsing then I have a shot at getting thru this.\n\nThank you for checking in on me, I really appreciate it. :)", "2_Subreddit": "StopSpeeding"}], "dujcfpy": [{"0_Comment Submission": "New lows on the bathroom floor", "1_Text": "Haha, not quite....girls can be gross too you know.", "2_Subreddit": "opiates"}], "dur23c2": [{"0_Comment Submission": "what is this mixes spring update bout? and how do i get it", "1_Text": "It’s from the anniversary gift mix, nothing to do with stations", "2_Subreddit": "tamagotchi"}], "dur25wl": [{"0_Comment Submission": "Does F-phenibut increase libido like normal phenibut?", "1_Text": "Ooooh! This sounds like a great alternative. I’ve been wondering what to do once my stash runs out", "2_Subreddit": "phenibut"}], "dwcf3m7": [{"0_Comment Submission": "Panic attacks.", "1_Text": "I’m about 6 months in and the anxiety is debilitating. Makes it hard moving forward. I’m hopimg it will pass but I has bad anxiety before I started using so we’ll see.", "2_Subreddit": "StopSpeeding"}], "dwcf5ou": [{"0_Comment Submission": "How hard is it to use a Japanese Tamagotchi as an English speaker?", "1_Text": "You can get English ocean but they very expensive. Japanese tamas are easy to use, don’t be shy :)", "2_Subreddit": "tamagotchi"}], "dwkhko7": [{"0_Comment Submission": "FOUND MY POLLY POCKETS AT MY PARENTS’ HOUSE! 1991 represent!", "1_Text": "You often see them on eBay :)", "2_Subreddit": "nostalgia"}], "dwkn9d4": [{"0_Comment Submission": "Bladder pain?", "1_Text": "I really don’t think the internet can diagnose an issue like that. Please see a doctor.", "2_Subreddit": "phenibut"}], "dwnloyn": [{"0_Comment Submission": "105 Days Clean", "1_Text": "Good luck!", "2_Subreddit": "opiates"}]}], "1_submissions": [{"7rp27h": [{"0_Title": "Was playing with my old virtual pet and this made me think of you guys <3", "1_Text": "I believe the statistic is how many times it takes to leave the relationship and not go back. Can definitely see it as truth, it took two or three more break ups after my best friend was hospitalized by her ex before she left him for good. I’m so happy she’s free from that monster.", "2_Subreddit": "opiates"}]}]}]}