{"pawssanova66": [{"0_comments": [{"dwulh2k": [{"0_Comment Submission": "Biggest cringe moment of all times?", "1_Text": "so uncomfortable", "2_Subreddit": "rupaulsdragrace"}], "dwuulsu": [{"0_Comment Submission": "Blow dryer advice please", "1_Text": "I just bought that BaBylissPRO Nano Titanium Dryer, and was not impressed. I was surprised because it has good reviews, and my old BaByliss was awesome. But it's just weak and gets insanely hot.  I'm going to be returning it to either get my old BaByliss again, or the Rusk Speed Freak. That one is $119, but man is it STRONG. My old one is the BaBylissPRO Porcelain Ceramic Carrera2 Dryer, for $74.95. It's nice and strong, but just be careful with the switches, because they're the ones you push up and down, as opposed to buttons you flip. Mine snapped off, but I've managed to superglue it and keep it working, lol.", "2_Subreddit": "HaircareScience"}], "dwuvhkz": [{"0_Comment Submission": "Full coverage foundation for blotchy, dry skin", "1_Text": "Agreed. I love her videos and I keep wanting to try this. I don't understand why Walgreens doesn't sell their OWN brand in their stores though. Why is it online only?", "2_Subreddit": "Makeup"}], "dwuyqm4": [{"0_Comment Submission": "Blow dryer advice please", "1_Text": "I occasionally had to clean out lint from the back, yes. But it was still my favorite hairdryer I ever had. And as you can see, I'm doing whatever I can to make it last (superglue). The annoying thing about the Rusk is that I kept hitting the buttons while I was holding it. The plus to the push switches on the BaBylissPRO Porcelain Ceramic Carrera2 Dryer is that I never accidentally hit them and change the settings, cause you have to actually PUSH them up and down to move them and change the settings.\n\nIf you're looking for a super strong, convenient hairdyer, I would get the BaBylissPRO Porcelain Ceramic Carrera2 Dryer. It was way more powerful than the Titanium one, and it's a few bucks cheaper.", "2_Subreddit": "HaircareScience"}], "dwvegs6": [{"0_Comment Submission": "Old-man-dog Lucky is probably gonna be sent over the rainbow bridge before too long. My heart is broken. 13 years old. He was a trooper but now he looks defeated. Rest easy pupper", "1_Text": "I always say, the only horrible part of owning a pet, is the time you have to eventually say goodbye to them. Everything else is happy memories and pure love. <3", "2_Subreddit": "OldManDog"}], "dwvicym": [{"0_Comment Submission": "Asexual or Low Libido?", "1_Text": "I'm having the same exact problem. There's someone in my life who I would pretty much be 100% compatible with, if sex wasn't an issue. He's my best friend, I could see a future with him, even having kids. But since I never want sex, it won't work.", "2_Subreddit": "asexuality"}], "dwviyqb": [{"0_Comment Submission": "When your friend tells you he got percs but follows it with \"but you're not getting any\".", "1_Text": "No, he got them from a guy at work who happened to have a procedure done and gave him the rest of his prescription. A once in a while kind of thing.\n\nHe knows I would do them in a heartbeat, and I told him I would def buy them off him if he decides he doesn't want them. But he's probably just gonna keep them \"just in case\" he wants them. Meh...it's been so long since I've had anything. It would have been fun just to have a couple for a good weekend.", "2_Subreddit": "opiates"}], "dwvj0oj": [{"0_Comment Submission": "When your friend tells you he got percs but follows it with \"but you're not getting any\".", "1_Text": "We used to date. I bet if we were still dating he would share. :-|", "2_Subreddit": "opiates"}], "dwvjk3f": [{"0_Comment Submission": "When your friend tells you he got percs but follows it with \"but you're not getting any\".", "1_Text": "Yea, he shouldn't have bothered telling me...he knows I've been on the hunt for percs for a long time.", "2_Subreddit": "opiates"}], "dwvjpmd": [{"0_Comment Submission": "When your friend tells you he got percs but follows it with \"but you're not getting any\".", "1_Text": "Lol. We've actually been on/off for a long time now. If I did that, it would open up another can of worms allll over again. \n\nI wouldn't even care if he charged me double at this point, I just want some lol.", "2_Subreddit": "opiates"}], "dwvsp1a": [{"0_Comment Submission": "When your friend tells you he got percs but follows it with \"but you're not getting any\".", "1_Text": "Yeah. We actually never banged. Hence why we aren’t together anymore lol. \n\nBut yea. He was prob trying to make me jealous on purpose.", "2_Subreddit": "opiates"}], "dwwtq26": [{"0_Comment Submission": "Asexual or Low Libido?", "1_Text": "I think he understands that I'm just not a very sexual person at all. But I feel bad because he is more affectionate and likes to cuddle and do those things. But I can't give that to him, and I don't want to deprive him of that.\n\nI don't necessarily think I'm asexual, I think I'm just aromantic. Because I've had dates with one or two guys that I was very sexually attracted to. I think I just don't feel that way towards him. \n\nWe've been on and off for a long time now, because I'm always never sure how I feel about him. Sometimes I think that I will eventually find someone that I DO have those sexual feelings towards. But I never know, because I've never had good sex or been with a guy that I felt \"lusty\" towards. \n\nI have no clue what  I am or what I want, lol. It's quite frustrating. :-\\", "2_Subreddit": "asexuality"}], "dwwu1nw": [{"0_Comment Submission": "Post Episode Discussion Post, Friday Morning Edition - April 06, 2018", "1_Text": "I'm sorry, and I know I'm prob gonna be downvoted to hell for this, but I cannot deal with The Vixen. I've dealt with people like her in real life. People who WAIT for drama to happen, who THRIVE on arguing and tension. They were the bullies in high school, who I was always tense around and always worried about them starting a fight with me.\n\nCall it dramatic, whatever. But she just makes me so angry. While I do agree that Aquaria would poke at her and then run away, you can tell Vixen was LIVING for it when Aquaria came for her. \n\nShe also never pads and just looks like skinny boy in a flimsy, tiny piece of fabric. Bye girl.", "2_Subreddit": "rupaulsdragrace"}], "dwwunhg": [{"0_Comment Submission": "Post Episode Discussion Post, Friday Morning Edition - April 06, 2018", "1_Text": "While I loved hearing her story, I think she might have spent too much time talking, and not enough time painting lol. \n\nI really felt for her hearing her story, though. That's just so sad. Glad she is finally happy in life.", "2_Subreddit": "rupaulsdragrace"}], "dwwwpr2": [{"0_Comment Submission": "S10E03 - Tap That App [Untucked Discussion]", "1_Text": "I probably should have took my comment from the other post, since most of The Vixen's antics were in Untucked.\n\nBut The Vixen makes me angry and uncomfortable. I can't stand people who THRIVE on drama, arguing and tension. She reminds me exactly of the bullies in highschool that I was always nervous around because they would constantly start fights and WAIT for a reason to pick on someone or start a fight.\n\nI do agree that Aquaria needs to stop poking then running away from the argument, and she clearly has some growing up to do. Their arguments are just hard to watch. Aquaria cries once she has nothing to fight back with, and The Vixen starts throwing out race? \n\nThe Vixen can try to say people are \"coming for her\" and that she has a \"reason to fight\". But she's just giving herself the image that she is so worried about portraying. Stop pressing the arguments all the time and let shit go. Like the other girls were saying, try to adapt to your surroundings a little. You can tell she was just LIVING FOR IT when Aquaria threw shade at her because she thrives on fighting.\n\nUgh, I can't stand her, sorry. She's just an angry, bitter person.", "2_Subreddit": "rupaulsdragrace"}], "dwwxhti": [{"0_Comment Submission": "Post Episode Discussion Post, Friday Morning Edition - April 06, 2018", "1_Text": "Aquaria is definitely young and immature, and has alot of growing up to do. But I was livinggg for that runway look.", "2_Subreddit": "rupaulsdragrace"}], "dwwxno8": [{"0_Comment Submission": "Post Episode Discussion Post, Friday Morning Edition - April 06, 2018", "1_Text": "There was a girl in one of my classes in high school that would be purposely intimidating and wait for any moment to start with someone. She never started with me, but she made me so tense that I had to switch classes. Because I constantly wanted to go OFF on that bitch. She was such a bully.\n\nVixen reminds me of her in a lot of ways. Just brings back those memories. Ugh.", "2_Subreddit": "rupaulsdragrace"}], "dwwycq4": [{"0_Comment Submission": "S10E03 - Tap That App [Untucked Discussion]", "1_Text": "It was so cringy towards the end of their argument. Aquaria starts to fake cry, and Vixen brings up race. It's hard to watch when people do the lowest shit to try to make their argument valid.", "2_Subreddit": "rupaulsdragrace"}], "dwwyw5x": [{"0_Comment Submission": "S10E03 - Tap That App [Untucked Discussion]", "1_Text": "I agree that Aquaria started fake crying once she had no defense. I don’t agree with either side. \n\nRace has nothing to do with it. Vixen clearly thrives on fights and that’s what bothers me.", "2_Subreddit": "rupaulsdragrace"}], "dwwzmyn": [{"0_Comment Submission": "S10E03 - Tap That App [Untucked Discussion]", "1_Text": "I would be just as annoyed if a white girl was doing the same thing.\n\nPeople who thrive on tension like Vixen does, get under my skin. Regardless of skin color.", "2_Subreddit": "rupaulsdragrace"}], "dwx0jog": [{"0_Comment Submission": "S10E03 - Tap That App [Untucked Discussion]", "1_Text": "Everyone's giving me shit for my comments on Vixen (but then deleting their comments), but this is so true. She just wants to keep attacking and never letting the argument die. Then when she's afraid she'll look like the stereotypical \"angry black woman\", she pulls the race card because she has no defense left. And I'm not defending Aquaria either, she started crying once she realized she had nothing relevant to say.\nI don't get why Vixen is so abrasive and then flips out when people tell her she needs to tone it down. You can see her face light up whenever someone says anything remotely shady, even if it has nothing to do with her (Cracker and Aquaria drama). She waits for moments like that to happen so she can butt herself in and fight about it. It makes my skin crawl.", "2_Subreddit": "rupaulsdragrace"}], "dwx0xux": [{"0_Comment Submission": "S10E03 - Tap That App [Untucked Discussion]", "1_Text": "This is what I've been trying to say too, but literally everything comes across as \"rascist\" to most people.\n\nVixen is putting herself into the \"angry black woman\" bubble by her own doing. She had already defended herself when Aquaria first came for her about the wig. Defend yourself, then let it go. But then she had to keep pressing and say \"that wasn't funny\" when Aquaria made the joke. She WANTED to keep fighting with Aquaria.", "2_Subreddit": "rupaulsdragrace"}], "dwx15m6": [{"0_Comment Submission": "S10E03 - Tap That App [Untucked Discussion]", "1_Text": "Vixen was practically jumping up and down with excitement during their argument. I just said in another comment - she had already defended herself when Aquaria came for her about the wig. But then she had to keep going and say \"that wasn't funny\" when Aquaria made the joke. The argument was over at that point, and she still wouldn't let it go. Because she's the type of person who thrives on tension.", "2_Subreddit": "rupaulsdragrace"}], "dwxj9ab": [{"0_Comment Submission": "My beautiful girl is 17 this year", "1_Text": "She looks amazing for her age!", "2_Subreddit": "seniorkitties"}], "dwxo5wr": [{"0_Comment Submission": "In case you needed another reason to avoid TSR...", "1_Text": "I pay for TSR (I know). Does anyone know if it does this if you pay? Haven't had a chance to look on my home computer yet. If it still gives you ads with a VIP membership, I'm leaving.", "2_Subreddit": "thesims"}]}], "1_submissions": [{"7iyq6b": [{"0_Title": "Game randomly not saving my Saved Outfits?", "1_Text": "so uncomfortable", "2_Subreddit": "thesimscc"}], "7jlthb": [{"0_Title": "Sims 4 Studio - when downloading newest version, do you uninstall the old one?", "1_Text": "so uncomfortable", "2_Subreddit": "thesims"}], "7mpb02": [{"0_Title": "Anyone ever try Rapidlash for eyelashes/eyebrows?", "1_Text": "so uncomfortable", "2_Subreddit": "HaircareScience"}], "7nv9kf": [{"0_Title": "Smoking weed during prep for colonoscopy?", "1_Text": "so uncomfortable", "2_Subreddit": "CrohnsDisease"}], "7nvcdl": [{"0_Title": "Smoking weed during prep for colonoscopy?", "1_Text": "so uncomfortable", "2_Subreddit": "ibs"}], "7pwxnp": [{"0_Title": "Using percs before anesthesia?", "1_Text": "so uncomfortable", "2_Subreddit": "opiates"}], "7rld0z": [{"0_Title": "Seeing Lana Del Rey on Sunday at Wells Fargo, at the same time as the Eagles game...should I forget about it?", "1_Text": "so uncomfortable", "2_Subreddit": "philadelphia"}], "7rv8yl": [{"0_Title": "THC Oil pen not hitting well/burnt taste", "1_Text": "so uncomfortable", "2_Subreddit": "Marijuana"}], "7rvb1r": [{"0_Title": "THC Oil pen not working? Burnt/chemical taste", "1_Text": "so uncomfortable", "2_Subreddit": "trees"}], "7rvcz1": [{"0_Title": "THC Oil pen not hitting/burnt chemical taste.", "1_Text": "so uncomfortable", "2_Subreddit": "vaporents"}], "7rvey6": [{"0_Title": "TCH Oil pen not hitting/burnt chemical taste", "1_Text": "so uncomfortable", "2_Subreddit": "oilpen"}], "7rvgza": [{"0_Title": "[Beginner] THC/oil pen not hitting/burnt chemical smell?", "1_Text": "so uncomfortable", "2_Subreddit": "vaporents"}], "7utbuq": [{"0_Title": "Random chest pains/constant lump in throat", "1_Text": "so uncomfortable", "2_Subreddit": "HealthAnxiety"}], "7xcgug": [{"0_Title": "Popular gameplay mods slowing down my game", "1_Text": "so uncomfortable", "2_Subreddit": "thesims"}], "7xl6rq": [{"0_Title": "How to go about seeing a registered doctor for medical marijuana?", "1_Text": "so uncomfortable", "2_Subreddit": "Marijuana"}], "81mq4u": [{"0_Title": "No options to use Archaeology table?", "1_Text": "so uncomfortable", "2_Subreddit": "thesims"}], "84dmlo": [{"0_Title": "Looking for syringes and empty cartridges for standard 510 battery pen?", "1_Text": "so uncomfortable", "2_Subreddit": "oilpen"}], "84dpnz": [{"0_Title": "Looking for syringes and empty cartridges for standard 510 battery pen?", "1_Text": "so uncomfortable", "2_Subreddit": "saplings"}], "85o1ic": [{"0_Title": "What a badass chick", "1_Text": "so uncomfortable", "2_Subreddit": "trashy"}], "863jwf": [{"0_Title": "Just bought my first batch of products from The Ordinary - need help on a routine", "1_Text": "so uncomfortable", "2_Subreddit": "SkincareAddiction"}], "863rvu": [{"0_Title": "[Routine Help] Just bought 3 products from The Ordinary - need suggestions on a routine", "1_Text": "so uncomfortable", "2_Subreddit": "SkincareAddiction"}], "86kfuo": [{"0_Title": "[Routine Help] Tried some things from The Ordinary for the first time, now makeup isn't sitting right.", "1_Text": "so uncomfortable", "2_Subreddit": "SkincareAddiction"}], "89k6if": [{"0_Title": "[Routine Help] Mario Badescu Drying Lotion - apply before or after putting on moisturizer/oils?", "1_Text": "so uncomfortable", "2_Subreddit": "SkincareAddiction"}], "89ql02": [{"0_Title": "[Product Question] - Sunday Riley Luna Sleeping Night Oil - how do you use with other products?", "1_Text": "so uncomfortable", "2_Subreddit": "SkincareAddiction"}], "8a3dia": [{"0_Title": "When your friend tells you he got percs but follows it with \"but you're not getting any\".", "1_Text": "so uncomfortable", "2_Subreddit": "opiates"}]}]}]}