{"cruisewithmebaby": [{"0_comments": [{"cr21gah": [{"0_Comment Submission": "Ecuador Moves to Decriminalize All Illegal Drugs", "1_Text": "Ecuador! I thought they already tolerated possession of small amounts of drugs. Like a g of coke, 1/4 of weed, etc. \n\nWhen I was down there, a quarter of weed cost me 30$, however a gram of fishscale cost me $15. Fucking amazing place! Check out Montanita if you wanna party in Ecuador. Drugs and parties everywhere and every night. It's like the cabo of Ecuador, but so much better than cabo. It's not as westernized and is a cultural melting pot. People visit from Europe, other countries in South America, Mexico, Australia, and the US.", "2_Subreddit": "Drugs"}], "cr21ilf": [{"0_Comment Submission": "Ecuador Moves to Decriminalize All Illegal Drugs", "1_Text": "IDK about that one. Montanita this the place to be for drug tourism in Ecuador. Parties everywhere, very easy to get drugs, and not to mention cheap fishscale coke. \n\nI must say, since so many foreigners visit Montanita, that drug tourism has been occurring even before this decriminalization happened in Ecuador.", "2_Subreddit": "Drugs"}], "cr21kew": [{"0_Comment Submission": "Tame Impala on MDMA?", "1_Text": "YES! If you can get a hold of some LSD I'd say mix the LSD with the MDMA and see Tame Impala. Saw them at Coachella this year on that combo and it was the highlight of the festival for me. You will be in pure bliss", "2_Subreddit": "Drugs"}], "cr21pdz": [{"0_Comment Submission": "Have any of you noticed any changes in your cognition from drug abuse?", "1_Text": "Yes I don't feel as cognitively sharp as I did before really getting into drugs. I feel stupider for sure. \n\nI think the main drugs that caused this is a daily weed habit, taking too much LSD and mushrooms, but mainly MDMA. I have only rolled about 20 times, but can notice a huge difference in my cognitive ability. Still to this day. I am just beginning a break from these drugs. I started rolling 4 years ago, same with the psychedelics. Ketamine has also kind of messed with my cognitive thinking. I just dropped LSD last night, however I have taken a year off MDMA before and 9 months off of psychedelics. I noticed a recovery in my cognitive functioning forsure, however not quite back to 100% of what it was.", "2_Subreddit": "Drugs"}], "cr24lem": [{"0_Comment Submission": "Tame Impala on MDMA?", "1_Text": "Not at all actually, as long as you keep the cid lower tha 200ug. The MDMA really synergizes with the LSD and I really feel that it's impossible to have a bad time unless something heavy happens in your environment. I'd way rather candyflip at a show than just LSD alone. It will take all the stress outta the LSD experience in a large crowd and replace it with happiness and love", "2_Subreddit": "Drugs"}], "cr2ba3c": [{"0_Comment Submission": "Have any of you noticed any changes in your cognition from drug abuse?", "1_Text": "I've done it for 7 years. It definitely doesn't help. I'm in a constant daze/haze when I smoke everyday. I think so much more clearly when I take a break from weed. But for some reason that's hard for me to do hhahah", "2_Subreddit": "Drugs"}], "cr31r4y": [{"0_Comment Submission": "Newbie question about Klonopin", "1_Text": "exercise helps my anxiety, because it makes me feel good about myself. It builds up my self confidence, which makes me a bit less anxious. \n\nI'm surprised you only got 20 0.5mg of k-pins AND you were having panic attacks. I never have had a panic attack, just social anxiety. It's making me question my psych, because he wrote me a script for 60 1mg kpins with 2 refills. and he knows I used to have a drug problem a couple of years ago. \n\nJust don't take em everyday so you don't become dependent on them. That's what I do, and I'm just left with an absurd amount of klonopin, which I feel is good to have on hand for when I truly need them. \n\nBe careful with benzos, but since you only have 20 0.5 mg I feel that if you don't take them everyday, you won't have a problem when it comes to addiction. Just don't go seeking out benzos on the street and you'll be good. Best of luck to you", "2_Subreddit": "Drugs"}], "cr6xga4": [{"0_Comment Submission": "LSD and Lamotrigine", "1_Text": "I'm on lamotrigine as well, and it doesn't affect my LSD experiences at all. I would suggest taking it while you're tripping, just to be sure that it won't affect the trip if you were taking it before. Everyone's body chemistry is different. I personally have taken it before I dose and noticed no effect on my trip. Definitely meditate for that good headspace hahah", "2_Subreddit": "Drugs"}], "cr6xl9a": [{"0_Comment Submission": "Tame Impala on MDMA?", "1_Text": "I've dosed 75ug for a candy flip and still felt it. I would definitely recommend dosing the MDMA at least an hour after you drop the L. Remember that L lasts for a long time, I usually do a booster dose of MDMA about 5-6 hours in and it hits hard, right back to the peak.", "2_Subreddit": "Drugs"}], "cr6xopb": [{"0_Comment Submission": "Tame Impala on MDMA?", "1_Text": "Yeah I feel it definitely fries your brain more than MDMA alone. I usually drop ~100ug to start and wait about an hour or two. Then I eat 100mg MDMA and vibe for a few hours. About 5-6 hours in I'll eat another 100mg MDMA and that has me going for the rest of the festival/show. 12+ hour experience forsure with this combo.\n\nMaybe you're taking too much MDMA or not enough L. I've never had the roll completely take over, they just synergize into pure bliss for me.", "2_Subreddit": "Drugs"}], "cr6xuey": [{"0_Comment Submission": "Newbie question about Klonopin", "1_Text": "Well exercise releases endorphins (your body producing/releasing natural opiates) which is another reason why you feel so good after exercise. \n\nI feel you on the psychiatrist pushing shit on you. They misdiagnosed me with depression and pushed SSRI's on me. The deal was SSRI's or rehab, fucking bullshit. Made me manic, filled with rage, and numb(like no empathy for anything). I ended up cold turkeying off that shit, 6 months later diagnosed with bipolar II. \n\nStay safe man! benzos are deceiving. I take them like 5 times a week, but low doses like 1-1.5 mg kpins. I have no idea if I'm physically dependent on them or not yet.", "2_Subreddit": "Drugs"}], "cr8bsvw": [{"0_Comment Submission": "Combining psychedelics and opioid agonists?", "1_Text": "A couple years ago I took 15mg roxycodone while 5-6 hours into a LSD trip and it was absolute bliss", "2_Subreddit": "Drugs"}], "cr8eb82": [{"0_Comment Submission": "Combining psychedelics and opioid agonists?", "1_Text": "That classic warm euphoria you get from opiates mixed with kaleidoscopic visuals from the LSD. I was at a festival, and was seeing the Red Hot Chili Peppers. I swear I was seeing rainbow energy coming off of Flea's bass. \n\nHonestly, if I had regular access to opiates, I would do this combo more often. It's the mixture of the 'feel great' from both opiates and LSD. Funny, now when I nod on opiates alone (with weed of course) I get psychedelic visuals in my nods. CEV and OEV.", "2_Subreddit": "Drugs"}], "crm80x0": [{"0_Comment Submission": "Anyone up? I'm having a bad trip.", "1_Text": "good call man! it will definitely help. earlier this month I dosed some LSD and 6 hours in decided to take a huugeee bong rip even though my tolerance is super low nowadays. I started losing my grip of reality and started getting bad/panic vibes. The Office was fucking perfect. took me right outta that mindset, and I enjoyed the rest of my trip", "2_Subreddit": "Drugs"}], "crm81qi": [{"0_Comment Submission": "Substances for Public Speaking anxiety? Dosages?", "1_Text": "I'm already addicted to drugs, so fuck it. Bad mindset, I know, but I'm an addict and ok with that for now.", "2_Subreddit": "Drugs"}], "crn0sb0": [{"0_Comment Submission": "Got prescribed Temazepam for insomnia. Opinions? Stories?", "1_Text": "Best benzo hands down for me. It's a hypnotic, a totally different feel from the rest of benzos. I would take 30-45mg and be in pure bliss. I'm on klonopin now and it is nowhere close to the feeling of temazepam. That shit is too good. Be careful with it. I had a script for a year or so. \n\nI always resisted sleep on it. The best words to describe it is \"comfortably numb\". At my peak I took 45mg with 1 mg of xanax and I was literally crawling on the floor. Cherish it though man, it's hard to come by.", "2_Subreddit": "Drugs"}], "crn1i66": [{"0_Comment Submission": "Can cats tell you're tripping?", "1_Text": "My cat always fucking knows something is up when I'm tripping. He gets all anxious and shit, anxiously cleans himself, won't stop meowing. I swear he just observes me. I was tripping face and I see him looking at me out of the corner of my eye. I look at him and he does that thing when you awkwardly make eye contact with someone and try and look away casually. It was SO weird. He is afraid of me. He won;t let me pet him, but he will lick me. Sometimes it bugs me out with the constant meowing ahhaha", "2_Subreddit": "Drugs"}], "crpnrm7": [{"0_Comment Submission": "Was this a dangerous combination?", "1_Text": "try it on LSD and then tell me that. Or any psychedelic for that matter", "2_Subreddit": "Drugs"}], "crpnsc5": [{"0_Comment Submission": "Was this a dangerous combination?", "1_Text": "yeah, I really should. Logical mind says I should, addict and mentally ill mind says do drugs whatever they are. Who the fuck cares if I overdose and die", "2_Subreddit": "Drugs"}], "crpnt09": [{"0_Comment Submission": "Was this a dangerous combination?", "1_Text": "Thanks man! I'm considering tapering off in the near future. Temazepam though, I'd love to go out on a bang with those. The best shit ever", "2_Subreddit": "Drugs"}], "crpok5f": [{"0_Comment Submission": "Another is this dangerous thread, with some personal info as well", "1_Text": "Thanks man, it's hard to get the motivation to start my hobbies again. But just trying to take it day by day", "2_Subreddit": "Drugs"}], "crpoxs7": [{"0_Comment Submission": "Another is this dangerous thread, with some personal info as well", "1_Text": "You are spot on. I need to grow some balls and get out of this hole. We are only here on this blue marble for a short amount of time. I know logically I should do this. You're inspiring me man, I gotta start taking action (like I've told myself dozens of times)", "2_Subreddit": "Drugs"}], "dww2j3n": [{"0_Comment Submission": "Kratom sucks!!!", "1_Text": "Kratom is maintenance unless you've never taken an opiate before. It can help slightly with cravings by tickling those opiate receptors. But you won't get high off of it.", "2_Subreddit": "opiates"}], "dww2l24": [{"0_Comment Submission": "Holy Trinity, last of my OC 80, charlie rock and 2× 2mg clonazepam", "1_Text": "Fuck I miss OC 80s so much", "2_Subreddit": "opiates"}], "dww7h4z": [{"0_Comment Submission": "Just relapsed after almost 10 months clean", "1_Text": "If I knew the answer to that question, I wouldn't be an addict. It's hard when I've accomplished so much for myself that on paper it really should look like why would I ever go back. \n\nYeah I'm much happier now. But I still think about using in a fond way. Pandora's box can never be closed. \n\n\nI've explained dope to people as imagine you are walking around an airport that never seems to end. You are carrying you heavy suitcase with you and dragging it everywhere you go nonstop. Then one day, you realize that you can put the suitcase down for a few hours. That is what heroin has always felt like to me.\n\nTrust me, I know I made a stupid decision. Temptation is like no other when it comes to dancing with the devil", "2_Subreddit": "opiates"}]}], "1_submissions": [{"2yn0j9": [{"0_Title": "High dose opiate experience, little tolerance", "1_Text": "Ecuador! I thought they already tolerated possession of small amounts of drugs. Like a g of coke, 1/4 of weed, etc. \n\nWhen I was down there, a quarter of weed cost me 30$, however a gram of fishscale cost me $15. Fucking amazing place! Check out Montanita if you wanna party in Ecuador. Drugs and parties everywhere and every night. It's like the cabo of Ecuador, but so much better than cabo. It's not as westernized and is a cultural melting pot. People visit from Europe, other countries in South America, Mexico, Australia, and the US.", "2_Subreddit": "Drugs"}], "358mbo": [{"0_Title": "150 ug LSD experience, once a fat bong rip was added to the equation, things got intense. Trip Report (Long)", "1_Text": "Ecuador! I thought they already tolerated possession of small amounts of drugs. Like a g of coke, 1/4 of weed, etc. \n\nWhen I was down there, a quarter of weed cost me 30$, however a gram of fishscale cost me $15. Fucking amazing place! Check out Montanita if you wanna party in Ecuador. Drugs and parties everywhere and every night. It's like the cabo of Ecuador, but so much better than cabo. It's not as westernized and is a cultural melting pot. People visit from Europe, other countries in South America, Mexico, Australia, and the US.", "2_Subreddit": "Drugs"}], "8a5rwt": [{"0_Title": "Just relapsed after almost 10 months clean", "1_Text": "Ecuador! I thought they already tolerated possession of small amounts of drugs. Like a g of coke, 1/4 of weed, etc. \n\nWhen I was down there, a quarter of weed cost me 30$, however a gram of fishscale cost me $15. Fucking amazing place! Check out Montanita if you wanna party in Ecuador. Drugs and parties everywhere and every night. It's like the cabo of Ecuador, but so much better than cabo. It's not as westernized and is a cultural melting pot. People visit from Europe, other countries in South America, Mexico, Australia, and the US.", "2_Subreddit": "opiates"}]}]}]}