{"jktat": [{"0_comments": [{"dwo7sl2": [{"0_Comment Submission": "Lost my job of 4 years--the one thing is was proud of in my life", "1_Text": "Shit I can't imagine your situatuon and how much that must hurt. You can get yourself together though. You still have your skills as a cake maker so try to get clean (yeah, easier said than done) and get a new job. Or at least taper down?", "2_Subreddit": "opiates"}], "dwocf2a": [{"0_Comment Submission": "Staying at home when i'm high as fuck feel like a waste ?", "1_Text": "Haha I know exactly what you mean. I try to do something constructive while im high. I get this smooth calm energy from it and it just makes me want to do shit. Sometimes I do end up playing vudeo games or watching youtube videos. Caffeine + opiates is a great combo if you want to end up doing something instead of just chilling on the couch.", "2_Subreddit": "opiates"}], "dwof4bh": [{"0_Comment Submission": "Opiates and motivation/creativity", "1_Text": "Yeah I try to give myself at least a day between dosing. For me doing it two days in a row is a waste because I dont feel shit the next day. But yeah, the longer you wait the better the high. On a side note, I love how I just got  comment saying \"stfu boring cunt\" but it got deleted 😂 I guess a hardened J will think im petty for even talking about codeine.", "2_Subreddit": "opiates"}], "dworete": [{"0_Comment Submission": "I Am a Beautiful Monster", "1_Text": "I want this framed on my wall. Maybe black and white.", "2_Subreddit": "opiates"}], "dwou5j6": [{"0_Comment Submission": "I Am a Beautiful Monster", "1_Text": "That would be dope (no pun intended)! Can you upload it somewhere and paste the link? My email address unfortunately contains my full name haha", "2_Subreddit": "opiates"}], "dwud56d": [{"0_Comment Submission": "2 weeks without my meds and I finally got some. But I could have gone down for it.", "1_Text": "Lmao took me a few sentences to figure out that I'm not dyslexic 😂", "2_Subreddit": "opiates"}], "dwuxtxo": [{"0_Comment Submission": "Getting opiates filled.", "1_Text": "Fuck trolls", "2_Subreddit": "opiates"}]}], "1_submissions": [{"88zt2b": [{"0_Title": "Opiates and motivation/creativity", "1_Text": "Shit I can't imagine your situatuon and how much that must hurt. You can get yourself together though. You still have your skills as a cake maker so try to get clean (yeah, easier said than done) and get a new job. Or at least taper down?", "2_Subreddit": "opiates"}]}]}]}