{"PillLover": [{"0_comments": [{"dwjg2e5": [{"0_Comment Submission": "You guys have no idea how excited I am.", "1_Text": "Let's be serious - you don't need that much. Maybe share with people in need?", "2_Subreddit": "opiates"}], "dwjj14w": [{"0_Comment Submission": "Careful if people PM you!", "1_Text": "Seriously? I never encoutered any fake pills in PL and I thought this problem is occuring only in US. I'm curious how they looked like cause there isn't that many brands of oxy avalaible here so it's easy to spot fakes.", "2_Subreddit": "opiates"}], "dwjkrb3": [{"0_Comment Submission": "Careful if people PM you!", "1_Text": "I have to add that I'm surprised there aren't more people selling opioids/benzos cause they are cheap as fuck in Poland.", "2_Subreddit": "opiates"}], "dwjqfyx": [{"0_Comment Submission": "Uber pilot program provides free rides for recovering opioid addicts", "1_Text": "Damn, I missed the moment when being addicted to something started to bring you some benefits and free stuff.", "2_Subreddit": "opiates"}], "dwjrczp": [{"0_Comment Submission": "Dboy idiocy", "1_Text": "Makes sense to me. Maybe it was tweaker's paranoia.", "2_Subreddit": "opiates"}], "dwjsitg": [{"0_Comment Submission": "Fuck my life", "1_Text": "Mind's playing tricks on you and you know it. There things you need more right now than getting high. Get you priorities straight, this can be a good start for quitting. If not, what will happen next? This shit is only getting worse for majority of people as time goes by, now you are homeless, next time you might end up dead or in prison. Think about it.", "2_Subreddit": "opiates"}], "dwjsqi2": [{"0_Comment Submission": "Saw this on r/trashy. Thought of you guys.", "1_Text": "I'm seeing tens of people like this on train station in my city. It's been like this for so long, security/police don't even give a fuck and quite frankly I understand it, as these guys are mainly nodding/walking around asking for money, they don't steal shit or act violently towards anyone.", "2_Subreddit": "opiates"}], "dwjuw8w": [{"0_Comment Submission": "What's your secret stash spot ?", "1_Text": "I don't need stash cause nobody is going to steal it from me. Where do you live? Afganistan?", "2_Subreddit": "opiates"}], "dwjv1xa": [{"0_Comment Submission": "Favorite jungle boys flavor😋😋", "1_Text": "This \"vendor\" is so shitty he needs to get more customers this way. Don't forget to post it on your facebook and instagram OP.", "2_Subreddit": "darknet"}], "dwjv71t": [{"0_Comment Submission": "What's your secret stash spot ?", "1_Text": "I get it, but for me it something I associate with paranoid tweakers or kids hiding drugs from their parents. Nice idea and pic though.", "2_Subreddit": "opiates"}], "dwjvh05": [{"0_Comment Submission": "How many of you have an accompanying mental disorder ?", "1_Text": "Good question would be, how many people got mental disorders due to abuse of drugs and lifestyle that goes with it.", "2_Subreddit": "opiates"}], "dwjvz5n": [{"0_Comment Submission": "No escrow dream listings", "1_Text": "Don't use FE. It's basically giving people money for free as they have no obligation to send you anything. And no, they don't care about 1/5 ratings as you are only one of hundreds if not thousands of customers.", "2_Subreddit": "DarkNetMarketsNoobs"}], "dwjw56c": [{"0_Comment Submission": "Bought 220ug samples but the results from de analysis were 142ug", "1_Text": "It depends where do they get them from. Really professionaly laid sheets are basically equal. \nAnd as for your question OP, most people don't produce tabs, they just buy them in bulk and sell it further so he might have no idea how strong they really are.", "2_Subreddit": "DarkNetMarketsNoobs"}], "dwknkll": [{"0_Comment Submission": "''HeinekenExpress'' Darknet vendor. I am looking to buy from this guy!", "1_Text": "NL are sketchy as hell, though I had coke come through few times to east EU with no problem. He seems ok, but you could easily find vendors from other countries which aren't red flags for customs.", "2_Subreddit": "darknet"}], "dwl6m0s": [{"0_Comment Submission": "🤘", "1_Text": "Does shooting all your money mean you are worth more as a person?", "2_Subreddit": "opiates"}], "dwleme2": [{"0_Comment Submission": "I feel like I’m in an on and off again relationship with dope", "1_Text": "Nothing worse than romanticising drugs and addiction. Pure cancer.", "2_Subreddit": "opiates"}], "dwli504": [{"0_Comment Submission": "40 oxy 10s, 12 perc 10s, 32 perc 5s, 21 50mg tramadol and 35 klonopin. I think I'm good for now!", "1_Text": "Weekend dose.", "2_Subreddit": "opiates"}], "dwljuo7": [{"0_Comment Submission": "Anyone got some decent ambient music to nod to?", "1_Text": "Heroin and your veins", "2_Subreddit": "opiates"}], "dwlk09c": [{"0_Comment Submission": "I got the packs homies", "1_Text": "Is this some kind of comment of what our quality weed vendor/poster is doing lately? This stuff looks great, are you going to shoot it?", "2_Subreddit": "darknet"}], "dwmzxqy": [{"0_Comment Submission": "vintage glassines courtesy of anthony bourdain", "1_Text": "Nice shitstorm going on there.", "2_Subreddit": "opiates"}], "dwn07lo": [{"0_Comment Submission": "First time trying tar, ready to make some monkey water!", "1_Text": "My god. People are actually putting this stuff in their veins?", "2_Subreddit": "opiates"}], "dwn2h6i": [{"0_Comment Submission": "vintage glassines courtesy of anthony bourdain", "1_Text": "Who are they? I mean, are they famous because they are junkies?", "2_Subreddit": "opiates"}], "dwon7on": [{"0_Comment Submission": "My brother always has my back. He was a meth and heroin addict for 25 years and he’s been clean for almost four years now.", "1_Text": "Friendly advice: if you don't have friends, you can't ignore them. Just try that for yourself!", "2_Subreddit": "opiates"}], "dwwwff5": [{"0_Comment Submission": "Valhalla login", "1_Text": "Valhalla is a scam site, don't even bother trying to buy anything there.", "2_Subreddit": "darknet"}], "dwwwgws": [{"0_Comment Submission": "Criminals have progressed from Darknet forums to End-to-End Encrypted Messaging Apps like Telegram", "1_Text": "Criminals? C'mon, they are good guys providing us illegal stuff that we need, give them a break.", "2_Subreddit": "darknet"}]}], "1_submissions": [{}]}]}