{"Dangerous_Stretch": [{"0_comments": [{"dw8t7k0": [{"0_Comment Submission": "15 roxy 30 prescription for 230 good deal or no", "1_Text": "Anddd you guys have the dope oc oxys -- I get my candy shipped here .50c/mg :-)", "2_Subreddit": "opiates"}], "dw8tpr0": [{"0_Comment Submission": "If I were a girl I would totally wear this poppy flower dress", "1_Text": "I live in NYC and I am sick and tired of Mayor Dildo giving these trans girls, aka freaks with their dicks tucked in, all this free shit, like what the fuck I tried using the girls bathroom in middle school because I heard it was so much nicer... needless to say I got suspended. If that happend in 2018, I would be awarded the key to the city and go on good morning america to talk about how oppressed I am and how I made my parents let me go on hormone therapie to grow tits when I was 8, I would be a hero! FUCK this gay ass LGBTQ+ crap, when is everyone going to wake the fuck up and realize their all mentally deranged", "2_Subreddit": "opiates"}], "dw9njnm": [{"0_Comment Submission": "If I were a girl I would totally wear this poppy flower dress", "1_Text": "you can take a joke -- that's what is wrong with **you people**", "2_Subreddit": "opiates"}], "dw9o4cm": [{"0_Comment Submission": "If I were a girl I would totally wear this poppy flower dress", "1_Text": "They are just attention whores and they are asking to be assaulted/murdered; 99% of the time they are violent people and most are mentally ill, shouting at people, forcing themselves on straight people and then getting violent when they are rejected. If they weren't so violent they wouldn't get targeted - no one wants to get close to those things in the first place yet close enough to get murdered. How many were killed anyway, and of course there is a higher murder rate that is just the nature of using statistic of a smaller sample of people  ( lets say there are a 1000 straight people and there are 100 trans - if one person from each group is murdered that would be a .1% and 1% murder rate respectively - yet it is the **same amount** of people!) I would bet that more **cis** people as you call them are killed each year.\n\n...isn't there some protest you should be at", "2_Subreddit": "opiates"}], "dw9o7ez": [{"0_Comment Submission": "How to get my prescription back?", "1_Text": "Damn you had an amazing doctor -- I live in NYC so  it shouldn't be too hard to find a doctor like that -- I'll probaby have to go to the bronx though", "2_Subreddit": "benzodiazepines"}], "dw9pf2p": [{"0_Comment Submission": "havent had these in over a year", "1_Text": "can someone PM me where I can buy seems? I am going to do a gorilla grow and want to plant around 200 I think that could get me a decent yeild", "2_Subreddit": "opiates"}], "dw9q0mv": [{"0_Comment Submission": "DAE feel like we are using opiates because we have been blocked off from our real purpose in life?", "1_Text": "Have you tried suboxone -- I kept relapsing for 2 years going on and off various pills then I detoxed in the hospital and started suboxone it has really helped -- don't get me wrong I miss the high and everything else that I love about opiates but I feel that its for the best", "2_Subreddit": "opiates"}], "dwgovt1": [{"0_Comment Submission": "Retarded things / Horror stories from rehabs you have attended?", "1_Text": "I'm in an IOP right now and I always told myself I am never going to rehab I will wind up coming out of there on worse drugs than I went in for. Turns out it is like OPs place and its an 'abstinence' facility - turns out most are. I get drug tested randomly and they test for everything even kratom. I also was told that the psychiatrist I will be seeing there will not prescribe me the adderall I take for ADHD nor any benzo for anxiety. \n\nSo I am going through the motions and my piss comes up dirty from the kratom and I just got so pissed that I decided to say fuck it I am going to get a doc to prescribe me suboxone. It was really easy and at least now I don't have to stay completely sober. The day I told my counselor she had this look of horror on her face as if I admitted I murdered somebody - she asked how long I will be on it 'only for a few weeks' I said nah its probably going to be a few years before my brain gets back to normal - somewhat joking.\n\nThe next week they tell me I have to sign a consent to let them give my drug test results to my doctor and told me I should get a 2nd opinion from the in-house doctor. \n\nAt this point I remember I have to meet with their stupid psychiatrist. So I take matters in to my own hands and find a out of network psychiatrist - I was more honest with him than I should have been but he is chill. He puts me back on Adderall and Klonopin and tells me that he prescribes suboxone and confirmed that it sounds like a great idea - I take him up on the offer because I would have had to pay 200 a month just to see the sub doc.\n\nI can't wait till tomorrow to tell them that I am back on my meds - and this time when they ask me to sign their hippa release form I am just going to say no. By telling the pdoc everything I am no longer worried that they might tell him something and have him drop me as a patient as they did with my last doc.\n\nI understand fully that I abused alcohol and weed but for gods sake dont punish me by taking away the meds that help my quality of life - they rather I suffer through my panic attacks and not be able to perform well at work than allowing me to take my meds. I beat them at their own game. These places truly suck and I hate that I have to be here - I rather just go to my SMART meetings and avoid abusing alcohol. Once I realized that they cannot **make** me go to an inpatient program I decided that idgaf. They keep saying that x,y,z are mandatory - as if I can't go on google to see if I **have** to do what they say - turns out 9/10 times I don't.\n\nI can't wait till I get out and never go back to this place... I was tricked into going because I was told this was a mental health intensive outpatient program turns out it's for addiction. Maybe they knew I wouldn't go if I was told that it was but it's not like I wouldn't know the second I went there. Once I am graduate I am calling the social worker at the hospital and say that it was fucked up to deceive me like that.", "2_Subreddit": "opiates"}], "dwgp5vh": [{"0_Comment Submission": "Retarded things / Horror stories from rehabs you have attended?", "1_Text": "My old psychiatrist was persian born in iran. I guess his addiction never went away as one day I went for a session and I could see that in the back yard there was a hookah, I didn't think much of it until a few minutes later he kept nodding out. I found it hilarious as he didn't hear a word I said. Then towards the end it was time to write my scripts up and as he looked to go through my medical chart I realized I could easily take this for granted - so I did.\n\nI told him I needed to up my Adderall from 10mg twice a day to 20mg xr and two 10mg ir pills as a booster. Bam he did it.. then I asked to switch from klonopin 1mg to xanax 1mg three times a day, and lastly I tried my luck one more time and asked if he could write me a prescription for vicodin for my headaches, once again no problem, he wrote me a script for norco 5/325 every 6 hours as needed.\n\nI really loved that guy :-)", "2_Subreddit": "opiates"}], "dwgpkmo": [{"0_Comment Submission": "Jesus fucking Christ. “The Doctors” show is stalking about narcan parties..", "1_Text": "I didn't know they gave people in the psych ward internet access..", "2_Subreddit": "opiates"}], "dwgpx9e": [{"0_Comment Submission": "Jesus fucking Christ. “The Doctors” show is stalking about narcan parties..", "1_Text": "I love dope. Dope is the best. I love dope more than my girlfriend. Dope dope dope. Sometimes when I am alone I take out my insulin syringe and shoot some dope into my veins. I used take pills after a surgery but than I got addicted and started snorting heroin. Than that wasn't enough and I would smoke some bth but nothing beats watching the blood go into the chamber as I inject. I probably use two grams a day. I but H by the kilo and it last me over a year. Its just cheaper to buy in bulk than to go out a buy an ounce or two a month. So what dope is great I work on wall street so money isn't a problem. If I am at work and want to use I go to the parking garage and take my dope out of the trunk and will snort a couple of lines. It makes work go by so much quicker. Before bed I will take a xanax a soma and shoot up. Then in the morning I do it all over again. I do take breaks though I have a stash of suboxone I take during that time so my wd isnt that bad. Then I start again and do it all over again. I have an apartment on central park west and my gf lives with me, I have two cars and a vacation house in colorado. I am always happy because of the dope. Dope makes my life so much better you should try it sometime - try to avoid dope cut with fent. Thats another reason I buy in bulk because I just go to mexico and I know that my brick was never cut with anything but if you dont go to mexico make sure you just take a test dose your first time. Peace love and **dope**", "2_Subreddit": "opiates"}], "dwgrcvp": [{"0_Comment Submission": "LISTEN AND BELIEVE.", "1_Text": "Cover of NYT said something like morgan stanley aware top executive has had been accused of beating ex-gf, but they didn't fire him... followed by an entire piece dedicated to pressuring ms into firing him..", "2_Subreddit": "whiteknighting"}], "dwgsqob": [{"0_Comment Submission": "My wife is a sex worker", "1_Text": "you have kids and yet you whore yourself out to make money, have you heard of getting a real job? You are a whore because you sell yourself (sex, body, etc..) to support yourself and your children. You are also raising your children as a single mother who is a sex worker. You are **choosing** to raise your kids in a toxic environment with no father figure (or perhaps a lot of father figures depending on how many different men have been in your life.) \n\nPeople like you disgust me. You rationalize what you do so that you don't have to face reality. What happens when your kids find out you are a sex worker, have you already figured out a way to rationalize that? You say **you** don't need a man in your life but what about your children - do they not deserve to grow up with a father?\n\nYou are actually going to start doing this again? Its one thing to do if you are young and without children - but you are a mother you need to grow up. \n\nIt has been theorized that women that do this have severe father issues - did he molest you as a child and therefore you have been completely desensitized to sex? What happens when you are put in a dangerous situation due to your line of work and get raped or contract hiv? I am sure you have rationalized this as well - you should probably do your children a favor and put them in foster care otherwise if you continue to raise them they will be damaged. \n\nOnce a whore always a whore ammiritee", "2_Subreddit": "whiteknighting"}], "dwgtijf": [{"0_Comment Submission": "Has anyone bought from sites like theses? Seems too good to be true...", "1_Text": "nah its super easy to buy drugs on the clearnet a lot of email sources too, there just kind of expensive. the best deals I found are for benzos they are cheap. roxy are a standard $1/mg although my oc oxy guy from europe is fifty cents per mg which is ok he also sells morphine/ketamine vials which I never got. then there is another guy who sells codeine 60mg 80/110$ \n\nI have never had a problem even though I have had packages searched nothing was ever found. I can't wait to I take a couple days off my subs so I can take the vicodin i last bought :-)", "2_Subreddit": "opiates"}], "dwgtsfi": [{"0_Comment Submission": "I'm an opiate newb, I don't wanna OD, can I get some advice?", "1_Text": "yeah no im calling bs, when I first started abusing opiates I cwe 50mg of oxy from percs and drank it mixed with soda. I also took 3mg of xanax. that was pretty much my go to when I first started out. \n\nthen as i got older i would snort oxy pop a bar or two drink a few beers and smoke some kush. i have had fent and then maybe an hour later take 2mg of klonopin. I understand people can die but lets be real about the dosage needed to. \n\n30mg oxy and 2mg alp is a blissful combo esp with no tolerance. enjoy dude", "2_Subreddit": "opiates"}], "dwhwjbw": [{"0_Comment Submission": "Retarded things / Horror stories from rehabs you have attended?", "1_Text": "I'm going to finish out the next few weeks so I can graduate hah", "2_Subreddit": "opiates"}], "dwhxof3": [{"0_Comment Submission": "Retarded things / Horror stories from rehabs you have attended?", "1_Text": "they don't want me to take any controlled substances including suboxone which has helped me stay off dope, ive never abused adderall or klonopin yet they say i can't take that either. well i saw two doctors who disagreed one of which is a psychiatrist specializing in addiction and he wrote me the scripts. so i found a loophole that doesn't mean im not trying to stay clean it just means im not going to be a sheep following their rules to a tee. i can go to this program practicing my coping skills and working on my substance use problem while taking my meds i dont see a problem. sorry you feel that everyone should follow a cookie cutter treatment plan thats just not realistic...", "2_Subreddit": "opiates"}], "dwhyf0l": [{"0_Comment Submission": "Retarded things / Horror stories from rehabs you have attended?", "1_Text": "The Dr in my IOP doesn't prescribe any controlled meds - I just went to a psychiatrist out of the program and he prescribed me Adderall Klonopin and Suboxone - as if I am going to stop taking my meds that help me and that I never abused.\n\nI think they view people with addictions as being addicted to everything regardless - I was in the program for less than two weeks before I relapsed on opiates and if I could have stayed on subs during that time I most likely wouldn't have relapsed... oh well", "2_Subreddit": "opiates"}], "dwhz1nc": [{"0_Comment Submission": "Retarded things / Horror stories from rehabs you have attended?", "1_Text": "I just think it's ridiculous how they can take me; someone who is an alcoholic and opiate addict and say 'no suboxone for you,oh you have anxiety and add, no klonopin or adderall either' they did me a disservice and two weeks in I relapsed on opiates so I got a suboxone prescription. In that sense i didn't get anything from it. I didn't make that part clear, my bad.", "2_Subreddit": "opiates"}], "dwi88uk": [{"0_Comment Submission": "Opana", "1_Text": "yeah its likely you just misremembered no big deal and either way you got a good deal. i would love to have a line of fishscale mixed with some nice tan h i never thought to do that i bet the euphoria is out of this world", "2_Subreddit": "opiates"}], "dwi9084": [{"0_Comment Submission": "Do doctors ever prescribe oxy for chronic migraines?", "1_Text": "yeah i had a psychiatrist who was super lenient with writing me scripts for whatever i want, one day i noticed him nodding during a sessions so i took advantage of it and asked him to raise my adderall and klonopin and when he did i decided to go for it and said i have headaches that tylenol isnt working for anymore and he wrote me 120 5/325 vicodin :-)", "2_Subreddit": "opiates"}], "dwia2mh": [{"0_Comment Submission": "Morning snort. Only ever had 10’s. What opiate did everyone start out with? Mine was oxy.", "1_Text": "I get codeine for cheap I usually stock up and buy 240 60mg no apap for 3 bills but if hydro wasnt $1/mg i would get them more frequently... somedays i wish i wasnt still on subs", "2_Subreddit": "opiates"}], "dww4anc": [{"0_Comment Submission": "I can't believe what I heard today", "1_Text": "Yeah especially since she takes his meds with her when she leaves to go to the program during the day - there is no fucking excuse since she has to be out for atleast 5 hours while outpatient rehab is going on...", "2_Subreddit": "Drugs"}], "dwyr8hn": [{"0_Comment Submission": "Election Night :)", "1_Text": "My favorite part of that night was waiting for them all to cry. Then when HRC wouldn't come out and sent an errand boy to calm down all of the crying cucks waiting for her. The next day I went over to Trump Tower and saw a huge protest outside. I walked up to the steps after walking away from the protest and was stopped by a suit when I was walking inside and had to state my reason for going and then had to be escorted upstairs. I was happier than a kid on Christmas.", "2_Subreddit": "The_Donald"}], "dwyta37": [{"0_Comment Submission": "Election Night :)", "1_Text": "No, I was going to a reception that night.", "2_Subreddit": "The_Donald"}]}], "1_submissions": [{"86wa0m": [{"0_Title": "How to get my prescription back?", "1_Text": "Anddd you guys have the dope oc oxys -- I get my candy shipped here .50c/mg :-)", "2_Subreddit": "benzodiazepines"}], "8a4z73": [{"0_Title": "I can't believe what I heard today", "1_Text": "Anddd you guys have the dope oc oxys -- I get my candy shipped here .50c/mg :-)", "2_Subreddit": "Drugs"}], "8aht5n": [{"0_Title": "Racism: The long con", "1_Text": "Anddd you guys have the dope oc oxys -- I get my candy shipped here .50c/mg :-)", "2_Subreddit": "AccidentalRacism"}], "8ahw6a": [{"0_Title": "President Trump Supports the Police Shaun King hates the Police", "1_Text": "Anddd you guys have the dope oc oxys -- I get my candy shipped here .50c/mg :-)", "2_Subreddit": "The_Donald"}]}]}]}