{"CheapCelebration": [{"0_comments": [{"dvjn4q3": [{"0_Comment Submission": "What would you guys do between taking an entire dose at once to get a nice high or split the dose in 3 or 4 times ?", "1_Text": "I would get nice and high three days in a row and hate myself for 2 and a half weeks", "2_Subreddit": "opiates"}], "dwqzjiv": [{"0_Comment Submission": "New to oxy, need some advice", "1_Text": "so if i wanted a nice nodd going take 2? 3?\n\ngot a moderate tolerance just completely naive about oxy", "2_Subreddit": "opiates"}], "dwr01ld": [{"0_Comment Submission": "New to oxy, need some advice", "1_Text": "I can pop codeine and tramadol like tic tacs, had a heavy fentanyl binge a while ago, tried H a few times, but not done anything heavy in a couple months", "2_Subreddit": "opiates"}], "dwr08am": [{"0_Comment Submission": "New to oxy, need some advice", "1_Text": "I've got the UK made Oxys so they're white, I can't find any info online to see if they're mixed with acetaminophen or not, so i'll probably neck them", "2_Subreddit": "opiates"}], "dwtjyw9": [{"0_Comment Submission": "Anyone else love cooking while high?", "1_Text": "oh of course when i get a good nod going on I'll sit and listen to Nirvana for an hour\n\nI cook when im moderately high", "2_Subreddit": "opiates"}], "dwtkumu": [{"0_Comment Submission": "Anyone else love cooking while high?", "1_Text": "Yes! Exactly this, headphones in and 30 floaty minutes later my kitchen is spotless. \n\nGlad i'm not the only one", "2_Subreddit": "opiates"}], "dwtnmku": [{"0_Comment Submission": "i’ve got a bunch of tramadol...", "1_Text": "Tramadol seems to affect people in different ways, I get a nice buzz off around 200-300mg and ive got a fair tolerance, \n\nBut from reading this sub for a while apparently a lot of people dont get any sort of euphoria from it.\n\nDon't take over 500mg as it can cause seizures regardless of tolerance.", "2_Subreddit": "opiates"}], "dwvjir6": [{"0_Comment Submission": "The mailman came through with some tar boys. First cop in about 7 months. Happy nods", "1_Text": "there was a dedicated subreddit for darknet markets i dont think him saying he got it online is a lax in OPSEC", "2_Subreddit": "opiates"}], "dwvjk43": [{"0_Comment Submission": "The mailman came through with some tar boys. First cop in about 7 months. Happy nods", "1_Text": "Looks tasty man, enjoy", "2_Subreddit": "opiates"}], "dwvjv19": [{"0_Comment Submission": "Oxy 30 xr?", "1_Text": "Yeah it'll definitely get you high, to avoid the ER part you can crush and bomb it (parachute) or snort.", "2_Subreddit": "opiates"}], "dwvk5dp": [{"0_Comment Submission": "Will fentanyl show on a 12 panel drug test?", "1_Text": "Fent never showed up on my drug tests when i was going to the clinic, that was just a piss test, it'd show opioids but not enough to fail. Similar note Tramadol showed up as PCP on my test?\n\nI'd blame the test they gave me but it was a NHS Clinic", "2_Subreddit": "opiates"}], "dwvk8kz": [{"0_Comment Submission": "The mailman came through with some tar boys. First cop in about 7 months. Happy nods", "1_Text": "Oh i assumed everyone had a separate account for the less than legal subs. My bad", "2_Subreddit": "opiates"}], "dwvo1vb": [{"0_Comment Submission": "Wondering how you guys met your now-dealers? (Don't worry, I'm not trying to source)", "1_Text": "started selling mandy in uni, escalated to selling xannies and a new customer hooked me up with his codeine guy, the codeine guy hooked me up to the dboy. \n\ndont use him regularly but he's reliable, nice dude\n\nedit: sorry i didnt fully read your post, realised my comment is of no help to you", "2_Subreddit": "opiates"}], "dwvp7xn": [{"0_Comment Submission": "Fentanyl detection times for probation?", "1_Text": "Don't take my word as law, but fentanyl didn't show up properly on my piss test, was a very slight positive but not enough to fail the test, this was only a day or two after taking it, or on my friend's post-mortem who definitely ODd on it. \n\nI sniffed diluted fent powder too, good luck with your test", "2_Subreddit": "opiates"}], "dwvpjbb": [{"0_Comment Submission": "Fentanyl detection times for probation?", "1_Text": "It was a day or two i think. \nim not too familiar with drug tests, i pissed in a cup and different boxes changed colour for drugs present. Wasn't for probation, i was in the process of getting prescribed methadone.", "2_Subreddit": "opiates"}], "dwvqsxp": [{"0_Comment Submission": "Can I mix 10mg oxy with a beer?", "1_Text": "Never had oxy before, didnt know what to expect", "2_Subreddit": "opiates"}]}], "1_submissions": [{"89hgo9": [{"0_Title": "New to oxy, need some advice", "1_Text": "I would get nice and high three days in a row and hate myself for 2 and a half weeks", "2_Subreddit": "opiates"}], "89solh": [{"0_Title": "Anyone else love cooking while high?", "1_Text": "I would get nice and high three days in a row and hate myself for 2 and a half weeks", "2_Subreddit": "opiates"}], "8a41el": [{"0_Title": "Can I mix 10mg oxy with a beer?", "1_Text": "I would get nice and high three days in a row and hate myself for 2 and a half weeks", "2_Subreddit": "opiates"}]}]}]}