{"hrtfthmttr": [{"0_comments": [{"dwqcn10": [{"0_Comment Submission": "April 3 has been promoted by hate groups as “Harm a Muslim” Day: Why Seattle Public Schools will have increased security on Tuesday", "1_Text": "Good people on both sides!", "2_Subreddit": "SeattleWA"}], "dwqfv31": [{"0_Comment Submission": "What parents have you met that make you think, “Yep, that kid is FUCKED”?", "1_Text": ">It was called a schedule when the drs in my hospital asked me to do it with my daughter.\n\nThen your doctors did you a disservice. I cannot count how many mothers I have met with who try to fix their newborns on a feeding schedule for their own convenience, and actually cause nutrition problems. The board guidance is to be as clear as possible that you should not be \"scheduling\" feeding for newborns in any way--formula or not--before 3 months. Your doctors should have described it as feeding on demand.\n\nSorry, but that's the best practice.", "2_Subreddit": "AskReddit"}], "dwqhm1q": [{"0_Comment Submission": "Involuntary commitment law for addiction goes into effect in Wash.", "1_Text": "It's not illegal to have drugs in your system.", "2_Subreddit": "SeattleWA"}], "dwqi5ab": [{"0_Comment Submission": "Involuntary commitment law for addiction goes into effect in Wash.", "1_Text": ">and the government has no plans to fund more hospitals or even beds for these people...\n\nIt's literally in the article. They are building 9 new facilities.", "2_Subreddit": "SeattleWA"}], "dwqmig5": [{"0_Comment Submission": "Involuntary commitment law for addiction goes into effect in Wash.", "1_Text": "Who hit you as a child?", "2_Subreddit": "SeattleWA"}], "dwqmmid": [{"0_Comment Submission": "What parents have you met that make you think, “Yep, that kid is FUCKED”?", "1_Text": ">If you read, the baby WASN'T demanding, that's the problem\n\nPlease quote exactly the part of her original post that explained this was the specific problem.\n\nI'll wait.", "2_Subreddit": "AskReddit"}], "dwqrhx5": [{"0_Comment Submission": "What parents have you met that make you think, “Yep, that kid is FUCKED”?", "1_Text": "Huh, how about that. Excoriating my first comment for not taking into account your later clarifications. That's certainly reasonable.\n\nReading comprehension: \"please quote exactly the part of her **original comment**.\" Revisionist history not welcome.", "2_Subreddit": "AskReddit"}], "dwquots": [{"0_Comment Submission": "What parents have you met that make you think, “Yep, that kid is FUCKED”?", "1_Text": "I am not sure why you are so worked up. This has nothing to do with you. You aren't even the original commentor I was responding to.", "2_Subreddit": "AskReddit"}], "dwslqj8": [{"0_Comment Submission": "After 30 years of business, Phnom Penh Noodle House in the ID is closing due to an unfortunate event.", "1_Text": ">and for a large swatch of people\n\nSwath.", "2_Subreddit": "SeattleWA"}], "dwsmmpk": [{"0_Comment Submission": "After 30 years of business, Phnom Penh Noodle House in the ID is closing due to an unfortunate event.", "1_Text": "It's actually both--no, many things. There are lots of inflationary pressures. Let's take a look, shall we?\n\n* Insurance: deregulation, consolidation, and work-dependent policies that can discriminate amongst pools all make insurance more expensive. Guess which party supports that? GOP.\n\n* Pharma: manipulates prices to hammer insurance. In many cases this not legal, insurance fraud. So why aren't we seeing more prosecution and judgements? Oh right, Republican judge appointments that couldn't give a shit about corporate abuse.\n\n* Medicine: soaring education debt generates the requirement for obscene salaries as a doctor, increasing inflationary pressure on medical procedure costs. I wonder who has been defunding public education for decades? Oh right. GOP.\n\n* Social safety nets: starving, unsheltered, drug-addicted uninsured populations use emergency rooms, and those costs spread to paying insurance pools. Which party systematically undermined every one of those policy areas for decades? Oh right....GOP.\n\nIn pretty much every single space that could help reduce medical costs, insurance abuse, corporate overreach and greed, tort law, education costs, preventative health, and basic income security, the GOP has been helping dismantle *every* 👏 *single* 👏 *one.* 👏", "2_Subreddit": "SeattleWA"}], "dwubzst": [{"0_Comment Submission": "Questions about IV use", "1_Text": "Clean, fresh gloves out of the box touching nothing are best.", "2_Subreddit": "Stims"}], "dwuvohr": [{"0_Comment Submission": "What do Seattle’s restaurant window food-safety emojis really mean?", "1_Text": ">and we get to pay for graphic design and printing all of these supplied signs.\n\nI'll give you your $.03 per year back personally if you'll just shut the fuck up about this forever.", "2_Subreddit": "SeattleWA"}], "dwuwesp": [{"0_Comment Submission": "Two of Seattle’s best barbecue joints are expanding", "1_Text": "Ok man, that's like 6 posts in the thread about Hole in the Wall. Yes, it's great, but slow down on the pitch?", "2_Subreddit": "SeattleWA"}], "dwv28zg": [{"0_Comment Submission": "New to /r/MensLib? Please read this first.", "1_Text": "yes.", "2_Subreddit": "MensLib"}], "dwx0z2u": [{"0_Comment Submission": "Seattle homeless 'tent mansion' low priority for city cleanup", "1_Text": "Not all of them refuse shelter for the same reasons.", "2_Subreddit": "SeattleWA"}], "dwx1eg8": [{"0_Comment Submission": "Seattle homeless 'tent mansion' low priority for city cleanup", "1_Text": "I don't see anyone saying \"deal with it\", I see them saying \"help with the problem.\"", "2_Subreddit": "SeattleWA"}], "dwx2ijg": [{"0_Comment Submission": "Seattle homeless 'tent mansion' low priority for city cleanup", "1_Text": "Has no one heard that broken window theory has been debunked?", "2_Subreddit": "SeattleWA"}], "dwxcsgq": [{"0_Comment Submission": "Seattle homeless 'tent mansion' low priority for city cleanup", "1_Text": "https://en.wikipedia.org/wiki/Broken_windows_theory#Criticism\n\nIt is pretty much universally panned by academia at this point.", "2_Subreddit": "SeattleWA"}], "dwxcupw": [{"0_Comment Submission": "Seattle homeless 'tent mansion' low priority for city cleanup", "1_Text": "And *that's* the problem here. You don't actually care about someone's circumstances. It's just easier to assign everyone the story that's most convenient to vilify them.", "2_Subreddit": "SeattleWA"}], "dwy0hrf": [{"0_Comment Submission": "User explains 'why [the GOP] want to roll back clean air and water regulations'", "1_Text": ">It only means there are **tradeoffs**.\n\nOh sure. That's the talking point. What you conveniently ignore is the value of those tradeoffs. Is it worth the 10 people who can't have jobs (oh but get unemployment and severance if they get laid off) to prevent 10,000 from life long debilitation from lead poisoning?\n\nMoreover, pretty much most of the \"tradeoffs\" are actually just convenient rhetoric. I'll give you an example:\n\nIn my town, they imposed a tax on soda with sugar in it. The point was two-fold: reduce consumption of sugar for public health reasons, and expand funding of education and healthy food stamp programs for the poor.\n\n Beverage industry went bananas, said it would cost tons of jobs. Turns out that cost to produce a can of Coke--labor included--is close to 15 cents. Most of that is transporting the coke from manufacture to stores, and most of those jobs are Union.\n\nThe truth is, they are making $.75 a can, minimum, pure profit. So what happened? They increased prices *on diet products that weren't even taxed*. They did this because they knew that raising the price of a can by $.25 means nothing to most people, and a differential between diet and non was irrational. They've laid off zero people. They didn't even need to add the tax to their products, given the absurd profit a can produces.\n\nThe point is that whatever tradeoffs they whined about were never real. They were just excuses to avoid hitting their own profit margins. This is the main story, and will continue to be.", "2_Subreddit": "bestof"}], "dwy2mcq": [{"0_Comment Submission": "User explains 'why [the GOP] want to roll back clean air and water regulations'", "1_Text": ">Is it worth it to lay off 10,000 people to prevent 10 from lead poisoning? See, you can change the facts and it changes the calculation. Perhaps it still is. But it is different than the strawman you constructed.\n\nOh, so lie. Gotcha. Make up bullshit. This is why you will lose. The only way to convince anyone of this schlock is to lie to them.", "2_Subreddit": "bestof"}], "dwy5oby": [{"0_Comment Submission": "User explains 'why [the GOP] want to roll back clean air and water regulations'", "1_Text": ">B:  A sugar tax does not internalise an externality.  It is a tax on consumption.\n\nComplete, utter horseshit. The entire point is a public health argument, and has serious ramifications for long term health, which this tax is attempting to internalize on industries imposing this cost on communities. Yes, there is a paternalism argument, which you might know something about if you bother with behavioral econ instead of the same old Chicago garbage.", "2_Subreddit": "bestof"}], "dwy5wit": [{"0_Comment Submission": "User explains 'why [the GOP] want to roll back clean air and water regulations'", "1_Text": ">You should really reconsider how much you think you know, because it's a whole lot less than what you think it is.\n\nThe argument is that it is not a choice when the only affordable and local consumption options are constrained to sugared products. \n\nGet over yourself.", "2_Subreddit": "bestof"}], "dwy6skg": [{"0_Comment Submission": "User explains 'why [the GOP] want to roll back clean air and water regulations'", "1_Text": "Me too, buddy. I just look beyond the same old bullshit. \n\nSeriously, you are the reason this country is such shit. Drinking the fucking \"praise the rich\" Kool aid. \n\nKeep it up. One day you'll regret being on the losing side. Until then, enjoy Rahm's cock.", "2_Subreddit": "bestof"}], "dwyeypf": [{"0_Comment Submission": "Seattle homeless 'tent mansion' low priority for city cleanup", "1_Text": "Fuck off. If you want to live in retard Utopia, Spokane is east.", "2_Subreddit": "SeattleWA"}]}], "1_submissions": [{"57gw1h": [{"0_Title": "More noob questions: about scenarios", "1_Text": "Good people on both sides!", "2_Subreddit": "battletech"}], "58amu5": [{"0_Title": "Best place to start for succession wars?", "1_Text": "Good people on both sides!", "2_Subreddit": "battletech"}], "5dng1d": [{"0_Title": "Awesome dog-mom friend shuts down asinine mombie share", "1_Text": "Good people on both sides!", "2_Subreddit": "titlegore"}], "5sujy9": [{"0_Title": "Looking for something spacious, safe, not a gas guzzler for 10k in the Northwest", "1_Text": "Good people on both sides!", "2_Subreddit": "whatcarshouldIbuy"}], "629n0y": [{"0_Title": "Kennel-only SA, housebroken to a fault, and the police", "1_Text": "Good people on both sides!", "2_Subreddit": "Dogtraining"}], "63exzc": [{"0_Title": "Anyone else having withdrawals?", "1_Text": "Good people on both sides!", "2_Subreddit": "GreenLattice"}], "64a1r4": [{"0_Title": "R/food loses its collective mind around a pretty rough dish. Pretty much every comment shits on the OP, the food, and the upvotes. Hilarious.", "1_Text": "Good people on both sides!", "2_Subreddit": "SubredditDrama"}], "6bijij": [{"0_Title": "Thanks for the support, babe...wait.", "1_Text": "Good people on both sides!", "2_Subreddit": "cringepics"}], "6gmia3": [{"0_Title": "Office 365 suite or standalone?", "1_Text": "Good people on both sides!", "2_Subreddit": "software"}], "6h2ylj": [{"0_Title": "In an ironic turnabout, moderators of /r/offmychest violate at least two Moderator Guidelines", "1_Text": "Good people on both sides!", "2_Subreddit": "Oppression"}], "6ozzr3": [{"0_Title": "Rules questions", "1_Text": "Good people on both sides!", "2_Subreddit": "ShadowWarArmageddon"}], "6ysknt": [{"0_Title": "Total meltdown and thread locked over a great weatherman referred to as \"articulate\" while he described hurricane Irma. Racism and anti racism keep the holy war alive.", "1_Text": "Good people on both sides!", "2_Subreddit": "SubredditDrama"}], "6ywtvd": [{"0_Title": "Total meltdown and thread locked over a great weatherman referred to as \"articulate\" while he described hurricane Irma. Racism and anti racism keep the holy war alive.", "1_Text": "Good people on both sides!", "2_Subreddit": "SubredditDrama"}], "705wdj": [{"0_Title": "Pinball Craftstman Hits Bumpers after Building a Sought-After Machine", "1_Text": "Good people on both sides!", "2_Subreddit": "pinball"}], "760ak9": [{"0_Title": "Water system experts: chlorine help", "1_Text": "Good people on both sides!", "2_Subreddit": "HomeImprovement"}], "78yam4": [{"0_Title": "Strategic Modeling not appearing?", "1_Text": "Good people on both sides!", "2_Subreddit": "pAIperclip"}], "798c7x": [{"0_Title": "Lvl 1 Lion TPK", "1_Text": "Good people on both sides!", "2_Subreddit": "KingdomDeath"}], "7al8wq": [{"0_Title": "Correcting gaps between floor and baseboard", "1_Text": "Good people on both sides!", "2_Subreddit": "HomeImprovement"}], "7iaokz": [{"0_Title": "Reports: NHL agrees to accept and consider Seattle expansion application", "1_Text": "Good people on both sides!", "2_Subreddit": "SeattleWA"}], "7rer5b": [{"0_Title": "Here's How Breitbart And Milo Smuggled White Nationalism Into The Mainstream", "1_Text": "Good people on both sides!", "2_Subreddit": "presidentbannon"}], "7uc6fx": [{"0_Title": "Seattleites making a run to the border for…Coke?", "1_Text": "Good people on both sides!", "2_Subreddit": "SeattleWA"}], "7uehyt": [{"0_Title": "Staffing the Accused: Inside the Six-Month-Long Downfall of Seattle Mayor Ed Murray", "1_Text": "Good people on both sides!", "2_Subreddit": "SeattleWA"}], "7z5w2h": [{"0_Title": "Cluster feeding nightmare", "1_Text": "Good people on both sides!", "2_Subreddit": "daddit"}], "81t1oj": [{"0_Title": "Northwest fly?", "1_Text": "Good people on both sides!", "2_Subreddit": "whatsthisbug"}], "83w1zg": [{"0_Title": "Will a $75 Million Head Tax Be Enough?", "1_Text": "Good people on both sides!", "2_Subreddit": "SeattleWA"}]}]}]}