{"ganjagrin": [{"0_comments": [{"dw9ahyt": [{"0_Comment Submission": "How does this tar look? Cold copped off of CL.", "1_Text": "Not so great to be honest. But it's really hard to tell with that stuff. There is so much you can do to cut it. It comes as a powder. But as soon as it hits any type of moisture it will gum up and get tar like very quickly. Like if you breathe couple breaths on it, then it will turn dark and sticky. Also if you put a small amount on foil to smoke and try and let it run. It should run real clean and leave hardly nothing behind on the foil.", "2_Subreddit": "opiates"}], "dw9dj9c": [{"0_Comment Submission": "How does this tar look? Cold copped off of CL.", "1_Text": "Not so great to be honest. But it's really hard to tell with that stuff. There is so much you can do to cut it. It comes as a powder. But as soon as it hits any type of moisture it will gum up and get tar like very quickly. Like if you breathe on it or it's real humid, then it will turn more dark and sticky. Also if you put a small amount on foil to smoke and try and let it run. It should run real clean and leave hardly nothing behind on the foil.", "2_Subreddit": "opiates"}], "dw9dxry": [{"0_Comment Submission": "How does this tar look? Cold copped off of CL.", "1_Text": "If it was really good and you sat it on your seat like that, it would likely stick to it. It Doesn't mean it won't get you high though!", "2_Subreddit": "opiates"}], "dw9edq2": [{"0_Comment Submission": "How does this tar look? Cold copped off of CL.", "1_Text": "Yeah the other picture looks a lot better. Usually the softer it is, the better it will be. Like when it cracks open like glass, you know someone definitely put some type of sugar type cut in it. If not sugar itself. It looks like it pulls apart at least. The best I ever had smelled like opium poppies. It was crazy sticky too. I thought it was opium at first. I'm done with tar now though. Tar seems mostly shity where I'm at these days but who knows I don't really look for it.", "2_Subreddit": "opiates"}], "dwbnbw8": [{"0_Comment Submission": "How does this tar look? Cold copped off of CL.", "1_Text": "I used to know these dudes that cut tar with sugar. They put a ton in it! I couldn't believe anybody bought that shit but they sold it cheap. Still I rather pay more and get something good. I can't do tar anymore though. It ruined my veins.", "2_Subreddit": "opiates"}], "dwcjtor": [{"0_Comment Submission": "The best tar I have ever had in my life...by far!", "1_Text": "Looks close to off the brick but a bit darker. Nice!", "2_Subreddit": "opiates"}], "dwdpgmd": [{"0_Comment Submission": "The best tar I have ever had in my life...by far!", "1_Text": "Yeah you're probably right it looks very close and that's just from a picture on a cell phone probably. Nice!", "2_Subreddit": "opiates"}], "dwdtmc0": [{"0_Comment Submission": "Dboy b like..", "1_Text": "If someone did that to me I'd rob them next time and go somewhere else...", "2_Subreddit": "opiates"}], "dwdty22": [{"0_Comment Submission": "Traveling to Mexico questions", "1_Text": "You could also take a deodorant stick out hollow out a little saw your stuff and put the stick back to make it look normal. You could also take a regular Bic type ink pen. Take it apart and cut the ink Park back and seal it so no ink comes out then you could load up the pin with whatever. They're mostly looking for big things. And mostly coming back to the US.", "2_Subreddit": "opiates"}], "dwe3xz1": [{"0_Comment Submission": "Prince died from 'exceedingly high' amount of fentanyl, report says", "1_Text": "It was a fent analog (u-47700, not then banned yet). He was taking some pain killer pills and some of them contained that instead of what they were supposed to be (like a pressed pill sold on the street as an oxy but it's really has fent in it). You would think with as rich as he was, he would be able to get whatever meds he wanted. Shame...", "2_Subreddit": "opiates"}], "dwe8o3e": [{"0_Comment Submission": "5 month tolerance break, still underwhelming as fuck.", "1_Text": "I've seen results that say up to 2 years for your dopamine to fire how it is supposed to again.", "2_Subreddit": "opiates"}], "dwe925d": [{"0_Comment Submission": "Spring break cocktail!", "1_Text": "A hundred percent for sure of fentanyl analogue. If you buy in bulk you can get it down to like $10 a gram. Even if you paid 100 a gram you could make hundreds of those pills out of a gram. Actually.... How many do you want? Lol", "2_Subreddit": "opiates"}], "dwfst2x": [{"0_Comment Submission": "Traveling to Mexico questions", "1_Text": "I would probably smash them though. That way they won't look like little pills through the X-ray machine if you can see them. I haven't been to an airport in quite a while. Added a lot of security measures since the last time I flew somewhere.  I'd be pretty sketched out to bring anything through an airport. If it was me...... I would mail them to myself before I left. Well depending on where you're going.", "2_Subreddit": "opiates"}], "dwftjtm": [{"0_Comment Submission": "With Regards To The Recent Subreddit Bans", "1_Text": "The DNM forum sites are better anyways I think...", "2_Subreddit": "fentanyl"}], "dwftoi7": [{"0_Comment Submission": "Carfentanil", "1_Text": "Yes the last maf before it was gone was not up to par. Still really good deal though.", "2_Subreddit": "fentanyl"}], "dwgfjjt": [{"0_Comment Submission": "Greetings! Cold cop story", "1_Text": "Everyone thinks you should just go to the projects and ask any black dude for something.  Yeah it will work...... possibly, or next most likely thing is,... you'll get robbed..... And hopefully live to tell about it. \n    The REAL best way to find the good shit (if your desperate) is to go to the hood...... find a hooker..... And tell her you will either give her 20 bucks or a little dope to take you to the best connect she has. Hookers always know where the best shit's at.....ha!", "2_Subreddit": "opiates"}], "dwgfo6j": [{"0_Comment Submission": "An eighth of some fire tar", "1_Text": "shiney...", "2_Subreddit": "opiates"}], "dwgg2cs": [{"0_Comment Submission": "Picked up some of this today. 2nd time ive gotten and the first time I immediately was like wtf is this so i texted my dude and he said its all good these guys add food coloring haha. Anybody ever experienced this?", "1_Text": "Yeah I've heard of it.... but that's fking retarded! Plus, if someone ever gets busted and tells on you, they can trace it straight back to your dumb fking ass cuz you're probably the only one with that color dope. Stupid move on the dealer's behalf...", "2_Subreddit": "opiates"}], "dwggh67": [{"0_Comment Submission": "How to avoid taking fentanyl cut heroin", "1_Text": "Most people don't cut H with real Fentanyl. They often use a fentanyl analogue that is a lot easier to get and a lot more cheap. They are usually weaker than regular fentanyl, so you have to use more. It's not like straight fent from a pharmacy but there are some active in sub milligram doses. What I'm getting at is the test strips should be pretty reliable to test for  analogs. Pretty sure you can move the test strip around in the sample to touch different parts as well.", "2_Subreddit": "opiates"}], "dwggm00": [{"0_Comment Submission": "How to avoid taking fentanyl cut heroin", "1_Text": "Shit was so good back then because hardly anyone was doing it. Now 30% of the country are doing opiates. Too much demand", "2_Subreddit": "opiates"}], "dwggvv9": [{"0_Comment Submission": "I'm an opiate newb, I don't wanna OD, can I get some advice?", "1_Text": "You could either feel really good! , or prolly just stop breathing in your sleep... That's a dangerous combo. If you test for benzos at a Suboxone clinic they will kick you out same thing at a methadone clinic. Cuz it's dangerous. I've had a couple close friends die from doing exactly that. Benzos and opiates probably one of the most dangerous combos I can think of..\n.", "2_Subreddit": "opiates"}], "dwghxsi": [{"0_Comment Submission": "With Regards To The Recent Subreddit Bans", "1_Text": "Yeah that's what I was talking about. And Avengers. Also the hub....", "2_Subreddit": "fentanyl"}], "dwh9oie": [{"0_Comment Submission": "Greetings! Cold cop story", "1_Text": "Go to Backpage possibly Craigslist? Actually I heard Craigslist got rid of their personals. I live in a rural area now but the closest city isn't really that big and there are lots of different \"hoods\" there. I thought all decent size cities had shity parts of town (hoods). At least everywhere I've been in the US there's been hoods (shity parts of town) where you're more likely to find drugs.", "2_Subreddit": "opiates"}], "dwh9sff": [{"0_Comment Submission": "Greetings! Cold cop story", "1_Text": "Yeah possibly but doubt you're going to find great shit that way unless you get lucky.", "2_Subreddit": "opiates"}], "dwuc9ji": [{"0_Comment Submission": "I'm Eric Hafner, I'm running for U.S. Congress in Portland, Oregon (OR-3). I want to legalize all drugs, including opiates, but offer ibogaine therapy too, and free drugs for addicts via prescription.", "1_Text": "You have my vote....", "2_Subreddit": "opiates"}]}], "1_submissions": [{"7wjrsh": [{"0_Title": "PMAF", "1_Text": "Not so great to be honest. But it's really hard to tell with that stuff. There is so much you can do to cut it. It comes as a powder. But as soon as it hits any type of moisture it will gum up and get tar like very quickly. Like if you breathe couple breaths on it, then it will turn dark and sticky. Also if you put a small amount on foil to smoke and try and let it run. It should run real clean and leave hardly nothing behind on the foil.", "2_Subreddit": "fentanyl"}]}]}]}