{"H-TownBalla": [{"0_comments": [{"drw3kej": [{"0_Comment Submission": "South America", "1_Text": "You say you speak spanish well, and you clearly speak english well so use that to your advantage to create a narrative that they can believe.  I dunno thats kinda what I did with dealers. Pretend to be another dealer or to represent someone with money. I inevitably would get better stuff and more respect than if they just initially saw me as a junkie.", "2_Subreddit": "opiates"}], "drxxq9m": [{"0_Comment Submission": "What's your dream?", "1_Text": "I'm with you.  I am 30 years old and I still don't know what I want.  I can name a thousand things that I'm not good at, but I'll be damned if I can name a single thing that matters that I am good at.  I've failed at just about everything in my life and I'm just so tired of letting my family and myself down.  Anyway, just wanted to let you know that you aren't alone in feeling that way.  I know exactly how you feel and it sucks.  Hope things start looking up for you.  Hell they have to for someone right?", "2_Subreddit": "depression"}], "drxyrd7": [{"0_Comment Submission": "(F)inally worked up the courage to post", "1_Text": "Absolutely stunning! Glad you found the courage because you have blessed us all!", "2_Subreddit": "opiates_gonewild"}], "dsk0wk8": [{"0_Comment Submission": "Direct Deposit", "1_Text": "Damn Huntington, West Virginia? Whats it like living there? I always hear about that place on the news whenever they are covering the opiate epidemic", "2_Subreddit": "opiates"}], "dslsxzs": [{"0_Comment Submission": "i toss all my bags and knots down a crack between the furniture. couldn’t find my last bag anywhere when i woke up after a zan nap. so i’ve been sorting through almost two yrs of dope bags hoping i tossed it down there cuz i know i didn’t do it. this is about half btw.", "1_Text": "It looks like theres a baggie at 12 o clock and at 14 minutes past the hour haha. Hope you find it", "2_Subreddit": "opiates"}], "dss7gno": [{"0_Comment Submission": "Taking Xanax", "1_Text": "Take .25 mg to start and then wait an hour or two.  IF you feel like you want more then take another .25", "2_Subreddit": "opiates"}], "dsup9az": [{"0_Comment Submission": "Snowed in...", "1_Text": "Yea I have access to all of those, but where I would have to go equates to a 40 dollar lyft each way.  I ended up biting the bullet and paying that, but it really sucks to pay an extra 80 bucks on top of what I spent with my friend.  The things we do...", "2_Subreddit": "opiates"}], "dsuqffa": [{"0_Comment Submission": "Are you responsible for your friends addiction?", "1_Text": "I feel ya on this one.  I was introduced to H by a friend who downplayed how addictive it really is, and assured me it was absolutely no different than the 30 mg blue roxy that I would take once every couple of weeks when working on an especially busy night bartending.  Well, needless to say I got addicted pretty fuckin quick and my life spiraled out of control as it tends to when shit starts consuming your entire life.  Anyway, when I got sober I finally came to the realization that it isn't anyone's fault but my own that I got into that situation.  I think it was better for me anyway to recognize what everyone's contribution to the events were, not who is solely responsible.  Because in my opinion there just aren't that many things in life that are that simple.  Just my opinion though.  I've been in your shoes too and it won't help you to look back and wonder what if?  If he's truly your friend then when he's ready to get clean or to clean up parts of his life then be there for him, but if not don't beat yourself up forever.", "2_Subreddit": "opiates"}], "dt05eo2": [{"0_Comment Submission": "How can I be kind without being stupid?", "1_Text": "Theres no doubt hes using. Leaving to go to \"work\" then coming home saying they didnt need him is just another way of saying I needed enough time to go and probably wait for the dope man for a good bit and then come home high with a bag in his pocket.  Tell him to take a drug test, and let him know you support him no matter what.  Just explain that he cant stay with you if hes not doing everything in his power to seek therapy and help to get clean.  He probably will play dumb and get mad.  He may even say some really hurtful shit, but just know hes just lost to this addiction and it isnt really him talking. \n\nIts a tough situation for everybody, but you need to handle it now before any of your fears become reality.  Ive been there and if he isnt seeking help, getting therapy, and involving you both in his plans then he is not only not going to work towards moving out, but at this point he cant even look a week or a month down the road because it just takes over your thought process and all you can ever see is how to get well and then how to hustle to get more.  Its a vicious cycle, but theres hope if you guys can start a dialogue today/tomorrow about the facts of his addiction and where to go next.  \n\nJust my opinion and I dont mean to offend if I did.", "2_Subreddit": "opiates"}], "dtecrz7": [{"0_Comment Submission": "Well fuck Walmart", "1_Text": "Looks like the name brand immodium on the right is still unprotected.  Wal mart just doesnt want their stuff to be taken haha fuck the other brands i guess.", "2_Subreddit": "opiates"}], "dtjw41g": [{"0_Comment Submission": "Emergency: \"I need soda [because] I'll die if I have to drink water one more time!", "1_Text": "Hahaha We all have a Cliff in our lives!  IF you don't know a Cliff, then YOU are the Cliff in your group!  I used to deal with this dude who would ask for the most ridiculous shit like: 1.  Let me get your jacket man (A brand new 150 dollar North Face that I had literally just bought that day!)  My answer was obviously no, but the idea that he ran that through his mind before he asked me, and that it turned out to be a good idea to him just blows my mind... 2.  Hey man will you go to Verizon and get approved for the New Iphone?  I'll look out (Which in his mind meant that he wasn't going to add anymore to my order, but instead just add less cut and give me what I paid for... Which unfortunately was a rare occasion in its own right)  3.  Hey man I need you to rent a car for me on the way through.  Again, \"I'll look out...\" \n\nThank god that I found a new connect, and don't need to fuck with his dumbass anymore.  I don't even get surprised at the ridiculous demands of some d-boys anymore.  They seem to just live in this fantasy world where people will do anything that they ask, but god forbid you ever are A. Late to meet them  B.  Call them out on some bunk shit they served you  C.  Ask for any kind of front  All three of these with shitty d boys has always turned into a grown man throwing a hissy fit about how he always has looked out for me and made sure i'm never sick (Both are completely false)  As we all know there are some SERIOUS FUCKBOY d-boys out there...", "2_Subreddit": "opiates"}], "du625xh": [{"0_Comment Submission": "What's better for withdrawals, Kratom or Tramadol?", "1_Text": "Well Tramadol is an opiate so I'd say that, but in my own experience as a G or more a day user I honestly have had more success with Kratom, some weed, and adderall than just using Tramadol.  I took around 350 mg of tramadol so that's what i'm basing my answer on.  The kratom however was from Gaia botanicals and it was a mix of Elephant and Red Bali.  Then I smoked a blunt, and took 40 mg of Adderall Instant Release.  That was more comfortable I found than the time I took Just some Trams.", "2_Subreddit": "opiates"}], "du62cvu": [{"0_Comment Submission": "Remembering recovery isn't linear. There are a lot of ups and downs.", "1_Text": "I love this!  So true! Progress is never linear! I actually received this very same advice from my father some years ago, and it has always stuck with me for some reason.  Thank you for sharing this gem!", "2_Subreddit": "opiates"}], "du9qqs1": [{"0_Comment Submission": "Remembering recovery isn't linear. There are a lot of ups and downs.", "1_Text": "yay yayyy", "2_Subreddit": "opiates"}], "duj8erb": [{"0_Comment Submission": "Black people are partially responsible for the discrimination they receive.", "1_Text": "I wholeheartedly agree with this unfortunate observation... This particular stereotype is just a FACT! Black people are the absolute worst restaurant patrons out of any race.  On top of being horrendous tippers, they are the most demanding, and by far the most critical of just about everything from the waiter to the food to the price to you name it, and they will complain about it.... I wonder why this is so commonplace for them to be such awful tippers, but when I worked in a Restaurant it was beyond frustrating to have to deal with them on a daily basis.. If you don't have the common decency to tip a minimum of 15% then stay the heck home!", "2_Subreddit": "unpopularopinion"}], "duj9nzv": [{"0_Comment Submission": "Dear Black People Please TIP when you go out to eat!", "1_Text": "I understand where you are coming from, but im also going to guess that you are assuming that I myself am not black.  Which is not the case!  Surprise surprise!  I wrote it this way intentionally because I had a sneaking suspicion people would just assume im some white guy spewing his racist views.  I am not generalizing, but rather I am using evidence backed personal research to make a point that we as a people are just awful tippers!  It is inexcusable, and it needs to change.  The sense of entitlement is a root cause, as well as the lack of education about what is appropriate behavior when going out to eat, but the main cause in my opinion is that there is this idea in our community that we are sticking it to the man by doing things like this when in reality we are just screwing over hard working individuals who deserve better.  We can do better, and damn it we SHOULD do better!", "2_Subreddit": "RestaurantEmployees"}], "dw37bol": [{"0_Comment Submission": "DJ screw is perfect music for the opiate high", "1_Text": "Definitely agree with this one! DJ Screw actually invented Chopped and Screwed music while using opiates!  In his case it was Purple Syrup, but yea I absolutely love listening to a good song chopped and screwed while i'm feeling the nod!  Houston native here, and it makes me smile to log on to this forum and see this post! Hope you're having a great night bangin screw!", "2_Subreddit": "opiates"}], "dw37d9k": [{"0_Comment Submission": "DJ screw is perfect music for the opiate high", "1_Text": "I'm from H-Town!  I live in North Carolina now, but my heart still lies in Texas!", "2_Subreddit": "opiates"}], "dw37jhi": [{"0_Comment Submission": "Grey heroin? I don't like the look of it.", "1_Text": "Some of the most fire dope i've ever gotten was grey like that!  I would be psyched to get that these days.  All the shit I get is fucking white, and we all know that means these fuckin days...", "2_Subreddit": "opiates"}], "dw385xd": [{"0_Comment Submission": "CL cold cop advice?", "1_Text": "Haha the advice is good friggin luck! I have never had any success trying to go through ol Craig's List... Thats just me, and maybe because of where I live in the country.. Either way I don't think i've even gotten so much as an email back whenever I am desperate and forced to try to resort to CL for a score.", "2_Subreddit": "opiates"}], "dw387gn": [{"0_Comment Submission": "First time doing fentanil. Any advice?", "1_Text": "You can always do more. You can't however do less!  Good luck!", "2_Subreddit": "opiates"}], "dw38azr": [{"0_Comment Submission": "Today's picked, a little under $200", "1_Text": "Geez I can't believe that only like 8 years ago this would've been a fraction of what it costs now!  And five years before that it would've been feasible to obtain this for like 20 bucks or some tiny amount because people who had scripts would get the whole script for nothing and the pills weren't like gold like they are today", "2_Subreddit": "opiates"}], "dw38njz": [{"0_Comment Submission": "no opiates, but got klon & adderall", "1_Text": "Not bad tools to have in your arsenal to overcome the hell that is opiate withdrawal!  Don't take the addy too late in the afternoon or whatever cause even with the klon it could be hard to go to sleep afterwards... If you have some greenery go ahead and add that,and if you also have some kratom and loperamide you are going to be able to be about as comfortable as one can be in those hellish couple of days!", "2_Subreddit": "opiates"}], "dwicd54": [{"0_Comment Submission": "Today's picked, a little under $200", "1_Text": "I've heard that drug prices in Australia are insanely high?  Is that true or just media propaganda?  I saw on Drugs Inc that Ice goes for like 10x as much as it does in the states.  How much is like a G or a bundle of some H down under?", "2_Subreddit": "opiates"}], "dwqqmxw": [{"0_Comment Submission": "Finally happy Tuesday.", "1_Text": "Thats because its one of those fake press wheels weve been seeing pop up across the country.  The third circle is 100 percent fent.  Be careful out there bropeos! Hahaha", "2_Subreddit": "opiates"}]}], "1_submissions": [{"7elq5n": [{"0_Title": "Help I don't want the thanksgiving wd's", "1_Text": "You say you speak spanish well, and you clearly speak english well so use that to your advantage to create a narrative that they can believe.  I dunno thats kinda what I did with dealers. Pretend to be another dealer or to represent someone with money. I inevitably would get better stuff and more respect than if they just initially saw me as a junkie.", "2_Subreddit": "opiates"}], "7etjka": [{"0_Title": "I hate my life", "1_Text": "You say you speak spanish well, and you clearly speak english well so use that to your advantage to create a narrative that they can believe.  I dunno thats kinda what I did with dealers. Pretend to be another dealer or to represent someone with money. I inevitably would get better stuff and more respect than if they just initially saw me as a junkie.", "2_Subreddit": "Opiatewithdrawal"}], "7mmp9r": [{"0_Title": "China blames US for fentanyl demand...", "1_Text": "You say you speak spanish well, and you clearly speak english well so use that to your advantage to create a narrative that they can believe.  I dunno thats kinda what I did with dealers. Pretend to be another dealer or to represent someone with money. I inevitably would get better stuff and more respect than if they just initially saw me as a junkie.", "2_Subreddit": "opiates"}], "7r2u47": [{"0_Title": "Snowed in...", "1_Text": "You say you speak spanish well, and you clearly speak english well so use that to your advantage to create a narrative that they can believe.  I dunno thats kinda what I did with dealers. Pretend to be another dealer or to represent someone with money. I inevitably would get better stuff and more respect than if they just initially saw me as a junkie.", "2_Subreddit": "opiates"}], "7yugd9": [{"0_Title": "Dear Black People Please TIP when you go out to eat!", "1_Text": "You say you speak spanish well, and you clearly speak english well so use that to your advantage to create a narrative that they can believe.  I dunno thats kinda what I did with dealers. Pretend to be another dealer or to represent someone with money. I inevitably would get better stuff and more respect than if they just initially saw me as a junkie.", "2_Subreddit": "RestaurantEmployees"}]}]}]}