{"Aztecpontiacc": [{"0_comments": [{"dsuef86": [{"0_Comment Submission": "Pretty much everyone watching the charts right about meow", "1_Text": "That worked out great I bought back in right when it started to go back up and sold right before it beat now I'm up 15%", "2_Subreddit": "CryptoMarkets"}], "dsy93pw": [{"0_Comment Submission": "Tether now prints $100 million DAILY to delay the doom of Bitfinex", "1_Text": "Just cashed out of he $2k I put into crypto three weeks ago after reading this. Luckily barely broke even. Fuck that shit", "2_Subreddit": "CryptoMarkets"}], "dsz07s8": [{"0_Comment Submission": "Time to cash out bevor the tether armaggadon hit us?", "1_Text": "I pulled out right before my portfolio went up 16%; would have made $300 last night :((( oh well, it would've been fine to lose what I had in it, but I didn't want to throw money away like that. I think we will have a great opportunity for profits once Tether collapses, right? Just keep saving extra fiat for when prices are cheap again. and if it doesn't crash and it turns out there is 2 billion sitting in a bank account, then just buy the next dip!", "2_Subreddit": "Tether"}], "dt0qmrz": [{"0_Comment Submission": "Which Coin will bring us Ripple like growth in 2018?", "1_Text": ">every January your savings account gets cut in half and is on the verge of a complete collapse with any sort of major hack, regulation, etc. \n\nSounds like great performance, can't wait to put my life savings into Bitcoin", "2_Subreddit": "CryptoMarkets"}], "dt35ye8": [{"0_Comment Submission": "CRYPTO GENIUS REVEALS STRATEGY FOR 80,000% RETURNS IN JUST 18 MONTHS", "1_Text": "How come nobody ever talks about this crypto genius? I see his face everywhere I go nowadays. He appears to be pretty much the Mohammed of cryptocurrency. Should I send him my money?", "2_Subreddit": "CryptoMarkets"}], "dt5qggj": [{"0_Comment Submission": "Is the dip over?", "1_Text": "Lol'd", "2_Subreddit": "CryptoMarkets"}], "dt7l052": [{"0_Comment Submission": "Coinbase Overshoots 2017 Revenue Goal By 66% Making $1 Bln, Rejects Further VC Funding", "1_Text": "If you go to Bitcoin's website they have a page with dozen of websites that you can purchase Bitcoin from with fiat. Funny, they don't actually list coinbase. For the USA market they do list Gemini", "2_Subreddit": "CryptoMarkets"}], "dte6fhu": [{"0_Comment Submission": "Post here your low market cap coins to get into at the rebound (my picks: FDX, PRL, WISH, OPT, SNOV, XBL, WAND, MTX - see in the description why)", "1_Text": "Only got around $500 in the markets right now, but I put it all into COSS last night after researching and looking at their website. Super ambitious and a little risky, but if they can pull of what they are shooting for, I see a top 10 coin.", "2_Subreddit": "CryptoMarkets"}], "dteims3": [{"0_Comment Submission": "Most talked about and upvoted cryptos and altcoins on reddit, week ending 2018-01-26", "1_Text": "I was trying to figure out a way to do the same thing. Was thinking use one of the top three as a low risk staple, a couple high ranking top 20s to complement, and new trending small caps as your high risk moon shots?", "2_Subreddit": "altcoin"}], "dtekgq0": [{"0_Comment Submission": "Recent scams or suspect tokens", "1_Text": "Just make sure you but back your Bitcoin right before tether plummets to zero and you'll be fine", "2_Subreddit": "altcoin"}], "dth7fxo": [{"0_Comment Submission": "U.S. Regulators to Subpoena Crypto Exchange Bitfinex, Tether", "1_Text": "Good thing I only have $600 in crypto. Regretting buying $600 worth of crypto last night though.", "2_Subreddit": "CryptoMarkets"}], "dtlmkk8": [{"0_Comment Submission": "U.S. Regulators to Subpoena Crypto Exchange Bitfinex, Tether", "1_Text": "What would that be worth now now? Probably around $250 if you invested in a mix of top 100? $100 if you went for small caps?", "2_Subreddit": "CryptoMarkets"}], "dtrgbcx": [{"0_Comment Submission": "I woke up this morning upset with myself, again, for not buying crypto until Ether was at $225 USD..", "1_Text": "What?", "2_Subreddit": "altcoin"}], "dts3fll": [{"0_Comment Submission": "Enjoy the massacre. It could be a once in life opportunity.", "1_Text": "just save up a little bit over the next few weeks/months, it'll probably keep going lower now that we've broken through the $8k BTC resistance level", "2_Subreddit": "CryptoCurrency"}], "dtt3ysv": [{"0_Comment Submission": "I've made 500k in profits. I'm fine. HODL is a community problem. If you can't think for yourself, you deserve to lose. I expect downvotes, but is there no one that thinks this is insane? Don't let the Internet tell you how to manage your risks/assets.", "1_Text": "I pulled out early January after the dip right after breaking even. Put $1k back in over the last three days, as it appeared we had hit the lowest point of resistance and we're going to bounce back. That $1k is now $380. Not really even worth pulling out at this point. While that was just play money, it's hard not to get emotional with something like this, you put so much time and energy into researching and trying to make the best decisions, it feels bad when you lose, not necessarily because of the money, but because you feel stupid and it's not fun anymore. I tried to get in for the wrong reasons, too. Mainly just to try to make a profit. After spending so much time reading about cryptocurrency so, I really have become interested and faithful in the technology though. Just uncertain about the immedediate future.", "2_Subreddit": "CryptoMarkets"}], "dtta1j9": [{"0_Comment Submission": "U.S. Regulators to Subpoena Crypto Exchange Bitfinex, Tether", "1_Text": "Not anymore!", "2_Subreddit": "CryptoMarkets"}], "dtx2ajg": [{"0_Comment Submission": "Binance trades frozen?", "1_Text": "Fucking wish I didn't have all my shit in tether thought everything was gonna drop tonight but it's still going up :/", "2_Subreddit": "CryptoMarkets"}], "dubuuqh": [{"0_Comment Submission": "What is the best coin to SELL right now and why?", "1_Text": "COSS\n\nI fell for the shills and bought a bunch at $1.10 after seeing their exchange and their website listing ten different massive projects they were pursuing.\n\nThe more I read (and the more the price went down) I realized that all of these ambitions were probably setting the bar a little too high. Especially with their exchange still being in beta while kucoin became the second largest exchange in the same amount of time.\n\nSold and bought neo.", "2_Subreddit": "CryptoMarkets"}], "ducqv6y": [{"0_Comment Submission": "Refunded by Coinbase", "1_Text": "same thing, happened last night while I was asleep, charged $350.00 three times, and refunded three times. I intentionally overdrew my debit card account yesterday in an attempt to hopefully prevent any charges from going through; however, Wells Fargo put them through anyways.\n\nWhen I called Wells Fargo and explained that these charges were not authorized, they immediately refunded the $105 in overdraft fees charged.\n\nI also turned off overdraft protection, and transferred until the balance of this account was $0.00. \n\nI plan on leaving this balance at $0.00 until all of this blows over, that way it will just get declined if they try and charge me again. \n\nFucking insane, how many hundreds of millions of dollars in duplicate charges has Coinbase processed??\n\nAt my business, the credit card fee is around 5%; Coinbase is going to be fucking broke soon if they don't cut this shit out. This is absolutely insane that this is still happening today.", "2_Subreddit": "CoinBase"}], "dv39r73": [{"0_Comment Submission": "Heart Becoming Increasingly Irregular, resolved w Magnesium Supplement", "1_Text": "She had me do an EKG, said everything was normal, and palpitations, elevated heart rate/blood pressure, etc. were being caused by anxiety and panic disorder.", "2_Subreddit": "HealthAnxiety"}], "dv7bpak": [{"0_Comment Submission": "How does Anxiety and sleeps impact the brain?", "1_Text": "Are you worried that you aren't sleeping enough? If you're getting seven hours of sleep, your getting the recommended amount of sleep for a young adult.. I wish I could get seven hours of sleep! When I was sleeping seven hours a night, I remember feeling pretty great..\n\nIn fact I remember reading a study that found 7 hours to be the most optimal sleep time for humans, and sleeping longer than that generally had negative effects as well. Can't seem to find it now though.", "2_Subreddit": "HealthAnxiety"}], "dvs6e9u": [{"0_Comment Submission": "My heart hates me.", "1_Text": "I've had anxiety and depression issues for the better part of the last decade, since I was 15 really.\n\nI went to the emergency room thinking I was having a heart attack a few years ago; basically, I got three xanax for a little over $6,000. \n\n\nI was doing pretty well, not having panic attacks, but around the holidays, anxiety always comes back (haven't talked to my mom in years, narcissistic mother). I started getting palpitations this time really frequently, which really freaked me out, convincing myself I developed an arrhythmia somehow. \n\nI went to the doctor and got an EKG, she refereed me to mental health treatment, stating anxiety was causing the palpitations. This made me feel better for a bit, but when I get stressed out at work, or start thinking about my health, they keep coming back. \n\n\nOne thing that has helped me dramatically is magnesium; I purchased an \"ionic\" magnesium solution from GNC, and this has helped reduce my palpitations by a huge percentage. \n\n\nIt's funny, when I wake up on Saturday morning, I feel great, and go on a huge long 5 mile straight-up-a-mountain hike, go out to dinner, and go to bed, and have an excellent resting heart rate and 02 measure, and no palpitations all day. But as soon as I get a couple days into the week, and work a few stressful 12 hour shifts, I'm back to getting occasional and sometimes more frequent palpitations, that always compound with my anxiety, making it 10x worse, and leading to a terrible spiral of stress>palpitations>anxiety>panic attacks>more palpitations>insomnia>worsening anxiety>more frequent panic attacks etc. \n\nReally sucks sometimes, but I guess it's slowly getting better. I would definitely try the magnesium though, if you haven't had any kidney problems.", "2_Subreddit": "HealthAnxiety"}], "dwdd8hx": [{"0_Comment Submission": "Buying in bulk to save money", "1_Text": "I used to spend $300 a day on blues, and $150 a day on H when I made the switch. I now spend between $20-$80 a day on H, and it's the purest, highest quality H me or anyone I know has ever seen. \n\n\nI found a runner that I grab a bunch from at a time from at a time, which means I can get it for what dealers are getting it for; this bring the cost per g down to $40-80 per (and it's not cut, so one g goes 2-3x as far). \n\n\nI'm very grateful I found out how to buy like this, because this has made my addiction completely sustainable and tolerable, and no one knows I use, as its more of a minor inconvenience rather than an all-consuming expense. \n\n\nI would highly recommend trying to save up a bit, and spend some time trying to find wholesale connects in your area, you probably all use an ounce a month anyways, it just takes a little self discipline to save it up for a month and start getting zips to cut your cost in half or into a quarter of what you pay retail, which is 75% profit for your dboy. \n\n\nThe biggest benefit is that, when you have an infinite supply of your DOC, you aren't fiending all the time; when I first started buying in bulk, I was using 2-3 g's a day; I'm now down to .3-1.0 a day (usually averaging .5, which is a huge reduction). I'm actually working on tapering down 10% a week until I get down to .1 or 0.05, which is when I'll try to hop off and go clean. It's not really fun or exciting anymore when you aren't broke and racking up credit card debt and hustling to get your next fix, it almost makes you depressed when you use; I think that getting to the point where you aren't worried about getting your next fix really makes you realize that life is way better clean, and makes you not want to use anymore.", "2_Subreddit": "opiates"}], "dwhd81e": [{"0_Comment Submission": "Buying in bulk to save money", "1_Text": "do it, totally worth the risk, because you'll cut your cost into a fraction of what you're paying now if it works out..", "2_Subreddit": "opiates"}], "dwhdbdc": [{"0_Comment Submission": "\"Let's rock.\" 'Let's rock.' \"Today.\" 'Today.'", "1_Text": "Thought this was a sandwich bag, nice 4-5 oz cop lol. \n\nBut then I saw the 2g comment and realized it's a mini sandwich bag.", "2_Subreddit": "opiates"}]}], "1_submissions": [{"7sa6fi": [{"0_Title": "CRYPTO GENIUS REVEALS STRATEGY FOR 80,000% RETURNS IN JUST 18 MONTHS", "1_Text": "That worked out great I bought back in right when it started to go back up and sold right before it beat now I'm up 15%", "2_Subreddit": "CryptoMarkets"}], "8197uq": [{"0_Title": "Heart Becoming Increasingly Irregular, resolved w Magnesium Supplement", "1_Text": "That worked out great I bought back in right when it started to go back up and sold right before it beat now I'm up 15%", "2_Subreddit": "HealthAnxiety"}]}]}]}