{"Airborne82D": [{"0_comments": [{"dwngkyw": [{"0_Comment Submission": "2nd amendment rights stripped", "1_Text": "Yeah I agree... I'm definitely going to talk with my doctor.. There's definitely a few different kinds fo crazy but I've never been the violent or homicidal type and as far a suicide goes a gun would be the last route I'd go lol. Disclaimer: I'm not suicidal what so ever. I'm gonna do some more digging and find a way to fix this.. Thanks for your input.", "2_Subreddit": "Veterans"}], "dwtnzlv": [{"0_Comment Submission": "Brass flakes (?) when cleaning my Shadow Compact, anyone see something like this before?", "1_Text": "I've had the same from cheap range ammo. Nothing to be alarmed.", "2_Subreddit": "CZFirearms"}], "dww22fg": [{"0_Comment Submission": "Was cleaning out my girl's dad's shed and found a whole bunch of vintage ammo.", "1_Text": "Haha dupont made ammo... Bet they won't go near anything gun related these days.", "2_Subreddit": "Firearms"}], "dww2ysa": [{"0_Comment Submission": "2nd amendment rights stripped", "1_Text": "Sure wasn't, it was me seeking help. Things are quite a bit different with the military I assume.", "2_Subreddit": "Veterans"}], "dww33tg": [{"0_Comment Submission": "Learned this the hard way", "1_Text": "Like fishing in a mud hole.. Likely to catch a diseased blue gill.. Somehow I caught a nice rainbow trout and not quite sure lol been with her for 5 years now and we have a kid.. On a side note I ended up in a scientology run rehab which is a whole nother crazy story lmao", "2_Subreddit": "opiates"}], "dww3d28": [{"0_Comment Submission": "Just copped for the first time in 7 months.", "1_Text": "Looks like some Seattle tar.. I don't miss the smell or taste but it sure does make ya feel good lol", "2_Subreddit": "opiates"}], "dww3igr": [{"0_Comment Submission": "Tramadol any good?", "1_Text": "Does it have the potential to induce anxiety? I'm very susceptible to anxiety.", "2_Subreddit": "Drugs"}], "dww3knk": [{"0_Comment Submission": "Tramadol any good?", "1_Text": "What mg did you take to I dice euphoria? I have 50mg pills I'm suppose to take 2 according to the script.", "2_Subreddit": "Drugs"}], "dww4kln": [{"0_Comment Submission": "Tramadol any good?", "1_Text": "I havnt had a single red strain that I enjoyed. I prefer green veins.", "2_Subreddit": "Drugs"}], "dww4mci": [{"0_Comment Submission": "Tramadol any good?", "1_Text": "How many MGs did you take?", "2_Subreddit": "Drugs"}], "dww6t3e": [{"0_Comment Submission": "Tramadol any good?", "1_Text": "Reds usually get me more drowsy and kind of weird feeling.. Of course I havnt tried all reds out there but the ones I've tried have caused me to completely stay away from them. Whites arnt bad but tend to make me a little more jittery and anxious sometimes. My favorites are green borneo and green Malaysian.. These two greens make me feel very relaxed and happy with no come down or jitters and a nice mild euphoria, they don't make me get energy or lethargy they're somewhere in the middle.", "2_Subreddit": "Drugs"}], "dww77vy": [{"0_Comment Submission": "Tramadol any good?", "1_Text": "Damn that's crazy.. Had you ever had a seizure before that?", "2_Subreddit": "Drugs"}], "dww7sdw": [{"0_Comment Submission": "Tramadol any good?", "1_Text": "Damn that's a trip.. I had read about the increased seizure risk and its definitely a concern.. Never had a seizure but definitely scary.. How many MGs did you take when you had a seizure?", "2_Subreddit": "Drugs"}], "dwwawuf": [{"0_Comment Submission": "Learned this the hard way", "1_Text": "So I ended up at this rehabilitation center called \"Narconon\".. The detox was weird from the get go. We were not allowed even Tylenol or any \"drug\" and I had to withdrawal from heroin cold turkey. Many sleepless nights but we wernt even allowed to take a nap during the day.. The weirdness began about the second day when the blank staring robots who worked there would direct us to \"look at that wall\".. so I would look at the wall and they would say \"thank you, look at that clock\".. This would go on for hours and the end result was suppose to be a \"cognition\" like \"omg I realize I do drugs because my father beat me\" or some crazy shit like that... After detox I was let out of the crazy room and graduated to the next step of the \"program\"... I was introduced to all the \"students\" who were a bunch of fucking losers... Don't get me wrong I was a drug addict and not the best person but these people who were being \"treated\" here had some serious issues besides drug abuse. The second phase of the program had 8 books or levels foresay all written by the founder of scientology \"L. Ron Hubbard\".. The first book was the craziest and basically said the reason that all people act up is because they have a \"misunderstood word\".. So while reading these books the staff would periodically check in and clear words from the curriculum and ask for example \"what does the word THERE mean?\" and I'd be like \"are you kidding me that word has about 100 different usages and contexts\" and so they'd be like \"well that's incorrect you have to read the entire book over from the beginning. This madness went on for a long time.. Next part was a sauna program where we would sit in the sauna for 15 minute intervals for about 4 hours a day and each day take more and more niacin to the point that you would have a reaction similar to allergies where your entire body would tingle and turn bright red.. This went on for 30 days and I worked my way up to like 2000mg of niacin a day.. After that we had to write down every single thing we did wrong in our entire life and have some creep in a dark room review everthing we wrote untill he felt we had revealed everything. We had to reenact situations in our lives with clay characters and do those \"objective exercises\" I mentioned in the beginning for hours and hours for weeks on end. The craziest part was that we had to sit in a chair and stare at another person across from is for 2 hours straight without moving a single muscle, couldnt even scratch and itch which is fucking torture and if you did at say the 1.5 hour mark you'd have to start over from the beginning.. This sent me into a rage and nearly caused me to freak the fuck out. Long story short it was a brain washing boot camp for the church of scientology hiding under the guise of a treatment center giving absolutely no rehabilitation to people with legit issues and charging folks $50k or more.. Crazy time in my life lol.", "2_Subreddit": "opiates"}], "dwwb6ks": [{"0_Comment Submission": "Tramadol any good?", "1_Text": "Wow sounds crazy.. I'm glad you're OK.. Thanks for the info man.", "2_Subreddit": "Drugs"}], "dwwzocv": [{"0_Comment Submission": "Learned this the hard way", "1_Text": "I agree! Burn em all down.", "2_Subreddit": "opiates"}], "dwwzqpn": [{"0_Comment Submission": "Learned this the hard way", "1_Text": "No I was in Colorado but they have treatment centers all over the US and the world.", "2_Subreddit": "opiates"}], "dwx01tb": [{"0_Comment Submission": "Just copped for the first time in 7 months.", "1_Text": "OK.. I guess you're busted lol", "2_Subreddit": "opiates"}], "dwxg5sk": [{"0_Comment Submission": "Learned this the hard way", "1_Text": "Yah my father paid for me to be there. They totally want to recruit people at their weakest point.. A lot of religions do the same thing but scientology is much more sinister imo. They talked about narconon on Leah Remini's Scientology show on A&E... Narconon is endorsed by Tom Cruise as the only rehab that actually works and they claim to have like an 80% success rate.. Needless to say I know about 8 people who are now dead who attended the program with me.", "2_Subreddit": "opiates"}], "dwxm75d": [{"0_Comment Submission": "Learned this the hard way", "1_Text": "Yeah just Google \"Narconon Oklahoma\" if you want to hear some horror stories.. There is also a bunch of class action lawsuits against them.", "2_Subreddit": "opiates"}], "dwxnnnt": [{"0_Comment Submission": "Facebook admits Zuckerberg wiped his old messages—which you can’t do", "1_Text": "Yeah man. Found nudes of ex wife and GFs of times past lol and weird convos from teenage years that don't even sound like me lol", "2_Subreddit": "worldnews"}], "dwxsphl": [{"0_Comment Submission": "Help quiting kratom!", "1_Text": "Thanks for the advice.", "2_Subreddit": "quittingkratom"}], "dwxtjbg": [{"0_Comment Submission": "I finally got some range time in with my new P-07. i get it now.", "1_Text": "I bought the p01 urban grey and I'm loving it. Cz will definitely get all my money in the future.", "2_Subreddit": "CZFirearms"}], "dwy0bmz": [{"0_Comment Submission": "Learned this the hard way", "1_Text": "Between this scientology rehab and Afghanistan I got a lot of stories to tell my children when they grow up\nLmao", "2_Subreddit": "opiates"}], "dwy2bh2": [{"0_Comment Submission": "Learned this the hard way", "1_Text": "For sure man lol..", "2_Subreddit": "opiates"}]}], "1_submissions": [{"87xcl3": [{"0_Title": "Everthing I was looking for and under $700", "1_Text": "Yeah I agree... I'm definitely going to talk with my doctor.. There's definitely a few different kinds fo crazy but I've never been the violent or homicidal type and as far a suicide goes a gun would be the last route I'd go lol. Disclaimer: I'm not suicidal what so ever. I'm gonna do some more digging and find a way to fix this.. Thanks for your input.", "2_Subreddit": "CZFirearms"}], "8a5twu": [{"0_Title": "Tramadol any good?", "1_Text": "Yeah I agree... I'm definitely going to talk with my doctor.. There's definitely a few different kinds fo crazy but I've never been the violent or homicidal type and as far a suicide goes a gun would be the last route I'd go lol. Disclaimer: I'm not suicidal what so ever. I'm gonna do some more digging and find a way to fix this.. Thanks for your input.", "2_Subreddit": "Drugs"}], "8acx4s": [{"0_Title": "Help quiting kratom!", "1_Text": "Yeah I agree... I'm definitely going to talk with my doctor.. There's definitely a few different kinds fo crazy but I've never been the violent or homicidal type and as far a suicide goes a gun would be the last route I'd go lol. Disclaimer: I'm not suicidal what so ever. I'm gonna do some more digging and find a way to fix this.. Thanks for your input.", "2_Subreddit": "quittingkratom"}]}]}]}