{"CYPROXY": [{"0_comments": [{"duy5t87": [{"0_Comment Submission": "Came into a brick of what must be heroin", "1_Text": "All I have to say is that if you intercepted your friends brick in an attempt to save them from themselves, i think you're going about it the wrong way. I'd be fucking furious if one of my friends did this with a single dose of my stuff let alone a brick of it.\n\nYou're interfering in someone's life and assuming that you're standing on the high ground. \n\nYou aren't.\n\nThe high ground is relative to where each person is standing.\n\nThe right move is to give it back provided they still want it. Find another way to fix your friend.", "2_Subreddit": "opiates"}], "duy5yp1": [{"0_Comment Submission": "My dog was prescribed Tramadol and it's just been sitting around. Can I safely take some? It says for vet use only but I'm calling BS on that", "1_Text": "There isn't a factory that makes meds for animals. The meds given to animals are the same meds that are for humans. In fact (pro tip) Fish-Mox is amoxicillin for fish and is OTC on amazon. We buy it all the time whenever we have an infection (ie: tooth) and we need a course of antibiotics.", "2_Subreddit": "opiates"}], "dvbqqhs": [{"0_Comment Submission": "Fast Heart", "1_Text": "No but the first thing that came to mind was the Vagas nerve. I remember when I was super constipated that someone said the the poop , if large enough and anatomy permitting, could press on the vagas nerve and cause heart issues or something?\n\n\nThat's all I got.", "2_Subreddit": "opiates"}], "dvcymdp": [{"0_Comment Submission": "Lope drying up...New Plans & Withdrawal", "1_Text": "Lope's half life is just as long as methadones. Trust me that it's as bad a WD.", "2_Subreddit": "opiates"}], "dvczgzr": [{"0_Comment Submission": "Lope drying up...New Plans & Withdrawal", "1_Text": "Hey buddy. I was on 100mg a day myself for a methadone addiction and was hooked on lope for over 5 years. One thing I can suggest is that you start dosing your lope WAY further apart. I basically got so broke I couldn't afford to even buy lope every day so I started dosing every other day and didn't notice any difference. I was also dabbling with the occasional opiate at the time as well so that helped too.\n\nThen I started dosing every 3 or 4 days. I never really even paid attention to it really. I was so busy with other more important stuff I just noticed one day that I hadn't dosed in 4 days  and was starting to feel some back pain.  I dosed (at this point in my lope addiction I was only taking 20 pills a day) and then didn't dose again for 4 days or more. I really don't remember but I do remember that before I knew it I hadn't had any in over a week and decided to just not get anymore.\n\nLike 3 weeks later the FDA put out their new regulation suggestions limiting the amount you can get at once. It was fucking kismet.\n\nAdditionally, I'll add that lope isn't inherently cardiotoxic. It *can* cause Torsades and long QT syndrome but if I recall correctly, lope seriously depletes potassium which affects heart chemistry and in turn calcium and sodium channels or some such thing (im too tired to cite any references). Some people have taken massive doses for long periods with no issues and others haven't been so lucky.\n\nPersonally I didn't have any issues until I smoked a cigarette and my heart started freaking out. This was before the \"lope is cardiotoxic\" buzz phrase caught on so I didn't figure it was the lope at the time. I dropped my dose significantly after doing some homework and the problems went away.\n\nIn any case, if you're dropping lope and staying clean you're going to feel the depression, lack of motivation, et al for months. If you dabble with the occasional opiate off and on without substituting for the lope then you might be able to manage the worst of the WD's from the lope. \n\nI found that *any* amount of oxy would make my lope WD's disappear and when I was on oxy benders, I didn't take any lope at all - for weeks.\n\nI dunno if any of this helps you or muddy's the waters for you .", "2_Subreddit": "opiates"}], "dvlwh6q": [{"0_Comment Submission": "1g of tar put into a vial. Who else does this?", "1_Text": "Never heard of someone using it for shots but there is a homebake TEK that goes into detail about defatting PST at some point in the process to remove any plant oils and fats by adding paraffin.", "2_Subreddit": "opiates"}], "dw120j4": [{"0_Comment Submission": "Im having a minor surgery tomorrow and need to know the risks", "1_Text": "Tell *someone* on the staff. A friend of mine's dad ended up in ICU after a routine surgery because he failed to tell the staff that he was a fucking alcoholic. Days after the surgery they couldn't figure out why his condition was declining so quickly. Then a family member tells them that \"you know he's an alcoholic right?\"\n\nNope, they didn't. An IV of ethanol brought him back but the damage was done. He wasn't ever right after that from what I understand but don't know why.", "2_Subreddit": "opiates"}], "dw77vij": [{"0_Comment Submission": "Oxycodone is the greatest thing mankind has ever created", "1_Text": "And a roll of the dice *every time* as to whether it will kill you outright. I've tinkered with the idea of switching to H and if I lived somewhere that actually had any H available I probably would have but I can't imagine having to test bump every fucking time and the paranoia that I'd have every time as well.", "2_Subreddit": "opiates"}], "dw77wvf": [{"0_Comment Submission": "Oxycodone is the greatest thing mankind has ever created", "1_Text": "Fucking-A bro. Opana is the king imho but it's as rare as hens teeth anymore.", "2_Subreddit": "opiates"}], "dw783b4": [{"0_Comment Submission": "Debating on whether or not I should do a CWE for 150 mg tramadol/1300 mg APAP", "1_Text": "It isn't worth the hassle and the loss for that little APAP.", "2_Subreddit": "opiates"}], "dw7850g": [{"0_Comment Submission": "No opiates but...JUNKY JESUS TO THE RESCUE. NEVER THOUGHT IT WOULD ACTUALLY HAPPEN TO ME!!!!", "1_Text": "lol man I totally feel you. I've spent way too much time in WDs trying to sling food while fucking weeded with a wall full of tickets.\n\nIt's the **worst**.", "2_Subreddit": "opiates"}], "dw78ekl": [{"0_Comment Submission": "Grapefruit juice after opiate ingestion", "1_Text": "I've done exactly that if only for the reason that it might help prolong the high. I recently ended up with a shitload of grapefruits someone gave me and I remembered to drink/eat 2 of them about an hour before scoring some oxy and when I finally snorted them and got high I was definitely higher - significantly higher and I had completely forgotten that I drank the GF juice. I was thinking to myself \"damn thats really hitting hard today' and it wasn't until later that evening that I remembered that I had the GF juice.\n\nCould have been a fluke but bergamottin is known to potentiate certain opiates.\n\nMy name is based on the Cytochrome P450 3A4 or CYP3A4 enzyme that we all love to try to inhibit to make our drugs feel better or last longer ;)", "2_Subreddit": "opiates"}], "dw78nyc": [{"0_Comment Submission": "With OxyContin (OP), how much do you get instantly, (percentage)?", "1_Text": "Ok so I read this in response to your post because I thought it was a really good question.\n\n[This](https://watermark.silverchair.com/10-suppl_1-S30.pdf?token=AQECAHi208BE49Ooan9kkhW_Ercy7Dm3ZL_9Cf3qfKAc485ysgAAAdIwggHOBgkqhkiG9w0BBwagggG_MIIBuwIBADCCAbQGCSqGSIb3DQEHATAeBglghkgBZQMEAS4wEQQMlVXSwzyvTADFuofAAgEQgIIBhfybU6Hzl8aEEDCktLrhj9Czlx2J9BXCVD8LSoLre6eLAi2oqMqfOUXjUTrOVGFPa9RKkIzqZD0i6kUmWuKk6o-eL226abNkkR9OuyZ6mz85OljttjUsNcWbOF0aipounrOXqd9uIPLd3XXFi1yM-RCUcvuTHAzbQIzKDG_m2GQMik-MiBaodynOiYOyyYuSL1mZZyfCFM-etKbQhVEnSU7Rxlmrs9Ou3KqMAbBcnOsNNl0tXvWydy-skPT0ZY3qvTrRJpzUSuejvmU9dSG6gDaLZzMAuI2urZ7n5_7Xu7KFs38YbDWvJKpMwOw3PeSUPAuTA8CGntn4X0CYoIkL0xJRqWlfmUBwUkYNqh8LUMbUPACmijo_pfOalH1jviwwfR4mSQ2rtea8RUuYtigf_0qRmAUCt37eYeclKNnOmz2kvgGIl7mXED7l03Lo1wWQm6hAZ4m__bAEbMV7BG6SB_5iPs7URUIm93lCUMgt_-oiYaGo8IJPlR29Bt9wLux3afIHKt4I)\npaper goes into detail about all of the primary controlled release matrixes popular today and under the Oxycontin sections it had this to say:\n\n\"In contrast, the OxyContin absorption\nmodel indicates that less than 10% of the total\nabsorption will be complete within 10 minutes\nafter absorption begins. The modeling indicates\nthat absorption from a dose of an immediaterelease\noxycodone solution will be essentially complete\napproximately 1.5 hours after absorption\nbegins, at which time absorption from OxyContin\nis approximately 40% complete. Oxycodone\nabsorption from OxyContin is only 75% complete\nat 9 hours after absorption begins and is approximately\n95% complete at 24 hours. Taking broken,\nchewed, or crushed Oxycontin tablets and other\nSR products “bypasses” the ER technology of the\nformulation and leads to rapid release and absorption\nof oxycodone, which may yield blood levels of\na potentially fatal dose.\"\n\nThis was a really interesting read and goes into detail about other med's matrixes as well.", "2_Subreddit": "opiates"}], "dw78tn7": [{"0_Comment Submission": "Dboy... Falling hard?", "1_Text": "If you have sex for heroin is it now a \"hagina\"?", "2_Subreddit": "opiates"}], "dw78wsk": [{"0_Comment Submission": "No opiates but...JUNKY JESUS TO THE RESCUE. NEVER THOUGHT IT WOULD ACTUALLY HAPPEN TO ME!!!!", "1_Text": "Yup. Sitting outside the back door of the kitchen on an empty 5 gallon bucket of sliced pickles smoking like hell, trying to get your back to stop screaming and dreading like hell having to walk back in...", "2_Subreddit": "opiates"}], "dw7933o": [{"0_Comment Submission": "Xtampza - Experience with breaking time release.", "1_Text": "Part of the allure of oxy is that very shortly after you take it, you feel great. Xtampza takes a good hour to kick in. Also with ER versions of any pill it get's really hard to determine half-life. It's harder to figure out if it's ok to dose again than if you know for a fact that in 3.2 hours half of the oxy will be gone.\n\nI'm probably overly cautious but today for instance I took 2 of these things the normal way. I feel fine. Not high per se but definitely more \"up\" than normal but I want to take more. The problem is that I don't know if it's safe to take 2 more now that it's 5 hours later.\n\nIf it was immediate release I would know instantly that it would be safe because after 5 hours over half of IR oxy is already gone. I can do the math.\n\nI don't feel like I have the tools and knowledge to \"do the math\" on the ER version of xtampza if that makes sense.", "2_Subreddit": "opiates"}], "dw7982w": [{"0_Comment Submission": "Y’all ever feel like your heart is not beating correctly?", "1_Text": "Specifically, in my case, they're called PVC's (Premature ventricular contractions) and they feel like your heart is skipping a beat. This was happening to me a LOT back in the early 2000's when my stress level due to my job was super ultra high.\n\nThe doc did an EKG and saw that it was PVCs and gave me xanax  (low dose) to take as needed. They went away for the most part but  I still get them from time to time. \n\nA micro second before it hits I can tell it's coming. I couldn't describe how I know. I just do. Anyway they generally aren't something to worry about but have a doc check it out anyway.", "2_Subreddit": "opiates"}], "dw79cva": [{"0_Comment Submission": "Need some input about Lope", "1_Text": "I took lope for 5 years. Started at high dose (100mg once a day) and after a year or 2 ended up with weird heart beats and shit not to mention a funky wall-eyed feeling when I looked to the left or right.\n\nIt definitely helped with the WDs from methadone.\n\nI eventually tapered to just 40mg once a day and stayed there for 3 more years and only recently quit it altogether. Lope WD is no fucking joke. I'd eat a wet bucket full of shit over lope WD any day so don't stay on the lope very long.\n\n15-20 pills at a time should help you immensely.", "2_Subreddit": "opiates"}], "dw79k7v": [{"0_Comment Submission": "No opiates but...JUNKY JESUS TO THE RESCUE. NEVER THOUGHT IT WOULD ACTUALLY HAPPEN TO ME!!!!", "1_Text": "And you have to make up some excuse as to why the other day you could easily handle the 8pm rush but tonight you aren't even close to getting the orders out on time. You're moving in slow motion and you can't even remember the orders  - hell, you can barely *read* the tickets.", "2_Subreddit": "opiates"}], "dw7aq12": [{"0_Comment Submission": "A review of the cardiotoxicity of Methadone", "1_Text": "This same effect is caused by loperamide as well. It's part of the reason there's a stink now about it and one of the reason's they're going to limit/regulate it's availability.", "2_Subreddit": "Methadone"}], "dw7asu2": [{"0_Comment Submission": "Do i need to piss dirty to get into the clinic", "1_Text": "I was doing 220mg of methadone a day for 3 years and had to quit cold turkey and had very similar duration of withdrawals as you did.\n8 months later I felt mostly like my old self but the fucking chain-sneezing lasted even longer! \n\nI would sneeze 6-10 in a row during the whole WD process - over a year of that!", "2_Subreddit": "Methadone"}], "dw7aw8t": [{"0_Comment Submission": "Looks like it was a fetty OD. I'm like super down abt this. For like 2 months now", "1_Text": "Fuck I didn't even know she had died. Well that just sucks. :\\", "2_Subreddit": "opiates"}], "dwnmj8q": [{"0_Comment Submission": "Sick on easter", "1_Text": "Me. sucks man.", "2_Subreddit": "opiates"}], "dww6d0j": [{"0_Comment Submission": "Some blues👌", "1_Text": "god I'd give a lot for just one right about now....\n;(", "2_Subreddit": "opiates"}], "dww6nrt": [{"0_Comment Submission": "Syringes in The US’s cock.", "1_Text": "Hey I don't shoot but I used to be in a profession that used hypodermics all the time and we would get them at Tractor Supply for animals. All sizes of syringes and needles. Fuck CVS.", "2_Subreddit": "opiates"}]}], "1_submissions": [{"77bbtf": [{"0_Title": "**BEWARE** Indian oxy is bunk.", "1_Text": "All I have to say is that if you intercepted your friends brick in an attempt to save them from themselves, i think you're going about it the wrong way. I'd be fucking furious if one of my friends did this with a single dose of my stuff let alone a brick of it.\n\nYou're interfering in someone's life and assuming that you're standing on the high ground. \n\nYou aren't.\n\nThe high ground is relative to where each person is standing.\n\nThe right move is to give it back provided they still want it. Find another way to fix your friend.", "2_Subreddit": "opiates"}], "77bfim": [{"0_Title": "How similar is an Opana (oxymorphone) buzz compared to heroin?", "1_Text": "All I have to say is that if you intercepted your friends brick in an attempt to save them from themselves, i think you're going about it the wrong way. I'd be fucking furious if one of my friends did this with a single dose of my stuff let alone a brick of it.\n\nYou're interfering in someone's life and assuming that you're standing on the high ground. \n\nYou aren't.\n\nThe high ground is relative to where each person is standing.\n\nThe right move is to give it back provided they still want it. Find another way to fix your friend.", "2_Subreddit": "opiates"}], "77fpzo": [{"0_Title": "Life is a series of Peaks and Valleys. The Valleys really suck.", "1_Text": "All I have to say is that if you intercepted your friends brick in an attempt to save them from themselves, i think you're going about it the wrong way. I'd be fucking furious if one of my friends did this with a single dose of my stuff let alone a brick of it.\n\nYou're interfering in someone's life and assuming that you're standing on the high ground. \n\nYou aren't.\n\nThe high ground is relative to where each person is standing.\n\nThe right move is to give it back provided they still want it. Find another way to fix your friend.", "2_Subreddit": "opiates"}], "7cj1vk": [{"0_Title": "When life keeps on beating the shit out of you...", "1_Text": "All I have to say is that if you intercepted your friends brick in an attempt to save them from themselves, i think you're going about it the wrong way. I'd be fucking furious if one of my friends did this with a single dose of my stuff let alone a brick of it.\n\nYou're interfering in someone's life and assuming that you're standing on the high ground. \n\nYou aren't.\n\nThe high ground is relative to where each person is standing.\n\nThe right move is to give it back provided they still want it. Find another way to fix your friend.", "2_Subreddit": "opiates"}], "7fc5yg": [{"0_Title": "Unemployment Eppicard question.... (unrelated to drugs, mostly)", "1_Text": "All I have to say is that if you intercepted your friends brick in an attempt to save them from themselves, i think you're going about it the wrong way. I'd be fucking furious if one of my friends did this with a single dose of my stuff let alone a brick of it.\n\nYou're interfering in someone's life and assuming that you're standing on the high ground. \n\nYou aren't.\n\nThe high ground is relative to where each person is standing.\n\nThe right move is to give it back provided they still want it. Find another way to fix your friend.", "2_Subreddit": "opiates"}], "7fcj7d": [{"0_Title": "Anyone's Unemployment Deposit Delayed due to the holiday? (Florida specifically, but any state) [eppicard]", "1_Text": "All I have to say is that if you intercepted your friends brick in an attempt to save them from themselves, i think you're going about it the wrong way. I'd be fucking furious if one of my friends did this with a single dose of my stuff let alone a brick of it.\n\nYou're interfering in someone's life and assuming that you're standing on the high ground. \n\nYou aren't.\n\nThe high ground is relative to where each person is standing.\n\nThe right move is to give it back provided they still want it. Find another way to fix your friend.", "2_Subreddit": "AskReddit"}], "7fclw6": [{"0_Title": "Anyone's Unemployment Deposit Delayed due to the holiday? (Florida specifically, but any state)", "1_Text": "All I have to say is that if you intercepted your friends brick in an attempt to save them from themselves, i think you're going about it the wrong way. I'd be fucking furious if one of my friends did this with a single dose of my stuff let alone a brick of it.\n\nYou're interfering in someone's life and assuming that you're standing on the high ground. \n\nYou aren't.\n\nThe high ground is relative to where each person is standing.\n\nThe right move is to give it back provided they still want it. Find another way to fix your friend.", "2_Subreddit": "AskReddit"}], "7fcou5": [{"0_Title": "Anyone's Unemployment Deposit Delayed due to the holiday? (Florida specifically, but any state)", "1_Text": "All I have to say is that if you intercepted your friends brick in an attempt to save them from themselves, i think you're going about it the wrong way. I'd be fucking furious if one of my friends did this with a single dose of my stuff let alone a brick of it.\n\nYou're interfering in someone's life and assuming that you're standing on the high ground. \n\nYou aren't.\n\nThe high ground is relative to where each person is standing.\n\nThe right move is to give it back provided they still want it. Find another way to fix your friend.", "2_Subreddit": "answers"}], "7fqqgq": [{"0_Title": "FUCKING DAMMIT! (Shitpost)", "1_Text": "All I have to say is that if you intercepted your friends brick in an attempt to save them from themselves, i think you're going about it the wrong way. I'd be fucking furious if one of my friends did this with a single dose of my stuff let alone a brick of it.\n\nYou're interfering in someone's life and assuming that you're standing on the high ground. \n\nYou aren't.\n\nThe high ground is relative to where each person is standing.\n\nThe right move is to give it back provided they still want it. Find another way to fix your friend.", "2_Subreddit": "opiates"}], "7frljy": [{"0_Title": "Fucking unemployment ...", "1_Text": "All I have to say is that if you intercepted your friends brick in an attempt to save them from themselves, i think you're going about it the wrong way. I'd be fucking furious if one of my friends did this with a single dose of my stuff let alone a brick of it.\n\nYou're interfering in someone's life and assuming that you're standing on the high ground. \n\nYou aren't.\n\nThe high ground is relative to where each person is standing.\n\nThe right move is to give it back provided they still want it. Find another way to fix your friend.", "2_Subreddit": "opiates"}], "7jkwyl": [{"0_Title": "New WD experience - thought I knew it all....", "1_Text": "All I have to say is that if you intercepted your friends brick in an attempt to save them from themselves, i think you're going about it the wrong way. I'd be fucking furious if one of my friends did this with a single dose of my stuff let alone a brick of it.\n\nYou're interfering in someone's life and assuming that you're standing on the high ground. \n\nYou aren't.\n\nThe high ground is relative to where each person is standing.\n\nThe right move is to give it back provided they still want it. Find another way to fix your friend.", "2_Subreddit": "opiates"}], "7jp6iu": [{"0_Title": "I'm making a CWE Guide and need formatting assistance.", "1_Text": "All I have to say is that if you intercepted your friends brick in an attempt to save them from themselves, i think you're going about it the wrong way. I'd be fucking furious if one of my friends did this with a single dose of my stuff let alone a brick of it.\n\nYou're interfering in someone's life and assuming that you're standing on the high ground. \n\nYou aren't.\n\nThe high ground is relative to where each person is standing.\n\nThe right move is to give it back provided they still want it. Find another way to fix your friend.", "2_Subreddit": "opiates"}], "7jpb77": [{"0_Title": "Heya!", "1_Text": "All I have to say is that if you intercepted your friends brick in an attempt to save them from themselves, i think you're going about it the wrong way. I'd be fucking furious if one of my friends did this with a single dose of my stuff let alone a brick of it.\n\nYou're interfering in someone's life and assuming that you're standing on the high ground. \n\nYou aren't.\n\nThe high ground is relative to where each person is standing.\n\nThe right move is to give it back provided they still want it. Find another way to fix your friend.", "2_Subreddit": "heroin"}], "7jpdnz": [{"0_Title": "Guide 1 - no formatting", "1_Text": "All I have to say is that if you intercepted your friends brick in an attempt to save them from themselves, i think you're going about it the wrong way. I'd be fucking furious if one of my friends did this with a single dose of my stuff let alone a brick of it.\n\nYou're interfering in someone's life and assuming that you're standing on the high ground. \n\nYou aren't.\n\nThe high ground is relative to where each person is standing.\n\nThe right move is to give it back provided they still want it. Find another way to fix your friend.", "2_Subreddit": "heroin"}], "7m40lc": [{"0_Title": "When you have money and NOBODY will answer the damn phone.", "1_Text": "All I have to say is that if you intercepted your friends brick in an attempt to save them from themselves, i think you're going about it the wrong way. I'd be fucking furious if one of my friends did this with a single dose of my stuff let alone a brick of it.\n\nYou're interfering in someone's life and assuming that you're standing on the high ground. \n\nYou aren't.\n\nThe high ground is relative to where each person is standing.\n\nThe right move is to give it back provided they still want it. Find another way to fix your friend.", "2_Subreddit": "opiates"}], "7m5sum": [{"0_Title": "The crap drug users do/put up with to score - my \"cop\" tonight.", "1_Text": "All I have to say is that if you intercepted your friends brick in an attempt to save them from themselves, i think you're going about it the wrong way. I'd be fucking furious if one of my friends did this with a single dose of my stuff let alone a brick of it.\n\nYou're interfering in someone's life and assuming that you're standing on the high ground. \n\nYou aren't.\n\nThe high ground is relative to where each person is standing.\n\nThe right move is to give it back provided they still want it. Find another way to fix your friend.", "2_Subreddit": "opiates"}], "7olcvy": [{"0_Title": "What a week", "1_Text": "All I have to say is that if you intercepted your friends brick in an attempt to save them from themselves, i think you're going about it the wrong way. I'd be fucking furious if one of my friends did this with a single dose of my stuff let alone a brick of it.\n\nYou're interfering in someone's life and assuming that you're standing on the high ground. \n\nYou aren't.\n\nThe high ground is relative to where each person is standing.\n\nThe right move is to give it back provided they still want it. Find another way to fix your friend.", "2_Subreddit": "opiates"}], "7pukqx": [{"0_Title": "I gotta come up with $30 first thing in the morning.", "1_Text": "All I have to say is that if you intercepted your friends brick in an attempt to save them from themselves, i think you're going about it the wrong way. I'd be fucking furious if one of my friends did this with a single dose of my stuff let alone a brick of it.\n\nYou're interfering in someone's life and assuming that you're standing on the high ground. \n\nYou aren't.\n\nThe high ground is relative to where each person is standing.\n\nThe right move is to give it back provided they still want it. Find another way to fix your friend.", "2_Subreddit": "opiates"}], "7q2tv6": [{"0_Title": "Heroin users - do you test shot every batch of H you pick up? How much do you test with if you do?", "1_Text": "All I have to say is that if you intercepted your friends brick in an attempt to save them from themselves, i think you're going about it the wrong way. I'd be fucking furious if one of my friends did this with a single dose of my stuff let alone a brick of it.\n\nYou're interfering in someone's life and assuming that you're standing on the high ground. \n\nYou aren't.\n\nThe high ground is relative to where each person is standing.\n\nThe right move is to give it back provided they still want it. Find another way to fix your friend.", "2_Subreddit": "opiates"}], "7r561h": [{"0_Title": "Jesus kill me now - and thanks JJ, sorta?", "1_Text": "All I have to say is that if you intercepted your friends brick in an attempt to save them from themselves, i think you're going about it the wrong way. I'd be fucking furious if one of my friends did this with a single dose of my stuff let alone a brick of it.\n\nYou're interfering in someone's life and assuming that you're standing on the high ground. \n\nYou aren't.\n\nThe high ground is relative to where each person is standing.\n\nThe right move is to give it back provided they still want it. Find another way to fix your friend.", "2_Subreddit": "opiates"}], "7tb2au": [{"0_Title": "I saw a train car full of Glacial Acetic Acid today...", "1_Text": "All I have to say is that if you intercepted your friends brick in an attempt to save them from themselves, i think you're going about it the wrong way. I'd be fucking furious if one of my friends did this with a single dose of my stuff let alone a brick of it.\n\nYou're interfering in someone's life and assuming that you're standing on the high ground. \n\nYou aren't.\n\nThe high ground is relative to where each person is standing.\n\nThe right move is to give it back provided they still want it. Find another way to fix your friend.", "2_Subreddit": "opiates"}], "7v56c6": [{"0_Title": "I was someones JJ today.", "1_Text": "All I have to say is that if you intercepted your friends brick in an attempt to save them from themselves, i think you're going about it the wrong way. I'd be fucking furious if one of my friends did this with a single dose of my stuff let alone a brick of it.\n\nYou're interfering in someone's life and assuming that you're standing on the high ground. \n\nYou aren't.\n\nThe high ground is relative to where each person is standing.\n\nThe right move is to give it back provided they still want it. Find another way to fix your friend.", "2_Subreddit": "opiates"}], "7ychyz": [{"0_Title": "God will it ever end?", "1_Text": "All I have to say is that if you intercepted your friends brick in an attempt to save them from themselves, i think you're going about it the wrong way. I'd be fucking furious if one of my friends did this with a single dose of my stuff let alone a brick of it.\n\nYou're interfering in someone's life and assuming that you're standing on the high ground. \n\nYou aren't.\n\nThe high ground is relative to where each person is standing.\n\nThe right move is to give it back provided they still want it. Find another way to fix your friend.", "2_Subreddit": "opiates"}], "831hgf": [{"0_Title": "Paychecks didn't come in today. FML", "1_Text": "All I have to say is that if you intercepted your friends brick in an attempt to save them from themselves, i think you're going about it the wrong way. I'd be fucking furious if one of my friends did this with a single dose of my stuff let alone a brick of it.\n\nYou're interfering in someone's life and assuming that you're standing on the high ground. \n\nYou aren't.\n\nThe high ground is relative to where each person is standing.\n\nThe right move is to give it back provided they still want it. Find another way to fix your friend.", "2_Subreddit": "opiates"}], "86r06j": [{"0_Title": "Xtampza - Experience with breaking time release.", "1_Text": "All I have to say is that if you intercepted your friends brick in an attempt to save them from themselves, i think you're going about it the wrong way. I'd be fucking furious if one of my friends did this with a single dose of my stuff let alone a brick of it.\n\nYou're interfering in someone's life and assuming that you're standing on the high ground. \n\nYou aren't.\n\nThe high ground is relative to where each person is standing.\n\nThe right move is to give it back provided they still want it. Find another way to fix your friend.", "2_Subreddit": "opiates"}]}]}]}