{"mrdounut": [{"0_comments": [{"dw1mef3": [{"0_Comment Submission": "Travelers if Reddit, what place made you think, \"I have made a huge mistake by coming here?\"", "1_Text": "Lol dont actually go to new delhi, especially alone as a white european traveler, when i studied abroad most of of the sexual harrassment from the trip happened there", "2_Subreddit": "AskReddit"}], "dw481dr": [{"0_Comment Submission": "Elon Musk wins approval for 'staggering' pay deal with potential $55bn bonus", "1_Text": "10%? From an engineering standpoint BEST CASE SENARIO, nothing goes wrong, if thats your best case senario, they are simply one catastrophic failure (recall, successful sue/suit, unfortunate death of a needed employee) from not even having a chance to make it. I give it like a 1 or 2 %", "2_Subreddit": "news"}], "dw9n5yz": [{"0_Comment Submission": "Feeling the urge to pee the moment you lie down in bed is the human equivalent of attemptig to shut down a computer with applications still running.", "1_Text": "THANK GOD NOT THE ONLY ONE", "2_Subreddit": "Showerthoughts"}], "dwd8lgz": [{"0_Comment Submission": "This woman’s family spent two weeks searching for her, before finding her body trapped behind a bookcase in her bedroom. She’d become stuck while plugging an electric cord in, and had been there the entire time.", "1_Text": "Aint lean, no promethazine in her system unless it was the lame ass just codiene syurp, most likely she was popping Tylenol 3's", "2_Subreddit": "MorbidReality"}], "dwdbb9g": [{"0_Comment Submission": "This woman’s family spent two weeks searching for her, before finding her body trapped behind a bookcase in her bedroom. She’d become stuck while plugging an electric cord in, and had been there the entire time.", "1_Text": "Anti sezuire medication really, but yes", "2_Subreddit": "MorbidReality"}], "dwdiyyz": [{"0_Comment Submission": "This woman’s family spent two weeks searching for her, before finding her body trapped behind a bookcase in her bedroom. She’d become stuck while plugging an electric cord in, and had been there the entire time.", "1_Text": "On its own there is no abusable benefit, when combined with an opiate like codiene, its a potentiator and it increases euphoria, length, and makes you sleepy (like an allergy pill). Infact you can take benadryl with opiates as well and itll have the same effect, it also removes itchyness. It prevents seziures but in large doses.. causes sezuires", "2_Subreddit": "MorbidReality"}], "dwf9k4e": [{"0_Comment Submission": "I am the thing that goes thump in the night", "1_Text": "A++++ TITLE", "2_Subreddit": "rs2vietnam"}], "dwgxxyk": [{"0_Comment Submission": "Blank prescription from Google images + 2 mins of photoshop = buying all the Xanax I want in Italy", "1_Text": "Ya lmao there was a gas station across the street in Cancun from my resort, and attached to the motherfucking gas station, is a doctor and pharmacy lmao", "2_Subreddit": "Drugs"}], "dwh0gpy": [{"0_Comment Submission": "What type of engineers travel the most?", "1_Text": "I thought so do, got into a consulting gig straight out of college. What they dont tell you about free trips to mexico, india, poland etc.. is that when you visit you're visiting factories, not the area by the beach, or the museums or even good resturants often. You will literally work 10 12 14 hour days frpm 5am to 7pm, contractors and consultants dont work for the company that they are at, so you often get immense pressure from your customer and dont even get me started on the field service guys, terrible family situations from being gone 24/7, and alcoholism, just get a good job and travel on your own often", "2_Subreddit": "AskEngineers"}], "dwh4bnc": [{"0_Comment Submission": "Second man sentenced for role in ‘life-shattering’ rape on St. Paul’s Harriet Island", "1_Text": "Lol okay medical professional", "2_Subreddit": "news"}], "dwhbzrx": [{"0_Comment Submission": "Blank prescription from Google images + 2 mins of photoshop = buying all the Xanax I want in Italy", "1_Text": "Uhhh, i hope your buddy can speak english better than you spell since that might be why lol", "2_Subreddit": "Drugs"}], "dwhfk71": [{"0_Comment Submission": "Blank prescription from Google images + 2 mins of photoshop = buying all the Xanax I want in Italy", "1_Text": "Ya in cancoon", "2_Subreddit": "Drugs"}], "dwhpqk8": [{"0_Comment Submission": "Well, we have all been in this predicament.....", "1_Text": "Lmao kid never has faked a drug test, not hard just bring a baby thermometer in with you dumbass", "2_Subreddit": "opiates"}], "dwhuj14": [{"0_Comment Submission": "Well, we have all been in this predicament.....", "1_Text": "I was clean for 58 days and still pissed dirty for thc, give me an option, i got an engineering job and rip drugs still fuck off, im prescribed lean and norcos so i could test dirty with opiates anyway", "2_Subreddit": "opiates"}], "dwhxtgt": [{"0_Comment Submission": "Well, we have all been in this predicament.....", "1_Text": "Read my fucking post you ding wit, i GET OPIATES PERSCRIBED. and yes i drank fucking water lol i was going on 7 years of smoking with the longest break no more then 36 hours", "2_Subreddit": "opiates"}], "dwif1dk": [{"0_Comment Submission": "Well, we have all been in this predicament.....", "1_Text": "Thanks for making fun of my debilitating allergies asshole,  good on you!", "2_Subreddit": "opiates"}], "dwiyu13": [{"0_Comment Submission": "Well, we have all been in this predicament.....", "1_Text": "I cant get allergy shots i get a reaction, im also allergic to all gluten, soy, rice, amd corn (corn syurp as well), ontop of cats, dust mites (literally dust), mold (the kind in shitty housing) so you have no idea what the fuck you are talking about and it makes me laugh at your ignorance", "2_Subreddit": "opiates"}], "dwj131r": [{"0_Comment Submission": "I do this 2-3 times a week..", "1_Text": "Child care in the US can cost 10k to 30k a year, sometimes if your partner only makes can make (30k-45k) and then after taxes (20-33k) barely covers the care, and dont get started on gas etc", "2_Subreddit": "AdviceAnimals"}], "dwjaalf": [{"0_Comment Submission": "I do this 2-3 times a week..", "1_Text": ">My son is in one of the more expensive day cares in our city.  It's about $1200 a month.  I.e., if one spouse worked at McDonald's theyd still have cash left over after paying for this day care.  Day Care is pretty cheap.\n\nLemme get this straight you pay 1200 a month, so thats $14,400 a year and if you make minimum wage at mcdonalds but work full time (ill be generous even and give 10/hr at 40 hours a week which is honestly impossible at mcdonalds) that amounts to $22,400 a year before taxes after taxes its (14,918.40) but we'll say its 15k. That leaves you with 600$ a year for all other expenses, about 1.64 CENTS a day. I hope you take a good look at your finances and make sure you understand them.\n\nAnd i also hope you start a nest egg for your children's educational future, god knows your parents didn't.", "2_Subreddit": "AdviceAnimals"}], "dwjhwjf": [{"0_Comment Submission": "I do this 2-3 times a week..", "1_Text": "Yes thank you, and to DiscoTut, no i didnt prove your point you still have to drive/bus/bike/walk  to work and no one is doing that on 1.64 a day", "2_Subreddit": "AdviceAnimals"}], "dwjkq8e": [{"0_Comment Submission": "The Road To 1.08 And The ARVN", "1_Text": "Spine critical shots?! Yes momma", "2_Subreddit": "rs2vietnam"}], "dwjkv2t": [{"0_Comment Submission": "Should the \"splat\" noise when you hit an enemy be in the game?", "1_Text": "Exactly, i like knowing that my spray of bullets into a forest where i saw a muzzle flash actually did something", "2_Subreddit": "rs2vietnam"}], "dwk3ctm": [{"0_Comment Submission": "Well, we have all been in this predicament.....", "1_Text": "nah im prescribed lean because i get asthmatic attacks and can't breath and it helps me relax my throat and numb it since i cough so hard i occssionaly cough pieces of my throat tissue, but yeah thanks man lol", "2_Subreddit": "opiates"}], "dwoa8pn": [{"0_Comment Submission": "What is your most terrifying animal encounter?", "1_Text": "Or coyotes, boars, bobcat, occasionally bears who have eaten people", "2_Subreddit": "AskReddit"}], "dwtblt5": [{"0_Comment Submission": "Did Anyone Get Their Tax Refund Money yet? I did at 4 Am. At 4:05 i called the dboy. Didnt spend a lot, trying to cut down and save $", "1_Text": "It wont lol", "2_Subreddit": "opiates"}]}], "1_submissions": [{"1m9e2f": [{"0_Title": "Clean, fresh, yummy .", "1_Text": "Lol dont actually go to new delhi, especially alone as a white european traveler, when i studied abroad most of of the sexual harrassment from the trip happened there", "2_Subreddit": "trees"}], "1o3fqo": [{"0_Title": "Kush comaaa", "1_Text": "Lol dont actually go to new delhi, especially alone as a white european traveler, when i studied abroad most of of the sexual harrassment from the trip happened there", "2_Subreddit": "trees"}], "1wf9yr": [{"0_Title": "Repping that good perpppp", "1_Text": "Lol dont actually go to new delhi, especially alone as a white european traveler, when i studied abroad most of of the sexual harrassment from the trip happened there", "2_Subreddit": "trees"}], "7dnkn1": [{"0_Title": "Item Stuck in \"Thank you for your Purchase\"?", "1_Text": "Lol dont actually go to new delhi, especially alone as a white european traveler, when i studied abroad most of of the sexual harrassment from the trip happened there", "2_Subreddit": "Grailed"}]}]}]}