{"Algoresdog": [{"0_comments": [{"dwrcir2": [{"0_Comment Submission": "Starting to do test bumps since I found out my bags are cut. What’s your preferring roa? Mine is boofing ofc", "1_Text": "Hm so dude never has fent mix? Seems like just about all dope in the US has a fent cut to it.", "2_Subreddit": "opiates"}], "dwsuia1": [{"0_Comment Submission": "My grandmother holding a snake, 1941. This picture was in her high school newspaper and got her expelled.", "1_Text": "Haha yeah I only have some of mine's hair and teeth but she lives in the desert in a hole underground now! I think the situation is better for both of us 😊", "2_Subreddit": "OldSchoolCool"}], "dwtic1l": [{"0_Comment Submission": "Starting to do test bumps since I found out my bags are cut. What’s your preferring roa? Mine is boofing ofc", "1_Text": "Oh. So what's the point of doing a test bump? That won't tell you whether the next bag or whether the rest of that bag has a hot spot. I think the safest way with fent cut dope is very tiny lines and breaking doing them slowly. \n\nThere really isn't a way to be 100% safe though.", "2_Subreddit": "opiates"}], "dwtv4bj": [{"0_Comment Submission": "What common product has a feature you’re not sure everyone is aware of?", "1_Text": "Lol i thought that for about .001 seconds. Thought process went like: \"wow I didn't know those batteries could start a car\" \"ok wait there's no way, these people are idiots\" followed by actual comprehension.", "2_Subreddit": "AskReddit"}], "dwtzehl": [{"0_Comment Submission": "Dillies and percs, dillies and percs. Everyone wishes for dillies and percsss", "1_Text": "As somebody who likes having this sub not closed down - fuck you.", "2_Subreddit": "opiates"}], "dwusmg7": [{"0_Comment Submission": "I'm Eric Hafner, I'm running for U.S. Congress in Portland, Oregon (OR-3). I want to legalize all drugs, including opiates, but offer ibogaine therapy too, and free drugs for addicts via prescription.", "1_Text": "Where did you get that figure of 70%+? I'm not trying to question your accuracy, rather just curious as to the sourcing.", "2_Subreddit": "opiates"}], "dwutjrb": [{"0_Comment Submission": "Found out I may possibly only have a few years to live", "1_Text": "So.. you possibly have a very short time to live and you're asking a bunch of people who have fucked up their lives whether you should do the same?\n\nHere's the bottom line: none of us have that much time on earth. While opiates provide pleasure, they will **never** provide real happiness, and if anything they will take away from that in the long run.\n\nMy advice to you is to take the money you would have spent on drugs and travel, or experience things. Even spend it on doing things for the people you love. I can 100% without a doubt guarantee you will get more or of it than you would shooting it into your veins. Read some books on fulfillment (I always recommend The Way of the Peaceful Warrior or Alan Watts' books). \n\nThe only person I would recommend opiods to is someone in hospice care or in extreme short term pain. Even those in long term pain would be better off seeking physical therapy, doing yoga, and taking ibuprofen, since opiods will actually increase your pain over time. \n\nThis board can be dangerous in that people show off their drugs that they're excited to have scored. Make no mistake: nobody that's an addict is happy. Finding happiness isn't possible when you've lost control of yourself, your life, and your finances.\n\nHope that helps.", "2_Subreddit": "opiates"}], "dwuu1vv": [{"0_Comment Submission": "Need Legal Advice Asap", "1_Text": "Say as little as you possibly can until you get a PD", "2_Subreddit": "opiates"}], "dwuu2wf": [{"0_Comment Submission": "I'll be well soon..", "1_Text": "Sad.", "2_Subreddit": "opiates"}], "dwuu77a": [{"0_Comment Submission": "Is Codeine any good for avoiding H WDs?", "1_Text": "Bro, nobody asked how to get clean. What are you even talking about?", "2_Subreddit": "opiates"}], "dwuucym": [{"0_Comment Submission": "Would you rather go without opiates or water for 3 days?", "1_Text": "... are you asking if I'd rather get high or die?", "2_Subreddit": "opiates"}], "dwx3fyf": [{"0_Comment Submission": "Got my hands on these. I have NO idea how to use them, have only done oral and intranasal oxy. Would be so grateful if someone gave me a step by step. How do I get a needle?", "1_Text": "I can tell you what causes the discrepancy - people don't clean out they assholes before boofing. \n\nYes, you too can nearly double your potency for $1.", "2_Subreddit": "opiates"}], "dwx3nxp": [{"0_Comment Submission": "Got my hands on these. I have NO idea how to use them, have only done oral and intranasal oxy. Would be so grateful if someone gave me a step by step. How do I get a needle?", "1_Text": "Check out my post history for the best way to boof. You won't need to do the dissolving pills part, just stick the syringe tip in your morphine bottle and pull the plunger up. Then fill the container with water, shake or stir and pull again for your second boof (leaving morph in there would be wasteful, and I find slightly more water in there helps absorption).\n\nHighly recommend doing it that way for harm reduction. Please don't start using needles - it's just not worth it.", "2_Subreddit": "opiates"}], "dwx3why": [{"0_Comment Submission": "Today’s pick up", "1_Text": "From what I've been reading those edges are pretty common on real blues.", "2_Subreddit": "opiates"}], "dwx3z9z": [{"0_Comment Submission": "Why do you go on one last binge before rehab?", "1_Text": "Actually, yes. Most people that go to rehab want to be forced to stop using by the rehab. Someone that truly intends to quit probably won't do the \"last hurrah\" thing.", "2_Subreddit": "opiates"}], "dwx73u8": [{"0_Comment Submission": "Today’s pick up", "1_Text": "Someone did a real vs fake pic earlier this week and the real had those edges", "2_Subreddit": "opiates"}], "dwxaois": [{"0_Comment Submission": "going to end up homeless soon..any tips?", "1_Text": "Bro.. you have so much life ahead of you. I felt the same way at your age. Right now I'm 31 and pretty bad into some opiates but I have a job I love, a beautiful long term girlfriend, and a loving family. I look back at all I've experienced in the past 10 years and I wouldn't trade it for anything.\n\nThings will get better. For now, you need to work on changing your mindset, even more than your situation. God, what I would give to be in your position, with no dependents and none of the trappings of adulthood weighing me down. You can literally do whatever the fuck you want from here - your life is an open book. You seriously want to throw that away? \n\nA measure of your wealth would be your means divided by your desires. Work on eliminating your desires, even before you work on increasing your means. You'll find a lot more happiness that way.", "2_Subreddit": "opiates"}], "dwxaqz1": [{"0_Comment Submission": "going to end up homeless soon..any tips?", "1_Text": "Yeah that's a shitty idea. Way better to go to a church or a shelter or sleep in a park than end up with a record.", "2_Subreddit": "opiates"}], "dwxatdv": [{"0_Comment Submission": "going to end up homeless soon..any tips?", "1_Text": "Fuck you. Don't tell this kid to start scamming people or begging. He's young and perfectly capable of contributing to his fellow man, not just being a leach.", "2_Subreddit": "opiates"}], "dwxawkt": [{"0_Comment Submission": "going to end up homeless soon..any tips?", "1_Text": "Bro, check out www.wwoof.org - you can get room and food on an organic farm in return for 20 hours of work a week. Possible that the host will let you work more for cash or you can find a part time job elsewhere. \n\nOr check out www.couchsurfing.com", "2_Subreddit": "opiates"}], "dwxb97a": [{"0_Comment Submission": "Got my hands on these. I have NO idea how to use them, have only done oral and intranasal oxy. Would be so grateful if someone gave me a step by step. How do I get a needle?", "1_Text": "Glad you chose to stay away from the needles. I've had a habit for 3 years now and haven't converted over. Honestly I feel like the BA of most drugs is almost as high rectally - most of the low BA results are likely due to fecal absorption. \n\nThe only thing you're \"missing\" is the rush. While I love the mild rush I do get from snorting and plugging - im not about to fuck my veins up and risk disease and other issues just to make the drugs hit harder. Honestly I'm not one to get high and just sit and nod out, though, so I may be different from most junkies. I like to get high and do stuff.", "2_Subreddit": "opiates"}], "dwxgczs": [{"0_Comment Submission": "LSD and Fentanyl", "1_Text": "Lol dude are you mentally handicapped? You write like you're not, but I'm genuinely curious.", "2_Subreddit": "Drugs"}], "dwxgnaz": [{"0_Comment Submission": "Theres still hope for us all.", "1_Text": "I don't get it - that shit is fucking terrible. I tried to use it for WDs one time and just got really constipated, still had WDs and then had to pass a shit like twice the size of a banana.\n\nIf you want WD relief, use kratom or if you can get them - subs. A week long sub taper is basically a free pass when it comes to withdrawals. You will feel some WDs depending on your dosage - but you need max 8mg a day to start to eliminate 80%+ of them (all you really need), and you can taper down from 8mg really easily (8mg > 6mg > 4mg > 3mg > 2mg > 1.5mg > 1mg > go further or jump(", "2_Subreddit": "opiates"}], "dwxhlg0": [{"0_Comment Submission": "LSD and Fentanyl", "1_Text": "Oh, that's why you're equating its use with child rape. Makes sense. \n\nI'm just going to take that as a yes.", "2_Subreddit": "Drugs"}], "dwxjmop": [{"0_Comment Submission": "Theres still hope for us all.", "1_Text": "Yeah I really don't get it", "2_Subreddit": "opiates"}]}], "1_submissions": [{"86otvw": [{"0_Title": "From the high to the rush", "1_Text": "Hm so dude never has fent mix? Seems like just about all dope in the US has a fent cut to it.", "2_Subreddit": "opiates"}], "87bm48": [{"0_Title": "Kratom for withdrawal", "1_Text": "Hm so dude never has fent mix? Seems like just about all dope in the US has a fent cut to it.", "2_Subreddit": "opiates"}], "87scv1": [{"0_Title": "When the plug has some options", "1_Text": "Hm so dude never has fent mix? Seems like just about all dope in the US has a fent cut to it.", "2_Subreddit": "opiates"}], "882ecu": [{"0_Title": "Plugging vs snorting Dilaudid (hydromorphone)", "1_Text": "Hm so dude never has fent mix? Seems like just about all dope in the US has a fent cut to it.", "2_Subreddit": "opiates"}], "88jo75": [{"0_Title": "The detox special", "1_Text": "Hm so dude never has fent mix? Seems like just about all dope in the US has a fent cut to it.", "2_Subreddit": "opiates"}]}]}]}