{"arnoldnoddington1": [{"0_comments": [{"dwemmyy": [{"0_Comment Submission": "Another policy update: the community members have spoken!", "1_Text": "yes all the fighting ive personally seen are from these people - i have no problem with them -i use to be taken - i listened and didn't get offended when i was wrong and had been told misinformation by others ...i know every opiate intimately -im not proud of it but i get hi for fun not with  ignorance making me likely to die. newbies shuld be open not closed down to people trying for the facts to be spread", "2_Subreddit": "opiates"}], "dwems8n": [{"0_Comment Submission": "Story time, Cold Copping fail", "1_Text": "what do you mean ? he is going to be walking around paranoid for months , why and who downvotes fact? if a 3 to 10 year jail sentence was in the hands of a cop who doesn't get enough big fishes during this operation, would you not worry ? op committed multiple felonies ......google it, they could bust him even a year from now", "2_Subreddit": "opiates"}], "dwena3r": [{"0_Comment Submission": "Story time, Cold Copping fail", "1_Text": "i wasn't being rude at all -that is the problem with typing", "2_Subreddit": "opiates"}], "dwenluq": [{"0_Comment Submission": "Another policy update: the community members have spoken!", "1_Text": "i was kidding but your attitude is part of the reason many 5 year veterans left, there are fights on near every post from kids who can't take advice or a joke. they also will argue for hours refusing to fact check someone's post that clearly proves the kids wrong. instead of accepting they were told something wrong -they will start calling people names and talk shit instead of acknowledging their older junkie pal named 'stitches' is wrong and passed his wrong info along to them. no stitches, cotton fever is not  caused by shooting actual pieces of the cotton - it's from bacteria that can even form before the plant is harvested.", "2_Subreddit": "opiates"}], "dwensya": [{"0_Comment Submission": "Another policy update: the community members have spoken!", "1_Text": "in reality im just glad you decided to make this change - i dont have to snarkily and sarcastically call every other post genius, o get yelled at for saying yo dumbass, there's a whole side bar with your needed answers, or my favorite ......how lazy are you-making posts to have others googling for you  - gooogle it your self!.. numerous fighting bouts came from these.", "2_Subreddit": "opiates"}], "dwipp0k": [{"0_Comment Submission": "Another policy update: the community members have spoken!", "1_Text": "im well aware and was voicing my concern - believing i meant this for any thing more than a chuckle to the others who get it and your reaction was worth it,uhh stay bronze giraffe gender fluid trans PC gender noun Synonym.", "2_Subreddit": "opiates"}], "dwiruyn": [{"0_Comment Submission": "Another policy update: the community members have spoken!", "1_Text": "no, it's not a rush and calling it that is incorrect -better inaccurate at describing the feeling. wen a opiate is sniffed a person never is right by saying i slowly felt the effects come over for multiple minutes in a rush -that is not right - yes there is not a scientific term for the rush felt in mere tenths of seconds when ivin , but engulfing one in a rush that comes out of nowhere and over takes at once certainly is aptly named a rush in colloquial non clinical terms. RUSH is a clear long established term used by iv addicts for decades with frequency of use solidifying proper junkie vernacular. so you can continue going around bragging about the 'rush' you felt slowly build across minutes because i am not the junkie websters-mirriam dictionary . just know you sound like a newb moron and the 10 people and 2 who just snort present, in the room to kitchen, are chiming in, grunts and boos of disagreement are pretty evident and sure of confidence that it's just not acceptable to call it a rush - lol look only 2 each grew up from same town and we have cali, ny, texas, pa, arizona, washington, toronto and an asshole from boston who likes tom brady . that is a decent spreading of states with the dooshy tom brady fan even agreeing - that is 10 IVers and 2 4th year sniffers who have been hit and the best said summed is\" it's not accurate description of the experience when snorting oxy or h, fent  just get you higher than h, but a rush is a rush-calling any use method a rush besides IV, obviously that person has ever been covered by the rush\" ..........everyone that i know - everyone asked here at my friends house, even neighbor dude facetiming his girl and her 2 friends who are clean presently overwhelming agree - you're wrong -not scientifically just by popular decree.  ages 19-40,  totaling 2-5 years each sniffing before daily IV, and the god damn, 90-100 years totaling IV Use - not one in the span of my boys uncle being the oldest has anyone here heard rush used except for IVIN. FINALLY, Ankle surgery a few years ago obviously requires anesthesiology people to put ME under BeForE Surgery,  and I only remember til the count back from 100 to 94, WITH THE NURSE Or MEDICAL PROFESSIONAL SAYING MY NAME - DIRECTIONS TO COUNT 100 To 1, COUNT AS Long As ABLE AND IGNORE THE ICEY SENSATION It's NORMAL AND Is \n The  MEDS TRAVELING UP YOUR ARMS,READY? START COUNTING NOW aRNOLD,  YOU'LL FEEL A RUSH OF WARMTH AFTER THE ICE, YOU'LL GET... ZONKERS .. out- we clearly are pathetic and spent about 15 on this - no it doesn't matter what you call it- but we are in unison -only here on reddit have we heard this - we all think it is ridiculous and who ever calls sniffing a rush - has not iv'd.   a rush is a rush.........boooooooom~", "2_Subreddit": "opiates"}], "dwis48l": [{"0_Comment Submission": "Story time, Cold Copping fail", "1_Text": "down vote again - who does that with no explanation - there is no clear reason for it ......so come on then ....or don't you believe enough in your reason to list it ...fear of looking idiotic ? im mature so if im incorrect i welcome being shown evidence so in the future im correct .  this world has a clear problem where stubborn idiots would rather stay idiots instead of admitting mistakes, and learning .......OH No I MISSED THE INFORMATION POSSESSED BY THE WHOLE HUMAN CONSCIOUSNESS OH NO KATIE WILL GO TO PROM With ZACK Now. RIDICULOUS", "2_Subreddit": "opiates"}], "dwislw0": [{"0_Comment Submission": "Don't you just love everyone whose personality revolves solely around the fact that they smoke weed is always a \"drug expert\" on literally everything about every drug?", "1_Text": "Damn you must be around 18 to still deal with that - find new people fast if any one is that way after 16- i was that guy at 14- check out my new glass bro - i definitely need 10 different smokin apparatuses.........i think the worst for me personally still has to be the name gulpers- bro this sensi-star ak47 blue berry cum soaked yuppie blaster is so heddie. fuck they suck. only sativa or indica matters. i use to name my home nuggets and watch the ridiculous spread through cliques as 5 bucks an eighth was added along the way.  guess what ? those were seeds from decade old middies usually found rolling around my junk drawer and named so my friends and myself could make fun of whomever used it. abercrombie & blitz, red eyed delight, G.E.S. 13 (GOVT EXTRA STRENGTH 13TH GENERATION) AKA gullible extra stupid 13 days before curing time recommended.........boy it was fun", "2_Subreddit": "opiates"}], "dwisqc9": [{"0_Comment Submission": "I just broke into my mom's CVS account...guys, this is bad.", "1_Text": "uhhhhhhhh you are an addict too- yes that blows but she fuckin fed sheltered birthed and raised you - get off your high horse and communicate with her.", "2_Subreddit": "opiates"}], "dwisw7u": [{"0_Comment Submission": "The worst withdrawal symptom", "1_Text": "you are new if you didn't think some dooshbag would argue for hours at you claiming he works at level 100% even durin day 3 of WD- or something similar and  ridiculous - i would just be happy to get some sleep -most cant.", "2_Subreddit": "opiates"}], "dwisxi8": [{"0_Comment Submission": "Is there a way to remove buprenophine from one's receptors sooner?", "1_Text": "injecting instead of sublingually -does not  help you now tho", "2_Subreddit": "opiates"}], "dwisyoo": [{"0_Comment Submission": "Is there a way to remove buprenophine from one's receptors sooner?", "1_Text": "no bupe is a strong cling machine", "2_Subreddit": "opiates"}], "dwit8uu": [{"0_Comment Submission": "Is there a way to remove buprenophine from one's receptors sooner?", "1_Text": "first - b4 the twats who think they know all - i am summing from the sub pamphlet from prescription and right in front of me - i bet still some one will argue - \" at ceiling dose of 24mg  sub saturates around 75% of receptors\"   it's quite easy to breakthrough with care and proper timing - getting a full feeling from opiates other than fent wont happen for days but you can do the half life math your self and get a estimated block strength - fent cuts thru and nver seemed dampened and the subs never cured any of this my fent symptoms and heroin only made me un sick- with no rush/ feeling no matter the dose. 15 bag shot was my max- nothing til 10 days or so off fent -then slowly i could feel dope again", "2_Subreddit": "opiates"}], "dww1r30": [{"0_Comment Submission": "a 50,000 needle poke question for fellow teens to office and suit Ivers.....", "1_Text": "it's ecp nobody ever cooks it", "2_Subreddit": "opiates"}], "dww21x6": [{"0_Comment Submission": "Do any of y'all like fent?", "1_Text": "fent doesn't do you? it destroys literally every one", "2_Subreddit": "opiates"}], "dww28o6": [{"0_Comment Submission": "I just broke into my mom's CVS account...guys, this is bad.", "1_Text": "i love dogs and that is the grime queen crown winner but you know that old saying -if you want your meds lassie you need to learn to speak english -classic grand pa quotes", "2_Subreddit": "opiates"}], "dww318y": [{"0_Comment Submission": "I just broke into my mom's CVS account...guys, this is bad.", "1_Text": "honestly i don't like to be mean but it's these new adults and im just over 30 but unless you just lay it down they try and wiggle every damn excuse sympathy and ideas that it is never the fault of their self . ive been just laying it hard because they can see it is important and a shut the fuck up and suck it up sometimes is just what needs heard -here ive told her to communicate on multiple posts over months and had listened to a 35 year old complain and blame his parents for sleeping with just 1 girl, buying him a car, encourage him not to work and say he was raped when sleeping by his gf he broke up with in the day which was over a decade ago and using that as why he still using heroin ......so yes I added a bit more zing then needed", "2_Subreddit": "opiates"}], "dww340u": [{"0_Comment Submission": "Do any of y'all like fent?", "1_Text": "you were not doing fent then", "2_Subreddit": "opiates"}], "dww3d5k": [{"0_Comment Submission": "a 50,000 needle poke question for fellow teens to office and suit Ivers.....", "1_Text": "what ? you can not understand ? should I post a boring post ? ill keep the comical insanity but thanks for the help. i wish you rock hard stool and horizontally flattened fecal colon barricades !", "2_Subreddit": "opiates"}], "dww3no4": [{"0_Comment Submission": "Do any of y'all like fent?", "1_Text": "i was doing a brick a day for 2 weeks beore the regular heroin had a effect besides sick relief and a quarter bag sniffed sent a 4 bag shot 3 a day iv user to ER for OD. i shot 20 bags of that same fent a day", "2_Subreddit": "opiates"}], "dww8ftj": [{"0_Comment Submission": "a 50,000 needle poke question for fellow teens to office and suit Ivers.....", "1_Text": "you don't understand either -if someone wishes you rock hard stool -they are just messing with you -", "2_Subreddit": "opiates"}], "dww8h4i": [{"0_Comment Submission": "a 50,000 needle poke question for fellow teens to office and suit Ivers.....", "1_Text": "sure bud. are you boring ?", "2_Subreddit": "opiates"}], "dww8nti": [{"0_Comment Submission": "Do any of y'all like fent?", "1_Text": "not high enough but when you say fent didn't get you hi compared to oxy you seem uneducated -just googling the equivalent dose chart shows why your post seemed like an ass flapping words. you're not though", "2_Subreddit": "opiates"}], "dww8r4y": [{"0_Comment Submission": "a 50,000 needle poke question for fellow teens to office and suit Ivers.....", "1_Text": "i know it's horrible i bought laxatives that are made like actual chocolates which is disturbing too", "2_Subreddit": "opiates"}]}], "1_submissions": [{"63cd2d": [{"0_Title": "so many ppl here piss me off.(harm reduction post)", "1_Text": "yes all the fighting ive personally seen are from these people - i have no problem with them -i use to be taken - i listened and didn't get offended when i was wrong and had been told misinformation by others ...i know every opiate intimately -im not proud of it but i get hi for fun not with  ignorance making me likely to die. newbies shuld be open not closed down to people trying for the facts to be spread", "2_Subreddit": "opiates"}], "6bf1eu": [{"0_Title": "412 burgh celeb(POSSIBLE) sighting while coppin.", "1_Text": "yes all the fighting ive personally seen are from these people - i have no problem with them -i use to be taken - i listened and didn't get offended when i was wrong and had been told misinformation by others ...i know every opiate intimately -im not proud of it but i get hi for fun not with  ignorance making me likely to die. newbies shuld be open not closed down to people trying for the facts to be spread", "2_Subreddit": "opiates"}], "6bfdas": [{"0_Title": "north east celeb? copping sighting ...(playful misleading title)", "1_Text": "yes all the fighting ive personally seen are from these people - i have no problem with them -i use to be taken - i listened and didn't get offended when i was wrong and had been told misinformation by others ...i know every opiate intimately -im not proud of it but i get hi for fun not with  ignorance making me likely to die. newbies shuld be open not closed down to people trying for the facts to be spread", "2_Subreddit": "opiates"}], "6d04cz": [{"0_Title": "to settle a debate chime in...(do not bring animosity)", "1_Text": "yes all the fighting ive personally seen are from these people - i have no problem with them -i use to be taken - i listened and didn't get offended when i was wrong and had been told misinformation by others ...i know every opiate intimately -im not proud of it but i get hi for fun not with  ignorance making me likely to die. newbies shuld be open not closed down to people trying for the facts to be spread", "2_Subreddit": "opiates"}], "6fa2cc": [{"0_Title": "a real true shitpost...", "1_Text": "yes all the fighting ive personally seen are from these people - i have no problem with them -i use to be taken - i listened and didn't get offended when i was wrong and had been told misinformation by others ...i know every opiate intimately -im not proud of it but i get hi for fun not with  ignorance making me likely to die. newbies shuld be open not closed down to people trying for the facts to be spread", "2_Subreddit": "opiates"}], "6gloeg": [{"0_Title": "damn i fucked up.", "1_Text": "yes all the fighting ive personally seen are from these people - i have no problem with them -i use to be taken - i listened and didn't get offended when i was wrong and had been told misinformation by others ...i know every opiate intimately -im not proud of it but i get hi for fun not with  ignorance making me likely to die. newbies shuld be open not closed down to people trying for the facts to be spread", "2_Subreddit": "opiates"}], "7dnx7h": [{"0_Title": "you a cop bro?", "1_Text": "yes all the fighting ive personally seen are from these people - i have no problem with them -i use to be taken - i listened and didn't get offended when i was wrong and had been told misinformation by others ...i know every opiate intimately -im not proud of it but i get hi for fun not with  ignorance making me likely to die. newbies shuld be open not closed down to people trying for the facts to be spread", "2_Subreddit": "opiates"}], "8a5gu5": [{"0_Title": "a 50,000 needle poke question for fellow teens to office and suit Ivers.....", "1_Text": "yes all the fighting ive personally seen are from these people - i have no problem with them -i use to be taken - i listened and didn't get offended when i was wrong and had been told misinformation by others ...i know every opiate intimately -im not proud of it but i get hi for fun not with  ignorance making me likely to die. newbies shuld be open not closed down to people trying for the facts to be spread", "2_Subreddit": "opiates"}]}]}]}