{"killbowling": [{"0_comments": [{"dw1ag0d": [{"0_Comment Submission": "It all fell apart", "1_Text": "What happened santa", "2_Subreddit": "Stims"}], "dw1bnj7": [{"0_Comment Submission": "he COMES", "1_Text": "Glorbin plz no thank you don’t do it", "2_Subreddit": "surrealmemes"}], "dw1j94c": [{"0_Comment Submission": "Props to all the reliable dealers out there", "1_Text": "Haha oh how I wish i was only spending 20 or 40 dollars a week.", "2_Subreddit": "Drugs"}], "dw670en": [{"0_Comment Submission": "It happened to my son", "1_Text": "Be hopeful, I’ve seen many people go crazy with lsd (daily for months) and completely fry their brains for a while, then eventually brightened back up. \n\nGood luck through all this!", "2_Subreddit": "Drugs"}], "dw67l3g": [{"0_Comment Submission": "Recreational Valium", "1_Text": "15 or 20mg next time. First time I took Valium I was nearly black out drunk and took 20mg. Passed out about 2 hours later. Defiantly not the brightest idea for a first timer, but it was a good time, felt good, and nothing bad came from it.\n\nDon’t take that much if you think you can’t control your impulses while being fucked up though haha. That’s when the bartard craziness always happens", "2_Subreddit": "Drugs"}], "dw6xu3t": [{"0_Comment Submission": "if you're already drinking alone on a friday night, you might as well be here", "1_Text": "damn is there a chat server here? sorruy too schlumpd to look", "2_Subreddit": "drunk"}], "dw6xznt": [{"0_Comment Submission": "I'm pretty drunk so I felt like this was the place to post makes sense right", "1_Text": "i know you werent asking me in particular, but straight vodka stayschlumpd", "2_Subreddit": "drunk"}], "dw701fm": [{"0_Comment Submission": "I'm pretty drunk so I felt like this was the place to post makes sense right", "1_Text": "Yes! It's wonderful", "2_Subreddit": "drunk"}], "dw72ssk": [{"0_Comment Submission": "if you're already drinking alone on a friday night, you might as well be here", "1_Text": "I didn’t realize this post linked to a discord chat lol I thought he was saying we should be on this thread. Fuck I’m dumb", "2_Subreddit": "drunk"}], "dw8hdsm": [{"0_Comment Submission": "What are some good ways to prepare for first semester majoring in CS", "1_Text": "You think I could find an internship for the summer without any education before hand?\n\nI’ll be an upcoming freshman this fall at university", "2_Subreddit": "cscareerquestions"}], "dw8htbm": [{"0_Comment Submission": "What are some good ways to prepare for first semester majoring in CS", "1_Text": "Cool, I'll check out udemy. Thank you", "2_Subreddit": "cscareerquestions"}], "dw8hya0": [{"0_Comment Submission": "What are some good ways to prepare for first semester majoring in CS", "1_Text": "Ok I'll look into that. Luckily I have some good connections in my area maybe I'll be able to land an internship position somewhere", "2_Subreddit": "cscareerquestions"}], "dwagdl9": [{"0_Comment Submission": "Best stim prescribed for add/adhd in terms of euphoria?", "1_Text": "adderall for sure 30mg ER", "2_Subreddit": "Stims"}], "dwfe3dd": [{"0_Comment Submission": "When you think about it, its pretty hectic that coffee is legal.", "1_Text": "Same with DXM, Sudafed, Phenibut, and a lot more. Some of the times I've been the most fucked up was from OTC drugs.\n\nDrug laws are ridiculous. Soon enough I hope to see dispensaries for all drugs. Lol doubt that will happen in my lifetime though. Oh well, I'll just stick to hiding my drug use from the cops", "2_Subreddit": "Drugs"}], "dwfej65": [{"0_Comment Submission": "Oxy to morphine", "1_Text": "IV would be the best bet if you're into that. Are you 100% sure its morphine? Just asking bc I've seen fakes for those and I'm pretty sure it was a low dose of a fent analog. Which in that case, oral or insufflation would be the best route. But be careful cause even with a small tolerance like you have, IV'ing fent is sketchy. \n\nOr just boof that shit", "2_Subreddit": "Drugs"}], "dwfgj54": [{"0_Comment Submission": "Oxy to morphine", "1_Text": "I believe most people who say they don't get them high or anything are usually using opiates on a more regular basis than you. I'm sure regardless of the ROA you will still feel great. Look up morphine potentiators. Usually something like low doses of dxm, valium, or even grapefruit juice will potentiate opiates.\n\nOh and btw I have never plugged anything either. I'd take a needle in my arm over a syringe up my bum anyday haha.", "2_Subreddit": "Drugs"}], "dwlbiun": [{"0_Comment Submission": "A bunch of subreddits were deleted? Can someone fill me in", "1_Text": "Thank you!", "2_Subreddit": "opiates"}], "dwnkzy0": [{"0_Comment Submission": "Taking Drugs To Find Personal Flaws To Change", "1_Text": "Yeah basically where I am at. But this post is more of me trying to talk myself into how to not need drugs as much to be content", "2_Subreddit": "Drugs"}], "dwnoerv": [{"0_Comment Submission": "Taking Drugs To Find Personal Flaws To Change", "1_Text": "As for the xanax thing, what I meant by coming off of them is like after a few days of a break from them. Then I start to crave benzos again, but instead of just continuing to medicate I want to start to fix the problems that xanax fixes, just without the xanax. Like learning to be less anxious. And yes I do get peace of mind from stimulants. Trust me after about a .15 shot of ice, ain't nothing going through your head but bliss and positivity. Sure some paranoia and the comedown sucks. but what I meant was trying to achieve the clarity of thoughts that I have on uppers. I have hyperactive / scattered thoughts and stimulants help to organize all that.\n\nAs for heroin, can't speak too much as I have never abused opiates long enough to consider myself a junkie. But I do know that the feeling of relief that opiates gives me (besides the dopamine rush), mainly stems from letting me forget about my anxiety and adhd.\n\nI think the main point of my post was to explain how my enjoyment of different drugs has brought me some insight into what flaws I have, and how different ways I can try to fix them without drugs. Like meditation, exercise, different hobbies, eating healthier, spirituality, etc.\n\nYou are probably correct saying I am a little too optimistic, but oh well. If my plan to be more happy with less drugs doesn't work, then I will just fall back to plan B. (saying fuck it and indulging whenever)", "2_Subreddit": "Drugs"}], "dwohxwa": [{"0_Comment Submission": "Taking Drugs To Find Personal Flaws To Change", "1_Text": "I doubt I’ll ever totally get out of my somewhat manageable drug addiction. Until my body gets too tired of it and I’ll just switch to more alcohol", "2_Subreddit": "Drugs"}], "dwpegoh": [{"0_Comment Submission": "Just How Dangerous Are Oxys", "1_Text": "To be honest, a lot of oc's / r's right now are just pressed fentanyl / fent RC's. (Unless you're getting them straight from the pharmacy or a trusted dealer) The real danger is people just don't know the proper dosage they are putting in their body especially if it is fent.", "2_Subreddit": "Drugs"}], "dwpgzed": [{"0_Comment Submission": "A Comprehensive Guide to Getting Trashed", "1_Text": "Throw a few valium in the mix there somewhere too. Then you'll really feel fucked", "2_Subreddit": "Drugs"}], "dwpiigs": [{"0_Comment Submission": "I‘m truly fed up with everything", "1_Text": "You gotta work on your own mental health. When you're feeling happy and content, drugs will be the cherry on top. Otherwise drugs will just take over and tear you apart.", "2_Subreddit": "Drugs"}], "dww8b1p": [{"0_Comment Submission": "Drug laws piss me off", "1_Text": "Australia is wild. Weed might not be legal in my lifetime but I'm hopeful that one day it will be everywhere and everyone will finally just suck up their pride and admit its not as bad as they thought it was for a while. That's why nothing will get passed in the States I think. We need the next generation to step up into the office and shit so they can run this bitch. Anyway Hi aussie person y'all drink way more than I can aussies got balls at least the ones i know", "2_Subreddit": "Drugs"}], "dww8hpa": [{"0_Comment Submission": "Well this might be goodbye, on way to er for interaction", "1_Text": "Bro I get it going to the hospital not knowing if you're gonna lie its a crazy experience I've been through it multiple times. DM if you wanna talk about it for real", "2_Subreddit": "Drugs"}]}], "1_submissions": [{"7jvxzm": [{"0_Title": "Long distanced memes", "1_Text": "What happened santa", "2_Subreddit": "highdeas"}], "7u7756": [{"0_Title": "The governments gone mad", "1_Text": "What happened santa", "2_Subreddit": "Drugs"}], "814rg7": [{"0_Title": "[TOMT][SONG] What is the first song in this edm/trap mix?", "1_Text": "What happened santa", "2_Subreddit": "tipofmytongue"}], "84k5mz": [{"0_Title": "Look at the bright side", "1_Text": "What happened santa", "2_Subreddit": "PewdiepieSubmissions"}], "85yndl": [{"0_Title": "Props to all the reliable dealers out there", "1_Text": "What happened santa", "2_Subreddit": "Drugs"}], "86x3iz": [{"0_Title": "What are some good ways to prepare for first semester majoring in CS", "1_Text": "What happened santa", "2_Subreddit": "cscareerquestions"}], "8872kd": [{"0_Title": "WTF happened to all these subreddits getting deleted? Is /r/drugs next?", "1_Text": "What happened santa", "2_Subreddit": "Drugs"}], "88d51l": [{"0_Title": "A bunch of subreddits were deleted? Can someone fill me in", "1_Text": "What happened santa", "2_Subreddit": "opiates"}], "88uuq4": [{"0_Title": "Taking Drugs To Find Personal Flaws To Change", "1_Text": "What happened santa", "2_Subreddit": "Drugs"}]}]}]}