{"butt_tits_2001": [{"0_comments": [{"di4rord": [{"0_Comment Submission": "Ichiko Aoba -- Imperial Smoke Town [Japanese Singer-songwriter] (2012)", "1_Text": "I love this so much", "2_Subreddit": "listentothis"}], "dj16o6x": [{"0_Comment Submission": "[Serious] Parents of unsuccessful young adults (20s/30s) who still live at home, unemployed/NEET, no social/romantic life etc., do you feel disappointed or failed as a parent? How do you cope? What are your long term plans?", "1_Text": "Yeah, you're basically just switching addictions.", "2_Subreddit": "AskReddit"}], "djedws2": [{"0_Comment Submission": "Amazon is doing to department stores what department stores did to small businesses", "1_Text": "I last went into a Sears with a friend over the holidays to get some shopping done. It was a barren landscape of pure sadness. The moment we stepped foot in there we felt the heaviest, most somber atmosphere. All the products were strewn throughout these shitty steel shelves that looked as if they had been rolled in to temporarily hold the unwanted items from other stores. It felt like there was a swarm of zombies waiting for us to leave outside.", "2_Subreddit": "Showerthoughts"}], "dll6g38": [{"0_Comment Submission": "This exit sign guy has a butt", "1_Text": "great ass", "2_Subreddit": "mildlyinteresting"}], "dmg6aka": [{"0_Comment Submission": "First time. Took roughly 1.2 grams", "1_Text": "Dang, just ordered a couple bottles of the HCL capsules, I hope they aren't bunk.\nThis is my first time trying phenibut, so that'd be pretty disappointing.", "2_Subreddit": "phenibut"}], "do2a8oy": [{"0_Comment Submission": "Check-In for Saturday, October 7th, 2017", "1_Text": "This is my first post on this sub, but god dammit, I haven't drunk anything today and I'm not going to.\nI'm gonna make this sub a daily visit of mine. Fuck addiction.", "2_Subreddit": "stopdrinking"}], "dr1xxgs": [{"0_Comment Submission": "How are you doing?", "1_Text": "I'm weirdly content. Made the decision to go to a Salvation Army rehab center tomorrow morning in order to pull myself out of this cycle of addiction I've been struggling with for too long. \nWish me luck.", "2_Subreddit": "AskReddit"}], "drid45r": [{"0_Comment Submission": "Sufjan Stevens - Casimir Pulaski Day [Folk]", "1_Text": "damn, thank you for posting this.\nSufjan's music has been a part of my life since I stumbled across this album in high school, and it won't ever leave.", "2_Subreddit": "Music"}], "dromb0t": [{"0_Comment Submission": "I would really appreciate feedback from other producers, I'm pretty happy with this one.", "1_Text": "Thank you so much, this was exactly what I was looking for.\nGood looking out 👌👌👌", "2_Subreddit": "musicproduction"}], "dromeb4": [{"0_Comment Submission": "I would really appreciate feedback from other producers, I'm pretty happy with this one.", "1_Text": "Much appreciated🙏 I'm not really shooting for a specific genre or anything, just kind of adding layers that sound nice to me. At some point I'd like to find a word for the tunes I make though", "2_Subreddit": "musicproduction"}], "ds2n8zx": [{"0_Comment Submission": "High schoolers of Reddit, what cliques exist now? Is it still nerds/jocks/stoners, or are there new groups that the older redditors don’t know about?", "1_Text": "I graduated in 13' and was prescribed benzos throughout high school. It was interesting to watch as they became more and more popular, and I wish I could say that I didn't feed into it. Ultimately those drugs led to a heroin addiction (and now sobriety).\nWish I could get that across to these kids I see glamorizing bars and whatnot, but nothing got through to me back then so I don't expect anything different", "2_Subreddit": "AskReddit"}], "dsaom68": [{"0_Comment Submission": "I would really appreciate feedback from other producers, I'm pretty happy with this one.", "1_Text": "Thanks man!", "2_Subreddit": "musicproduction"}], "dst2sp0": [{"0_Comment Submission": "I like the aesthetics of anime but I have a hard time watching it", "1_Text": "You aren't doing anything wrong, you just haven't liked any series you've seen yet. Try out Gurren Lagaan or maybe try Welcome to the N.H.K. \nThose sold me on anime shows.", "2_Subreddit": "anime"}], "duavjtt": [{"0_Comment Submission": "What binge-worthy channel which resides on YouTube can you recommend me?", "1_Text": "You Suck At Cooking is a super rad channel", "2_Subreddit": "AskReddit"}], "dwr4iyb": [{"0_Comment Submission": "Best Agency for film actors in SF/Bay?", "1_Text": "My Dad, younger brother and several other people I know have gotten work through Stars Agency in San Francisco. I would get in contact with them!", "2_Subreddit": "acting"}], "dwry67h": [{"0_Comment Submission": "Best Agency for film actors in SF/Bay?", "1_Text": "My little brother and my dad generally have gotten small parts with closeups and some lines. I know that my Dad has gotten bigger parts in indie films however. It really depends on how much work you put in along with your agent, but it's really likely you'll get work if you're determined.", "2_Subreddit": "acting"}], "dwsauag": [{"0_Comment Submission": "Getting my foot in the door of recovery and proceeding to slam it repeatedly", "1_Text": "I’m trying to figure out if there are any excuses I can even attempt to justify at this point, and the only one that even comes close is “I’m an addict and this is what addicts do.” But honestly I think that’s a total fucking cop out and a load of shit. I’m ready to give it up because I know for a fact that I want to live a sober life, I just don’t know why I keep picking up.\nThank you. I really, really appreciate your reply. I’m in a very strange, almost purgatory like state, where I have a sliver of hope but my brain is telling itself that that sliver is some sort of fluke.\nMay I ask if you’re clean/how long?", "2_Subreddit": "opiates"}], "dwsbun6": [{"0_Comment Submission": "Getting my foot in the door of recovery and proceeding to slam it repeatedly", "1_Text": "Don’t be sorry, if this is a book it should be in goddamn Oprah’s book club.\nI really really like the swimming pool analogy. Picking up the phone and asking for help has historically proven to be difficult for me, but during my few months in recovery it became exponentially easier every day. Now it’s really difficult again, and I think that’s due to the shame I feel about struggling. The majority of people I spend my time with are sober people who I either A: Went to rehab with(a lot of us stayed in the area) or B: Met in AA. Because of this, they’re all fairly savvy to sobriety stuff and I feel like they’re all looking down on me. Like some people are just straight rude as fuck, some people have distanced themselves from me (which I totally understand, nobody wants to take the time to develop a close relationship with someone that could die any day) and other people treat me like a sick child who needs to be coddled.\nGranted, this is a majorly gold plated problem. I just realized I’m whining about the fact that I have a support system. Holy fuck, another reminder that the drugs are just a symptom of my twisted ass thinking lmao\nI feel like I’m so close to getting this thing, yet so fucking far. \nI guess you’re right though, at the end of the day this comes down to consistently practicing new coping mechanisms that don’t ruin our lives.", "2_Subreddit": "opiates"}], "dwsdpgp": [{"0_Comment Submission": "Getting my foot in the door of recovery and proceeding to slam it repeatedly", "1_Text": "Thank you, I really appreciate it. I forget how important simplicity seems to be in early recovery. The next right thing. The next right thing. The next right thing...\nThank you again!", "2_Subreddit": "opiates"}], "dwsqr9e": [{"0_Comment Submission": "Getting my foot in the door of recovery and proceeding to slam it repeatedly", "1_Text": "I really appreciate your input. I was on 16 mg. suboxone for a year and a half and eventually kicked it in rehab per the suggestion of my therapist. It was honestly a huge accomplishment for me to get off of it, but now I’m considering getting back on it for the sake of saving my life. \nSuboxone gets so much fucking hate and to be honest I’ve participated in the hate, but I credit suboxone with the fact that I’m still alive. Who knows what would’ve happened during that year and a half if I wasn’t on subs. \nAgain, I appreciate the input, and congratulations on two years man. That’s amazing", "2_Subreddit": "opiates"}], "dwsseqd": [{"0_Comment Submission": "Getting my foot in the door of recovery and proceeding to slam it repeatedly", "1_Text": "Thank you man. You’re right, venting can be the point of this post in itself lol\nSame goes to you if you ever need to get stuff of your chest.\nThank you again!", "2_Subreddit": "opiates"}], "dwu77l3": [{"0_Comment Submission": "When lames talk about good music", "1_Text": "Why do I feel like Pete posted this", "2_Subreddit": "Homeshake"}], "dwy0qty": [{"0_Comment Submission": "Does being an addict make me a bad person?", "1_Text": "Addiction is a disease of self centeredness at its very core. I completely get it man.\nThe drug use is really just a symptom. And it’s only one of many that our selfish and spiritual emptiness fosters.\nThis doesn’t make us inherently bad people however, because if we do what we can to combat it and change the way we walk the world then we’re recognizing exactly what our shitty actions have done.\nGranted, I don’t think we can change unless we recognize that there’s a problem with how we think in the first place. So be proud of yourself for already winning the first battle of a lifelong war.\nAA and other 12 step groups really help to provide a guideline to change our reactions to life. Try to hit a meeting and talk to at least a few people afterward if you haven’t before. \nMuch love", "2_Subreddit": "addiction"}]}], "1_submissions": [{"4t3tzt": [{"0_Title": "So I finally have the funds to get a new pair of shoes. Any recommendations? (This is my first post on Reddit btw, forgive me if this is an obnoxiously common post)", "1_Text": "I love this so much", "2_Subreddit": "Sneakers"}], "5572l1": [{"0_Title": "Shared room nightmares", "1_Text": "I love this so much", "2_Subreddit": "misophonia"}], "6hcdtp": [{"0_Title": "Puma Blaze of Glory (crackle pack?)", "1_Text": "I love this so much", "2_Subreddit": "Sneakers"}], "7lldnv": [{"0_Title": "I would really appreciate feedback from other producers, I'm pretty happy with this one.", "1_Text": "I love this so much", "2_Subreddit": "musicproduction"}], "7on02a": [{"0_Title": "I work at round table pizza and I'm completely indifferent to it, AMA.", "1_Text": "I love this so much", "2_Subreddit": "RoundTablePizza"}], "7rdya0": [{"0_Title": "Shampoo - Hanging Up On U", "1_Text": "I love this so much", "2_Subreddit": "listentothis"}], "89nsi9": [{"0_Title": "Getting my foot in the door of recovery and proceeding to slam it repeatedly", "1_Text": "I love this so much", "2_Subreddit": "opiates"}]}]}]}