{"Baron80": [{"0_comments": [{"duaoem1": [{"0_Comment Submission": "Prospective from a Raiders fan", "1_Text": "Thank you OP!! \n\nI was in a crappy mood today and then I open reddit and see this, now I have the biggest smile on my face and feel much better about life.", "2_Subreddit": "Cardinals"}], "duftpll": [{"0_Comment Submission": "My friend was arrested today. He's about to face major withdraw and I hope he'll be ok.", "1_Text": "Yeah, opiate seizures are like the popcorn farts of the seizure family. They're more of an inconvenience than anything, they kinda tickle actually. \n\nAnd since my faith in humanity was lost long ago I guess I'll include /s", "2_Subreddit": "opiates"}], "dulooen": [{"0_Comment Submission": "Ugly Gods Instagram account was deleted with millions of followers because of this post", "1_Text": "If it was deleted for \"no reason\" then how does he know it was because of that specific post?", "2_Subreddit": "conspiracy"}], "dulscf0": [{"0_Comment Submission": "Ugly Gods Instagram account was deleted with millions of followers because of this post", "1_Text": "I don't do anything on Instagram so I don't know how it works really, when you say his \"account is now online\" does that mean it hasn't been deleted?\n\nHow can you be sure he didn't delete those posts himself in some kind of attempt to draw attention to himself and gain more followers? I'm not saying that's what I think happened but some people do love to be victims for whatever reason.", "2_Subreddit": "conspiracy"}], "duxl8l9": [{"0_Comment Submission": "Came into a brick of what must be heroin", "1_Text": "Attempting to sell a brick of heroin to a random homeless dude is a great way to wind up dead. \n\nWould not advise this course of action.", "2_Subreddit": "opiates"}], "duxn1ih": [{"0_Comment Submission": "Came into a brick of what must be heroin", "1_Text": "I thought the same thing, especially after they implied that they intercepted it from the mail while their loved one was almost at rock bottom.\n\nHaving that kind of money to spend on dope doesn't sound like rock bottom to me.", "2_Subreddit": "opiates"}], "dvjqsp0": [{"0_Comment Submission": "SUNDAY SUNDAY SUNDAY! [vol.2] Free Booty Giveaway, yarrr! Fent testing strips ahoy!", "1_Text": "I never win anything but here goes nothing!\n\n4, 10, 80", "2_Subreddit": "opiates"}], "dvjvq4g": [{"0_Comment Submission": "Hello (again) r/opiates... here to tell the truth.", "1_Text": "I'm sure we've all done things we aren't proud of, I certainly know I have anyway. I try not to think about it most of the time.\n\nYou can't change the past, only make a real effort to do better in the future and as more time passes you won't feel so bad about those things. I hope your admission here helps you feel better.", "2_Subreddit": "opiates"}], "dvl3yfl": [{"0_Comment Submission": "Banging dope while on methadone", "1_Text": "I'm on 65 mgs and can still get pretty high snorting fent dope. I usually don't even skip the clinic when I get high.", "2_Subreddit": "opiates"}], "dvlna23": [{"0_Comment Submission": "What's something you don't see anymore?", "1_Text": "Yours was about typical then. I've worked in the car business a long time and the mid 90's to mid 2000's Dodge and Chryslers are known as some of the worst cars ever made.\n\nAnything with the 2.7 especially but the 3.5 wasn't all that great either.", "2_Subreddit": "AskReddit"}], "dw0j6wf": [{"0_Comment Submission": "Our application was just approved for gorgeous fluff-butt-mystery-mutt. He's about 25lbs, and a 1.5 years old. What do you think his mix is?", "1_Text": "In my expert opinion I'd say he's at least 99% awesome. Not sure what else he's mixed with though.", "2_Subreddit": "mutt"}], "dwdwlcq": [{"0_Comment Submission": "Current dwelling", "1_Text": "No man is an island, entire of itself; every man is a piece of the continent.", "2_Subreddit": "opiates"}], "dwfb83o": [{"0_Comment Submission": "Crazy shit my roommate says volume 3 : hardcore edition", "1_Text": "I would be so damn anxious with this lady around me all the time, she sounds like a ticking time bomb just waiting to blow and get everyone in her general vicinity arrested.", "2_Subreddit": "opiates"}], "dwmjh65": [{"0_Comment Submission": "So a Black man couldn't stop running..", "1_Text": "I don't get it.", "2_Subreddit": "darkjokes"}], "dwn0060": [{"0_Comment Submission": "So a Black man couldn't stop running..", "1_Text": "Oh ok.", "2_Subreddit": "darkjokes"}], "dwnfn27": [{"0_Comment Submission": "London Murder Rate Overtakes New York for First Time Ever after Spate of Fatal Stabbings and Shootings", "1_Text": "The \"east side\" of St. Louis is a different city (E. St. Louis), in a different state (Illinois).", "2_Subreddit": "news"}], "dwuht0f": [{"0_Comment Submission": "What’re your other vices?", "1_Text": "I had a friend that was from Michigan and he used to call it pop, was so weird at first but I got used to hearing it.", "2_Subreddit": "opiates"}], "dwuhx67": [{"0_Comment Submission": "What’re your other vices?", "1_Text": "Rockstar energy drinks and cigs. I'm certain there would be others but I have a hard time affording even those sometimes with all the money I piss away on dope.\n\nOh, and methadone.", "2_Subreddit": "opiates"}], "dwuigvi": [{"0_Comment Submission": "Fentanyl is 1000xs stronger than morphine...", "1_Text": "Maybe you're right about fent being 10,000x stronger than morphine, I truly don't know but that figure is very hard to believe in any case.\n\nSeems like you would die immediately upon ingesting something that much stronger than morphine before ever being able to build up a tolerance. As I said though, I really don't know so don't take this as me calling you a liar.", "2_Subreddit": "opiates"}], "dwuiyi2": [{"0_Comment Submission": "today would’ve been your 23rd birthday. i miss you everyday darlin’ 💔", "1_Text": "Lol, straightened arrow is awesome. I do sometimes feel like a crooked, warped arrow that's been shot from a bow and will miss my intended target by miles. \n\nI'm sorry about your friend, you both look way too young for this life. Be careful if you're still using please.", "2_Subreddit": "opiates"}], "dwukegu": [{"0_Comment Submission": "Fentanyl is 1000xs stronger than morphine...", "1_Text": "Yeah I have heard those stories, pretty wild stuff. Kind of a shame that good dope like that is wasted on a cop, lol.\n\nI always wondered if stories like that were exaggerated as the media and the police are prone to doing that when it involves drugs but if they're true then it absolutely backs up your claim.", "2_Subreddit": "opiates"}], "dwuvdue": [{"0_Comment Submission": "The come up", "1_Text": "Pickles And Crackers", "2_Subreddit": "opiates"}], "dwvvsex": [{"0_Comment Submission": "How an extra GPS tracker on a drug dealer's car unraveled a corrupt Baltimore police force that robbed homeless people and resold confiscated heroin and ecstasy back on the street", "1_Text": "Or the existing system that's already in place, internal affairs, can stop being a joke and start doing their job.\n\nI think the internal affairs division works more towards the goal of covering the department's ass rather than making sure officers such as these are held accountable for their actions.", "2_Subreddit": "Bad_Cop_No_Donut"}], "dwvwjif": [{"0_Comment Submission": "Fentanyl is 1000xs stronger than morphine...", "1_Text": "Yep, I'm certainly not going to debate the fact that fentanyl is much stronger than morphine. I was questioning the figure of fentanyl being 10,000x the potency of morphine.\n\nYour response doesn't really shed any light on that subject but you're absolutely correct about the drugs being dosed differently, I can't deny that.", "2_Subreddit": "opiates"}], "dwxtjo1": [{"0_Comment Submission": "Fentanyl is 1000xs stronger than morphine...", "1_Text": "Well, as a pharmacist, you would certainly know better than me lol.\n\nSorry to hear that people were jerks to you, some people really can't handle a dissenting opinion. But don't let it get ya down, your future is probably much brighter than theirs. I know it's brighter than mine lol. \n\nHave a good one :)", "2_Subreddit": "opiates"}]}], "1_submissions": [{"74j56x": [{"0_Title": "Giving credit where it's due...", "1_Text": "Thank you OP!! \n\nI was in a crappy mood today and then I open reddit and see this, now I have the biggest smile on my face and feel much better about life.", "2_Subreddit": "opiates"}]}]}]}