{"Infuses": [{"0_comments": [{"ds2jcp4": [{"0_Comment Submission": "OnlyUseMeBlade Gropes Drunk Married Woman on New Years Stream", "1_Text": "boatyDrugs", "2_Subreddit": "LivestreamFail"}], "dsp16e5": [{"0_Comment Submission": "RIP u/scarred4lyfefromthis", "1_Text": ".", "2_Subreddit": "opiates"}], "dt5ozcv": [{"0_Comment Submission": "Anyone shoot up H on acid", "1_Text": "I remember a friend and I were 3 tabs deep each and we found ourselves at another friends house. The guy who's house we were at was (is) a major artsy type of guy, real bohemian. He knew we were off our tits, sat us down and put on [The Holy Mountain](https://www.youtube.com/watch?v=bdXGhsAynGI)\n\n\nShit was weird.", "2_Subreddit": "opiates"}], "du2myot": [{"0_Comment Submission": "Joey Diaz Diving Deep", "1_Text": "Uncle Joey taking it like a champ... fuckin TREMENDOUS", "2_Subreddit": "JoeyDiaz"}], "du2ptpj": [{"0_Comment Submission": "Theo Von on Tom Segura's Louisiana Joke", "1_Text": "don't apologise for sayin cunt ya mad cunt, only shit cunts get offended at the word cunt...fucken dog cunts", "2_Subreddit": "JoeRogan"}], "du6a73v": [{"0_Comment Submission": "The Church Of What's Happening Now #558 - Ali Siddiq", "1_Text": "Good googly-moogly Ali is STONED TO THE GILLS\n\nedit: holy moly Joey and Lee are off their tits too!", "2_Subreddit": "JoeyDiaz"}], "duhgz43": [{"0_Comment Submission": "Young Joey, 7 yrs old, tooled up with 007 knife, $50 in your pocket, living on 88th and hanging out on 144th on the weekends, hustling. So full of shit. Keep taking the tablets pal.", "1_Text": "Is this all you do with your time on this website my man? Just shitpost about a comedian?\n\nJust get high dawg.", "2_Subreddit": "JoeyDiaz"}], "duwbia2": [{"0_Comment Submission": "Question about cwe (sorry)", "1_Text": "> Can i still crush them and do a cwe? \n\nyes\n\n> Also, whats the best way of increasing yield of codeine in the final product? I dont usually bother with the freezer, could this get me a higher amount in the final product? \n\nthe freezer bit is up for debate - generally what I do is: \n\ncrush, put in glass, put in freezer, take out when very cold but not frozen (and also when there's an obvious sedimentary split), filter (i usually do it two or three times if it's a larger amount - better to lose a small % of my drugs than my whole liver) then drink\n\nbut honestly it doesn't matter how you cwe them, as long as the end result is a decently clear solution you should be fine.", "2_Subreddit": "opiates"}], "dv01t7x": [{"0_Comment Submission": "The Church of What's Happening Now #563 - Danny Brown", "1_Text": "This is going to be a good one, cocksuckas.\n\nedit: wow joey is stoned to the muthafuckin gills", "2_Subreddit": "JoeyDiaz"}], "dv5zz4g": [{"0_Comment Submission": "Enjoying the mix of tramadol and oxy for the first time; there’s a sort of levity to the usually weighty happiness oxy provides alone. What are your favorite opioid/ate cocktails? Feel free to tell a little tale of your experience.", "1_Text": "Yeah nah get fucked ya shit cunt", "2_Subreddit": "opiates"}], "dvdexej": [{"0_Comment Submission": "[Nsfw] Ex prisoners of reddit, what are your horror stories/things you wish you could unsee and how did you cope with it while locked up?", "1_Text": "Hey Hitler!", "2_Subreddit": "AskReddit"}], "dvdr1r4": [{"0_Comment Submission": "Vince Staples is dropping his new single \"Get The Fuck Off My Dick\" tonight", "1_Text": "You corny and a hater\n\n**You weird**", "2_Subreddit": "hiphopheads"}], "dvfbah4": [{"0_Comment Submission": "Strange story about a fight at the Comedy Store from Dice's Instagram", "1_Text": "tl;dr - just another night at the comedy store where everybody except Joey Diaz is coked out of their fucking minds.", "2_Subreddit": "JoeRogan"}], "dvfbdpk": [{"0_Comment Submission": "Dice Clay just stopped Joey Diaz getting into a fight over Kate Quigley.", "1_Text": "Quoting myself in the thread on the /r/JoeRogan subreddit;\n\n> tl;dr - just another night at the comedy store where everybody except Joey Diaz is coked out of their fucking minds.\n\n\nI doubt it was anything serious at all.", "2_Subreddit": "JoeyDiaz"}], "dvfbuqe": [{"0_Comment Submission": "Dice Clay just stopped Joey Diaz getting into a fight over Kate Quigley.", "1_Text": "I...what?\n\n>where everybody except Joey Diaz\n\n>except Joey Diaz", "2_Subreddit": "JoeyDiaz"}], "dvoau9w": [{"0_Comment Submission": "Okay soooo", "1_Text": "Yeah...they'll do that.", "2_Subreddit": "opiates"}], "dvpx0gy": [{"0_Comment Submission": "What’d you guys think of Podcast #567 with Wheeler?", "1_Text": "I think he might have had a couple of beers or something - he's said he doesn't drink normally but a drink or 2 mixed with the pot and xanax will fuck you up beyond belief - slurred speech, lack of coordination and generally just being messy as fuck.\n\nI really hope he gets a grip on this xanax shit soon, I've noticed he's been talking about it in a recreational state of mind for a few months now and it's been worrying me since the beginning.\n\nCome on Joey, you should be able to see this is going to take you to places you don't want to go.", "2_Subreddit": "JoeyDiaz"}], "dvtztcc": [{"0_Comment Submission": "600 hulk bars xanax", "1_Text": "Didn't Robert Downey Jr. say that?", "2_Subreddit": "opiates"}], "dwpyhx2": [{"0_Comment Submission": "The Church Of What's Happening Now #572 - Kate Quigley", "1_Text": "I dunno...maybe I'm half a fag but the way Joey creeps after Kate gives me the heebie jeebies, and now he's on the Xans he's got absolutely no inhibitions about being a class A fuckin...whatever the fuck.\n\nI mean I'd still fuck her til she had nutjuice coming out of her nose, so who am I to say anything...", "2_Subreddit": "JoeyDiaz"}], "dwudgd1": [{"0_Comment Submission": "I'm Eric Hafner, I'm running for U.S. Congress in Portland, Oregon (OR-3). I want to legalize all drugs, including opiates, but offer ibogaine therapy too, and free drugs for addicts via prescription.", "1_Text": "I wish I had your brain chemistry.", "2_Subreddit": "opiates"}], "dwudjn9": [{"0_Comment Submission": "Fentanyl is 1000xs stronger than morphine...", "1_Text": "While we all appreciate the thought behind the post, I very very highly doubt anybody who comes onto this board doesn't understand the dangers of fent, especially seeing as we have frequent fent warnings and pretty much everybody here knows somebody who has OD'd because of it.\n\nThanks for the heads up though, it came from a good place.\n\nedit: Sorry if I sound like an asshole, that wasn't my intention.", "2_Subreddit": "opiates"}], "dwwpm00": [{"0_Comment Submission": "How do you know when it's kicking in", "1_Text": "You're all good man - as long as you're genuine we're always happy to answer questions - this is a harm reduction subreddit after all. Be safe, and please never use opiates recreationally again.", "2_Subreddit": "opiates"}], "dwwpoph": [{"0_Comment Submission": "New CWE idea", "1_Text": "That's a no from all of us, dawg.", "2_Subreddit": "opiates"}], "dwwq5xs": [{"0_Comment Submission": "1963 EH Holden [718 × 427]", "1_Text": "Gorgeous. Glad to see a(n) ~~Aussie~~ Chinese car here...\n\nFuck I need a beer or 10....", "2_Subreddit": "carporn"}]}], "1_submissions": [{}]}]}