{"Kipriot_holidays": [{"0_comments": [{"dwju7gt": [{"0_Comment Submission": "How many of you have an accompanying mental disorder ?", "1_Text": "I was fine, till I start maintenance program on subs.\nOn second year I feel myself empty, depressed and aggressive. I am leaving on the sunny island in the Mediterranean Sea, everybody is happy here, they’re going to the beaches at summer, making some happy things that normal people do, but I just want to close myself in the room, I send my wife to the beach or to the mountains, even paying for all of this just to stay home and to not see random happy faces coz I want to kill everybody lmao \nI got some script today for the antidepressants, benzos etc, hope this will help me lol", "2_Subreddit": "opiates"}], "dwklybk": [{"0_Comment Submission": "Suboxone titration", "1_Text": "You can create for yourself an hell inside the hell, actually you can send yourself to the bottom of the hell lol\nIf you are in full addiction then 24 hours is the minimum amount of time that you must to wait mate. Better to wait for a full 36 hours before taking suboxone, because you are really about to send yourself to the hell of PWDs after only 12 hours.\n\nAnd if you’ll not listen to this, just a small hint -\nWhen you will start to feel yourself freezing with liquid metals inside your veins, just go to the hottest shower for an hour at least lmao And don’t take more bupe or dope, it will not help, just ride it out, if you don’t have methadone in your body it will be over soon, from 1 hour to 12 hours and few days more you will feel like shit lmao", "2_Subreddit": "opiates"}], "dwl1bfo": [{"0_Comment Submission": "Strange benzo prescription", "1_Text": "Thanks for your respond mate.\nAnd thanks for your wishes. In last couple of years I didn’t use other benzos, except of Xanax, but it was only for few times and few months ago for therapeutic reason.\nBut in past years,  4 or 5 years ago I was using flunitrazepam, alprazolam and diazepam hardly, together with heroine and methadone. I was a hardcore junky without veins and almost without ability to walk normally if not on dope. It was part of my life that I don’t remember at all, with 5-6 overdoses, ambulances etc... Now I am ok, is my second year on bupe and my life has changed drastically, family, new good job and good reputation.  Except of few problems that I get in last month, one of my employers own me the huge amount of money and now starting the bankruptcy process, so I was not able to pay my bills, local Electricity Authorities cut of the power supply in my house, Cell phone carrier cut of all mobiles of my family , to many anxiety, scandals in the family and all related with this shit drama... So I was forced to ask for a script to not loose the control completely.", "2_Subreddit": "benzodiazepines"}], "dwl8gz8": [{"0_Comment Submission": "Strange benzo prescription", "1_Text": "No, I visit the clinic once at week or if I have enough money - once at month, to get my medications. 8mg suboxone pills daily. I can buy 1 pack for a week or 4 packs for an month, nobody is counting and sometimes I take more for me or for somebody who asks me if he is in a trouble.\nMy main target is to fight anxiety and the second goal is to potentiate somehow action of bupe because in all pressure that I feel it is not helping me anymore , because I feel myself like 5 minutes away from relapsing and actually I had to relapse for few times already in last months. I thought that the perfect solution is to change maintenance from the bupe to methadone, but unfortunately it is not possible in my country. The only way to get mdone is to go in inpatient rehab for few weeks. But it is not possible for me right now.\n\nIs hard to believe in that what 2 months ago I was thinking that I don’t need anymore any maintenance and i was tapering bupe consumption by lowering the dosage every few days, but now everything gone in a wrong way, mate.\nJust want to shoot H, feel the buzz and say fuck off to the problems and to fuck up any pain and anxiety inside me, but I am happy that there is still a smart part of myself that is doing everything to stop me from this decision.\n\nRespectfully.", "2_Subreddit": "benzodiazepines"}], "dwlcbnf": [{"0_Comment Submission": "Dr Phil trying to help Heroin addicts by threatening them and looking down on them pisses me off", "1_Text": "Hm, very good idea, but unfortunately it is not possible, nobody will do it. \nNew born son of the Sheikh in Dubai didn’t get such advance lmao \nEconomically and practically it is not possible unfortunately, but I can’t disagree that this method will work. \nTheoretically this method will be most successful from any other methods, but in this case everybody will try to become addicted to get such amazing opportunity LOL\nHere where I leave now, in EU, we have laws for addicted persons, they can just declare that they are not able to function normally because of addiction and psychological problems caused by consumption of substances so can not work, nobody will force them to make a job and they’re getting payment from governments every month, just like salary, and much higher than minimum allowed amount by ministry of economics, higher than my official part of salary.\nAnd you know what? There is the tones of people that trying to declare same thing and inability to function, just to get such payments Lmao.", "2_Subreddit": "opiates"}], "dwld6p2": [{"0_Comment Submission": "Dr Phil trying to help Heroin addicts by threatening them and looking down on them pisses me off", "1_Text": "For example - simple staff (not managers etc) in different companies, salesman, cleaners, hotel staff, builders etc in most cases they have income about €900 + taxes,  and addicted heroin users is receiving incomes €1000, €1200 and more, even depending on their responsibilities, like house rental costs, family member, maybe they have wife an kids, old parents that need care etc., in this cases they can claim that they’re need more to be able to pay all bills and responsibilities etc.\nI am working hard as a project manager and manager of transport department of our company, but I am fucking jealous because some persons have better incomes without doing anything at all except of shooting H every day and that H is paid by my taxes and taxes of my family. Fuck it...", "2_Subreddit": "opiates"}], "dwldmjp": [{"0_Comment Submission": "Used subs for the first time recreationally, need advice please...", "1_Text": "You didn’t browse anything and you didn’t search anything. Here is every day people asking about same things.\n\nYes, you must to wait few days, better more than 72 hours to get full effects of any opioids.\n\nEdit: for your tolerance 2mg of bupe is more than enough. You just wasted your strips, because there is no difference for you how much you’ll take the suboxone. There is a ceiling dose and bupe is so strange drug that is better take less to feel more.\n\nGood luck mate", "2_Subreddit": "opiates"}], "dwns54d": [{"0_Comment Submission": "Dr Phil trying to help Heroin addicts by threatening them and looking down on them pisses me off", "1_Text": "Cyprus, but this is not local laws just for internal use. This is directives from EU, about disabled persons.\nSo, if I have hepatitis C, addiction to substances etc - I am disabled and as disabled person I cannot work normally, so I have right to claim for financial support as disabled lol", "2_Subreddit": "opiates"}], "dwrx3wc": [{"0_Comment Submission": "Dosing Oxy in Morning Dosing Codine in the Evening?", "1_Text": "Are you sure? 400mg of code? 400 mg is for sure not for beginners mate.\nAnd no, I am talking not about overdose or something, but am talking about allergic reaction . \n400mg is a good dose for those who have a tolerance", "2_Subreddit": "opiates"}], "dwtx5vj": [{"0_Comment Submission": "I can't believe she registers with THAT (found on tumblr)", "1_Text": "Is easier to register with that than with insulin syringe.\nEven the site of injection is disappearing more quickly in this case ;)", "2_Subreddit": "opiates"}], "dwum91l": [{"0_Comment Submission": "How can I find a dealer for brown now that craigslist is done for?", "1_Text": "Sourcing?", "2_Subreddit": "opiates"}], "dwumq2y": [{"0_Comment Submission": "Is Codeine any good for avoiding H WDs?", "1_Text": "Codeine will help for sure. \n\nThere is a trick with some pills that contains codeine and ibuprofen. It is not allowed to mix both substances in one pill, now I don’t remember what exactly happens , but the pills with Codeine and Ibuprofen always contains 2 sides, one side is white and other side is red and is very easy to separate them. Codeine is in white side ;)", "2_Subreddit": "opiates"}], "dwv0dys": [{"0_Comment Submission": "Phenobarbital & Suboxone treatment", "1_Text": "No, in case if there is no opiates on receptors it will be fine.   The trick is to wait more than 30+ hours sometimes 48h. \nPWDs is almost unpredictable ;) once I take suboxone only after 10-12 hours and I get demo version of pwds for few minutes, I had to go in hot shower and after that even feel the buzz lmao\nBut unfortunately on second try to do the same stupid thing I got PWDs for 6-8 hours and after 3 days I was feeling myself like shit.", "2_Subreddit": "opiates"}], "dwv11ux": [{"0_Comment Submission": "Phenobarbital & Suboxone treatment", "1_Text": "That second time it was real hell mate. It was Sunday, at morning I shot 0,25 H, and at evening I shot some fent analog and go to sleep. I wake up after just few hours on full withdrawals, sweating, it was very intense WDs. \nI had 1 sub of 8mg, I take the half and boooomm.. There is no words to describe this hell... I was able to sleep after 6 or 8 hours and I had mild withdrawals for 3 days more and subs didn’t helped me.", "2_Subreddit": "opiates"}], "dwv1isl": [{"0_Comment Submission": "Phenobarbital & Suboxone treatment", "1_Text": "Yes. I agree about tolerance and ceiling dose of Bupe.\nI wish I had same choice as you ;) Because here where I leave now we can get only the suboxone. Only one clinic have mdone, but only for inpatient rehab. Maintenance only with suboxone.", "2_Subreddit": "opiates"}], "dwv2ypo": [{"0_Comment Submission": "Phenobarbital & Suboxone treatment", "1_Text": "Yes, but here in small EU country, where first maintenance program started at 2008 and it was subutex and after couple of years they changed it to Suboxone. \nGovernmental clinics use only subs for maintenance, one inpatient hospital use methadone only for detox and we have one private clinic that was giving the scripts for DHC and Oxy but they stop it because of pressure from local DEA and ministry of health now they use suboxone to.", "2_Subreddit": "opiates"}], "dwvd3ia": [{"0_Comment Submission": "Question regarding narcan and opiates", "1_Text": "No, it remains in your body for weeks, months and even years.\nThey just need to know what exactly they are looking for.  And sometimes structure of the substance is still unknown and they will not discover it. You can change molecular structure to change the substance but still keep the effects", "2_Subreddit": "opiates"}], "dww67r7": [{"0_Comment Submission": "Question regarding narcan and opiates", "1_Text": "Are you sure?  Did you listen about hair check? Did you listen about cells analysis with biopsy? Lmao\nBut if we are talking only about standard drug tests - ok, about 72 hours in urine", "2_Subreddit": "opiates"}], "dwwmpoa": [{"0_Comment Submission": "order not arriving", "1_Text": "I am in EU and sometimes I can wait 20+ days and sometimes 3 days. And who knows wtf is going on mate, but always on holidays you will get delays. Even bank transactions in Euro was stoped at catholic Easter", "2_Subreddit": "DarkNetMarketsNoobs"}], "dwwmx19": [{"0_Comment Submission": "Using e-cigarettes to smoke heroin/coke/crack?", "1_Text": "Personally not, but I read about it every few days here on this sub, so it supposed to be true \n\nEdit: about BTH and fent, dunno about crack", "2_Subreddit": "opiates"}], "dwx8ur8": [{"0_Comment Submission": "Using e-cigarettes to smoke heroin/coke/crack?", "1_Text": "I understand you bro. I was  meth-head for few years of my life.  I hate it to but I still waking up at night and waiting for a buzz from that shot in my dream lmao", "2_Subreddit": "opiates"}], "dwx9g6n": [{"0_Comment Submission": "order not arriving", "1_Text": "I ordered things from vendor that always do NDD for domestic orders, but when I get the order there was a postal stamp about 3 days later.  And other time I place  the order with vendor known as selective scammer and I got it in 2 days lol but he send me fent mixed with some dirt from the kitchen instead of heroin lmao", "2_Subreddit": "DarkNetMarketsNoobs"}], "dwx9til": [{"0_Comment Submission": "Using e-cigarettes to smoke heroin/coke/crack?", "1_Text": "Lol I know some meth-heads that walking all night long and searching some weird things with torch light, everywhere, in grass on the streets, behind the bus stops etc... But the strangest thing is that they are really finding things like golden rings , some cash etc lmao\nEdit: they are finding even the dead drop with heroin that was hidden for somebody", "2_Subreddit": "opiates"}], "dwxabzu": [{"0_Comment Submission": "R/drugs compares using heroin to raping children...", "1_Text": "Somebody just rape him when he was cold coping for heroin and now he hates everybody on opiates lol", "2_Subreddit": "opiates"}], "dwxfvwf": [{"0_Comment Submission": "Quick question about Codeine", "1_Text": "72 hours for sure ;)  And...  Any test will show you the same results as heroin.  Because it metabolized to morphine. So you are positive for opiates", "2_Subreddit": "opiates"}]}], "1_submissions": [{"851lek": [{"0_Title": "Introducing myself", "1_Text": "I was fine, till I start maintenance program on subs.\nOn second year I feel myself empty, depressed and aggressive. I am leaving on the sunny island in the Mediterranean Sea, everybody is happy here, they’re going to the beaches at summer, making some happy things that normal people do, but I just want to close myself in the room, I send my wife to the beach or to the mountains, even paying for all of this just to stay home and to not see random happy faces coz I want to kill everybody lmao \nI got some script today for the antidepressants, benzos etc, hope this will help me lol", "2_Subreddit": "opiates"}], "85im0n": [{"0_Title": "New licensed product of Indivior UK ltd (suboxone producers) “Sublocade”", "1_Text": "I was fine, till I start maintenance program on subs.\nOn second year I feel myself empty, depressed and aggressive. I am leaving on the sunny island in the Mediterranean Sea, everybody is happy here, they’re going to the beaches at summer, making some happy things that normal people do, but I just want to close myself in the room, I send my wife to the beach or to the mountains, even paying for all of this just to stay home and to not see random happy faces coz I want to kill everybody lmao \nI got some script today for the antidepressants, benzos etc, hope this will help me lol", "2_Subreddit": "opiates"}], "88di8n": [{"0_Title": "Strange benzo", "1_Text": "I was fine, till I start maintenance program on subs.\nOn second year I feel myself empty, depressed and aggressive. I am leaving on the sunny island in the Mediterranean Sea, everybody is happy here, they’re going to the beaches at summer, making some happy things that normal people do, but I just want to close myself in the room, I send my wife to the beach or to the mountains, even paying for all of this just to stay home and to not see random happy faces coz I want to kill everybody lmao \nI got some script today for the antidepressants, benzos etc, hope this will help me lol", "2_Subreddit": "opiates"}], "88dq42": [{"0_Title": "Strange benzo prescription", "1_Text": "I was fine, till I start maintenance program on subs.\nOn second year I feel myself empty, depressed and aggressive. I am leaving on the sunny island in the Mediterranean Sea, everybody is happy here, they’re going to the beaches at summer, making some happy things that normal people do, but I just want to close myself in the room, I send my wife to the beach or to the mountains, even paying for all of this just to stay home and to not see random happy faces coz I want to kill everybody lmao \nI got some script today for the antidepressants, benzos etc, hope this will help me lol", "2_Subreddit": "benzodiazepines"}]}]}]}