{"polydrugfiend": [{"0_comments": [{"dwemwd2": [{"0_Comment Submission": "Ever tripped on the Velvet Underground & Nico Album?", "1_Text": "No, but I've done heroin while listening to this album before.", "2_Subreddit": "LSD"}], "dwen8u0": [{"0_Comment Submission": "Ever tripped on the Velvet Underground & Nico Album?", "1_Text": "Pure bliss, I love listening to the Velvet Underground and Deerhunter on opioids. So calming and depressing; it makes me feel at home.", "2_Subreddit": "LSD"}], "dwenbpa": [{"0_Comment Submission": "Ever tripped on the Velvet Underground & Nico Album?", "1_Text": "What do you mean? I mean, obviously heroin is very addictive and does kill.", "2_Subreddit": "LSD"}], "dweogva": [{"0_Comment Submission": "Ever tripped on the Velvet Underground & Nico Album?", "1_Text": "Oh of course, my personal favorite is Sunday Morning.", "2_Subreddit": "LSD"}], "dweoja2": [{"0_Comment Submission": "Do you think drug addiction is a \"disease\"?", "1_Text": "I love all of this conversation that's occurring.", "2_Subreddit": "Drugs"}], "dwep5pl": [{"0_Comment Submission": "An open letter to the girl I haven't met yet.", "1_Text": "I don't even know what to say, this is exactly how I felt until I met my \"Annabelle\". But she accepts me, addiction and all, and she lights up my world every day. There are times when I'm irrationally angry around her, and stupid, and just downright awful. But she understands and loves me through all of it. I hope that you find her and never let her go.", "2_Subreddit": "Drugs"}], "dwepoop": [{"0_Comment Submission": "An open letter to the girl I haven't met yet.", "1_Text": "You're never alone, it's just hard to reach out because most people won't understand. You can always PM me if you need to talk. I hope that I never lose her, because if I do, I'll never find a love like that again.", "2_Subreddit": "Drugs"}], "dweppm7": [{"0_Comment Submission": "Hey so what are some signs that you may have done a little to much heroine and shouldn’t snort another line?", "1_Text": "That's true, I think I was confusing the ketamine/ketamin difference.", "2_Subreddit": "opiates"}], "dwgnxap": [{"0_Comment Submission": "Hey so what are some signs that you may have done a little to much heroine and shouldn’t snort another line?", "1_Text": "It's refreshing to receive understanding for my mistakes on here rather than hatred. ☺", "2_Subreddit": "opiates"}], "dwr0opi": [{"0_Comment Submission": "First time hydrocodone.", "1_Text": "You should expect to feel a warm, lovely feeling that emanates from your body and your mind. I would suggest taking about 15-20mg of hydrocodone for your first time. It mixes very well with weed.", "2_Subreddit": "Drugs"}], "dwr0uhy": [{"0_Comment Submission": "I think I snorted a half gram of crystal meth by accident. What am I in for?", "1_Text": "You're in for one sleepless night if you don't have Xanax or another benzo. You'll probably be stimulated well into the early morning and have a bad comedown. However, I doubt you did half a g in one key bump.", "2_Subreddit": "Drugs"}], "dwu2oib": [{"0_Comment Submission": "Is it just bad coke", "1_Text": "I can certainly vouche for this. I live relatively close to the Mexican border and most of the time the cocaine is high quality. Granted, it's a $100 a g, but that's definitely worth it compared to paying $60 for some shit that's cut to hell.", "2_Subreddit": "Drugs"}], "dwu55v8": [{"0_Comment Submission": "need some moral support taking 40gels", "1_Text": "I once swallowed 10 pills at once and I gagged like a motherfucker.", "2_Subreddit": "dxm"}], "dwu5905": [{"0_Comment Submission": "Retarded Drug Dealers", "1_Text": "Do you think there's a possibility that he's a cop? I mean obviously there's a possibility but a strong one?", "2_Subreddit": "Drugs"}], "dwu5eel": [{"0_Comment Submission": "Used 4 days ago. Should I cancel drug test tomorrow?", "1_Text": "That's difficult to say. Cocaine is out of your urine within 1-3 days but if you haven't been drinking a lot of water I would postpone it.", "2_Subreddit": "cocaine"}], "dwu6eu9": [{"0_Comment Submission": "Retarded Drug Dealers", "1_Text": "Yeah, I never did that shit when I was dealing. I was always up front and honest and I think that's why I had so many repeat customers. Honestly though, how can you sell something and not know a damn thing about it? I just don't understand why or how people don't take the time to google the drug(s) they're selling.", "2_Subreddit": "Drugs"}], "dwu6l2d": [{"0_Comment Submission": "Replacing marijuana with Ketamine", "1_Text": "Do NOT make a habit out of ketamine. It's fine to take it every once in a while like every other hallucinogen, but repeated, long term use will destroy your bladder. If you end up becoming addicted and use for a long time you will have to use a catheter for the rest of your life.", "2_Subreddit": "Drugs"}], "dwu6nua": [{"0_Comment Submission": "Where can I find some LSD? (Scotland)", "1_Text": "Take a train ride to the Netherlands. Best LSD I've ever been able to find.", "2_Subreddit": "LSD"}], "dwu6thv": [{"0_Comment Submission": "My best friend just died, having overdosed on fentanyl.", "1_Text": "I'm sorry, I almost died a couple weeks ago from fentanyl and I never want to touch that shit again. Although it's hard not to use, especially in times of emotional turmoil, please don't use this as an excuse to use more. I have no idea what it's like to lose a close friend, but please don't destroy yourself to find relief. I don't think that's what your friend would want.", "2_Subreddit": "opiates"}], "dwu6va3": [{"0_Comment Submission": "Why is snorting benzos so popular?", "1_Text": "This. My first experience with any recreational drug I snorted Percocet. Needless to say, it was not pleasant.", "2_Subreddit": "Drugs"}], "dwu9rya": [{"0_Comment Submission": "Blood work in the morning", "1_Text": "They're legally not allowed to test for anything other than what they tell you they're testing for.", "2_Subreddit": "Drugs"}], "dww4q3u": [{"0_Comment Submission": "May I ask people’s views on ethical rules? Do they exist to you or don’t?", "1_Text": "I only live by one rule. Don't intentionally harm others in any way unless they deserve it.", "2_Subreddit": "LSD"}], "dwwngjl": [{"0_Comment Submission": "LSD and Breastfeeding", "1_Text": "Hmm, this is a tricky question to answer. Your friend certainly shouldn't breastfeed while on acid (I'm sure that would be a weird experience). However, LSD is out of your blood before you even stop tripping. I don't think it would be that harmful at all, as LSD has one of the shortest half-life's of any drug that I know of. Definitely don't make a habit of it though.", "2_Subreddit": "LSD"}], "dwwnxry": [{"0_Comment Submission": "Friend takes K", "1_Text": "Just make sure that he uses ecstasy and ketamine sparingly. Ecstasy should only be taken once a month at the most, but you should really wait three months in between dosages. Long-term ketamine usage can wreck havoc on your bladder and require you to wear a catheter for the rest of your life if it's bad enough. Everything in moderation.", "2_Subreddit": "Drugs"}], "dwxywoy": [{"0_Comment Submission": "Cocaine and alcohol", "1_Text": "Everything in moderation is fairly safe for you.", "2_Subreddit": "cocaine"}]}], "1_submissions": [{"81vxcx": [{"0_Title": "Recurring opiate desires", "1_Text": "No, but I've done heroin while listening to this album before.", "2_Subreddit": "opiates"}], "81zn4m": [{"0_Title": "Sinaloa Cartel", "1_Text": "No, but I've done heroin while listening to this album before.", "2_Subreddit": "Stims"}], "81zvc2": [{"0_Title": "Fake Roxys in Southwest Region of US", "1_Text": "No, but I've done heroin while listening to this album before.", "2_Subreddit": "opiates"}], "84tt29": [{"0_Title": "Poly-drug addiction", "1_Text": "No, but I've done heroin while listening to this album before.", "2_Subreddit": "Drugs"}], "84u7az": [{"0_Title": "This is a good question for all you onion growers", "1_Text": "No, but I've done heroin while listening to this album before.", "2_Subreddit": "Drugs"}], "86q36h": [{"0_Title": "I hate the feeling of fentanyl", "1_Text": "No, but I've done heroin while listening to this album before.", "2_Subreddit": "opiates"}], "87eiqr": [{"0_Title": "March for our lives?", "1_Text": "No, but I've done heroin while listening to this album before.", "2_Subreddit": "OffensiveMemes"}], "87okft": [{"0_Title": "Do you think drug addiction is a \"disease\"?", "1_Text": "No, but I've done heroin while listening to this album before.", "2_Subreddit": "Drugs"}], "87oocz": [{"0_Title": "A picture from a long fucking time ago ☹️", "1_Text": "No, but I've done heroin while listening to this album before.", "2_Subreddit": "Stims"}], "89wpi8": [{"0_Title": "Retarded Drug Dealers", "1_Text": "No, but I've done heroin while listening to this album before.", "2_Subreddit": "Drugs"}]}]}]}