{"downwithdisease996": [{"0_comments": [{"dwgbxir": [{"0_Comment Submission": "\"Let's rock.\" 'Let's rock.' \"Today.\" 'Today.'", "1_Text": "Right on!", "2_Subreddit": "opiates"}], "dwgcvp7": [{"0_Comment Submission": "\"Let's rock.\" 'Let's rock.' \"Today.\" 'Today.'", "1_Text": "Well I fucking love the dead and that's some great looking dope! Im happy for you! I wish I could buy in weight and not worry about bags being small or even empty.", "2_Subreddit": "opiates"}], "dwge98f": [{"0_Comment Submission": "This is so sad. Poor girl.", "1_Text": "If you look, the mother put up so many videos just saying she loved her daughter and wanted to educate. Apparently the end all of this was the daughter climbed out a window and went to get high and never came back.", "2_Subreddit": "opiates"}], "dwgr7zz": [{"0_Comment Submission": "The time I stayed with my dboy for a couple weeks....", "1_Text": "Wow you are rude as fuck.", "2_Subreddit": "opiates"}], "dwgst7s": [{"0_Comment Submission": "\"Let's rock.\" 'Let's rock.' \"Today.\" 'Today.'", "1_Text": "Hey now that's my sweet sweet ginger God!! Haha! I love panic too though ! :)", "2_Subreddit": "opiates"}], "dwgtfau": [{"0_Comment Submission": "The time I stayed with my dboy for a couple weeks....", "1_Text": "I totally understand being pissy about that, trust me. And there is a lot of unnecessary b.s. in this sub. But this is not someone who spams the sub with crap and doesn't sound like a low life to me! They were just trying to post something original and relatable. I just feel like you don't need to bash on her for her life on dope not being as picture perfect as you make it seem like yours is.", "2_Subreddit": "opiates"}], "dwhjltb": [{"0_Comment Submission": "quick need help", "1_Text": "Caffeine!  Addies, anything to wake ya UP!", "2_Subreddit": "opiates"}], "dwhk70f": [{"0_Comment Submission": "quick need help", "1_Text": "If you have the time run to Wal-Mart and pick up caffeine pills and 12 pack of Mt.  Dew! Soda helps me at work", "2_Subreddit": "opiates"}], "dwhkg7y": [{"0_Comment Submission": "quick need help", "1_Text": "Get caffeine pills if you don't mind taking something like that they're totally over the counter and much easier,  more potent ,and faster", "2_Subreddit": "opiates"}], "dwhuiy9": [{"0_Comment Submission": "quick need help", "1_Text": "So glad it worked out for you !", "2_Subreddit": "opiates"}], "dwhuyo7": [{"0_Comment Submission": "quick need help", "1_Text": "Took a tab, did a shot, my eyes never got dilated....weirded me out", "2_Subreddit": "opiates"}], "dwhvd2m": [{"0_Comment Submission": "What’s the point of living...?", "1_Text": "Dying", "2_Subreddit": "AskReddit"}], "dwhvp8e": [{"0_Comment Submission": "quick need help", "1_Text": "I'm happy to help I'm on really thin ice at my own job", "2_Subreddit": "opiates"}], "dwhw2vp": [{"0_Comment Submission": "What’s the point of living...?", "1_Text": "Not delaying, just waiting. I personally am hurtling towards it. But the apathy really makes it drag. Sometimes you gotta find something that makes you happy just to get thru shit.", "2_Subreddit": "AskReddit"}], "dwhxnxg": [{"0_Comment Submission": "My Wife And I at a Phish show", "1_Text": "This is adorably awesome !", "2_Subreddit": "phish"}], "dwjmyhp": [{"0_Comment Submission": "My FUCKING dream", "1_Text": "My best dream so far I found a brick in the drawer my grandparents never let me go in as a child. I always knew there was something amazing in there....\n\n\nCurious enough I only dream about getting high if I'm in w/d", "2_Subreddit": "opiates"}], "dwmu01e": [{"0_Comment Submission": "Missed a shot about 4 days ago the pain has gone away but it doesnt look much better should i go to the ER or is the pain going away a good sign?", "1_Text": "He i.v.ed it and he didn't shoot it into the vein.", "2_Subreddit": "opiates"}], "dwmufsl": [{"0_Comment Submission": "Besides using a thermometer, is there a way to know if the pee you’re using for a test is warm enough?", "1_Text": "Like the guy above said microwave it a little so it's hot, and better safe than sorry, leave it strapped to you somehow on your groin or inside thigh (as close to the body part it would actually come out of as possible) for one or two hours prior", "2_Subreddit": "opiates"}], "dwmuj4h": [{"0_Comment Submission": "Besides using a thermometer, is there a way to know if the pee you’re using for a test is warm enough?", "1_Text": "I am female, but it definitely works and I use a thick plastic little hair dye bottle inside me an hour prior and I've never had any issues.", "2_Subreddit": "opiates"}], "dwmurdj": [{"0_Comment Submission": "“When you feel the urge just smoke some weed..”", "1_Text": "Now I'm just broke from smoking a half every week though bro", "2_Subreddit": "opiates"}], "dwoad47": [{"0_Comment Submission": "So friend went out of town", "1_Text": "I load for UPS. We're too busy to give a shit. As long as you don't seem sketch at the store they have no reason to suspect your package. Just mail it in a typical express envelope.", "2_Subreddit": "opiates"}], "dwoagc9": [{"0_Comment Submission": "So friend went out of town", "1_Text": "Maybe try to put them in something so they can't rattle, and can't be 'felt' through the envelope.", "2_Subreddit": "opiates"}], "dwqthec": [{"0_Comment Submission": "What was the first song you got at your your first show??", "1_Text": "Farmhouse!", "2_Subreddit": "phish"}], "dwurcty": [{"0_Comment Submission": "Crack pipe", "1_Text": "Chore boy (copper scrubber)", "2_Subreddit": "opiates"}], "dwutrpd": [{"0_Comment Submission": "Crack pipe", "1_Text": "Family dollar should definitely have it. It'll be in the cleaning section by the sponges and brillo. Make sure you burn the piece you're going to shove in your pipe because you don't wanna taste that nasty coating.", "2_Subreddit": "opiates"}]}], "1_submissions": [{}]}]}