{"biscoballa": [{"0_comments": [{"d7za0qe": [{"0_Comment Submission": "Vyvanse VS adderrall?", "1_Text": "Vyvanse for what you're wanting it for. I'm prescribed adderall and I can't take it for at least 5 days when I'm transitioning to sub. I actually started out on vyvanse and absolutely loved it. There's no huge peak. It's a fairly even plateau. However, I wanted an IR for \"breakthrough\" days when I really needed an extra boost at work (vyvanse doesn't make an IR). My doc didn't want me on two different types of amps (fucking retarded) so he switched me to add xr and add IR. I wish I could go back to vyvanse. \n\nMy issue with adderall is that a lot of times I get too focused or antsy and don't get shit done. Where as vyvanse, I could barely notice I was on anything but it worked really well", "2_Subreddit": "opiates"}], "d8sqgt7": [{"0_Comment Submission": "How or why did you guys and gals start using needles?", "1_Text": "Your pharmacists? You mean your doctor?", "2_Subreddit": "opiates"}], "d965vwn": [{"0_Comment Submission": "How is everyone?", "1_Text": "Wow, that's awesomely ridiculous. Please give me your friends/fiends info. 😜", "2_Subreddit": "opiates"}], "d9bqa0a": [{"0_Comment Submission": "Waiting on the (mail)man", "1_Text": "What does it usually cost for fire on DNM?  I've been thinking of going that route but have heard it's pricey. However, if it's fire then I'm sure it might be worth it.", "2_Subreddit": "opiates"}], "d9rdg46": [{"0_Comment Submission": "Hippy dope porn ( bicolor tourmaline )", "1_Text": "Fellow biscuit kid here (username checks out). I'm still seeing them though, going on 10 years. Nowadays I just do mini vacation runs though. So maybe 2-3 runs per year. For example, this year I did 4 nights in Denver in April and I'm doing NYE in Atlanta. It works for me. It's always something to look forward to when working the 9-5 grind, that's for sure.", "2_Subreddit": "opiates"}], "da0kw28": [{"0_Comment Submission": "The love of my life", "1_Text": "Roughly how much per mg if you don't mind me asking?", "2_Subreddit": "opiates"}], "da4y5br": [{"0_Comment Submission": "Old habits...", "1_Text": "So you just use once a week and then do subs for the remainder?  I wish I had that kind of self control. I meant to that last time and 3 weeks later.....that sub induction suckedddd", "2_Subreddit": "opiates"}], "ddw7woz": [{"0_Comment Submission": "Keeping the good vibes going, what phrase is your motto, your goto, your favorite phrase of all time? First 15 get 15 percent off at Zakah Life.", "1_Text": "\"Be the change you want to see in the world\"", "2_Subreddit": "kratom"}], "df70ong": [{"0_Comment Submission": "New kratom user dose help", "1_Text": "I concur with this. You won't feel it for at least the first week. It will help the WDs though. Especially the mental aspect. After the first week you'll definitely start feeling very subtle effects more and more.", "2_Subreddit": "kratom"}], "dkpl9um": [{"0_Comment Submission": "gabapentin advice", "1_Text": "What's better, gaba or prebaba?  Is it sketch to specify which one you want to your doc?", "2_Subreddit": "opiates"}], "dq8lz8d": [{"0_Comment Submission": "My semi-legal stash - Kratom, weed, phenibut, and LSA", "1_Text": "What dosage do you take?", "2_Subreddit": "DrugStashes"}], "dq8m5pf": [{"0_Comment Submission": "My semi-legal stash - Kratom, weed, phenibut, and LSA", "1_Text": "I’ve taken it like 4 times. Took 1.2g the first time and felt nothing. Took 2.1g the second time and definitely felt it but the last 2 times I’ve taken it at the 2g dose I️ haven’t really felt much. I’ve also spread my doses at least two weeks between each other", "2_Subreddit": "DrugStashes"}], "ds7a4mj": [{"0_Comment Submission": "Fucking finally. Not the best cop but CL pulled thru. 20$ for all of them. Super old man like 75, drives a Jag. Said he would give me 10 blue 30s if I wear something cute and walk his schnauzer 2x a week. Fuuuuuucking right I will.", "1_Text": "What did he have it posted on CL under? Causal Encounters?", "2_Subreddit": "opiates"}], "dt3nb9g": [{"0_Comment Submission": "We discovered a locked safe in the floor during remodel of our old home", "1_Text": "RemindME! 20 hours “Locked safe disappointment”", "2_Subreddit": "mildlyinteresting"}], "dwhe5jm": [{"0_Comment Submission": "\"Let's rock.\" 'Let's rock.' \"Today.\" 'Today.'", "1_Text": "Preach!", "2_Subreddit": "opiates"}]}], "1_submissions": [{}]}]}