{"chippersan": [{"0_comments": [{"dwm9fd3": [{"0_Comment Submission": "i’m fiending like a bitch rn", "1_Text": "they should kill that thing with fucking fire", "2_Subreddit": "opiates"}], "dwm9uys": [{"0_Comment Submission": "What happened to Jay Mohr?", "1_Text": "His wife went from this -\nhttps://i.pinimg.com/originals/e5/ec/d5/e5ecd575e0e2209fd94641cbe612f6c1.jpg\n\nTo this -\nhttp://i.perezhilton.com/wp-content/uploads/2017/03/jay-mohr-nikki-cox-divorce-specifics__oPt.jpg\n\nhttp://i.dailymail.co.uk/i/pix/2013/03/05/article-2288240-1870C210000005DC-25_634x868.jpg\n\nhttp://cdn01.cdn.justjared.com/wp-content/uploads/2008/06/lips-cox/nikki-cox-lips-lips-lips-07.jpg\n\n\nAnd then divorced him which i guess was a good think...She had too many surgeries and her lips/tits like deflated and got lopsided", "2_Subreddit": "opieandanthony"}], "dwnporq": [{"0_Comment Submission": "Happy Easter From The Sons of Tranarchy.", "1_Text": "that many sleeveless shirts on anybody over 40 in one room should not be legal", "2_Subreddit": "opieandanthony"}], "dwphium": [{"0_Comment Submission": "Reminder: Joe Cumia regularly brings up his military service, which consisted of him flitting round a kitchen peeling potatoes while the real men were fighting", "1_Text": "is there any clips of him talking about his military service on the show or anywhere else? because in almost ever picture he takes you constantly see him wearing either an Airborne T shirt or a lapel pin like what he wore to him appearance on people court with Judge Marilyn Monsoon", "2_Subreddit": "opieandanthony"}], "dwru87p": [{"0_Comment Submission": "The look of a dedicated co-host", "1_Text": "i think bobos whole mongoloid retard shtick could just be a genius act & hes actually in like fucking mensa", "2_Subreddit": "opieandanthony"}], "dwrxder": [{"0_Comment Submission": "The look of a dedicated co-host", "1_Text": "# #NotAllRetards", "2_Subreddit": "opieandanthony"}], "dwsu1un": [{"0_Comment Submission": "The look of a dedicated co-host", "1_Text": "that video was the best", "2_Subreddit": "opieandanthony"}], "dwtyca8": [{"0_Comment Submission": "CQ unmast w/ Ronnie B on 4/20 buddays", "1_Text": "Woah there friend, i can't just let you get away with that one", "2_Subreddit": "opieandanthony"}], "dwtyhdj": [{"0_Comment Submission": "CQ unmast w/ Ronnie B on 4/20 buddays", "1_Text": "why would he want to get rid of it? i mean you need that to hold up the sails and make sure the ship moves no?", "2_Subreddit": "opieandanthony"}], "dwtykx6": [{"0_Comment Submission": "\"I wont write to your bosses\". Sure Ant. Not like you didn't dox your own subscribers and threaten to call their employers or anything...", "1_Text": "hey i like john cusack, con air was the best", "2_Subreddit": "opieandanthony"}], "dwtyuv0": [{"0_Comment Submission": "And they say they are hard to get .. 🧐", "1_Text": "Dude thats hilarious, i had a huge day today too, it was like fucking christmas the last 24 hours almost every connect i have called me sayinf they had a bunch,  I bought close to 400 in the last 24 hours hahah its fucking awesome", "2_Subreddit": "opiates"}], "dwtzbxw": [{"0_Comment Submission": "And they say they are hard to get .. 🧐", "1_Text": "$1000 for 450 is a fucking steal jesus chirst the going rate is susually 1000 for like 50 of them lately \n\nDid you grab all of these today? i grabbed a bunch too pretty much every connect i have had them today and i was barely ever expecting it, I wasnt expecting anything big  to come around untill the weekend but today was like christmas but better hahaha\n\nI bought as many as they had because i know sometimes its so damn dry i cant find a fucking thing regardless of how much money im willing to throw people to find them they just arent there sometimes so days like today are awesome. My plans are to take this 350+ i bought today and taper off with them slowly and comfortablly which is going to be hard because im taking 800+ mg of oxy per day but knowing i have such a reserve in one place where they are safe and i don have to look for them is so reassuring you have no idea lol", "2_Subreddit": "opiates"}], "dwtznz4": [{"0_Comment Submission": "Did Anyone Get Their Tax Refund Money yet? I did at 4 Am. At 4:05 i called the dboy. Didnt spend a lot, trying to cut down and save $", "1_Text": "yea i got a G and it was promptly spent on 50 30s that were consumed in 2 days", "2_Subreddit": "opiates"}], "dwtzpp0": [{"0_Comment Submission": "Over 2 grand right here", "1_Text": "thats cute", "2_Subreddit": "opiates"}], "dwtzzwp": [{"0_Comment Submission": "Connect from cold cop always coming correct", "1_Text": "damn bro thats ballsy as fuck, i live in the city too but even on the driest day i'd be freaked about asking some dude outside the corner store for 30s unless i already knew he fucked with them or had some other kinda lead haha", "2_Subreddit": "opiates"}], "dwu05sl": [{"0_Comment Submission": "And they say they are hard to get .. 🧐", "1_Text": "yea i gave myself the next couple days to still get fucked up while i figure out my next move so thats like 75 ill do  then the rest i can plan a taper on", "2_Subreddit": "opiates"}], "dwu07yh": [{"0_Comment Submission": "And they say they are hard to get .. 🧐", "1_Text": "yea i was happy as shit i wwent to the bank yesterday and freed up some cash", "2_Subreddit": "opiates"}], "dwv8av2": [{"0_Comment Submission": "Nothing like sealed bottles to start my day.", "1_Text": "yea smaller pharmacys usually do it, i have rarely seen it done at cvs or big companys", "2_Subreddit": "opiates"}], "dwv8tiq": [{"0_Comment Submission": "And they say they are hard to get .. 🧐", "1_Text": "it might sound shitty but i talk like this because on the days when i cant find anything and i want to fucking cry cause im getting jerked around and played with by assholes because they know i need them, i wish i was just dead, and then on days like today when i can secure enough to not have to worry for awhile for sure im going to be as happy as possible\n\n\nyea i fucking need them or i wouldnt have spent 8-9k in the last 48 hours without any intention of selling them to make money back, they are just for me. Don't get self righteous saying i'm making it harder for people who need them, if I am, so is OP, so are you if you buy any on the street, and so is this entire forum for being here so why are you feeding into it if thats how you feel?", "2_Subreddit": "opiates"}], "dww229e": [{"0_Comment Submission": "The American Dream", "1_Text": "sallaaam alaikum Antwan", "2_Subreddit": "opieandanthony"}], "dww8hmk": [{"0_Comment Submission": "Opie's latest pop up show is going viral on reddit", "1_Text": "looks like vos' arm", "2_Subreddit": "opieandanthony"}], "dww8lvb": [{"0_Comment Submission": "This is disgusting", "1_Text": "i wonder what kind of sneakers he wore with a suit to make him down with the negroid youth he yearns to connect with", "2_Subreddit": "opieandanthony"}], "dww9cuj": [{"0_Comment Submission": "Do you guys do drugs?", "1_Text": "If you only used today and dont have a habit again yet, just throw the rest of the bun away and stop while your ahead, rememer how shitty it was kicking your habit before\n\nI have a habit myself i've built up over the least 3 years, been using for like 5-6 years total, i'm at like 800mg a day at this point and its just not sustainable, just hemorrhaging money buying them off the street even in bulk i just cant keep this up, i got kind of lucky since its the beginning of the month and a lot of my connects came through all at once and i've been able to cobble together almost close to 400 or so 30mg oxycodone tablets that i plan to use to taper myself off this crazy habit that i cant keep a lid on anynmore, the days when i can't find them i just want to blow my brains out since im taking at least 20 30mg tabs in one dose once a day\n\nIf i want to try and get high i have to usually wait around 24-30hrs or so from my last dose untill good im in withdrawal, usually like 11pm the next day after i dosed the day before at like 7pm and ill take like 850-900mg otherwise its kinda hard to catch and warm euphoria from the dose plus just the relief of all my symptoms melting away", "2_Subreddit": "opieandanthony"}], "dwweai1": [{"0_Comment Submission": "Everybody has their time. Mine is now.", "1_Text": "haha i'm not sober i currently have a yuge habit but i've done the cold turkey at home detox countless times, gone to rehab like 2-3 times and after those rehab stints years ago i just kinda decided i wasnt readt to quit at that point and that im not just gona keep putting my life on pause fucking it up being embarrassed by quitting and relapsing and going to rehab all over again and decided that id keep using and maintaing my life best as possible, which i have. Im functioning at a pretty high level going to colllege with a full time job, have had jobs in the past that all ended well, not your normal run of the mill lying cheating and stealing constantly junkie shit even though there is no doubt about it i am a junkie just instead of shooting dope i'm eating like 8-900mg of oxy everyday, I get high at the end of the day when im done all my responseable shit. I keep with oxy instead of dope by choice, i always know what i'm getting with pharms and i dont like snorting or needles to i just eat my pills, with the pills i always know what im getting and the right dose im taking theres no guessing like there is with dope no collapsed veins etc its easier to be a normal functional person than it would be on heroin even though it would be soooo much cheaper, that extra money is worth it for the peace of mind to know what im putting into my body.\n\nobv if your trying to say since im using i shouldnt comment but i have a ton of experience with all this shit and have done so much research and have read endlessly on the subject, so even thogh im an addict who cant or hasnt gotten clean yet i still have a better perspective and more knowledge on the subject than most normal people and some of the doctors ill talk to about shit to be honest not to sound arrogant cause i know that does. I'm still trying to figure out what the best way for me to help myself would be, i am thinking of going the ibogaine route since the treatment center i have talked to and have confirmed they are legit just moved from mexico to the Bahamas which is one of the big reasons i didnt want to go before because mexico freaked me out lol.", "2_Subreddit": "opiates"}], "dwweovx": [{"0_Comment Submission": "wish my dboy would see this ad 🙄", "1_Text": "the good compermise is just to be honest thoght and tell people like hey either let me know \"im gona need somthing at 10am tomorrow morning are you going to be around\" or if not say what time you will be around like hey i wont be back till 5pm\n\nthats how i used to do it id prefer people almost like make an appointment and say hey when you free tomorro? ill be ready in the morning etc", "2_Subreddit": "opiates"}]}], "1_submissions": [{"4o5rgk": [{"0_Title": "Anthony needs to get rid of Keith", "1_Text": "they should kill that thing with fucking fire", "2_Subreddit": "opieandanthony"}], "4pl13s": [{"0_Title": "Paterson Nightly is a Bartard?", "1_Text": "they should kill that thing with fucking fire", "2_Subreddit": "opieandanthony"}], "4qje2h": [{"0_Title": "too late to plant poppies??", "1_Text": "they should kill that thing with fucking fire", "2_Subreddit": "opiates"}], "4t1b8h": [{"0_Title": "Could Anthony actually sue any of these newspapers?", "1_Text": "they should kill that thing with fucking fire", "2_Subreddit": "opieandanthony"}], "4vorpp": [{"0_Title": "Which one of you bumbling idiots named \"john\" just called Anthony's show", "1_Text": "they should kill that thing with fucking fire", "2_Subreddit": "opieandanthony"}], "50xpaf": [{"0_Title": "New PA Prescription Monitoring Program", "1_Text": "they should kill that thing with fucking fire", "2_Subreddit": "opiates"}], "52czsu": [{"0_Title": "Ari Shaffir interviews 9/11 first responder/comedy club owner Cris italia about being at WTC on 9/11-Single best podcast I've ever heard..Listen to it", "1_Text": "they should kill that thing with fucking fire", "2_Subreddit": "opieandanthony"}], "55c0cf": [{"0_Title": "X-Post from /r/midlyInteresting", "1_Text": "they should kill that thing with fucking fire", "2_Subreddit": "opiates"}], "58pq4l": [{"0_Title": "Does anyone know why it says they are playing episode 3 \"eye in the sky\" tonight? I thought last week was episode 1 where did i miss episode 2??", "1_Text": "they should kill that thing with fucking fire", "2_Subreddit": "Gold_Rush_Alaska"}], "596dvy": [{"0_Title": "Dying?", "1_Text": "they should kill that thing with fucking fire", "2_Subreddit": "westworld"}], "5h278u": [{"0_Title": "So Nolan said before that if we paid close attention we would figure out Westworld's location by the end of the season..Anybody??", "1_Text": "they should kill that thing with fucking fire", "2_Subreddit": "westworld"}], "5hv7b8": [{"0_Title": "Responsible Gun Owner", "1_Text": "they should kill that thing with fucking fire", "2_Subreddit": "opieandanthony"}], "5ji5t5": [{"0_Title": "Everyone make sure you stock up/save a bit extra so as not to be caught sick on christmas !!", "1_Text": "they should kill that thing with fucking fire", "2_Subreddit": "opiates"}], "5k7466": [{"0_Title": "William S. Burroughs - The Junkies Christmas... Merry christmas everyone", "1_Text": "they should kill that thing with fucking fire", "2_Subreddit": "opiates"}], "5l7th0": [{"0_Title": "PSA: REAL A215 ACTAVIS 30mg OXYCODONE PILLS DO HAVE RAISED EDGES/LIP ON THE OUTER RIM", "1_Text": "they should kill that thing with fucking fire", "2_Subreddit": "opiates"}], "5lxj4o": [{"0_Title": "New Banner?", "1_Text": "they should kill that thing with fucking fire", "2_Subreddit": "opiates"}], "5mzy1k": [{"0_Title": "Johnny Winter's manager had been slowly lowering his Methadone dosage for 3 years without Johnny's knowledge and, as a result, Johnny was completely clean of his 40 year Heroin addiction for over 8 months before finally being told he was totally clean", "1_Text": "they should kill that thing with fucking fire", "2_Subreddit": "opiates"}], "6rifu8": [{"0_Title": "T2:Trainspotting Extended/Directors Cut Available anywhere??", "1_Text": "they should kill that thing with fucking fire", "2_Subreddit": "trainspotting"}], "6rpvr7": [{"0_Title": "Why are 'Acid Attacks' so prevalent in South Asia, the Middle East & now more often UK/Europe but still rarely occur in the United States?", "1_Text": "they should kill that thing with fucking fire", "2_Subreddit": "AskReddit"}], "7g1w6y": [{"0_Title": "Arties Nose/Face Swelling Up??", "1_Text": "they should kill that thing with fucking fire", "2_Subreddit": "opieandanthony"}], "7ga4ar": [{"0_Title": "Anthony's license is being suspended for 6 months after he was caught driving 100mph+ in two separate incidents", "1_Text": "they should kill that thing with fucking fire", "2_Subreddit": "opieandanthony"}], "7hfc6n": [{"0_Title": "Opie & Anthony: Ant Lusted For His Cousin", "1_Text": "they should kill that thing with fucking fire", "2_Subreddit": "opieandanthony"}], "7lzpu8": [{"0_Title": "William S Burroughs - The Junky's Christmas", "1_Text": "they should kill that thing with fucking fire", "2_Subreddit": "opiates"}], "7q2v71": [{"0_Title": "Anthony's legal troubles just keep piling up", "1_Text": "they should kill that thing with fucking fire", "2_Subreddit": "opieandanthony"}], "85zzlu": [{"0_Title": "The CM at the end of Anthony's new Twitter handle stands for Child Molester", "1_Text": "they should kill that thing with fucking fire", "2_Subreddit": "opieandanthony"}]}]}]}