{"AlwaysTryin30": [{"0_comments": [{"dwnxvox": [{"0_Comment Submission": "Happy April Fool's, guys.", "1_Text": "😂😂😂 There isn't a soul on earth I'd trust with my wake up. These are facts.", "2_Subreddit": "opiates"}], "dwnxyjs": [{"0_Comment Submission": "Rest easy, u/OldRapGroup", "1_Text": ".", "2_Subreddit": "opiates"}], "dwnycbn": [{"0_Comment Submission": "Drug taking loophole", "1_Text": "The general consensus seems to be this is a bad idea all the way around. I'd have to agree. What's worse than being addicted to one substance? Being addicted to six.", "2_Subreddit": "opiates"}], "dwnydsv": [{"0_Comment Submission": "I think I fucked up.", "1_Text": "I'm in the same spot bro. I'm either in rehab, or homeless by the end of the week. Fuck...", "2_Subreddit": "opiates"}], "dwnyk00": [{"0_Comment Submission": "I think I fucked up.", "1_Text": "I think it's honestly seeming that way. It's probbaky better to be in rehab that homeless right? I wish I didn't fuck up this bad. I hate myself for this. It seems like life isn't worth living and that everyone would be better off without me. I really wish I wasn't this big of a fuck up. Maybe we can't get this done \"together at the same time\" and come out on the other side proud of ourselves. And more importantly, with our families proud of us for once in years.", "2_Subreddit": "opiates"}], "dwoqccs": [{"0_Comment Submission": "I think I fucked up.", "1_Text": "It's okay man. I know you didn't mean it in a bad way. I also thank the other commentors for sticking up for me even though you didn't mean anything bad. Mostly everyone here is amazing and very supportive. Yeah just having a rough time recently. One of my oldest, closest friends, used me financial wise, and that caused a snowball effect and really hurt my financially more than I could ever afford. I couldn't explain the loss of money to my family without admitting to them about my use. That hasn't gone very well. Two days later I lost my steady job that had a pretty good income. Just am at the point that I'm not sure what to do. I just really hope this is rock bottom and doesn't go further down.", "2_Subreddit": "opiates"}], "dworb31": [{"0_Comment Submission": "I think I fucked up.", "1_Text": "Yeah. I don't think there is a way I'll be able to make my rent. End of the week might be an exaggeration as I think I'll get 30 days to clear out but I'm not sure. Rehab seems like it might be the only way I'll get a roof over my head as my parents definitely won't let me into their home. They have the house completely locked up to keep me out and won't talk to me. If I go to rehab they might open back up to me a little bit. My habit used to be very, very heavy, and over the last 6 months to a year I have actually cut my use back substantially. Like enough of a cut back that I'm proud of myself for it, and so are a lot of my friends. I just had a very unlucky last month and a half where it seemed like eveeyrhjng and anythjng that could go wrong did. Idk if im at a point right now where it would be smart to spend all that money on rehab. It would have made a lot more sense back when my habit was really out of control. I'm just not sure what else to do. I can easily say, around January this year, I did not see this being where I would end up by the beginning of April. Everything just crashed and burned so fast.", "2_Subreddit": "opiates"}], "dwoyxhp": [{"0_Comment Submission": "The best move in nba 2k", "1_Text": "Lol. I always play broadcast camera unless I'm in my career.", "2_Subreddit": "NBA2k"}], "dwp06dx": [{"0_Comment Submission": "Found this in my children (17 yo) room.. help identify", "1_Text": "God I hated when my parents went through my stuff. I mean, at least your parents cares and worries about you enough to do it, but it still sucked. This is definitely not an opiate though.", "2_Subreddit": "opiates"}], "dwp0aw2": [{"0_Comment Submission": "Found this in my children (17 yo) room.. help identify", "1_Text": "Also, definitely DO NOT rain hell down on your child. This will make matters worse. Have a calm conversation and tell them you are worried. Don't get mad at them because that can really, really make things backfire. Good luck. I'm just trying to help you out.", "2_Subreddit": "opiates"}], "dwp0ftj": [{"0_Comment Submission": "Took an RP30... 30mg is what I normally take... in about an hour I was gasping for air, passed out for about 30 mins and woke up in an ambulance... I assume this was cut or pressed with fent but now I’m scared to do it again.", "1_Text": "Most definitely fent. If you normally take 30mg, 30mg would never do that to you unless it was a fent press.", "2_Subreddit": "opiates"}], "dwp22ut": [{"0_Comment Submission": "The best move in nba 2k", "1_Text": "After playing it like that for so long I just got used to it. I'm sure watching large amounts of basketball on TV also helped with it. I also just recognize when someone starts to get out in transition. I'm not sure how to explain lol.", "2_Subreddit": "NBA2k"}], "dwpbr7w": [{"0_Comment Submission": "The best move in nba 2k", "1_Text": "I agree. Now if only they could make the crowds even slightly realistic...", "2_Subreddit": "NBA2k"}], "dwpc4z7": [{"0_Comment Submission": "Lost my job of 4 years--the one thing is was proud of in my life", "1_Text": "I just recently lost my job too. I had a series of events that led up to me having to admit my addiction to my family (that didn't go very well. Actually went worse than I expected it too.) Two days after this happened, I ended up losing my job that had a decently good income. You are not alone in this. It feels like we are alone, but it helps knowing that we aren't. If you need to talk feel free to PM me. Honestly, it probably wouldn't be bad for me to have someone else to talk to as well. I sincerely wish you the best. I hope you can right your wrongs and finds happiness.", "2_Subreddit": "opiates"}], "dwpk5vy": [{"0_Comment Submission": "A gram of South East Asian #4 China White", "1_Text": "Son of a bitch...", "2_Subreddit": "opiates"}], "dwpnp4l": [{"0_Comment Submission": "So i got arrested for paraphernalia today and", "1_Text": "That's such bull shit. I'm not political even one bit, but do you life in a republican state?", "2_Subreddit": "opiates"}], "dwpnz9d": [{"0_Comment Submission": "so i actually died", "1_Text": "As much as I understand (and trust me, I understand the whole not having another shot at life seems almost inviting), take it as a blessing. You have the chance to do right. I wish you all the best.", "2_Subreddit": "opiates"}], "dwruci0": [{"0_Comment Submission": "When your co worker comes to you with 2mg dillies and asks if you know anyone that can sell them so you get them for half the price for yourself 👌🏾 #DontKnoHeDaPlug", "1_Text": "S H O O T T H E M.\n\nlol no if you don't already IV definitely don't start.", "2_Subreddit": "opiates"}], "dwrud3t": [{"0_Comment Submission": "When your co worker comes to you with 2mg dillies and asks if you know anyone that can sell them so you get them for half the price for yourself 👌🏾 #DontKnoHeDaPlug", "1_Text": "Same. Lol.", "2_Subreddit": "opiates"}], "dwrui9p": [{"0_Comment Submission": "Found in /trashy. While y'all striking out on Whisper this chick letting the drugs find her.", "1_Text": "Can cook your dope and dinner.😂😂😂Lmfao", "2_Subreddit": "opiates"}], "dwrx8pg": [{"0_Comment Submission": "I died last week", "1_Text": "You say there is nothing on the otherside. Can you possible give me more details of what this experience was like, with crossing over to the other side? You can PM me so this isn't public...", "2_Subreddit": "opiates"}], "dws1yce": [{"0_Comment Submission": "I died last week", "1_Text": "Im not religious in any way whatsoever. But I'll be honest. This really hit me hard. I want to believe there is life on the otherside, but this leads me tk believe there is not. Idk why, but this bothers me a lot. Maybe because I'm unhappy with my life, and hoped that there was something better waiting for me on the otherside. I guess I shouldn't have expected or hoped for anything less though. Thank you for your response. I hope you have better luck finding happiness in your life than you have.", "2_Subreddit": "opiates"}], "dws2jo9": [{"0_Comment Submission": "{NSFW} Boof Queen!", "1_Text": "Oh my. I'd be lying if I didn't admit, I very much liked this post. Lol. Idk which one I want more here, hahaha.", "2_Subreddit": "opiates"}], "dws2v43": [{"0_Comment Submission": "When your co worker comes to you with 2mg dillies and asks if you know anyone that can sell them so you get them for half the price for yourself 👌🏾 #DontKnoHeDaPlug", "1_Text": "Glad to hear this. One of the worst decisions of my life was letting my friend shoot me up. What was supposed to be a one time thing, turned into a daily habit and need to stick a needle in my arm to feel that rush. I wish I never decided to let him hit me that first time. I got plenty out of swallowing and snorting occasionally. What the fuck did I do to myself...\n\nLike I said, glad to hear this. Please don't ever start it if you are tempted. You will regret it. Be smarter than I...", "2_Subreddit": "opiates"}], "dww8mu7": [{"0_Comment Submission": "Today’s pick up", "1_Text": "Hey now maybe he really don't know and wants to learn lol.", "2_Subreddit": "opiates"}]}], "1_submissions": [{"7c5dht": [{"0_Title": "2k18 my league questions", "1_Text": "😂😂😂 There isn't a soul on earth I'd trust with my wake up. These are facts.", "2_Subreddit": "NBA2k"}], "7laopl": [{"0_Title": "My ultimate WD help. WD SUCKS as obviously everyone knows. Got some good old xannies to make the wd at least better and a little fun! Happy Thursday, hope everyone else cops what they need to have a good holidays! First time poster by the way after lurking for awhile.", "1_Text": "😂😂😂 There isn't a soul on earth I'd trust with my wake up. These are facts.", "2_Subreddit": "opiates"}], "7osqaa": [{"0_Title": "There is no bigger upset, than losing your shit...", "1_Text": "😂😂😂 There isn't a soul on earth I'd trust with my wake up. These are facts.", "2_Subreddit": "opiates"}], "7q2ohg": [{"0_Title": "Score for the night (minus 2) didn't think it would happen. The joy of when it does is amazing!", "1_Text": "😂😂😂 There isn't a soul on earth I'd trust with my wake up. These are facts.", "2_Subreddit": "opiates"}], "7s1ink": [{"0_Title": "Has anyone ever had a reaction like this? It doesn't hurt, just itched. Whole body got really itchy for a minute after IVing Morphine.", "1_Text": "😂😂😂 There isn't a soul on earth I'd trust with my wake up. These are facts.", "2_Subreddit": "opiates"}], "7u6f75": [{"0_Title": "I know this has probably been asked here many times but I need advice...", "1_Text": "😂😂😂 There isn't a soul on earth I'd trust with my wake up. These are facts.", "2_Subreddit": "opiates"}], "7wk3wh": [{"0_Title": "Happy late night nods fellow bropiates! Hope you're all having a great night.", "1_Text": "😂😂😂 There isn't a soul on earth I'd trust with my wake up. These are facts.", "2_Subreddit": "opiates"}], "7zcflv": [{"0_Title": "Do you guys save your last dose for the morning or just do it have a good time and take the shit coming in the morning?", "1_Text": "😂😂😂 There isn't a soul on earth I'd trust with my wake up. These are facts.", "2_Subreddit": "opiates"}], "7zium9": [{"0_Title": "Cotton shot question.", "1_Text": "😂😂😂 There isn't a soul on earth I'd trust with my wake up. These are facts.", "2_Subreddit": "u_AlwaysTryin30"}], "83jzvp": [{"0_Title": "Happy Saturday night. Probably the last I can do for awhile, so going to try and enjoy this! What's everybody using tonight?", "1_Text": "😂😂😂 There isn't a soul on earth I'd trust with my wake up. These are facts.", "2_Subreddit": "u_AlwaysTryin30"}]}]}]}