{"ISnortCars": [{"0_comments": [{"dw8yjsz": [{"0_Comment Submission": "About 50gs of some Peruvian fire", "1_Text": "damn yea that's sketch for sure, very happy to hear it all worked out. definitely would be amazing, hope you had fun.", "2_Subreddit": "cocaine"}], "dw904wt": [{"0_Comment Submission": "Recent issues", "1_Text": "Let's just make sure we all try our best to keep this sub around. Don't source, don't try to sell stuff on here, don't mention vendors/markets, etc. and we'll be fine. Just follow the rules, be extra careful, and if you're unsure go ahead and PM me and/or another mod before you post something. If I see something that breaks the rules I'll just delete it, not a huge deal. I think the opiates forum will stay around because they follow the rules and help people, and they are much bigger than we are. Let's do the same and I think we'll be okay. \n\nI made a thread that's stickied at the top of the forum. Please check that out and let's all make sure this subreddit stays around.", "2_Subreddit": "fentanyl"}], "dw90qtn": [{"0_Comment Submission": "Carfentanil", "1_Text": "Guys please don't mention markets or vendors. It's okay to discuss new analogues and the current state of the market, but like I said please don't make direct or indirect mentions of where you're getting it, and please don't ask where to get it either. Thanks.", "2_Subreddit": "fentanyl"}], "dwgdrwu": [{"0_Comment Submission": "With Regards To The Recent Subreddit Bans", "1_Text": "I talked to the mods of the opiates forum, and the admins actually reached out to them to let them know about all those subreddit bans. They told them that they had nothing to worry about because it's a well modded forum and they don't break any rules there. They did say it's good to let members know about the policy changes though and let people know they're gonna be more strict about anyone breaking that policy.\n\nIt's not even just sourcing that gets subs banned. Sourcing was big reason for many subs being banned, but for subs like DNM it wasn't sourcing. It was more of just mentioning vendors, mentioning specific markets, vendors being marked as such which made it easier for people to do DD's off site, and just a bunch of stuff like that.\n\nAlso all the forums for markets got banned like the Dream Market subs. People on there were asking which vendors had the best xyz, almost no moderating going on to take care of that stuff, and just in general massive amounts of illegal shit going on. The admins do not want the heat.\n\nR/opiates is a model example of what we want to do here. They still have an amazing sense of community there, and there's still tons of \"shit posting\" like dope porn and all that, but with that being said, it is an amazingly well modded forum. They make sure there's no sourcing or anything that can even be interpreted as sourcing. No even mentioning locations. No talking about specific DNM or vendors AT ALL. No vendors advertising there or even being marked as vendors. \n\nNo subreddit is perfect, and anything that has to deal with illegal substances is going to be controversial and occasionally break reddit rules. The good simply has to outweigh the bad by a lot, and r/opiates makes sure of that. It is a forum that's focused on harm reduction, and that's what we want to do here. We want a strong sense of community, to keep people safe, and we want to be here for a long time. Like I said I have talked to some of the mods and gotten tips on how to keep this subreddit around for a very long time, and I'm going to do my best to make sure that happens for as long as I possibly can.", "2_Subreddit": "fentanyl"}], "dwgdzl9": [{"0_Comment Submission": "With Regards To The Recent Subreddit Bans", "1_Text": "R/cocaine and r/opiates are still around and have been around a long time. I have no doubt that r/opiates in particular will be around for a VERY long time. They work with the admins to make sure that they do, and we will follow their lead. They are sort of our big brother sub and we strive to do what they do there. \n\nI will do everything in my power to make sure this sub never gets deleted. I do need your guys help though like I said, just try to follow the rules the best you possibly can. If you aren't sure, ask me. I am on here a lot. \n\nIf worst case scenario happens and our sub does get deleted (which I honestly do not think will happen as long as I'm around) we will find a way to restore the community. I'd strongly prefer to stay on Reddit.", "2_Subreddit": "fentanyl"}], "dwgqoyj": [{"0_Comment Submission": "With Regards To The Recent Subreddit Bans", "1_Text": "I've heard of it. I read the DNM sub a decent amount, and I know that was their plan if their sub got banned which it unfortunately did. It is good to have a backup plan, but like I said I want to keep this sub on Reddit if we can. It will reach the most people that way, and hopefully save some people in the process.", "2_Subreddit": "fentanyl"}], "dwgro9j": [{"0_Comment Submission": "Made a big order of MAF from rcqueen last week", "1_Text": "RCQueen has been banned so this thread is no longer needed. I will lock it instead of deleting it, just in case someone has some of RCQueen's product in their possession or encounters RCQueen on another marketplace. They should be considered a scammer and known to mislabel products. This is extremely dangerous and has no place in the marketplace.", "2_Subreddit": "fentanyl"}], "dwgsb9r": [{"0_Comment Submission": "I got snorted off the dick of this guy on Tinder who looked nothing like his pics....and I was a surprise!", "1_Text": "Wow this is fucking absurd, but fucking amazing.", "2_Subreddit": "Drugs"}], "dwgt42y": [{"0_Comment Submission": "I got snorted off the dick of this guy on Tinder who looked nothing like his pics....and I was a surprise!", "1_Text": "fair enough", "2_Subreddit": "Drugs"}], "dwi2juq": [{"0_Comment Submission": "With Regards To The Recent Subreddit Bans", "1_Text": "I am not very computer savvy. Can you teach me how to back up the cache? PM me. I am not defending reddit's deleting of the subs in any way, or even saying it was logical. I'm just saying mods at r/opiates have actually talked to the admins and they said they are safe, so as long as we follow their lead we should be too. With that being said I will definitely back it up if you show me how and it's safe opsec wise.", "2_Subreddit": "fentanyl"}], "dwi43e2": [{"0_Comment Submission": "Well, we have all been in this predicament.....", "1_Text": "lmao", "2_Subreddit": "opiates"}], "dwi47lk": [{"0_Comment Submission": "Well, we have all been in this predicament.....", "1_Text": "If you're a heavy smoker, and especially if you're a bigger guy who doesn't exercise a lot etc. THC can stay in your system for an absurdly long amount of time. My good friend quit for 4-5mo cold turkey and was still pissing dirty. Took about 6mo to clear it out. I didn't think it was possible for it to last that long.", "2_Subreddit": "opiates"}], "dwi4aw9": [{"0_Comment Submission": "Well, we have all been in this predicament.....", "1_Text": "Just buy one of those fake penises if you're a guy. Do those things actually work? I've never been on probation and hopefully never will be *knocks on wood* but was curious about that. I've heard there's something called a wizzinator or something like that. It's an actual fake penis that you fill with urine and squeeze. Not sure how real it looks but yea, pretty funny.", "2_Subreddit": "opiates"}], "dwipztp": [{"0_Comment Submission": "Well, we have all been in this predicament.....", "1_Text": "god damn, never even heard of that. A lot of places will have a person in there with you but they'll turn around or not pay attention at all. Other places, they'll watch but they're not like intently starin at your junk. I've only heard of a cpl places where they watch you like a hawk, and I don't think I've heard of any place where the guy checks for a fake dick lol. Must be getting more common.", "2_Subreddit": "opiates"}], "dwiq043": [{"0_Comment Submission": "With Regards To The Recent Subreddit Bans", "1_Text": "thx", "2_Subreddit": "fentanyl"}], "dwiqk31": [{"0_Comment Submission": "Removing inactive moderator u/pxck", "1_Text": "He hasn't posted in about 6 months. I am worried about his well being infinitely more than him being de-modded, so I'm hoping you guys can check if he's logged in within the last 4-5 months. \n\nI also would like to find out if u/jojoman4life has logged in within the last month or two. He hasn't posted in I believe 2-3 months, and I am also worried about his well being. I don't want him removed, I want to give him more time since it's only been 2-3mo since he last posted. \n\nThanks. \n\nOh also, u/ufgod is no longer interested in modding r/carfentanil. That will leave me as the only mod there, and I don't have full permissions. I am hoping to be given full permissions so I can add another mod or two (I already have one ready to mod, just cannot invite him without the permissions). \n\nThanks.", "2_Subreddit": "redditrequest"}], "dwnwzgu": [{"0_Comment Submission": "Jojoman4life and pxck", "1_Text": "Good to hear from you. I figured you were just not around much. As for u/pxck I am actually worried about him a decent amount. If you know how to contact him, or anyone does, please do. Thanks.", "2_Subreddit": "fentanyl"}], "dwnxyfo": [{"0_Comment Submission": "Happy April Fool's, guys.", "1_Text": "lol fuck you guys, I literally made an announcement in the r/fentanyl forum, was extremely pissed. I love you guys, but fuck you.", "2_Subreddit": "opiates"}], "dwny4ge": [{"0_Comment Submission": "Been off heroin for 10 months, still depressed as fuck and I’m over it", "1_Text": "Have you talked to a psychiatrist? An anti depressant might help for a short period of time, or something similar. You're probably still extremely serotonin deficient and a bunch of other chemicals that I don't understand because I'm not a doctor/scientist are all fucked up. I know prescription drugs might not be the best route to go down, but from what I told it can be very necessary for a short period of time to help your brain get back to normal. \n\nI was 6mo clean cold turkey and it never got better for me either. I truly wish I would've talked to a professional, but I didn't and it was a big mistake. While you're still clean and (assuming) physically healthy, you should talk to someone if you have the means. If you cannot afford a psych or insurance won't cover it, there are alternatives. Not sure what kind there are, you'll have to ask someone else about that. I just strongly recommend at least talking to someone even if you don't end up on any meds. \n\nObviously I'm not a dr and I am not recommending you go immediately jump on whatever scripts they throw at you, just a suggestion that I hope you consider.", "2_Subreddit": "opiates"}], "dwt1te0": [{"0_Comment Submission": "Jojoman4life and pxck", "1_Text": "Got a PM from pxck today, so at least there was a happy ending to this thread. Both jojo and pxck are alive and seemingly okay which is great.", "2_Subreddit": "fentanyl"}], "dwugzha": [{"0_Comment Submission": "Ppf experience (variant of paf)", "1_Text": "I think it's because PAF was so new and nobody knew anything about it, so the first (well not first I'm sure, but the main one people got on here from a well known vendor) ending up being caustic/pretty much poison hurt its reputation very very badly and understandably so. It probably wasn't even PAF, and if it was it was clearly mixed with some horrible chemical or there was something that went horribly wrong in the synthesis. \n\nWhen MAF first came around everyone seemed to love it, well at least I did and everyone I knew did. I saw some people complain in feedback on some peoples pages that they were sent MAF instead of fent HCL. I'm sitting there thinking wow I wish that happened to me! \n\nMAF is like my favorite ever (beside carf but that's been long gone for a while it seems) so it's really sad to see it going extinct like carf did. It seems like the big reason is that the profit margin simply isn't there for the labs, and instead of just raising the price they move on to the next compound they can make cheaply which seems to be PAF, although I've still yet to see anyone selling real legit PAF yet, so it's good to see you got a good batch. \n\nAlso, is PAF or PMAF or PPF even a real name for these analogues or is it completely made up? I've heard both, but have yet to see a chemical name or structure for any of them.", "2_Subreddit": "fentanyl"}], "dwuh4xz": [{"0_Comment Submission": "Ppf experience (variant of paf)", "1_Text": "I feel the same way. So many people have asked why I don't make nasal sprays, and mostly it's the ritual of snorting. That on top of me not feeling unsafe basically eyeballing lines of maf/fent hcl etc. because of my high tolerance. Obviously if I obtained something very strong like CF again I'd need to make a solution, but beside that I strongly prefer to just snort lines. I always start off superrrrrrr small and work my way up for safety reasons. \n\nI also just find nasal sprays to be a bit more inconvenient for me. I hate the idea of having like all of my product in one little bottle of saline, imagine spilling it or something happening to it. With tolerance being high you really have to make a strong solution so I'd feel uneasy having something like that for daily usage. Carrying around a bottle vs just having a little baggie of powder also is just more convenient for me to have the baggy. Can also just carry a couple days supply around and re-up it out of my big bag (which I always keep under lock and key) works for me.\n\nHonestly I cannot advise people to do the same, you should really just make a solution and have a nice accurate milligram scale to measure it, this will provide the most accurate dosing and it's the safest route to go especially if you're new to fent it's simply mandatory.", "2_Subreddit": "fentanyl"}], "dwuh6wx": [{"0_Comment Submission": "Ppf experience (variant of paf)", "1_Text": "I have no problem with this as a mod. As long as you don't hint at or mention sources directly it's okay. Saying it's hard to get doesn't point anyone in the direction of where to get it or even hint at it so like I said it's completely fine. If anything this is useful information, because people will realize that if they see a listing for it somewhere on DNM or elsewhere, there's a strong chance it may be fake and they'll either get scammed or sent something else which is very dangerous. I hope this makes people be more cautious when trying to purchase this stuff or anything like it.", "2_Subreddit": "fentanyl"}], "dwwjhv5": [{"0_Comment Submission": "Today’s pick up", "1_Text": "what do you mean?", "2_Subreddit": "opiates"}], "dwwji6e": [{"0_Comment Submission": "Today’s pick up", "1_Text": "They definitely look off, but it's probably just the pic if you're sure they're real.", "2_Subreddit": "opiates"}]}], "1_submissions": [{"6lgid7": [{"0_Title": "Carfentanil Forum", "1_Text": "damn yea that's sketch for sure, very happy to hear it all worked out. definitely would be amazing, hope you had fun.", "2_Subreddit": "Carfentanil"}], "6oe2g9": [{"0_Title": "New harm reduction sub, r/carfentanil", "1_Text": "damn yea that's sketch for sure, very happy to hear it all worked out. definitely would be amazing, hope you had fun.", "2_Subreddit": "opiates"}], "6qtles": [{"0_Title": "Thiofentanyl", "1_Text": "damn yea that's sketch for sure, very happy to hear it all worked out. definitely would be amazing, hope you had fun.", "2_Subreddit": "fentanyl"}], "6wpfpv": [{"0_Title": "How to contact support on Dream", "1_Text": "damn yea that's sketch for sure, very happy to hear it all worked out. definitely would be amazing, hope you had fun.", "2_Subreddit": "DarkNetMarketsNoobs"}], "6wurtk": [{"0_Title": "Carfentanil Subreddit", "1_Text": "damn yea that's sketch for sure, very happy to hear it all worked out. definitely would be amazing, hope you had fun.", "2_Subreddit": "fentanyl"}], "75uop1": [{"0_Title": "A couple questions from a noob", "1_Text": "damn yea that's sketch for sure, very happy to hear it all worked out. definitely would be amazing, hope you had fun.", "2_Subreddit": "cocaine"}], "760tbp": [{"0_Title": "Got my pack today, ready for the weekend!", "1_Text": "damn yea that's sketch for sure, very happy to hear it all worked out. definitely would be amazing, hope you had fun.", "2_Subreddit": "cocaine"}], "7j11qu": [{"0_Title": "BTC to Monero Exchange", "1_Text": "damn yea that's sketch for sure, very happy to hear it all worked out. definitely would be amazing, hope you had fun.", "2_Subreddit": "Monero"}], "7jdn8p": [{"0_Title": "Monero not showing up in desktop wallet", "1_Text": "damn yea that's sketch for sure, very happy to hear it all worked out. definitely would be amazing, hope you had fun.", "2_Subreddit": "Monero"}], "7kdakc": [{"0_Title": "Question about the portfolio circle chart", "1_Text": "damn yea that's sketch for sure, very happy to hear it all worked out. definitely would be amazing, hope you had fun.", "2_Subreddit": "ExodusWallet"}], "7p5wc6": [{"0_Title": "Best site to check xmr price on?", "1_Text": "damn yea that's sketch for sure, very happy to hear it all worked out. definitely would be amazing, hope you had fun.", "2_Subreddit": "Monero"}], "7plrj4": [{"0_Title": "r/fentanyl", "1_Text": "damn yea that's sketch for sure, very happy to hear it all worked out. definitely would be amazing, hope you had fun.", "2_Subreddit": "opiates"}], "7pmfc2": [{"0_Title": "Thoughts on this trade for Mirotic", "1_Text": "damn yea that's sketch for sure, very happy to hear it all worked out. definitely would be amazing, hope you had fun.", "2_Subreddit": "DetroitPistons"}], "7q9fib": [{"0_Title": "Boban", "1_Text": "damn yea that's sketch for sure, very happy to hear it all worked out. definitely would be amazing, hope you had fun.", "2_Subreddit": "DetroitPistons"}], "7s3cyb": [{"0_Title": "Cocaine and Adderall", "1_Text": "damn yea that's sketch for sure, very happy to hear it all worked out. definitely would be amazing, hope you had fun.", "2_Subreddit": "cocaine"}], "7s3e7l": [{"0_Title": "Coke user doing adderall", "1_Text": "damn yea that's sketch for sure, very happy to hear it all worked out. definitely would be amazing, hope you had fun.", "2_Subreddit": "adderall"}], "7tcleb": [{"0_Title": "A More Permanent Card?", "1_Text": "damn yea that's sketch for sure, very happy to hear it all worked out. definitely would be amazing, hope you had fun.", "2_Subreddit": "cocaine"}], "7tr62q": [{"0_Title": "A more permanent card", "1_Text": "damn yea that's sketch for sure, very happy to hear it all worked out. definitely would be amazing, hope you had fun.", "2_Subreddit": "opiates"}], "86zcwy": [{"0_Title": "With Regards To The Recent Subreddit Bans", "1_Text": "damn yea that's sketch for sure, very happy to hear it all worked out. definitely would be amazing, hope you had fun.", "2_Subreddit": "fentanyl"}], "87zupd": [{"0_Title": "Jojoman4life and pxck", "1_Text": "damn yea that's sketch for sure, very happy to hear it all worked out. definitely would be amazing, hope you had fun.", "2_Subreddit": "fentanyl"}], "888lo7": [{"0_Title": "Removing inactive moderator u/pxck", "1_Text": "damn yea that's sketch for sure, very happy to hear it all worked out. definitely would be amazing, hope you had fun.", "2_Subreddit": "redditrequest"}]}]}]}