{"loveladee": [{"0_comments": [{"dr4t7ko": [{"0_Comment Submission": "Neversoft Developers of Tony Hawk Pro Skater 1998", "1_Text": "Damn I knew I was giving in to childhood nostalgia! I'm not even old lmao i'm just out of me teens finally.\nbut bscallerreturns if you know so well, shoot me some games with heart", "2_Subreddit": "gaming"}], "dsgyqv5": [{"0_Comment Submission": "TIL that Frank Goldsmith, Jr., a Titanic survivor who later lived near Navin Field (Tiger Stadium) in Detroit, never took his children to baseball games because the roar of the crowd reminded him of the screams of people dying in the freezing water.", "1_Text": "Isn't that what they want the masses to forget?", "2_Subreddit": "todayilearned"}], "dt1m5yc": [{"0_Comment Submission": "China says shutdown shows U.S. democracy chaotic and chronically flawed", "1_Text": "American's persecution complex is older than America itself. It comes from the puritan culture which first established itself in New England, and lesser so from the fact many of the early European people's who moved to the US were persecuted and moved because of that", "2_Subreddit": "worldnews"}], "dt1misr": [{"0_Comment Submission": "China says shutdown shows U.S. democracy chaotic and chronically flawed", "1_Text": "Sure. But we've only been this powerful for 73 years. My grandfather is older than that. Cultures don't change overnight, and persecuted mindset is deeply embedded to the evangelical mindset, so I don't find it too ridiculous that Americans still think this way (also, which btw, there isn't actually too many American's who seriously think we're persecuted. just some of the loudest ones lmao)", "2_Subreddit": "worldnews"}], "dt70qez": [{"0_Comment Submission": "I Was a Bank Robber Until I Read Kant - The one thing that criminals and philosophers share is a sense of being an outsider", "1_Text": "this is an amazing quote and your username is also dope, a kafka fan my friend?", "2_Subreddit": "philosophy"}], "du0fwqw": [{"0_Comment Submission": "[I ate] A pound of mixed fried shellfish", "1_Text": "\"It's over when I'm full enough to start masturbating, so then the meal isn't even over. It isn't over until I hate myself so much I need to pull my dick out.\" - Louis CK", "2_Subreddit": "food"}], "du0fxkw": [{"0_Comment Submission": "[I ate] A pound of mixed fried shellfish", "1_Text": "I thought about killing myself over less", "2_Subreddit": "food"}], "du42ms7": [{"0_Comment Submission": "The absolute joke of Romanian football", "1_Text": "...do you not care that cars can and will become death machines when used improperly?", "2_Subreddit": "soccer"}], "du42p7l": [{"0_Comment Submission": "The absolute joke of Romanian football", "1_Text": "You can for sure still bribe American cops, but its much more expensive, and generally requires a lot more balls because of the chance of catching a felony (but I do know some gold line pocketed people who have done it)", "2_Subreddit": "soccer"}], "duky1b3": [{"0_Comment Submission": "Nom", "1_Text": "also you need to learn russian \n\nhttps://www.youtube.com/watch?v=YjOZT_6_F3A", "2_Subreddit": "gifs"}], "dul080y": [{"0_Comment Submission": "That's not supposed to happen", "1_Text": "okay wait, I'm not sure i understand what you mean here by \"I'm not even American\"", "2_Subreddit": "instant_regret"}], "dul19kd": [{"0_Comment Submission": "I hate that TRP is the truth, but it is.", "1_Text": "This is a great comment, thank you, this is why I come to To the Redpill, because fundamentally this sub is about optimizing your potential as a male through work and good philosophy, and not just fuking bitches", "2_Subreddit": "TheRedPill"}], "duu6s6q": [{"0_Comment Submission": "Focussing on Pussy isnt Beta Behavior", "1_Text": "seriously", "2_Subreddit": "TheRedPill"}], "duu7lrm": [{"0_Comment Submission": "There's a lot of negativity about the culture war that feminism has been winning, but it IS coming around to bite them:", "1_Text": "\"I'm going to go back to appreciating all the other stuff in my life, as should you gents.\"\n\nI'm good friends with a girl who is a stripper, and she said to me word for word not a week ago \"There is nothing hotter than when a man has something better to do [than see me]\"", "2_Subreddit": "TheRedPill"}], "duy0xcu": [{"0_Comment Submission": "Hey Reddit, what's your \"type\"?", "1_Text": "lmao to edit 2. Why do you think they all single brah?", "2_Subreddit": "AskReddit"}], "duy5zxl": [{"0_Comment Submission": "Hey Reddit, what's your \"type\"?", "1_Text": "this is comment is kafkaesque, have you ever read him?", "2_Subreddit": "AskReddit"}], "dv05oed": [{"0_Comment Submission": "The Petty Godfather", "1_Text": "yeah man, i don't get what it is but the internet loves to defend cheaters. makes me think everybody cheats these days", "2_Subreddit": "BlackPeopleTwitter"}], "dvdrrod": [{"0_Comment Submission": "The real women to celebrate on International Women's Day", "1_Text": "what do you mean men from the 60'?", "2_Subreddit": "The_Donald"}], "dvny0eu": [{"0_Comment Submission": "This is ridiculously sad. A father tells his kids about their mother cheating on him and she threatens to kill him. In the eyes of two legal advice subreddits, he is an evil, manipulative jerk.", "1_Text": "I don't think \"telling the truth\" is a cute way of \"I want to hurt the other person\"; that's fucking bullshit. Get out of here with that arrogant bullshit", "2_Subreddit": "TheRedPill"}], "dvny3c8": [{"0_Comment Submission": "This is ridiculously sad. A father tells his kids about their mother cheating on him and she threatens to kill him. In the eyes of two legal advice subreddits, he is an evil, manipulative jerk.", "1_Text": "god you're such an arrogant shithead", "2_Subreddit": "TheRedPill"}], "dvo0jx6": [{"0_Comment Submission": "This is ridiculously sad. A father tells his kids about their mother cheating on him and she threatens to kill him. In the eyes of two legal advice subreddits, he is an evil, manipulative jerk.", "1_Text": "lmao. four words. treat people with respect\n\nIt's much easier- instead of foaming at the mouth like a rabid dog with insults- to argue against your opponent's arguments with better arguments, than to resort to ad hominen\n\nyou're right- children, and adolescents often lack wisdom, but telling them so disrespectfully discourages them from developing wisdom, because you've turned that trying and curious spirit into an indignant one. Men like you are the reason growing up was fucking annoying, so fuck off. Just because you've seen some shit doesn't make you the authority on anything. Sit the fuck down and be humble", "2_Subreddit": "TheRedPill"}], "dw6jh25": [{"0_Comment Submission": "it's a trap", "1_Text": "worst boner", "2_Subreddit": "greentext"}], "dwemz66": [{"0_Comment Submission": "What was your \"I shouldn't have said that\" moment when talking to a customer?", "1_Text": "that's hilarious, maybe you should always be this loud", "2_Subreddit": "AskReddit"}], "dwen79l": [{"0_Comment Submission": "What was your \"I shouldn't have said that\" moment when talking to a customer?", "1_Text": "lmao, he probably deals with this from his gf on the reg, he was happy you said something", "2_Subreddit": "AskReddit"}], "dwqayp7": [{"0_Comment Submission": "{NSFW} Boof Queen!", "1_Text": "Damn where do i find girls like you?", "2_Subreddit": "opiates"}]}], "1_submissions": [{"8482ed": [{"0_Title": "Floyd's Triangle Combined with Incremented Stars", "1_Text": "Damn I knew I was giving in to childhood nostalgia! I'm not even old lmao i'm just out of me teens finally.\nbut bscallerreturns if you know so well, shoot me some games with heart", "2_Subreddit": "AskProgramming"}]}]}]}