{"DepressedOnReddit": [{"0_comments": [{"dwvt94q": [{"0_Comment Submission": "28 with 220 ng/dl", "1_Text": "I'm 23 and my levels were around yours. I started on TRT", "2_Subreddit": "Testosterone"}], "dwvufqm": [{"0_Comment Submission": "28 with 220 ng/dl", "1_Text": "Hasn't been long enough to say any long term effects, but I've run AI from the start. I'm on 100mg of test which is what I started on, I'll likely be put on a higher dose (200mg) when I go back in a week or so. \n\nMy quality of life has improved tremendously in the past 30 days, I went from not being able to talk to people to having no social anxiety. I am slightly hypomanic because I am on both testosterone and vyvanse though, which his an amphetamine. \n\nSince jumping on test, I've gone from not working out at all or really going outside for 2-3 years... To working out for roughly 2 hours a day  plus an hour long walk. Maybe some sprints on top of it.\n\nI hurt so badly from all of the exercise that I've gotten it's almost absurd. The first two weeks of exercise have been humbling, I can only hope that a higher dose of test plus more protein will have me healing much faster than I do now. \n\nFWIW it took roughly 9 days for my entire psyche to change, from being horrifically depressed and unable to get any erection or even leave my home, to running sprints at random times in the middle of the day. I'm about 50 pounds heavier than I was when I know I last had normal test, so the amount of exercise I'm getting is intense.\n\nMy binge eating has completely ceased as well. I have also been losing weight.", "2_Subreddit": "Testosterone"}], "dwvutdm": [{"0_Comment Submission": "Help! Low testosterone at 20 after injury?", "1_Text": "Double this. \n\nI have PTSD and had to go on TRT to feel remotely normal. I've suffered from an extreme amount of stress for the past 3-4 years.", "2_Subreddit": "Testosterone"}], "dwvv5ff": [{"0_Comment Submission": "28 with 220 ng/dl", "1_Text": "I'm getting my blood work soon, and I go to a T clinic. T clinics are somewhat unsavory places, basically like a steroid store that's legal TBH. I think my clinic might go to 200-300mg or so a week if you so choose. I am thinking about going up to just see how it feels, so far I haven't had any negative side effects. \n\nI am lacking sex drive just a bit still, even though I jerk off a lot. So that's a little bit of a problem too. I'm hoping 200mg/w = higher sex drive, faster recovery, better cardio, etc. \n\nYeah, my mental health was strongly influenced by my low testosterone. It's absolutely breathtaking to go from a 8-9/10 on the anxiety scale to 0-1/10 when talking to people.", "2_Subreddit": "Testosterone"}], "dwvv73c": [{"0_Comment Submission": "2nd shot didnt seem as noticeable.", "1_Text": "Sorry man, hopefully you will soon. How much are you on a week? Is it take home? I inject 100mg/w. The difference is extreme.", "2_Subreddit": "Testosterone"}], "dww6lpd": [{"0_Comment Submission": "The best time to look for a job is when you have a job - solid evidence from the Federal Reserve", "1_Text": "Yeah, this is what I do. I stopped getting high though. I’m probably going to move into a career soon though. I need something to do with my time.", "2_Subreddit": "personalfinance"}], "dww7awq": [{"0_Comment Submission": "The best time to look for a job is when you have a job - solid evidence from the Federal Reserve", "1_Text": "I feel it. I’m 23 and trying to make enough money from my business and essentially gambling that I don’t have to work for someone else. I have a disability so it makes it even scarier to think “what if I can’t be stable and work for someone else?”.", "2_Subreddit": "personalfinance"}], "dww7dj9": [{"0_Comment Submission": "The best time to look for a job is when you have a job - solid evidence from the Federal Reserve", "1_Text": "What would you do in the situation that someone has never worked for anyone but themselves? I make great money but want to work in a specialized field some day.", "2_Subreddit": "personalfinance"}], "dww7igl": [{"0_Comment Submission": "The best time to look for a job is when you have a job - solid evidence from the Federal Reserve", "1_Text": "Haha, this is literally my life. I haven’t had to drop that line in years though. Some shit heel destroyed my apartment when I was on a 4 month vacation in Santa Barbara. Nothing like taking a menial labor job, working 80 hours for 2 weeks straight then leaving.", "2_Subreddit": "personalfinance"}], "dww7las": [{"0_Comment Submission": "Does anyone else here live off self deprecating/ dark humor?", "1_Text": "So do I.", "2_Subreddit": "ptsd"}], "dww7pvv": [{"0_Comment Submission": "Does anyone else here live off self deprecating/ dark humor?", "1_Text": "Nah, I’m not that person but you’re okay. I like to make jokes so that people can’t tell what really traumatized me. The horror on people’s faces when I ask If their dads were selfish lovers is glorious. \n\nGallows humor is the way to go.", "2_Subreddit": "ptsd"}], "dww8zte": [{"0_Comment Submission": "The best time to look for a job is when you have a job - solid evidence from the Federal Reserve", "1_Text": "Thanks for the detailed response. I currently make about 200-300k/yr. I have been growing increasingly concerned that at some point when I go to work for someone else no one will want to hire me. \n\nI know that might sound nutso, but I’m trying to orient my career towards eventually working somewhere that I feel true fulfillment. By fulfillment, I mainly mean having real structure and being happy. I want to be able to say “I did this for someone else today, or I helped this person” not “I made even more money than last month”.\n\n I’m hoping that I can help run a nonprofit, or if I do better in science courses.. Maybe I can become a respiratory therapist. Big pay cut, but the whole point is to do whatever makes me feel good. Currently I do not enjoy the work that I do.\n\nI’m hoping that if I start volunteering like I used to, like 6-8 hours a day, I won’t have such a difficult time getting a job. Preferably, that will help me adjust to working with other people. I don’t mind being told what to do.", "2_Subreddit": "personalfinance"}], "dww918e": [{"0_Comment Submission": "The best time to look for a job is when you have a job - solid evidence from the Federal Reserve", "1_Text": "Does Johnson and Johnson have travel insurance or something? I’m so confused. I’m glad you are cognizant of how much important your family is than some fucking company though.", "2_Subreddit": "personalfinance"}], "dww9pbc": [{"0_Comment Submission": "Brett Okamoto: \"Per sources, Chiesa/Pettis and Borg/Moreno are both off. Chiesa’s facial cuts, and his weight cut was thrown off. Borg started to experience problems with his eye, from the particles of glass.\"", "1_Text": "TRUTH.", "2_Subreddit": "MMA"}], "dwx8kri": [{"0_Comment Submission": "Mueller investigating whether Russians funded Trump: Report", "1_Text": "Buttery males.\n\nFuuuuck, this deserves a thousand upvotes.", "2_Subreddit": "politics"}], "dwxbelr": [{"0_Comment Submission": "Guy matches with his neighbour on Tinder (repost from r/Tinder)", "1_Text": "Hahahahahahahahaha, fuck. \n\nI’ve been with my gf for 3 years, and we went through a dry streak of once a month for 5 months or so. Finally got it down to once a week.\n\nOnce a month feels fucking weird.", "2_Subreddit": "nevertellmetheodds"}], "dwxc4uh": [{"0_Comment Submission": "That seat was occupied too", "1_Text": "My broad brethren, I feel your pain. Im 2 feet wide and my gf also has broad shoulders. We mostly book first class so we don’t have to squeeze into such small seats.", "2_Subreddit": "trashy"}], "dwxhwcq": [{"0_Comment Submission": "A guy I knew in high school has been commenting inane stuff on everyone's posts and I got sick of his bullshit. (repost with identifying info removed)", "1_Text": "Tacoma native here.. I visited a friend in San Antonio for a couple weeks. The rain Texas gets is fucking cancer. A few hours into a rainstorm and my buddy and I were driving through like a foot plus of water.", "2_Subreddit": "quityourbullshit"}], "dwxjjh4": [{"0_Comment Submission": "28 with 220 ng/dl", "1_Text": "8-10 days - however I still wake up at 4 AM thinking about how I’m going to get early onset Alzheimer’s like my grandpa and my family is going to watch me slowly (quickly) fade away into the abyss at like 40. Then I think about how either I’m going to watch my girlfriend die or she might see me die. But that’s post traumatic stress disorder, so I’m sure it’s unique to me. \n\nHowever, the *severe* depression that made me think awful things about myself all the time? Gone bitches! It’s dope, man. Hopefully test helps you as much as it helps me. It’s crazy to think that a few weeks ago I couldn’t even sit down in a coffee shop without having a mental breakdown (on the inside obviously, no one could tell). \n\nI fucked up and ran a mile yesterday for the first time in quite a long time. So I’m in some pretty intense discomfort today. However, I’m sure higher test levels will help me get past this as well.", "2_Subreddit": "Testosterone"}], "dwxl76f": [{"0_Comment Submission": "The best time to look for a job is when you have a job - solid evidence from the Federal Reserve", "1_Text": "I really appreciate the response. This is a type of situation that is incredibly difficult or impossible to get advice on in real life. I helped run my parents business working 12 hours a day on the weekend and some weekdays starting at 14. Then started college courses at 15, and started making more than anyone I knew at 18 after I moved to LA. So getting any sort of peer advice is out of the question, as is telling anyone what I do. I learned the hard way that you should never tell friends how much you earn even if they ask. \n\nI would definitely be entering a new field, I cannot stand anything to do with working with other people to competitively make money. My immediate family (mom, older brother) all made the same or more than me around my age and either burnt out completely or sacrificed their happiness to do this. \n\nI’m thinking that I’m going to do this until I’ve got enough money for my family to be taken care of if I develope early onset Alzheimer’s like my grandfather did. I’m finishing up my bachelors in business admin, then trying to find a medical field to study. I have a full ride including grad school, so I figure I should at least finish what I started.", "2_Subreddit": "personalfinance"}], "dwxlm7l": [{"0_Comment Submission": "That seat was occupied too", "1_Text": "The broad shouldered life is an expensive one. I’m  sure you’ve had the same issues finding shirts and clothes as I have. \n\nFunny side note, if your wife is strong don’t teach her to wrestle. My girlfriend is also pretty strong because she’s fairly compact. I made the mistake of teaching her how to wrestle and when she went to hug me yesterday she went for a hip toss fucked me up.", "2_Subreddit": "trashy"}], "dwxnaoj": [{"0_Comment Submission": "I'm Mark Karpelès, ex-CEO of bankrupt MtGox. Ask me anything.", "1_Text": "I mean, if you’re happy in your every day life you shouldn’t think that just because I made some money my life is better. Life is about fulfillment my friend. If you feel even remotely good during your day or after it, that’s an accomplishment. \n\n I absolutely hate the amount of stress and anxiety that came along with making this money. I didn’t just randomly invest in bitcoin and make money from that. I’ve been fairly successful outside of crypto. But that doesn’t mean that I *deserved* to make this money or that its right. That simply isn’t true. I’m a pretty strong supporter of democratic socialism, so I really feel the same way about it as you do. \n\nI have worked 80 hours weeks doing heavy manual labor with a back problem to pay my bills at certain points in my life. So I know what it’s like to work for a fucked up wage. \n\nThe same way that crypto made people rich, it broke others. Crypto is no more than a more gambling centric version of the stock market.", "2_Subreddit": "Bitcoin"}], "dwxnu53": [{"0_Comment Submission": "She mentioned in her bio she only has one arm. I mentioned in my bio I'm funny. This is what happened.", "1_Text": "That’s awesome. This makes me feel better about my disability.", "2_Subreddit": "Tinder"}], "dwxog2j": [{"0_Comment Submission": "Conor McGregors mugshot and top charges.", "1_Text": "Fucking savage. I’ve been pretty convinced he was going to be fully cooperative and most likely very apologetic with the officers. Probably taking photos with tons of people there as well.", "2_Subreddit": "MMA"}], "dwxve8r": [{"0_Comment Submission": "Conor McGregors mugshot and top charges.", "1_Text": "I’m astounded that people think I’m cool with what he did. I just found the weight thing to be funny. \n\nEverything else is just commentary on what I think he’s going to do, which seems to be exactly what happened. He’s going to try and do whatever is needed to get out of this situation. \n\nI don’t support what he did at all, and I’m plenty mad that he ruined ufc 223.", "2_Subreddit": "MMA"}]}], "1_submissions": [{"7s0e4b": [{"0_Title": "LBC is fucking me raw", "1_Text": "I'm 23 and my levels were around yours. I started on TRT", "2_Subreddit": "localbitcoins"}]}]}]}