{"Contin_A_Trap": [{"0_comments": [{"dlvj28h": [{"0_Comment Submission": "What do you guys in the UK like to binge on?", "1_Text": "Yeah I know such a good deal I couldn't  resist. Yeah it was not sure if I can give names though. Only thing was it took a month to arrive, must have been held at customs for inspection but still made it. So I ordered 10 more from a UK vendor and all 40 arrived the same day. I don't use the dnm sub though I'm sure I'm not the only one who snapped up that deal", "2_Subreddit": "opiates"}], "dlyplbk": [{"0_Comment Submission": "Anyone had these before?", "1_Text": "I've had them before. They white on the inside? The coating should rub off easily and they are quite soft to crush.", "2_Subreddit": "opiates"}], "dm22ulv": [{"0_Comment Submission": "UK copping stories", "1_Text": "Haha I'm pretty sure I've seen that old guy before. I bet he owns a small fortune but would rather live on the streets and save money for gear. Haven't been able to find anything good in that city though so been relying on dnms. I doubt I'll find anything better on the street to be honest, but I'm sure it's out there", "2_Subreddit": "opiates"}], "dmas23v": [{"0_Comment Submission": "why is this sub so envious?", "1_Text": "Mate looking after cats isn't a healthy source of income", "2_Subreddit": "opiates"}], "dmboooa": [{"0_Comment Submission": "Full pharma stash - hello from the UK!", "1_Text": "Is that all prescription? Only seen dexies once before but didn't take full advantage of them. Hear they can be amazing at high enough dosage", "2_Subreddit": "opiates"}], "doviy2r": [{"0_Comment Submission": "Not posted in months hows everyone doing?", "1_Text": "That was a nice read man. I remember you posting under a different name, always good stories and pics of your stash on that wooden coffee table. Glad to hear you're doing well I honestly thought you were dead after finding that large amount of h", "2_Subreddit": "opiates"}], "dox9l9m": [{"0_Comment Submission": "Not posted in months hows everyone doing?", "1_Text": "Wouldn't we all man. One can only dream. Keep the stories coming though, I live in the same city as you so it's nice to read some relatable content.", "2_Subreddit": "opiates"}], "dozcxo5": [{"0_Comment Submission": "Picking up with the bestie this morning. 🔥🔥🔥", "1_Text": "Aw man I'm jealous as fuck. Always wanted to get some of that nhs heroin. Nae way you're getting that for 8 quid a gram though", "2_Subreddit": "opiates"}], "dqb69tb": [{"0_Comment Submission": "My tar had a weed crumb in it", "1_Text": "So weed laced with heroin is a thing now", "2_Subreddit": "opiates"}], "dqkaxf3": [{"0_Comment Submission": "x-post r/scottishpeopletwitter", "1_Text": "The Scottish dialect is kind of a lazy English with loads of slang and shortened words. When Scottish people type they use the same slang and try to mimic it phonetically so it looks an absolute mess, and turns out is quite hilarious.\n\nAs for the strong American accents I don't personally struggle with it and I'm not sure if many Scots will. I think we are exposed to a lot of these accents in film and tv from a young age so develop an ear for them. Also I can't imagine any other English dialect to have as many different ways of swearing and even puncturing sentences with swear words as the Scots do.\n\nAm Scottish by eh wey n aye if ye hae any skag then al tak a shot", "2_Subreddit": "opiates"}], "dqsz9zy": [{"0_Comment Submission": "gonna be a fun week", "1_Text": "The sandoz ones crush even easier than the auros based on ones I've had. The coating on the sandoz ones comes off easier too. Its like they were designed for insufflation", "2_Subreddit": "opiates"}], "drkuq2a": [{"0_Comment Submission": "Very first time chasing off foil. Went over each line multiple times until black. Burned and wasted a lot I think?. How to improve?", "1_Text": "I find a tea light candle works great instead of a lighter. Its a cooler flame and much more stable than a lighter. Fucking clippers are the worst. They can jump from barely any flame to burn your eyebrows off before you know what's happened", "2_Subreddit": "opiates"}], "drkv1th": [{"0_Comment Submission": "Very first time chasing off foil. Went over each line multiple times until black. Burned and wasted a lot I think?. How to improve?", "1_Text": "Yeah they're okay but I seem to burn through one of them in a day if I'm smoking heavy. I should invest in a little oil lamp haha", "2_Subreddit": "opiates"}], "drlskyr": [{"0_Comment Submission": "Fent + Heroin mix", "1_Text": "Was it sold as #4? I feel you should out the vendor to warn other users but not sure if that's against the rules", "2_Subreddit": "opiates"}], "drmgzqe": [{"0_Comment Submission": "Fent + Heroin mix", "1_Text": "Was it a uk vendor? I think I know who. That's some bull shit behaviour though I hope you've left a review warning people", "2_Subreddit": "opiates"}], "drmurha": [{"0_Comment Submission": "Fent + Heroin mix", "1_Text": "Honestly man the vendor should be shamed and banned for false advertising. I mean at least sell it as fent dope rather than mislead people and cause fucking deaths.\n\n Is the vendor named after a London transport service? If so I have seen that listing up for a long time and it gets good reviews I guess people in the UK don't expect to be getting fent and have no other #4 vendors to compare it to. I hope this doesn't become a common occurrence", "2_Subreddit": "opiates"}], "ds02pbf": [{"0_Comment Submission": "New Years Quit Train!?", "1_Text": "I remember your post a while back about your plan to quit. Glad to hear you're still kicking man. You're over the hump man just keep going. Much love", "2_Subreddit": "opiates"}], "dtvjkmc": [{"0_Comment Submission": "My tooter!!...catches sooo much resin!!!", "1_Text": "Why not just use a foil tooter? Then the resin is already on foil for you when you unwrap it? This seems like loads of effort and you still don't get it all", "2_Subreddit": "opiates"}], "dtvzttk": [{"0_Comment Submission": "My tooter!!...catches sooo much resin!!!", "1_Text": "Aye I meant that one with the nails and shit. The only advantage I can see is stability but it's not exactly portable unless you want stabbed in the leg with nails. Might as well IM it. \n\nI carry mine around in a little tube that's used to transport joints. But mostly I do heroin alone in my room so don't need to take it out much", "2_Subreddit": "opiates"}], "duu2wkl": [{"0_Comment Submission": "R/guns discovers my drug taking habits from snooping my username and judgement ensues. Am I the only 1 who doesnt dig into everyone's posts?", "1_Text": "I'm interested to see what crabcurry2.jpg is. Sounds tasty", "2_Subreddit": "opiates"}], "duvx0cs": [{"0_Comment Submission": "R/guns discovers my drug taking habits from snooping my username and judgement ensues. Am I the only 1 who doesnt dig into everyone's posts?", "1_Text": "That looks awesome man. Don't know why you're banned but I enjoy all your posts. Stay real", "2_Subreddit": "opiates"}], "dvrhlx7": [{"0_Comment Submission": "Just took 4 tab 10s and about to start my day, what are you guys on this morning", "1_Text": "My order arrived today. Half g of crack and half g of some nice #3. Received it 4 hours ago and the crack is all gone. That shit is so fiendy. On the plus side I've barely touched the h so I'll be able to enjoy my weekend. \n\nFuck I want more crack", "2_Subreddit": "opiates"}], "dwt4s3f": [{"0_Comment Submission": "How are drugs regulated in India? (Crosspost to r/opi, r/benzos) Have you tried indian Taptentadol?", "1_Text": "I used to buy a ton of those etizest from india, they were so cheap and i found the quality consistently good. I guess that was before they went to shit. Tried buying some otc in india recently and everywhere refused to sell them. They've really clamped down on the pharmacies selling narcotics without a script recently.\n\nI've tried tapentadol before, not sure if they were from India or not though. It's similar to tramadol but a bit stronger. I found they were quite dissociative almost like I took some dxm. The high was quite dirty to be honest and I've not been tempted to try then again. They'd be good if you have a low tolerance or to help ease withdrawals.\n\nAnyone know if they have the same seizure risk as tramadol?", "2_Subreddit": "opiates"}], "dwuvpgr": [{"0_Comment Submission": "HighQ, Xtreme-Macro of 1g Afghan #3 UK", "1_Text": "Food filter haha. Looks tasty as fuck. I've never been able to find rocky #3. Stuff round here is always powder and cut to fuck with the occasional soft pebble", "2_Subreddit": "opiates"}], "dwv82ag": [{"0_Comment Submission": "HighQ, Xtreme-Macro of 1g Afghan #3 UK", "1_Text": "Yeah got the same phone it's great, even for actual food. Never heard it called that but in that case you got yourself a nice hot dinner there", "2_Subreddit": "opiates"}]}], "1_submissions": [{}]}]}