{"opewizard47": [{"0_comments": [{"duvtj4r": [{"0_Comment Submission": "lmaoo when you have to remind yourself to go to the bathroom so you don’t get too backed up #opiateprobz", "1_Text": "lol purple means it’s completed", "2_Subreddit": "opiates"}], "duvy3oh": [{"0_Comment Submission": "lmaoo when you have to remind yourself to go to the bathroom so you don’t get too backed up #opiateprobz", "1_Text": "lol", "2_Subreddit": "opiates"}], "duw45gu": [{"0_Comment Submission": "lmaoo when you have to remind yourself to go to the bathroom so you don’t get too backed up #opiateprobz", "1_Text": "lol not yet, i was waiting for my dboy to come thru first and the whole time i expected him to be here any minute so i figured i’d go to the bathroom after and it took him 4 hours to get here, i literally just got it and had been waiting since 4 smh. so i’m about to soon lol.", "2_Subreddit": "opiates"}], "duwa3ds": [{"0_Comment Submission": "Re-Dosing", "1_Text": "so today while i was waiting on dboy i was starting to get sick and also anxious because he was taking so long so i decided to take a little xanax to calm me down while i waited and hopefully stop me from checking my phone every 30 seconds, well it didn’t help with that too much and once i finally got my shit my first dose hardly even hit me because of the xanax, and it was just .5mg  -___-\nso i ended up having to do like 5 times my normal amount just to feel satisfied after anticipating and waiting for so long. fml.", "2_Subreddit": "opiates"}], "dv1kyg4": [{"0_Comment Submission": "Re-Dosing", "1_Text": "btw i googled it and it seems like it’d be good and work for the right person, just not me. too expensive first of all, and there is a key that it comes with after all so if i really wanted to, at any moment i could unlock it and use my shit. so following that logic, i might as well just try and use willpower and self-control not to use on my own. the only difference would be having a fancy, expensive lock box to store my shit in and remind me when to use it. speaking of which, it seems like that’s what the pill timer is mainly meant to be used for; to remind one when to take their medicine and how much to take, not so much to prevent one from over-taking their medicine. although it’s purpose does happen to unintentionally serve as that too. thanks anyway! very interesting.", "2_Subreddit": "opiates"}], "dv1lxsv": [{"0_Comment Submission": "Re-Dosing", "1_Text": "actually yes! idk if i’d necessarily call it progress but my doses are more spaced out again. i picked up from one of my old dboys and got some fire that has great legs, so now i’m not as tempted to re-dose so often! the stuff i’d been getting this past month was great and i loved it, the effects just would not last for shit. so yeah :)", "2_Subreddit": "opiates"}], "dv1otea": [{"0_Comment Submission": "Re-Dosing", "1_Text": "yuuuupppp, it was cut with fent :/ the old stuff that is, this new stuff isn’t thank god. i actually liked the fent at first, i barely had to use any and as a result i was saving a lot of money even tho i had to dose so often. but the short-lasting aspect of it caught up to me as my tolerance to the fent rose and it ended up costing me just as much money as before when buying regular shit without fent, if not more.", "2_Subreddit": "opiates"}], "dv1uhm4": [{"0_Comment Submission": "Re-Dosing", "1_Text": "now i get why it’s the center of the epidemic lol", "2_Subreddit": "opiates"}], "dv8eyf4": [{"0_Comment Submission": "Nothing makes a person clean their house faster than: “Hey! Are you home?”", "1_Text": "followed by disappointment, loneliness *and fapping*", "2_Subreddit": "Showerthoughts"}], "dvczl6v": [{"0_Comment Submission": "BLINK-182 TRIBUTE ALBUM VOL. 4", "1_Text": "i’d like to do Obvious please!", "2_Subreddit": "Blink182"}], "dvd016x": [{"0_Comment Submission": "Update: We did it!", "1_Text": "calm down", "2_Subreddit": "Blink182"}], "dvd03vg": [{"0_Comment Submission": "Well, we have 98% confirmation that at least Travis browses this Sub.", "1_Text": "the one on this sub has capitalization, the one here that travis posted does not. so no, he most likely found it somewhere else.", "2_Subreddit": "Blink182"}], "dvetj0h": [{"0_Comment Submission": "BLINK-182 TRIBUTE ALBUM VOL. 4", "1_Text": "hi OP! you accidentally put me down for Dammit when I asked to do Obvious :)", "2_Subreddit": "Blink182"}], "dvetm87": [{"0_Comment Submission": "BLINK-182 TRIBUTE ALBUM VOL. 4", "1_Text": "it’s okay he can totally do Dammit! you put that down as mine by mistake but I asked for Obvious", "2_Subreddit": "Blink182"}], "dveulvu": [{"0_Comment Submission": "Music you bump when fucked up. Drop an artist or a song", "1_Text": "Elliott Smith", "2_Subreddit": "opiates"}], "dvo32kj": [{"0_Comment Submission": "My last 2 days of using dope before I start methadone maintenance the day after tomorrow!! 1g of some fire bth and 3 new darts :) happy nods opi fam", "1_Text": "not sure if you’re saying good luck on getting into the program or just good luck in general? because i’m already in. i’ve met with the nurses, done the paperwork and got confirmation that i was approved. after showing them my tracks the doctor also said that they’re going to skip the standard detox period that comes first and just put me right on maintenance. \nit might not be this way for you but where i live it’s pretty easy to get on MM. clinics are readily accessible all over, the only difficult part about it is the waitlist and i’m already past that part.", "2_Subreddit": "opiates"}], "dvo32tq": [{"0_Comment Submission": "My last 2 days of using dope before I start methadone maintenance the day after tomorrow!! 1g of some fire bth and 3 new darts :) happy nods opi fam", "1_Text": "thank you!!", "2_Subreddit": "opiates"}], "dvpj2gg": [{"0_Comment Submission": "My last 2 days of using dope before I start methadone maintenance the day after tomorrow!! 1g of some fire bth and 3 new darts :) happy nods opi fam", "1_Text": "zomg thx u so much 4 this gr8 advice!!!!! i can’t wait 2 try it!!!!! im gonna have my frenz cum over and help me do it 2nite!!!!! xD", "2_Subreddit": "opiates"}], "dvpjflc": [{"0_Comment Submission": "My last 2 days of using dope before I start methadone maintenance the day after tomorrow!! 1g of some fire bth and 3 new darts :) happy nods opi fam", "1_Text": "my brother goes to the clinic and was using less than i do when he entered and they started him on a detox plan first, beginning at 30mg and going up 10mg every day until switching him over to maintenance the third day. they told me i won’t be having to do detox and they’re just putting me on maintenance right away so idk if the starting dose is higher than that but i do know it’ll be +10mg every day until i get to a dose that i’m comfortable with. and if i have to start off at 30mg i don’t mind, at least i’ll be moving up quickly. sorry to hear that yours progressed so slow though :/ that sucks", "2_Subreddit": "opiates"}], "dvpjy74": [{"0_Comment Submission": "My last 2 days of using dope before I start methadone maintenance the day after tomorrow!! 1g of some fire bth and 3 new darts :) happy nods opi fam", "1_Text": "thank you so much!! luckily my brother has already been going to this clinic for months so i know all about how it works there, you get to go up 10mg a day, and the people are actually really nice. you’re right tho i believe 30mg is the highest they can start you at cause that’s what they did for my brother, i have experience with taking methadone given to me by a family member who is prescribed it for pain and also purchasing it off the street and though 30mg definitely isn’t enough for me to be comfortable it should just barely keep me well and be bearable for one day.", "2_Subreddit": "opiates"}], "dvpny97": [{"0_Comment Submission": "My last 2 days of using dope before I start methadone maintenance the day after tomorrow!! 1g of some fire bth and 3 new darts :) happy nods opi fam", "1_Text": "that’s so encouraging to hear. hopefully i’ll be able to say that myself one day. how long were you on methadone maintenance?", "2_Subreddit": "opiates"}], "dvpnyfg": [{"0_Comment Submission": "My last 2 days of using dope before I start methadone maintenance the day after tomorrow!! 1g of some fire bth and 3 new darts :) happy nods opi fam", "1_Text": "lmao", "2_Subreddit": "opiates"}], "dwenuiv": [{"0_Comment Submission": "Kids today will never know that unique smell of Blockbuster which was kinda like a mixture of candy and carpet.", "1_Text": "ahh those damn refer addicts.. always mentioning things and making references, referrals and recommendations. they just can’t stop alluding.", "2_Subreddit": "Showerthoughts"}], "dwxdixj": [{"0_Comment Submission": "[F] Too horny to get back to sleep", "1_Text": "fuck asking for nudes, ima start asking for spence’s tail pics", "2_Subreddit": "gonewild"}], "dwxhixa": [{"0_Comment Submission": "Got my hands on these. I have NO idea how to use them, have only done oral and intranasal oxy. Would be so grateful if someone gave me a step by step. How do I get a needle?", "1_Text": "first off like a lot of other people have said, save yourself the horrible consequences and just don’t shoot up if you haven’t before. even if you were to shoot those up tho, it’s only 10mg per 1ml, that is hardly any morphine and a lot of liquid, im honestly really surprised i didn’t see anyone say that. unless you’re opiate naive you’d definitely have to shoot more than 1 to catch a high but that would mean more than 1ml which most needles don’t hold. even if you found a needle that held say 3ml that would be nasty injecting all that liquid into your veins and still probably wouldn’t get you loaded, at least i know for me even shooting all of those bottles up at once somehow wouldn’t get me very high lol. you can totally use it orally if you want but the bioavailability of oral morphine is really low. seems like you might be opiate naive tho? so i’d say if you drink 3 or more of those you might enjoy yourself. just play it safe. you can always do more but can’t do less.", "2_Subreddit": "opiates"}]}], "1_submissions": [{"6eyikq": [{"0_Title": "3g's of #3, only $100 here in cali :-)", "1_Text": "lol purple means it’s completed", "2_Subreddit": "opiates"}], "6gjvlm": [{"0_Title": "Just checking in", "1_Text": "lol purple means it’s completed", "2_Subreddit": "opiates"}], "6gr0u8": [{"0_Title": "midnight cops ($100/2.5g)", "1_Text": "lol purple means it’s completed", "2_Subreddit": "opiates"}], "6mn8l1": [{"0_Title": "Crazy thought", "1_Text": "lol purple means it’s completed", "2_Subreddit": "opiates"}], "6ptyt7": [{"0_Title": "JJ possessed my dboy??", "1_Text": "lol purple means it’s completed", "2_Subreddit": "opiates"}], "7b01vt": [{"0_Title": "😋 (5 methadone 10mg, 3 morphine 60mg, 2 oxy 40mg, 1 hydrocodone 10mg, 1 pressed xanax 2mg)", "1_Text": "lol purple means it’s completed", "2_Subreddit": "opiates"}], "7ckt88": [{"0_Title": "saw this ad at a Macy’s the other day, thought you guys would enjoy it.", "1_Text": "lol purple means it’s completed", "2_Subreddit": "opiates"}], "7y7otj": [{"0_Title": "thought this was kinda funny lol from r/shower_thoughts", "1_Text": "lol purple means it’s completed", "2_Subreddit": "opiates"}], "7ytcl5": [{"0_Title": "thought you guys would enjoy this lol from r/funny", "1_Text": "lol purple means it’s completed", "2_Subreddit": "Stims"}], "807z8q": [{"0_Title": "Re-Dosing", "1_Text": "lol purple means it’s completed", "2_Subreddit": "opiates"}], "80ib00": [{"0_Title": "lmaoo when you have to remind yourself to go to the bathroom so you don’t get too backed up #opiateprobz", "1_Text": "lol purple means it’s completed", "2_Subreddit": "opiates"}], "849k1y": [{"0_Title": "My last 2 days of using dope before I start methadone maintenance the day after tomorrow!! 1g of some fire bth and 3 new darts :) happy nods opi fam", "1_Text": "lol purple means it’s completed", "2_Subreddit": "opiates"}]}]}]}