{"Elepimp_": [{"0_comments": [{"dsn4abw": [{"0_Comment Submission": "How much does 2cb usually go for?", "1_Text": "Do you even know how much that would actually be lol", "2_Subreddit": "2cb"}], "dsompt8": [{"0_Comment Submission": "Is it a good idea to take dxm syrup by freezing", "1_Text": "Its literally unbearable for a lot of people including myself. I can’t even drink it at all unless its mixed in something.", "2_Subreddit": "dxm"}], "dsp1njx": [{"0_Comment Submission": "Is it a good idea to take dxm syrup by freezing", "1_Text": "Usually sprite or lemonade but Its been a while since i haven’t really been in the mood to stomach it.", "2_Subreddit": "dxm"}], "dsp5850": [{"0_Comment Submission": "What a disappointment", "1_Text": "I wouldn’t  say you should feel that psychedelic at that dose. 350mg depending on weight is around a low-mid second plateau dosage and dxm doesn’t really get very  psychedelic until the third, with the second just being really euphoric and fun. If you want a solid third plateau trip I recommend dosing around 600-700mg depending on your weight. This website is really helpful for dxm dosage, http://dexcalc.com/", "2_Subreddit": "dxm"}], "dsp6ec3": [{"0_Comment Submission": "Is an entire 4 FL OZ bottle of DXM enough to get you to second plateau?", "1_Text": "I want to say yes but just to clarify, how much dxm does it have per ml?", "2_Subreddit": "dxm"}], "dsp7con": [{"0_Comment Submission": "Is an entire 4 FL OZ bottle of DXM enough to get you to second plateau?", "1_Text": "Probably not unless you are super light and take it on an empty stomach, and even then it would be an extremely low second plat dose. This is most likely going to be a first plat dosage.", "2_Subreddit": "dxm"}], "dssk0ih": [{"0_Comment Submission": "What a disappointment", "1_Text": "Good luck man I have wanted to have a dxm trip around that dosage for a while I just haven’t wanted to drink the syrup and get nauseous because I highkey feel like it effects the trip.", "2_Subreddit": "dxm"}], "dt6c53q": [{"0_Comment Submission": "Tonights gunna be a good night", "1_Text": "I run from gel caps lmao, have a nice trip", "2_Subreddit": "dxm"}], "dup5hzf": [{"0_Comment Submission": "Once you extract, you never go back", "1_Text": "dang I really wish I could figure this stuff out", "2_Subreddit": "dxm"}], "dup6aa2": [{"0_Comment Submission": "Orally taking powder 2CB?", "1_Text": "You could parachute it maybe", "2_Subreddit": "2cb"}], "duplt8s": [{"0_Comment Submission": "Orally taking powder 2CB?", "1_Text": "You could look up the details but its basically a method to not have to taste stuff. Whats you do I believe, as I have only done it a couple times, is you put the powder on a piece of toiler paper then you fold it up and swallow it so that the paper will dissolve pretty quickly in the stomach", "2_Subreddit": "2cb"}], "duqomzt": [{"0_Comment Submission": "Brassard to Pittsburgh for a 1st, goalie Gustavsson and other cap related elements.", "1_Text": "Rust Khunhackl Hagelin and Sheahan are all solid penalty killers however thats only one center according to Pittsburgh. I would say Hagelin and Sheahan then Rust and Kuhnhackl since Rust is still listed as a center in nhl at least but i mean brassard would probably be fine if he was put out", "2_Subreddit": "penguins"}], "duzdm2s": [{"0_Comment Submission": "\"Just stay in there, you're done for tonight\"", "1_Text": "Wouldn’t that be Zuck?", "2_Subreddit": "hockey"}], "dv1oyxm": [{"0_Comment Submission": "What's your tag, and how did you come up with it?", "1_Text": "yeah same lmao I think more people should fuck with their name lmao but I mean I guess its not as lit as ours so", "2_Subreddit": "SSBM"}], "dv917wy": [{"0_Comment Submission": "Does anyone miss Paul Steigerwald?", "1_Text": "I liked him but they guys doing it now seem fine, I would take anyone of them over Mike Lange but I wish I could hear Doc back on the mic.", "2_Subreddit": "penguins"}], "dvtjkk1": [{"0_Comment Submission": "Unless something insane happens, the Pens will be facing either Philadelphia, Columbus, New Jersey, or Florida in the first round of the playoffs. Who do you want and who do you not want?", "1_Text": "So It looks like we will play the #1 wild card or 3rd place and overall no opponent seems like a bad match up right now.\n\nI think Philly would be the toughest matchup based on the rivalry and playoff history and since we knocked out Columbus last year, Although Florida is really hot right now and could look to do something Nashville like so I would watch out for them if they can get a wild card spot.\n\nJersey is who I would want to play since I think Florida and Columbus have been playing better recently and Jersey has been dropping down in the standings", "2_Subreddit": "penguins"}], "dvvpf8m": [{"0_Comment Submission": "Andreas Johnsson first career goal.", "1_Text": "7th round pick looking real good", "2_Subreddit": "hockey"}], "dw7apyd": [{"0_Comment Submission": "Player scores game winner on same night his Dad dies", "1_Text": "This makes me happy, my best long time hockey friend for about 6+ years dad was found dead by their mom last night and I feel for him right now.", "2_Subreddit": "hockey"}], "dwdizb6": [{"0_Comment Submission": "Confessions of a coke head", "1_Text": "Then Idk what Me and the Mrs means to you lol", "2_Subreddit": "Drugs"}], "dwdnupp": [{"0_Comment Submission": "Confessions of a coke head", "1_Text": "I mean I know its slang but I have always thought for wife. I would think it would be kinda weird referring to your gf basically as your wife but idk what your relationship is like I guess lmao", "2_Subreddit": "Drugs"}], "dwdomhj": [{"0_Comment Submission": "NBC Sports: The Penguins are better than they were a year ago", "1_Text": "Were there shootouts in the playoffs in 09?", "2_Subreddit": "penguins"}], "dwfukqx": [{"0_Comment Submission": "The high of weed changes the more you smoke?", "1_Text": "It can be, just not for your wallet", "2_Subreddit": "Drugs"}], "dwnxi4i": [{"0_Comment Submission": "Also showing off.", "1_Text": "Thats probably the nicest looking mdma i have ever seen (not that I have seen a lot) have some good rolls", "2_Subreddit": "MDMA"}], "dwnxnbh": [{"0_Comment Submission": "First time, got a Vick 4( dxm +Guaifenesin)", "1_Text": "I would think that its not worth it with that much guaf for such little dxm", "2_Subreddit": "dxm"}], "dwp31w1": [{"0_Comment Submission": "TFW you’re trying to get clean but have a needle fixation", "1_Text": "This is lowkey fascinating to me because I am fucking terrified of needles and so I don’t see myself using them as an ROA ever lmao", "2_Subreddit": "opiates"}]}], "1_submissions": [{"62c5a6": [{"0_Title": "spliting 4 points with a friend tonight ill let you guys know how it goes", "1_Text": "Do you even know how much that would actually be lol", "2_Subreddit": "MDMA"}], "68nfma": [{"0_Title": "Blacking out on Dxm", "1_Text": "Do you even know how much that would actually be lol", "2_Subreddit": "dxm"}], "6nwls8": [{"0_Title": "Thought you guys would like the name of this street by my house :)", "1_Text": "Do you even know how much that would actually be lol", "2_Subreddit": "trees"}], "6xdkz4": [{"0_Title": "Cloud9 vs SK round ends with 9 players alive", "1_Text": "Do you even know how much that would actually be lol", "2_Subreddit": "GlobalOffensive"}], "6xpj8a": [{"0_Title": "Does Sand get its name from the fact that it is basically Sea Land?", "1_Text": "Do you even know how much that would actually be lol", "2_Subreddit": "StonerPhilosophy"}], "6xrr5y": [{"0_Title": "Need some guidance on some config troubles", "1_Text": "Do you even know how much that would actually be lol", "2_Subreddit": "GlobalOffensive"}], "7198n7": [{"0_Title": "The ranking system is trash", "1_Text": "Do you even know how much that would actually be lol", "2_Subreddit": "GlobalOffensive"}], "71qu16": [{"0_Title": "Got a gram of oil in an interesting container yesterday", "1_Text": "Do you even know how much that would actually be lol", "2_Subreddit": "trees"}], "72tqzo": [{"0_Title": "Top 10 Megadeth songs", "1_Text": "Do you even know how much that would actually be lol", "2_Subreddit": "Megadeth"}], "7cd954": [{"0_Title": "I couldn’t go to my Grama’s house to watch tonights game so she updated me", "1_Text": "Do you even know how much that would actually be lol", "2_Subreddit": "penguins"}], "818zsi": [{"0_Title": "Olympics/World Cup Team Tournement", "1_Text": "Do you even know how much that would actually be lol", "2_Subreddit": "NHL18"}]}]}]}