{"highbro10": [{"0_comments": [{"dvbcst9": [{"0_Comment Submission": "My slip up lasted entire Feb. This was one of the bigger scoops. Back on the clean train. I hope I can stick to it 🙏🏻", "1_Text": "Stay on the clean train you can actually cum on a girl on the clean train than the dope train. Ya feel me bruh ? Ha", "2_Subreddit": "opiates"}], "dvbctv5": [{"0_Comment Submission": "This will help my journey to a normal life again", "1_Text": "If I just have a 8 mg and I only have one will that be enough to get clean these 5 days I was thinking taking 1mg each day since I only been on dope for a year and never took subs in my life...", "2_Subreddit": "opiates"}], "dvckjte": [{"0_Comment Submission": "This will help my journey to a normal life again", "1_Text": "Holy shit bro, thank you ! This is the kind of response I wanted ! I’ll take your advice and see how it goes. I wish I could get another strip but their hard to find or people wanna trade dope for a strip I can’t even do that haha cause I don’t wanna even see dope or I’ll fucking do it -__-", "2_Subreddit": "opiates"}], "dvckml7": [{"0_Comment Submission": "This will help my journey to a normal life again", "1_Text": "Thanks bro ! Is the WDs for subs gonna be hell ? If I just take 1mg or is it like mild WDs ? Will I have cold sweats ? That’s the only thing I can’t stand man I’m scared of that shit :/", "2_Subreddit": "opiates"}], "dvckooj": [{"0_Comment Submission": "My slip up lasted entire Feb. This was one of the bigger scoops. Back on the clean train. I hope I can stick to it 🙏🏻", "1_Text": "I’m proud of you man ! Bust nuts all day train 4 life", "2_Subreddit": "opiates"}], "dvi0at0": [{"0_Comment Submission": "Gonna burn so many cig holes in my track pants...", "1_Text": "Ha damn", "2_Subreddit": "opiates"}], "dvjstun": [{"0_Comment Submission": "To Emily: your semi-regular reminder that I love you and I'm proud of you", "1_Text": "This post deserves all the respect ! I don’t know you but just off this one post I can tell your a good person and I can tell you worry all the time about your sister ! I hope she responds back and she’s okay and I hope your okay too ! And taking care of her kids is so fuckjng awesome ! Be safe and I hope everything at the end turns out good !", "2_Subreddit": "opiates"}], "dvjt4h0": [{"0_Comment Submission": "I nodded so hard that I randomly told my boyfriend that I’m actually a lesbian", "1_Text": "Everyone in the comment saying “this is sad” but to be honest isn’t it better to have narcan ready every time ? And if the BF thought it was sad he would of left her a long time ago but he didn’t so that means he’s risking it because he loves her and cares so I don’t think it’s sad I think the BF is just accepting.", "2_Subreddit": "opiates"}], "dvmafw0": [{"0_Comment Submission": "I nodded so hard that I randomly told my boyfriend that I’m actually a lesbian", "1_Text": "That’s good , me and my girl are in the same situation but we smoke, but I worry about her every day and she worries for me. It’s a lot of stress but I love her so it doesn’t bother me as much as people would think so I respect any relationship that isn’t all about dope.", "2_Subreddit": "opiates"}], "dvmahd6": [{"0_Comment Submission": "[Discussion] Snapchat Locked (Snapchat ++)", "1_Text": "Just download tweakbox and use the Snapchat++ I never had a problem with that one or any of the tweakbox tweaked apps ! Enjoy !", "2_Subreddit": "jailbreak"}], "dvmb4k2": [{"0_Comment Submission": "[Request] A tweak that sends a text to people when they text you letting them know that you are napping. (Controlled via a toggle)", "1_Text": "This would be good for your drug dealer too,\nSo if he comes and texts “I’m here” It’ll text back for me saying “I’m napping” and he could knock on my door to wake me up instead of leaving and I would have to wait another 4 hours just cause i took a nap.... boom !!", "2_Subreddit": "jailbreak"}], "dvmb5h5": [{"0_Comment Submission": "[Request] a tweak to pin an app to the App Switcher so that it won’t close by mistake", "1_Text": "I really need this ! Only bummer part is if you pin porn and your girl looks thru it your so fucked ha.", "2_Subreddit": "jailbreak"}], "dvv44a1": [{"0_Comment Submission": "3lb bag of sour worms because they were out of sourpatch 😭 WEEK 3 without dope. Kms.", "1_Text": "You’re beautiful ! You should eat those worms and check my music out ! Soundcloud.com/sik00", "2_Subreddit": "opiates"}], "dvxc47q": [{"0_Comment Submission": "3lb bag of sour worms because they were out of sourpatch 😭 WEEK 3 without dope. Kms.", "1_Text": "Hahahahaha for real.", "2_Subreddit": "opiates"}], "dw6u29h": [{"0_Comment Submission": "X post from another sub. I died a little inside", "1_Text": "It’s a cig guys ..... duhhhhhh", "2_Subreddit": "opiates"}], "dw6u3am": [{"0_Comment Submission": "Payday Oxy!", "1_Text": "I like how pay days is exciting cause your getting pills or dope but not excited about getting money haha", "2_Subreddit": "opiates"}], "dw6u6s9": [{"0_Comment Submission": "Anyone in here a fan of The Office?", "1_Text": "This show is so underrated ! This show is fucking awesome ha", "2_Subreddit": "opiates"}], "dw6uah8": [{"0_Comment Submission": "Whelp", "1_Text": "It’s still blows when no one answers so you hit up the dude with shit dope cause you can’t be patient then when you get the shit dope and give him the money everyone hits you up and you’re like “FUCK” ha", "2_Subreddit": "opiates"}], "dw6umhb": [{"0_Comment Submission": "I have $12 til Thursday", "1_Text": "Feeling like it’s the worst heart beating fast from being anxious it’s about to burst \nLesson better be learned before I put this devil piece on foil and burn \nLoving this life is a sacrifice for everything you love but nothing comes first just the drugs \nYou say you wanna quit then the next day you lit and forget about your regrets \nFeeling upset cause your tossing and turning from the hurting girlfriend and friends and family being hurt because the drugs always come first \nI hope one day I get my shit together and stay away from the demon and venom forever my life would be so much better no more weight on my shoulder I hope it’s lighter then a feather \nThat’s my story and I hope one day I reach that glory this war would be less gory thank you for reading !", "2_Subreddit": "opiates"}], "dw6uzzm": [{"0_Comment Submission": "[NEWS] Dad who drove daughter to buy fatal heroin dose could get 40 years, authorities say.", "1_Text": "I feel like the drug dealer got less cause he probably snitched his main dealer out....", "2_Subreddit": "opiates"}], "dw6v2gk": [{"0_Comment Submission": "Another picture of yesterday's pickup. 7G's", "1_Text": "Usually this kind of color and dope is mixed with fent! Usually I get brown powder where you can breathe on it and it turns into tar but this shit looks white !", "2_Subreddit": "opiates"}], "dwgndjm": [{"0_Comment Submission": "[Question] Any update on saurik and his JB release?", "1_Text": "They don’t seem to like you but are we pointing that out...... ops I just did bruh", "2_Subreddit": "jailbreak"}], "dwn7956": [{"0_Comment Submission": "First time trying tar, ready to make some monkey water!", "1_Text": "You never had tar ?", "2_Subreddit": "opiates"}], "dwn79uy": [{"0_Comment Submission": "Mmmmm 😈💦", "1_Text": "Skittles !! 💰", "2_Subreddit": "opiates"}], "dwq0rsn": [{"0_Comment Submission": "First time trying tar, ready to make some monkey water!", "1_Text": "Ahhhh, well how did you get a hold of this beauty ? Ha", "2_Subreddit": "opiates"}]}], "1_submissions": [{"66g4hp": [{"0_Title": "Copped some fire tar ! Happy afffffff", "1_Text": "Stay on the clean train you can actually cum on a girl on the clean train than the dope train. Ya feel me bruh ? Ha", "2_Subreddit": "opiates"}], "6sjpny": [{"0_Title": "Sik0 - Bars In The Club Prod.StunnahSezBeatz [Rap/HipHop] (2017)", "1_Text": "Stay on the clean train you can actually cum on a girl on the clean train than the dope train. Ya feel me bruh ? Ha", "2_Subreddit": "Music"}]}]}]}