{"ashmc2001": [{"0_comments": [{"dra15x5": [{"0_Comment Submission": "When you're feeling down, what *genuinely* makes you feel a ton better? [Serious]", "1_Text": "Having one of my nieces or nephews give me a big hug. Their sweet innocent love in all they say and do just blinds me to the awful shit of a bad day. Being an aunt is the best.", "2_Subreddit": "AskReddit"}], "draq102": [{"0_Comment Submission": "Pharmacists, would you ever date a tech?", "1_Text": "Well, I’m now married to the pharmacist that I dated (when I was a tech) We met at work, but once things began shifting from friendly social time...to ‘oh shit we kissed’...he was transferred to another store. It was purely coincidental that he transferred, but I’m thankful we didn’t have to make the decision to either stop hanging out or try to date on the down-low.", "2_Subreddit": "pharmacy"}], "dreft6l": [{"0_Comment Submission": "Just blame it on the pharmacy and move on", "1_Text": "I recall being taught in school that a simple “I’m sorry. I screwed up” lowers the anger level from patients so quickly. I live by this rule and will be the first to fess up when I mess up. \n\nSomething tells me MDs are not taught that.", "2_Subreddit": "TalesFromThePharmacy"}], "dreiy9c": [{"0_Comment Submission": "Just blame it on the pharmacy and move on", "1_Text": "Ya know...I would assume that. But I work at a big-box and that has never been conveyed to me. Ever. They encourage us to do what we can to keep the patient from continuing to be pissed off.", "2_Subreddit": "TalesFromThePharmacy"}], "drrh5fq": [{"0_Comment Submission": "Ya. Ok walgreens.", "1_Text": "It’s not a big deal at all. I’m a floater and have had to deal with closing / opening / pick up. Super easy and no hassle at all.", "2_Subreddit": "pharmacy"}], "druojde": [{"0_Comment Submission": "Based on your last text message sent, what would your presidential campaign slogan be?", "1_Text": "...she’s an incompetent cunt.", "2_Subreddit": "AskReddit"}], "drvapk2": [{"0_Comment Submission": "Does working at a pharmacy improve your immune system?", "1_Text": "Can’t say scientifically...but I never get sick (other than seasonal allergies). No stomach ‘flu,’ never had bronchitis, nor strep throat. \n\n10+ years in pharmacy. So maybe??", "2_Subreddit": "pharmacy"}], "dsemxfs": [{"0_Comment Submission": "What's a little gamble you take everyday that could go terribly wrong?", "1_Text": "Sure. That is what the doctor wrote on this prescription...here ya go patient!!", "2_Subreddit": "AskReddit"}], "dsi5vpy": [{"0_Comment Submission": "\"don't you just have to put the pills in the bottle?\"", "1_Text": "Someone said that to my tech today and protested the 20 minute wait...I looked over raised my arms in an idk manner and laughed as I said, “yeah...lets hope we get you the right ones! I got a lot of options here!!”\n\nFor once, the laughed and seemed to understand why what they said was kinda ignorant.", "2_Subreddit": "TalesFromThePharmacy"}], "dsi6tp1": [{"0_Comment Submission": "I wish the normies would stay out of this sub", "1_Text": "That’s me. I have several Family members that have been addicted to pills, heroin, cocaine, alcohol, Etc.  I know that in my head, the same genes reside,  so I read the stories and struggles and victories that you guys post and it helps me understand. \n\nI’m also a pharmacist that tries so hard to understand and empathize with my patients.", "2_Subreddit": "opiates"}], "dsn1th7": [{"0_Comment Submission": "Can anyone from wags help me order the dividers for the fast rack?", "1_Text": "I’ll check at Work Monday if no one has replied. \n\nHave you tried looked at the Equipment link for yuyama on storenet?", "2_Subreddit": "pharmacy"}], "dsn52hl": [{"0_Comment Submission": "Another new office Chair, Orifice Despot", "1_Text": "I used to work at one of these office supply stores and it would hurt my heart when we were\nTo DTS (direct to salvage) products...we were\nSupposed to destroy it beyond use. \n\nSo this chair would have had box cutter slices all over it. \n\nGlad someone isn’t doing their job lol.", "2_Subreddit": "DumpsterDiving"}], "dswnql6": [{"0_Comment Submission": "New PIC - is my tech hour allotment the norm?", "1_Text": "Last week I tripped on something...and after I propped myself up...I laughed and lamented\nTo my tech that I was pissed that my damn human instinct kicked in, broke my fall, and kept me from busting my head open. \n\nI would have rather busted my head open and been able to go to the hospital than stay at\nWork.", "2_Subreddit": "pharmacy"}], "du0v612": [{"0_Comment Submission": "Second lane is there so you can skip the line", "1_Text": "At my stores it has always been whoever I can speak to the soonest to keep line moving. I always thought it was a bit daft to for someone to keep  waiting in the first lane behind a car when there is a second empty lane available, so I never really felt bad about helping the person that drove up to the 2nd lane after them.", "2_Subreddit": "TalesFromThePharmacy"}], "du46i3d": [{"0_Comment Submission": "Are PA's giving anyone else trouble? Not talking about prior authorizations...", "1_Text": "I appreciate your pragmatic response here. I think it does a good job clarifying both sides of the issue here.", "2_Subreddit": "pharmacy"}], "du7c49f": [{"0_Comment Submission": "I’m going to the doctor tomorrow but in the meantime, anyone have any idea what this could be?", "1_Text": "Lol it looks like lead from a pencil from when you were a kid or something!!! My sister was stabbed with a pencil in 4th grade the lead broke off in her skin and now it looks like that! (25 years later...)", "2_Subreddit": "popping"}], "du7yq39": [{"0_Comment Submission": "911 operators of reddit, what's the most blood chilling emergency call you've heard?", "1_Text": "Did you ever find out how the situation resolved?", "2_Subreddit": "AskReddit"}], "dubtd7y": [{"0_Comment Submission": "To perform a 🔥 skateboard trick", "1_Text": "Hahaha bro #1: keeps filming. Bro#2 literally grabs the fiery pants and straddles his legs to extinguish the flame. \n\nGood job bro #2", "2_Subreddit": "therewasanattempt"}], "dvyl2q3": [{"0_Comment Submission": "How do react when picking up tamiflu?", "1_Text": "Most think it’s a cure for the symptoms. I have to remind them it will not help the cough, snot, misery....but hopefully make it end quicker.", "2_Subreddit": "pharmacy"}], "dvynyhw": [{"0_Comment Submission": "My father and I at same age, 30 years apart (1600x900)", "1_Text": "Yes!! I am the spitting image of my great grandmother. All my family is fascinated and LOVES it...but for me...it’s a bummer. Cause she may have been the kindest, most lovely lady that ever lived, but boy was she a bit...homely. I always knew what I’d look like when I reached adulthood...just a modern version of her.", "2_Subreddit": "pics"}], "dvytmvg": [{"0_Comment Submission": "How do react when picking up tamiflu?", "1_Text": "Honestly, no. I encourage them to finish it. But only as it applies to the patient I’m speaking with.", "2_Subreddit": "pharmacy"}], "dw41g3a": [{"0_Comment Submission": "The 71-year-old president is tweeting about fighting 75-year-old Joe Biden.", "1_Text": "Yes. But he’s not POTUS. A position which, until 45, exhibited much more restraint and class. \n\nAlso, it wasn’t broadcasted via twitter.", "2_Subreddit": "politics"}], "dwcijl7": [{"0_Comment Submission": "Retail pharmacy- what's the vibe you get from the floor staff?", "1_Text": "What were they over nighting?", "2_Subreddit": "TalesFromThePharmacy"}], "dwpk6kq": [{"0_Comment Submission": "Very limited info on these online, help?", "1_Text": "Lol how old is that bottle?? Pretty sure that is Davocet, (propoxyphene) which was taken off the market in 2010. And I’m pretty sure Walgreens labels haven’t looked like that since 2007.", "2_Subreddit": "opiates"}], "dwtu3ze": [{"0_Comment Submission": "In the comments of an anti-vaccer post on Facebook", "1_Text": "It’s not wrong. But, getting the shot and preventing yourself from getting the flu, means that you’ve prevented  yourself from becoming a walking incubator to further spread the virus should you ever contract it. Instead of being sick and coughing all the grossness around to spread it for 5-7 days...you’d be 1 less person spreading it.", "2_Subreddit": "MurderedByWords"}]}], "1_submissions": [{"2lw3g1": [{"0_Title": "Fist Pump. Proud champion hog.", "1_Text": "Having one of my nieces or nephews give me a big hug. Their sweet innocent love in all they say and do just blinds me to the awful shit of a bad day. Being an aunt is the best.", "2_Subreddit": "pics"}]}]}]}