{"JeffSpicoli2015": [{"0_comments": [{"d60qgyr": [{"0_Comment Submission": "Imodium and kratom questions?", "1_Text": "Careful with Imodium. BTW yes they are 2mg each and work people take insane anounts of em. Heavy abuse of it as a drug to help get clean off of heroin/pill addictions is just starting to happen/become popular. Try and use them for as short of a term period as possible, because you're going to be taking between 25-50 a day... yep, not enough facts out there on heavy Imodium substitution, it's not a great idea at all.\n\n\n\nI have not a single experience or even a single search of research on it, so I can't help you there dude. If you want any suboxone/bupe info then reply to this or send me a message and ill hold your hand and wall ya through it all.. \n\n\n\nStep-by-step, day-by-day, a fresh start over, a new way to play....\n\n\n\n\n\nLOL sorry brother, got lost in a 90s time loop, ;-). Best of luck", "2_Subreddit": "OpiatesRecovery"}], "d60u55j": [{"0_Comment Submission": "The dope game is a man's world, but us girls can be hustlaz too", "1_Text": "Looks like a good 30 hours or so to me! Well, that's what it would be if you replaced that disgusting meth for some good ol' white girl so as to start the 💉 speedball binge fest! Seriously though, fuck crank and goofballs, long live the speedballs!!", "2_Subreddit": "opiates"}], "d60um39": [{"0_Comment Submission": "pws my nightmare", "1_Text": "Nope it isn't!\n\n\n Naloxone is in Suboxone like others have said, was combined with the bupe so whatever pharmaceutical company \"invented\" it could label it as a \"anti-abuse\" addition so it could be fast tracked through the FDA bureaucracy hor$e $hit and start making pharmaceutical suits rich as fuck!\n\n\nThat's why suboxone can be absorbed under your bagina bubbler, inhaled into yo sinuses and injected into yo veins with the same method and feeling that subutex gives ya. Anyone telling you otherwise or whose spouting off contradictory information about \"Suboxone gives PWD and Subutex doesn't!!\" is just straight wrong and you should tell them to do some simple Google research so they stop spring wrong misinformation!\n\n\nBupe causes the PWD, people!! Spread the word (bird being the first word of course, and -utex and -oxone being that same exact shit, so stop saying \"Subutex is alot better!!\" because if isn't! I'm so tired of explaining this, to mostly retarded junksters lol, with them all trying to talk \"the REAL facts\" at me to try and get lower pricing (WHICH IS VERY FAIR ALREADY, YA PENISBEADS!!!) because it's never going to happen and I'm not a patient person to begin with!!\n\n\n Haha, BAH-HUMBUG", "2_Subreddit": "opiates"}], "d61uimk": [{"0_Comment Submission": "Imodium and kratom questions?", "1_Text": "Imodium is a terrible idea already, but if someone needs it for WDing they're gonna need a lot, 20+ or more is what they will usually pop, that's why I said to not use them for any period of time at all", "2_Subreddit": "OpiatesRecovery"}], "d62bgcf": [{"0_Comment Submission": "Crazy to think meth/amp powder could help tapering even lower and then off completely?", "1_Text": "What in the fuck you babbling about, LOL. I'd love to hear you say that in real life with a straight face, just so I could bust up laughing so hard that you'd be covered in my spittle, hahahahaha.\n\n\n\"Crank //Methamphetamine is by no means very dangerous.\"\n\nQuote of the year candidate hun! :)\n\n\nLOL! You say you've used meth for 20+ years, and you seriously don't believe it's one of (more like 100% no doubt about it, it is the absolute worst drug available for sure ) the most dangerous illegal drugs easy obtained in the U.S.? \n\n\nYou say you have never had it bestow any physical/mental damage to you, how can you be so sure? If you are correct, than you can't be so thick to not know how rare/outrageous it is what you said. \n\n\nMind posting a picture of your face? Blurry out your eyes or whatever but I bet anything you're wrong and the meth isn't an hidden secret of yours, I bet it's an obvious part of who you are\n\n\n\nFunny coincidence but this past week I've seen a whole bunch of meth sympathizers (I guess that's the word lol) and quite a few down vote trains for anyone being less than a sweetie pie towards it,its pretty funny.", "2_Subreddit": "opiates"}], "d62bljb": [{"0_Comment Submission": "Crazy to think meth/amp powder could help tapering even lower and then off completely?", "1_Text": "Right? LOL, I'm so happy I read this before bed, -\"Street meth is by no means very dangerous'", "2_Subreddit": "opiates"}], "d67jr7k": [{"0_Comment Submission": "Damn! Dboy hooking it up again! 0.8 for a slice of nug and 20 bucks! His way of apologizing for being \"late\" fuck yeah shit post", "1_Text": "we're you just JKing with us? In all seriousness this looks like one of the bags of those ground snappers you buy around the 4th of July. Did you do any? I really wanna know what the quality is now, haha", "2_Subreddit": "opiates"}], "d6dhswm": [{"0_Comment Submission": "Pokemon GO saves struggling Washington ice cream shop", "1_Text": "I got one! \n\n\nSuper poor atm, have been for the last... ohh two years or so? Haha, any who I threw down $250 with a friend who did too, we had a friend who has a silk screener/t-shirt maker and we got 100 shirts with three different ones. Sold out in 6 days, ranging from $9-$18 and after the initial $250 I had a ~$650(I think it ended being a 65%/35% split. In my favor since it was my idea, I sold more and set everything up) profit! \n\n\nThere's another positive POGO story for yas! :-)", "2_Subreddit": "UpliftingNews"}], "d6nqpe1": [{"0_Comment Submission": "what stuff have you sold to get your shit?", "1_Text": "The worst is definitely the necklace/rings I took from my parents. I don't think I will ever be able to wake up without feeling like inhumane trash for those. Will haunt me til the day that I croak!\n\nBut my personal stuff... man this is gonna make me sick, lol. Not only a pawn shop but comic stores, consignment and a lot of online sites such as eBay/Reddit/4chan/Craigslist. \n\nEvery system I be ever owned (360, 4-5 PS2, 3 PS3 ) and the games (5 of mine for 360, about 15+ new ones stolen from Best Buy((BB)) Wal-Mart((WM)) and Target((TT)). 30+ for PS2. 30+ mine for PS3 and 40+ new stolen from BB, WM, TT. 20+ new PS4/One from BB. 40+ wii/DS/Game Boy stole from BB/TT/WM.).\n\n\n\nA huge DVD and Blu Ray collection that I built myself, so easily 300+ DVDs and 40+ DVD T.V. Series, 20+ Blu Rays with 5 T.V.Series. Stolen and sold it would have to be 100+ DVD/20 T.V.Series and 100+ Blu Rays/30+ T.V. Series and box sets. Most of the DVDs I received maybe a dollar max for, the series were between ten and twenty each. Blue Rays returned me four-eight bucks each, the series were sold for fifteen/fourty each, a few box sets (007) I sold for fifty+.\n\n\nEvery iPod I've ever held in my hands, about 20 I'd guess. Nanos, Classics, Touch; all of em. Luckily the last one I sold was 7 or so years ago, back when you could sell them for a whole lot more than you can now.\n\n\n\nEvery smartphone I have owned/stolen. At least 20+ iPhones, 2 Windows phones and 20+ Androids.  Nothing like getting $200 in cold cash for something you could fit into 10 of in your pockets, lol.\n\n\nMisc. electronics. Kindle, PSP, 3DS, iPhone accessories, portable USB speakers, mouses, headphones, chargers.\n\n\nA HUUUGE amount of Pokemon cards. I lived off of stealing/trading/selling Pokemon/toys for two years up until recently. I kept a excel spreadsheet and before I stoped I had stolen 3000 packs of Pokemon cards, mostly single packs but also the three pack varieties they have right now. Added to my collection I had since a kid (every USA holographic from the first 6 sets, huge amount of Japanese hills+, 30+ first edition set one holos, 13 Charizards with 2 first editions about $3k+++, rare/promos etc) with the new (had about 350 ex cards if would of kept all, 120+ Mega Ex, 60+ Secret Rare Ex, 15 M Charizard Ex($45 each) with 12 Secret M Charizard Ex ($80 each) and 10+ Full Arts ($20) 20+ m/s.r. m/full art Lucario($20-$25 each) 10+ Secret Rare Diagla ($30 each)). Needless to say it was a fucking massive collection. Wish I never started selling shit, FUCK YOU JIMMY you poor fuck, if it wasnt for you I wouldn't of. Sold some online and most to a comic shop, they were always lowballing the duck out of me. Ended up with probably $3k if added up from multiple sales after everything was gone. Made me sick as hell looking on eBay for a minute.\n\n\nWhole Lego collection. About 40 sets and another 300 mini figures. Sick still, Damn I love this question....lol.\n\n\nHuge action figure collection. Before I sold these to a local faggot (who still owes me $500, fucking loser), Craigslist and online I amassed a AMAZING collection. S.H. Figuarts, Revolution and Figma  (look them up if you had a itch, these companies makes some dope shit) was the majority of them. Had the full Power Rangers SHF, all of the Iron Mans made (quit right before the SHF Iron Man 43/45 dropped) and more others. Had a bunch of Marvel Legends, WWE figures, Gunpla... Damn th is is making me so fucking sad. Collection was worth about $12-$14 thousand according to eBay sales. The best part was I started collecting with nothing!! Christmas before last I got 3 Power Rangers (Black Red and Yellow) and I was off! Made some amaZing unbalanced in my favor trades/buys and it was up from there. Total investment in my part for my collection? About $159/$200. \n\n\n\nFuck.... I'm down remembering. This fucking sucks. I'm going to do a speedball. Thanks dude.", "2_Subreddit": "opiates"}], "d6y5ygc": [{"0_Comment Submission": "How to Remove Naloxone from Suboxone Tablets?", "1_Text": "You don't have to worry about the Naloxone brotha, as long as you don't get headaches from it it doesn't mean shit the amount that's in a strip. Naloxone was a quick one pulled by big pharma over the FDA.\n\n\nThe only reason they put it suboxone was so it would get fast tracked into a pharmacy near you. The whole point of it being included is so \"they are abuse proof\" and as y'all know, you can sniff shoot or swallow subs without doing a god damn thing. Enjoy", "2_Subreddit": "opiates"}], "d6yog4t": [{"0_Comment Submission": "what's a fair amount to break off for someone helping you find dope?", "1_Text": "I think 20% is a very fair amount for me to get off of their satchel. I see if like this: I am going out of my way for one MAYBE even two (maximum ill take out of my life for 20%. You expect me to spend two + hours helping you out? My time ain't free fucker, I value an hour of my time at $20 so that's what kind expect to get!) hours of MY time to plug (whoever) their sack of whatever great quality/great priced medicine I plugged them from my guy. Some people think that since the first sack I middled them that they gave me $10/.1-.2 that every other one I'm doing it for free....? What the fuck! I don't know you. You ain't a good friend of mine, shit you ain't even a shitty friend of mine, do you really think I'm down to constantly risk my freedom and what little $$$ I live off of for me to gain $0/NOTHING, just out of the kindness of my little heart!?!? You must be fucking retarded! I don't bring it up each time because I don't think I need to treat you like a special education student and remind you daily that I'm not your helper. So if (whoever) stops paying me $10/breaking me off fairly then prices/weights are bound to frequently change and not in your favor!\n\n\nThis is why keep always give people the chance to buy my plug off me. Such a great deal, wish people who use to plug me have me this cool option before, it would of been an amazing investment. \n\n\n\n\"Hmmm, let me think... a one time payment of $100 that will save me hundreds/thousands of dollars in the long run AND save me hours/days/week of my life spent waiting and catering on the middle man or should I waste, EVERY SINGLE TIME I WANT TO GET DRUGS THAT IS, an extra hour+, $5-$10 gas and another $10-$40 in middling fees and pinched sacks...? I'm not good with math/thinking, and $100 is bigger than the $25 Ill lose getting middled TODAY... Yeah, I don't want a great plug, no thanks!!!\" \n\n\n(Hahaha!! Stupid junkie middle man, you thought you could pull a fast one on me huh? No more YOU, junkie middle man ripping me off daily, haha.... wait....wait a second!!!!!)", "2_Subreddit": "opiates"}], "d70zefi": [{"0_Comment Submission": "What is a hoax you're not proud you fell for?", "1_Text": "Hell yeah they are dude! I collected HARD for about a 12/13 months up until a few months back. It was during a serious hard drug addiction so most of the packs I got weren't paid for, so they cost me a solid free 99! I sold probably hundred and thirty loose sealed packs in the first week of lifting them.\n\n\nI started opening a few one night when I was reallly high and realllly bored. One pack in and BOOM I'm addicted to something else! haha, it was great fun, almost as good as being a kid and opening up the old shcool base set 1 and jungle packs. Had around 200+- packs in my possession at the time (Right before/after Phantom Forces dropped i think) and that night I opened all of them and sorted/grouped them all out and it was mothafuckin glorious! That night was composed of mostly Flashfire, XY, Furious Fists and a few Dragons Exalted/Dark Exllorers/Boundries Crossed. Straight epic pullage went down with 37-40 EX's, 13 being M ex's, 14 Full Arts and 4(!!!) Secret Rates. Four of the M's were either regular or dark Charizards, one each of regular/dark Secret M Charizards and bunch other cool shit I can't remember. The start to the addiction. Before I sold any of them I amassed 2300+ of the codes for online pokemon packs, everything coming from either the single cardboarded packs, triple packs + coin/pin, triple packs + shiny rare and only a few tins.  They were mostly XY, Furious Fists, Flashfire, Legendary Treasures, Plasma Blast and Plasma Freeze; also with very little Dragons Exalted, Next Destinies, Dark Explorers, Plasma Storm, Boundaries Crossed and Noble Victories.\n\n\n\n\nIll stop here, but I had an amazing collection of Ultra Rates before I started going broke and sold them to comic stores and getting ripped off insanely. But yeah, people are surprised pokemon cards are still popular and worth money. Those Charizards about a year ago sold for $25/$35/$40/$50 respectively. I just looked them up and they are selling for $5/$10/$30 more now.  Some of the Ultra Rares from 1-2 year old sets are bank!! Ultra Ball secret rare trainer is $200!!!! Shaymin Full Art and regular Ex $80/$50. M Charizard regular/black $30/$35 and SR M Charizard regular/black $60/$70. Crazy stuff!!", "2_Subreddit": "AskReddit"}], "d7b3g4r": [{"0_Comment Submission": "What the scummiest thing you've done to get your fix/most junkie move you've pulled to get your fix?", "1_Text": "I pulled a Silent Bob earlier today actually.\n\n\nA true Silent Bob is when I SNEAK into someones house, usually a dealer, find the stash, proceed to get high and pocket the rest for later. Then I SNEAK into their bedroom and drug myself before I SLOWLY INSERT myself into their man cave and only after I finish with the Silent Bobbing do I tenderly kiss his neck and whisper in his ear \"I just stole all of your dope, faggot\".", "2_Subreddit": "opiates"}], "d8y2j2w": [{"0_Comment Submission": "[H] Marvel Legends, Display Stands, Flight Stands, NECA [W] Legends, Paypal", "1_Text": "Hey! Cable, Cyclops, Deadpool, Juggernaut, Ice Man, Rogue and War Machine! $80? Awesome lmk", "2_Subreddit": "toyexchange"}], "drwfkls": [{"0_Comment Submission": "What's the worst you ever been ripped off (knowingly or unknowingly)?", "1_Text": "A few years back I got had by this mother fucker for a ball of black- $160. Was newly homeless at the time ( literally the third day being a street Walker ) had just ran out and because of the timing ns my location being without transport+a working non-WiFi only phone along with being my normal super impatient self decided to  have anyone middle for me ASAP so ended up getting it plugged via Alex.\n\n\nWithout a second thought of anything possibly not being on the up and up w ns his'plug' came and met up with me a few hours later (the fact that he didn't rush to meet me put me at ease and didnt ring any bells of mine thatd begin making me concerned and suspicious alerting my brain to acknowledge and keep track of red flags) and we made the exchange, made a little small talk before turning my ass around without inspection of the ball besides holding the Sak and a quick eyeball and sniff making sure it wasn't super shorted or any kind of pathetic fake non-black type substance. Was in shock a few minutes later after opening it up seeing it was that nearly identical appearance wise fake black which had been soaked in vinegar I guess because this kind of shit doesn't have a convincing smell by its lonesome. The fact e pulled this faggy knock stunt to me with full knowledge of my homeless/moneyless/jobless situation straight up shocked me silly! The image that everyone in our circle of users perceived of him was wrong by 180 degrees. He never gave no hint that he would pull something like this on anyone, much less a friend, lol.\n\n\nWell to cut this short a few months later after this became more or less \"water under the bridge\" he left his brand new Galaxy 5?6?7? (Whatever was brand spanking new at the time) in my buddy's backseat after getting dropped off leaving it basically in my fucking lap, LOL, giving me a little momentarily smidgen of proof that karma exists. It was the cherry on top for my payback  which up until then only ended up being $45. Sold that beautiful mother fucker for a whopping $825 which left me with $780 in my pockets after I handed him  $45 after pulling up to him without him having a clue i was coming to meet up, as well as telling him \" Its obvious that you need  this $45 more than I do Alex\".\n\n\n It was, without any near competition, the absolute most poetic event of my life, lol. Fuck you Alex.", "2_Subreddit": "opiates"}], "ds3vnpx": [{"0_Comment Submission": "Anyone ever been to hear lil game rooms? My dude has had me here with him all day he been caking up. It's a chance but if u broke almost it a easy chance to take for a decent payout", "1_Text": "Ya got me intrigued dude. What is 'Hear Lil Game Rooms'? Is it like what they have in California called internet cafes? where they have computers that are set up to play slot machine games that are completely illegal and don't stay open in the same locations for too long? And to not be blatantly illegal instead of cash you use cards that you load $ on to or some shit?", "2_Subreddit": "opiates"}], "dscpqy1": [{"0_Comment Submission": "Profiled by the cops", "1_Text": "The bit about completely forgetting your hotels name/location leading to spending $250 on another room for like 6 fucking hours gave me my first unjustified case of rage I've had in forever, lol, followed by some quality giggles, so thanks for sharing!", "2_Subreddit": "opiates"}], "dto2fpd": [{"0_Comment Submission": "What Has Been Your Worst Drug Experience... In A Nutshell?", "1_Text": "Surprisingly whenever these threads pop-up I'm always stumped at the minimal/nonexistent mentions of possibly the very worst, top 3 at the very least, of the bad time inducing drugs that is ALCOHOL!\n\n\nThanks to the side effects of the booze blackouts I can't be very specific here but I can confidently attribute liquor to being the substance behind 95% of all of my bad experiences while under the influence! MawFucking liquid loser fluid", "2_Subreddit": "Drugs"}], "dto2wwg": [{"0_Comment Submission": "What Has Been Your Worst Drug Experience... In A Nutshell?", "1_Text": "That wasn't a hallucination brotha! Just one of the handful of our parallel universes!  \"Ants In My Eyeballs Johnson\" trying to sell his electronics. (Just started watching Rick and Morty! LOL)", "2_Subreddit": "Drugs"}], "dtrd8bl": [{"0_Comment Submission": "Anyone here ever won the lottery for decent money?", "1_Text": "Bought a $10 crossword last night and won $100! Of course I'm not happy with that because i was twacked out, lol.\n\nStupidly decide to let it ride with more expensive crosswords, $20. Bought 1... Nada! Bought another... Nada! Fuck it, already dug this big of a hold so I bought a 3rd and... $250! \n\nStarted the night with $10 and no hope of getting high and completely changed a shitty Saturday into a $290 come up! Fucking love it when a plan comes together, eh?", "2_Subreddit": "opiates"}], "dw75vxc": [{"0_Comment Submission": "The frustration of losing a dealer’s contact info..", "1_Text": "LOL! thought you were my buddy for a sec, he did the same shit.\n\nSucks that he got you to take the gun rap.\n\nHellllllla terrible idea in retrospect, huh dude?", "2_Subreddit": "opiates"}], "dw7a6lc": [{"0_Comment Submission": "I met this guy on tinder who looked nothing like his pics....and also brought me a few surprises.", "1_Text": "LOL!! \n\n\nYou fucking dickhead, i just about popped all the stitches in my mouth laughing. I'm sending you the fuckin bill, hahaha", "2_Subreddit": "Drugs"}], "dwaxzpx": [{"0_Comment Submission": "Scored a 100 pack of blues... Last hooray before getting sober for good", "1_Text": "Ya realize them pill mill days were 10+ years ago, right Grandpa? haha, ya cant compare deals like these with the time difference being +- 1 decade! Ya silly goofus\n\n\n\nThe only goods that haven't fluctuated in pricing in the last 10+ years is In N Out + Costco hotdogs, lol", "2_Subreddit": "opiates"}], "dwazq6a": [{"0_Comment Submission": "Scored a 100 pack of blues... Last hooray before getting sober for good", "1_Text": "Well yeah connections are everything. Damn if i could get dumb ass roxis for 15/each I'd seek out pill users and flip em as much as possible for that easy gold mine that is a $15 30. Normal price here is 25-35 each. You'd be one gigantic silly goosed motherfucker to not take advantage of your situation on a regular basis, yo!\n\n\nShit dunno what qualifys as Cartel Membership Rewards Card status pricing, but 2 things: \n\n\n 1.) No pills for this guy, I identify as a sisgendared dragon-kin black tar usin'-n-abusin' coolass motherfucker! \n\n\n2.) Do I qualify for a Cartel Rewards Card and  Premium Pricing rewards with $125 balls / $240 quartas ?", "2_Subreddit": "opiates"}], "dwhitvt": [{"0_Comment Submission": "New Cold Cop story", "1_Text": "Loaded and safety off, while possibly being a junkie ya say? Darwin award here ye come!!", "2_Subreddit": "opiates"}]}], "1_submissions": [{"3gidb3": [{"0_Title": "Finally! Knock off Nendoroid Pokemon Red's on eBay!", "1_Text": "Careful with Imodium. BTW yes they are 2mg each and work people take insane anounts of em. Heavy abuse of it as a drug to help get clean off of heroin/pill addictions is just starting to happen/become popular. Try and use them for as short of a term period as possible, because you're going to be taking between 25-50 a day... yep, not enough facts out there on heavy Imodium substitution, it's not a great idea at all.\n\n\n\nI have not a single experience or even a single search of research on it, so I can't help you there dude. If you want any suboxone/bupe info then reply to this or send me a message and ill hold your hand and wall ya through it all.. \n\n\n\nStep-by-step, day-by-day, a fresh start over, a new way to play....\n\n\n\n\n\nLOL sorry brother, got lost in a 90s time loop, ;-). Best of luck", "2_Subreddit": "ActionFigures"}], "49ebzs": [{"0_Title": "God Damn Chinese hackers or How I hate you looooong time!", "1_Text": "Careful with Imodium. BTW yes they are 2mg each and work people take insane anounts of em. Heavy abuse of it as a drug to help get clean off of heroin/pill addictions is just starting to happen/become popular. Try and use them for as short of a term period as possible, because you're going to be taking between 25-50 a day... yep, not enough facts out there on heavy Imodium substitution, it's not a great idea at all.\n\n\n\nI have not a single experience or even a single search of research on it, so I can't help you there dude. If you want any suboxone/bupe info then reply to this or send me a message and ill hold your hand and wall ya through it all.. \n\n\n\nStep-by-step, day-by-day, a fresh start over, a new way to play....\n\n\n\n\n\nLOL sorry brother, got lost in a 90s time loop, ;-). Best of luck", "2_Subreddit": "opiates"}], "4dalg4": [{"0_Title": "Chris Farley", "1_Text": "Careful with Imodium. BTW yes they are 2mg each and work people take insane anounts of em. Heavy abuse of it as a drug to help get clean off of heroin/pill addictions is just starting to happen/become popular. Try and use them for as short of a term period as possible, because you're going to be taking between 25-50 a day... yep, not enough facts out there on heavy Imodium substitution, it's not a great idea at all.\n\n\n\nI have not a single experience or even a single search of research on it, so I can't help you there dude. If you want any suboxone/bupe info then reply to this or send me a message and ill hold your hand and wall ya through it all.. \n\n\n\nStep-by-step, day-by-day, a fresh start over, a new way to play....\n\n\n\n\n\nLOL sorry brother, got lost in a 90s time loop, ;-). Best of luck", "2_Subreddit": "opiates"}], "586o47": [{"0_Title": "Need some information! Anybody in California have some tips on getting into inpatient rehab?", "1_Text": "Careful with Imodium. BTW yes they are 2mg each and work people take insane anounts of em. Heavy abuse of it as a drug to help get clean off of heroin/pill addictions is just starting to happen/become popular. Try and use them for as short of a term period as possible, because you're going to be taking between 25-50 a day... yep, not enough facts out there on heavy Imodium substitution, it's not a great idea at all.\n\n\n\nI have not a single experience or even a single search of research on it, so I can't help you there dude. If you want any suboxone/bupe info then reply to this or send me a message and ill hold your hand and wall ya through it all.. \n\n\n\nStep-by-step, day-by-day, a fresh start over, a new way to play....\n\n\n\n\n\nLOL sorry brother, got lost in a 90s time loop, ;-). Best of luck", "2_Subreddit": "OpiatesRecovery"}]}]}]}