{"MetaMetaFour523": [{"0_comments": [{"dwkrap6": [{"0_Comment Submission": "Any Opinions or advice on methadone subutex and suboxone?", "1_Text": "Word. I came off a heavy IV dope habit, with 5 years off MMT in the mix. I attempted a pretty quick taper off the methadone and suffered for months. At over 10 months in I *still* have residual anxiety, fatigue and memory issues, and I’m still sneezing. All of it is very very minor, but just, fuckall you know? I can’t believe I survived that level of extended hell and managed to come out the other side still clean.", "2_Subreddit": "opiates"}], "dwkrzoi": [{"0_Comment Submission": "In desperate need of help", "1_Text": "The meds you have will help, but don’t underestimate how much non-med solutions can help, especially once you get past the acutes.\n\nMy detox and PAWS were horrible - like beyond brutal, and I had no resources to go to rehab or anything, did it myself at home. The things that got me through it were kratom, weed, Imodium (in SMALL amounts), hot baths, walks, meditation, exercise, a healthy diet and going to NA/AA.\n\nI did NOT wanna go to meetings, but they made all the difference to me. You just have to get desperate enough to go. Believe me, I tried everything else first, and none of it did fuckall for me. You can do this.", "2_Subreddit": "OpiatesRecovery"}], "dwl0n2m": [{"0_Comment Submission": "Questions on urine lab test", "1_Text": "I have a pretty slow metabolism. If I was just chipping occasionally w no real tolerance, 3-4 days usually. Once I was addicted and using daily it took me 6-7 days to pee clean. When I was using on top of my methadone when I was on MMT it took 8-10 days (!).\n\nBottom line is everybody’s different. You can always get a drugstore pee test to check.", "2_Subreddit": "opiates"}], "dwl10wj": [{"0_Comment Submission": "A day at a time.", "1_Text": "Wow, holy sh*t that’s got to be rough. Sincere congrats to you! Hmu if you ever need support, I came off a heavy IV dope/speedball habit on top of 5 yrs of MMT last year - detoxed myself and it sucked.\n\nIt is literally a minute at a time sometimes when you’re going through that. You’re amazing though, hang in there because it’s all worth it when you get your life back.", "2_Subreddit": "opiates"}], "dwl8wgj": [{"0_Comment Submission": "A day at a time.", "1_Text": "Yeah.. 5 years, and using on top of my dose for part of it. So dumb. Over ten years heavy use altogether.  You know hard that is - which is why I commented to you. My heart goes out to anyone fighting this fight and I think you are super brave. The hardest part is just letting the time pass, so your body, head and life have time to heal.", "2_Subreddit": "opiates"}], "dwlgp3j": [{"0_Comment Submission": "Can't stay totally clean", "1_Text": "It’s tricky. There was a thread on either here or /r/opiatesrecovery the other day about how the powers-that-be define “success” as far as getting clean.\n\nI can only give my opinion :). I have a similar long, heavy use history as you. I struggle with “completely clean” as well. I’ve been clean of opiates and heroin for over 10 months now, off my prescribed benzos for 2. I barely ever drink, I smoke weed, and I consider myself clean. Because I am clean from anything that was ever an issue for me. I’m careful not to ever step into substances I know may set me down a bad path, so yes, in my heart I am my own best definition of clean.\n\nI used kratom to detox, and knew it was a slippery slope so I tapered off. Sounds like this might be what you feel like is holding you back. I know I could not handle doing kratom right now. Have you checked out /r/quittingkratom?", "2_Subreddit": "opiates"}], "dwmferu": [{"0_Comment Submission": "Opiophile", "1_Text": "Omg I forgot about opiophile! I spent a lot of time there back in the day :)", "2_Subreddit": "opiates"}], "dwn1vcw": [{"0_Comment Submission": "Life was so much easier as a junkie. Or was it?", "1_Text": "Yes. I could’ve written your post except I’m only 10 months clean. There is definitely a 10-year old in my head, who thought that once I got clean everything would be sunshine and rainbows, and that has so not been the case. \n\nPart of my problem is that now that I don’t have that “one problem” I get hyper focused on my various multiple problems and how to fix them. And I’m like the little Dutch boy (girl whatever) like, everytime I get one hole plugged the water starts spraying out another and I’m running out of hands. Plus self esteem issues from being a junkie for the last 10 years. \n\nOne thing that has helped more than anything is NA/AA - with the whole focus on teaching people to stop trying to control everything. That’s always been an issue. As I realize that I can only actually control a small subset of things in my life, and that worrying about the rest stresses me out. So I’ve gotten a lot of peace from practicing that. Even if you don’t like 12 step you can take something from that.\n\nBut yeah, it’s hard. Being a grown up kind of sucks. Ima keep fighting the good fight for now.", "2_Subreddit": "OpiatesRecovery"}], "dwo5my9": [{"0_Comment Submission": "What do people call dope where you live?", "1_Text": "Train, boy or dope in VA", "2_Subreddit": "opiates"}], "dwozver": [{"0_Comment Submission": "Lost my job of 4 years--the one thing is was proud of in my life", "1_Text": "I feel you too. I lost my job at the tail end of my addiction - ironically it had nothing to do with me or anything I did - straight layoff. It was still horrible, and basically kicked off 2 years of pure suck. I’ve been clean for 10 months now, still trying to resolve all the job crap.\n\nBut I came here to say that I think you’d be a really good candidate for methadone. Just be smart about it. Don’t use on top of it no matter what, it does not lead to a good place. Tapering off can also suck but if you are smart about it, it’s not bad.\n\nAnd if you follow all their rules at the clinic you can get carries pretty quickly - you start earning them after 3 months at my old clinic. They are all different though.\n\nBut methadone would prob give you the best chance to get functional and feel normal. IMHO anyway.", "2_Subreddit": "opiates"}], "dwqxl0b": [{"0_Comment Submission": "Wish me luck at my PM appointment. Thanks, y’all are badass", "1_Text": "Good luck Catman!", "2_Subreddit": "opiates"}], "dwqyy6j": [{"0_Comment Submission": "Tuesday April 3rd Daily Check In", "1_Text": "Ugh that sucks!! I am real sorry that happened to you. Do you ever use the Headspace app for meditation? It’s a good one. Try and stay off your feet and hang in there.", "2_Subreddit": "OpiatesRecovery"}], "dwqzhng": [{"0_Comment Submission": "Tuesday April 3rd Daily Check In", "1_Text": "I am grateful for another day clean. I’ve rode out some tough days for the last few months but I’m thinking I might see the light at the end of the tunnel now. I managed to file my horror show taxes today which is a relief - I owe :( bcus I run my own business right now. I been really struggling to change that whole situation and it’s the source of a lot of my stress. Keep your fingers crossed for me please.\n\nMy 1-year anniversary is coming up next month. I guess I need to go to more meetings and try to be more social in the program. That’s the hardest part for me but I get a lot out of it when I push myself.\n\nBut yeah, happy it’s spring, happy to be clean.", "2_Subreddit": "OpiatesRecovery"}], "dwr14t0": [{"0_Comment Submission": "Weight gain in recovery", "1_Text": "Look at this as an opportunity to get healthy. Similar thing happened to me. When I got off dope, I was what I call “skinny fat” - I wasn’t really fat but I was flabby and in awful shape. My mind frame at the time (since I’d been living on cereal, ice cream and sour patch kids) was “oh, now I can eat and get healthy!”\n\nBut I didn’t understand what that meant, and thought it meant I could eat everything. So fast forward like 4 months, and by late last year I was about 165 lbs. and still in crap shape. I’m F and 5’7”.\n\nSo I cut out all sodas and sweet drinks, processed and fast food, candy - and started walking around my neighborhood. I’d go for about a .5 mile and be exhausted. But it was baby steps. I’ve graduated to a CICO diet and cooking everything from scratch, mostly raw food diet. And I can breeze thru 3-4 miles without breaking a sweat. I exercise and lift weights too. And I’ve lost 20lbs! \n\nTry using a step counting app like Pacer. Or a fit bit or Apple Watch. \n\nI do CICO (calories in, calories out) and use the My Fitness Pal app. It makes it so easy. Portion size is everything!\n\nGreat subs are:\n/r/1200isplenty\n/r/loseit\n/r/healthyfood\n/r/keto\n\nSeeing the changes in my body has been a slow process but it’s been such a great motivator for my recovery. And it helps keep me out of trouble. Have fun!", "2_Subreddit": "OpiatesRecovery"}], "dwr1nfh": [{"0_Comment Submission": "Mentally, I just cannot handle withdrawal or sobriety...", "1_Text": "You need support, most of us can’t do this alone. Are there any kind of meetings you could go to? an IOP, AA/NA, SMART, Rational Recovery, Ring, etc. Even NA by phone. You might not want to go, but consider giving it a try. It could change everything for you as far as how you’re feeling. Might be worth it - it saved my life.", "2_Subreddit": "OpiatesRecovery"}], "dwr28tq": [{"0_Comment Submission": "How does your clinic operate? Mine is bilking my health insurance....", "1_Text": "That’s a LOT of groups! Geez. My old clinic was self pay/cash only and they’d hit us with various fees- benzo fee, annual fee, fee to re-test a dirty, etc.\n\nI only had to do one group per week for an hour.", "2_Subreddit": "Methadone"}], "dwrdwnw": [{"0_Comment Submission": "Mentally, I just cannot handle withdrawal or sobriety...", "1_Text": "It’s awesome if you have someone to go with you. And yes, babies are in meetings on the regular. They are especially fawned over in the women’s’ meetings. And remember, it’s perfectly fine to listen til you feel up to sharing. But the more you open up to people, the easier it is to gather a support network. If you talk in the meeting tell them exactly how you’re feeling. \n\nSome meetings are better than others - I sort of meeting hopped until I found ones I liked a lot. And NA by phone gives you the opportunity to get a feel for how things work ahead of time. You can decide if you think it’s something that is right for you before you ever set foot in the room.", "2_Subreddit": "OpiatesRecovery"}], "dwsa0vs": [{"0_Comment Submission": "How does your clinic operate? Mine is bilking my health insurance....", "1_Text": "I think you meant to reply to OP? Like I said, my clinic was cash only/self pay - which meant that if you have private insurance your only hope of getting any reimbursement was if you had an HSA. I would get receipts from them, but nothing was ever itemized like it would be on an EOB.\n\nI am not sure how they handled Medicaid patients.", "2_Subreddit": "Methadone"}], "dwsd2sc": [{"0_Comment Submission": "How does your clinic operate? Mine is bilking my health insurance....", "1_Text": "This is past tense since I’m off mmt, but yes that’s correct. I was billed an extra $20/month because I had an outside low dose benzo script.\n\nIt was supposedly to cover benzo monitoring in my UAs, which ended up being a huge nightmare. I got red flagged over and over because my benzos were sometimes not showing up in my UA. I was immediately accused of diverting them, despite never having a bad pill count. I have never abused my benzos, and my prescribing doctor backed me up a hundred percent. Didn’t matter though - the clinic still thought I was lying junkie scum. I’m so glad to be off both methadone and benzos now.\n\nMy annual fee was higher too - I can’t remember by how much, but that was also a “benzo” charge.", "2_Subreddit": "Methadone"}], "dwsdlww": [{"0_Comment Submission": "Getting my foot in the door of recovery and proceeding to slam it repeatedly", "1_Text": "Yeah junkies gonna junk is not really an excuse :)\n\nLook, you had 3 months, so you know how much work it takes and you got a taste of the rewards. You know what you have to do to be clean, so it’s a matter of just doing it. It’s as simple as making the next right choice.\n\nRelapse is a part of lots of people’s recovery. You’ve learned something, so now it’s time to use it. In NA I see lots of people come back into the rooms after a relapse, and they are met with love and support. Yes, some people will stand back for awhile, but that’s because they’re scared. It’s not a personal reflection on you. It sounds like you are sick of the grind. This is a great time to jump back into recovery. You can do this!", "2_Subreddit": "opiates"}], "dwsfv1f": [{"0_Comment Submission": "Share how many days clean you are", "1_Text": "316", "2_Subreddit": "OpiatesRecovery"}], "dwsgjy6": [{"0_Comment Submission": "Almost two years clean and feeling really lost...", "1_Text": "Don’t do one more time. Think about this rationally. Are you really willing to risk everything you’ve worked so hard for? And let’s be realistic- what are the chances it’s going to be as good as you are probably romanticizing? Here’s the four choices you have:\n1. You use and it is indeed as good as you think. You’re most likely off to the races again and will lose what you have. Possibly back to square one.\n2. You miscalculate dose or get fent and OD\n3. The dope sucks and you’re left with guilt and crappy feelings, barfing and a lighter wallet\n4. You walk away and have hope for the future\n\nIf you’re feeling bad, most likely there’s something else going on with you. Try to figure out what it is. Putting dope on top is not going to make it better.", "2_Subreddit": "OpiatesRecovery"}], "dwsus9t": [{"0_Comment Submission": "Ability to get new rigs in different states?", "1_Text": "Virginia sucks. The law *says* you can buy them OTC, but it’s at the discretion of the pharmacist, and 9/10 pharmacists are dicks who do not care about harm reduction. If you’re really determined, and willing to run from drugstore to drugstore asking then yeah, you’ll probably find something.\n\nYou can almost always get them at Walmart around here but they have a super limited selection - usually only the short tips.\n\nThrow them in your checked back in your toiletries with a few diabetic supplies.", "2_Subreddit": "opiates"}], "dwvdo4k": [{"0_Comment Submission": "I don't fucking know anymore..", "1_Text": "Great advice - I came here to say exactly this. And upvote for your u/ 😆", "2_Subreddit": "opiates"}], "dwvz4kl": [{"0_Comment Submission": "3 months off pills and miss them today. any words of encouragement would be great right now", "1_Text": "I go through days like that, just wanting to get high. I know I’m not gonna do it but it’s still stressful and frustrating. You’re doing good I think - just keep looking at all the reasons not to use. And congrats on your time- 3 months is huge! And me too, as far as my body feels so much better now that I’m clean.", "2_Subreddit": "OpiatesRecovery"}]}], "1_submissions": [{}]}]}