{"Gordonsan": [{"0_comments": [{"dodi39q": [{"0_Comment Submission": "The weapon for a bear hunt", "1_Text": "Dignity of risk.", "2_Subreddit": "WTF"}], "dokir8y": [{"0_Comment Submission": "Teddy Roosevelt's diary entry from the day his wife died", "1_Text": "It's weird when my dad died on Father's Day everyone was crying and sobbing. I simply asked to go to the hospital cafeteria.  I still regret how I handled that situation.", "2_Subreddit": "pics"}], "dpdyhoq": [{"0_Comment Submission": "Subway Emperor", "1_Text": "So good it hurts.", "2_Subreddit": "BetterEveryLoop"}], "dplo4w1": [{"0_Comment Submission": "Can someone explain why police in Usa are so badly trained compared to Europe?", "1_Text": "I imagine the threat of individuals having guns escalates police to shoot first. Even if no guns are visible concealed carry is still possible.", "2_Subreddit": "USA_politics"}], "dpt5cvx": [{"0_Comment Submission": "What's a 10/10 album from the last 15 years by a relatively obscure artist/band?", "1_Text": "The Music's self titled album. [The Music](https://en.m.wikipedia.org/wiki/The_Music_(album)", "2_Subreddit": "AskReddit"}], "dqpgxx4": [{"0_Comment Submission": "[16F] Am I ugly?", "1_Text": "That's a lot of issues to handle at 16. The good news is you have identified them and you can address them. I dated a woman with bpd before she was diagnosed and it was a very difficult relationship. I'm proud of you for getting help, a lot of older individuals find therapy to be ineffective, but in reality are simply putting up barriers to treatment. Keep on working on yourself, it's honestly one of the hardest things to do. Soon you will learn to like yourself and feel better. The way you look is not the issue here at all. I like your fashion sense and the way you style your hair. \n\nKeep working on loving yourself and everything else will fall in place.", "2_Subreddit": "amiugly"}], "ds1pk8l": [{"0_Comment Submission": "NSFW - People of reddit who have had sex with an in-law or step sibling or parent, what happened? How did you get into that situation? and did anyone find out?", "1_Text": "That read like a textbook of my life. Up until the marriage though. Alcohol ruined that.", "2_Subreddit": "AskReddit"}], "dsbtbcq": [{"0_Comment Submission": "My dad sent me this...", "1_Text": "Jesus. I wish the technology existed for virtual hugs.", "2_Subreddit": "creepyPMs"}], "dscevwe": [{"0_Comment Submission": "This is me in Dec 1995. This is me in Dec 2017. I overcame addiction, homelessness, and a history of incarceration. Been sober 20 years next month.", "1_Text": "Tracy is a angel at R/Opiates", "2_Subreddit": "pics"}], "dscfb88": [{"0_Comment Submission": "This is me in Dec 1995. This is me in Dec 2017. I overcame addiction, homelessness, and a history of incarceration. Been sober 20 years next month.", "1_Text": "Potato, potato.", "2_Subreddit": "pics"}], "dsfff2w": [{"0_Comment Submission": "What are some dark or unknown corners of Reddit the average Redditor doesn't know about?", "1_Text": "Agreed, a lot of people think opiate subreddit is all doom and gloom but if you actually stick around it's a very open and welcoming community. Even for non users.", "2_Subreddit": "AskReddit"}], "dsiwr3t": [{"0_Comment Submission": "BF withdrawing from opiates - wants to start again and slowly \"taper off\" - terrible idea, right?", "1_Text": "I'm so sorry. I can empathize both sides. Maybe keep In touch if you can handle it. He's probably gonna hit the sauce a lot harder after losing you. \n\nYou did the right thing, the hard thing, and if he ever gets well he is going to regret what happened here today.", "2_Subreddit": "OpiatesRecovery"}], "dsiwzad": [{"0_Comment Submission": "What does an OD on fent feel like?", "1_Text": "Like nothing at all. You don't remember it and feel nothing. Here one day gone the next.", "2_Subreddit": "fentanyl"}], "dsizv9m": [{"0_Comment Submission": "BF withdrawing from opiates - wants to start again and slowly \"taper off\" - terrible idea, right?", "1_Text": "Great to hear.", "2_Subreddit": "OpiatesRecovery"}], "du50342": [{"0_Comment Submission": "I like a girl but she thinks im not that handsome in person. But after seeing her to an resort she thinks im good. What should i do meet with her again?", "1_Text": "Confused by the wording on this post. She thought you were ugly, but you saw her again at a hotel and she found you attractive? Are you then asking if you should try courting her again? \n\nIf that's the question, we'll ultimately that's up to you. Do you still find her attractive? Do you think she may change her mind again and find you unattractive? Finding someone attractive isn't something that usually changes, id be wary of a alternate motive. Like money, or getting gifts. \n\nEither way good luck, and keep us posted.", "2_Subreddit": "Advice"}], "du515no": [{"0_Comment Submission": "Tipping on takeout orders", "1_Text": "I always tip takeout. However it's a low tip. Never over 15% for me. Unless something special was ordered or done.", "2_Subreddit": "AskNYC"}], "dumcw1a": [{"0_Comment Submission": "Mothers Birthday, and i want to surprise her with a PC. My build keeps going over budget.", "1_Text": "I'll look into it, thanks for the suggestion!", "2_Subreddit": "buildapc"}], "dumd0zu": [{"0_Comment Submission": "Mothers Birthday, and i want to surprise her with a PC. My build keeps going over budget.", "1_Text": "Great point. Any brands to lean towards? Or are they all fair game?", "2_Subreddit": "buildapc"}], "dw0xdhx": [{"0_Comment Submission": "[F19] Judge this potato, I'm curious :3", "1_Text": "12/10 potatoes.", "2_Subreddit": "Rateme"}], "dworm76": [{"0_Comment Submission": "Suboxone", "1_Text": "It's gonna last for three days or more. Be ready for a long ride.", "2_Subreddit": "opiates"}], "dwqe3gc": [{"0_Comment Submission": "Reconnected with the love of my life after a nearly 15 year hiatus. I'm left feeling heartbroken.", "1_Text": "Have you told her you don't want to move on? Let her know you have waited 15 years for this moment and that you love her regardless of her past mistakes. Let her know you don't see yourself as better than her. Ask to help her seek counseling, or some other way to improve her confidence. \n\n\nUnless this is her way of letting you down easy. In which case respect her choice, and move on. \n\nGood luck.", "2_Subreddit": "datingoverthirty"}], "dwqeh1j": [{"0_Comment Submission": "Reconnected with the love of my life after a nearly 15 year hiatus. I'm left feeling heartbroken.", "1_Text": "Then don't give up, let her know you will be around to help, and will be waiting.", "2_Subreddit": "datingoverthirty"}], "dwrb016": [{"0_Comment Submission": "Reconnected with the love of my life after a nearly 15 year hiatus. I'm left feeling heartbroken.", "1_Text": "I think we are all working with limited information. I agree that if she doesn't want to be with him he should respect that. However only the op can know for certain if the woman is insecure and uncertain, or is trying to tell him he's not interested. \n\nPersonally I rarely give advice suggesting that men should persist in this sort of behavior. The only reason I did otherwise was because the way OP framed the situation. \n\nIf anyone is interested I suggest watching this short clip about how movies have subtlety encouraged this sort of \"benevolent\" stalking. \n\nhttps://youtu.be/rZ1MPc5HG_I", "2_Subreddit": "datingoverthirty"}], "dwvl6l6": [{"0_Comment Submission": "Opiate allergy", "1_Text": "Why did you keep taking so many opiates after having a negative reaction?", "2_Subreddit": "opiates"}], "dwvvjk9": [{"0_Comment Submission": "Opiate allergy", "1_Text": "Blessing and a curse.", "2_Subreddit": "opiates"}]}], "1_submissions": [{"66g28m": [{"0_Title": "Stretch Armstrong !", "1_Text": "Dignity of risk.", "2_Subreddit": "nostalgia"}], "66g3oi": [{"0_Title": "Animorphs. Read every single one including the Hork bajir chronicles.", "1_Text": "Dignity of risk.", "2_Subreddit": "nostalgia"}], "66g55i": [{"0_Title": "Magic eye!", "1_Text": "Dignity of risk.", "2_Subreddit": "nostalgia"}], "66g8r8": [{"0_Title": "Math blaster!", "1_Text": "Dignity of risk.", "2_Subreddit": "nostalgia"}], "6afx62": [{"0_Title": "My Bitcoin is at 0 confirmaton after 24 hours.", "1_Text": "Dignity of risk.", "2_Subreddit": "btc"}], "6fk6uv": [{"0_Title": "Needles broken off in the neck of a heroin addict. Cross post.", "1_Text": "Dignity of risk.", "2_Subreddit": "opiates"}], "6gdh5i": [{"0_Title": "Does anyone use Beautiful Rigs, or tools for your ritual? If so, please show.", "1_Text": "Dignity of risk.", "2_Subreddit": "opiates"}], "6te56a": [{"0_Title": "The five rings board game Matt was discussing", "1_Text": "Dignity of risk.", "2_Subreddit": "mattcolville"}], "6v0y14": [{"0_Title": "Morty' s aggression?", "1_Text": "Dignity of risk.", "2_Subreddit": "rickandmorty"}], "6v9rt9": [{"0_Title": "FDA assigning employees to search suspicious mail incoming from overseas at international mail handling facilities. Be safe out there.", "1_Text": "Dignity of risk.", "2_Subreddit": "opiates"}], "6wsrqs": [{"0_Title": "I was looking for a FAQ in the community info section before I asked this question but couldn't find one so please forgive me if this has been asked before. I'm moving to the Midwest and want to look into purchasing a beginners handgun, does this community have any suggestions?", "1_Text": "Dignity of risk.", "2_Subreddit": "handguns"}], "7z9m1k": [{"0_Title": "Mothers Birthday, and i want to surprise her with a PC. My build keeps going over budget.", "1_Text": "Dignity of risk.", "2_Subreddit": "buildapc"}]}]}]}