{"-NevereverKnowsBest-": [{"0_comments": [{"dulyce3": [{"0_Comment Submission": "Welp, this certainly WON’T get me high, but at least I’ll feel o.k. 🤓", "1_Text": "No big dicking but I'm jealous.. years later and I'm still looking at needing 3 blues for half a nod", "2_Subreddit": "opiates"}], "dulyfz9": [{"0_Comment Submission": "Final question for iv pros", "1_Text": "Are you bevel up?  Are you coming in at an angle?", "2_Subreddit": "opiates"}], "dulym0d": [{"0_Comment Submission": "Final question for iv pros", "1_Text": "Might overload the vein n pop it?  I don't think that is very likely tho.  Like i said I used the Burroughs 'leave it on and let the release pressure suck it in method.  I dunno if this is bad harm reduction but if say make small shots.. boot with tie on and get it off quick", "2_Subreddit": "opiates"}], "dulyyh7": [{"0_Comment Submission": "Final question for iv pros", "1_Text": "Sounds like right form.. I say leave the damn tie on.  Anyone feel welcome to tell me I'm wrong", "2_Subreddit": "opiates"}], "dum4e03": [{"0_Comment Submission": "Final question for iv pros", "1_Text": "I have fucking pvc pipes for vein and always have so I never suffered much damage.. they are huge and plump and juicy..sigh.. after a few years clean and never got bad at all but my heart isn't happy \nBuy micron filters kids..", "2_Subreddit": "opiates"}], "duo0fm0": [{"0_Comment Submission": "The Real Reason the FDA wants kratom banned (Proof)", "1_Text": "What's the difference man?  If its animal cells grown in lab or on cow what is the difference? I don't see a defeated argument.  I see a confusion on your part between theme and aesthetic", "2_Subreddit": "kratom"}], "duo8qrn": [{"0_Comment Submission": "I know they don't look as pretty as blue or green eyes while high but I thought my brown eyes looked cool in this photo.", "1_Text": "How did you escape r / drugs?", "2_Subreddit": "opiates"}], "duu88bx": [{"0_Comment Submission": "Washington Post article, says that Kratom is likely NOT the salmonella culprit", "1_Text": "Why do they always call them drug czars?   I never got that.. sounds like some Soviet,  authoritarian shit.  Why is the person protecting America from its greatest threat to it's freedom (drugs are unamerican ya know) have a foreign sounding, scary name.", "2_Subreddit": "kratom"}], "duu9i2t": [{"0_Comment Submission": "R/guns discovers my drug taking habits from snooping my username and judgement ensues. Am I the only 1 who doesnt dig into everyone's posts?", "1_Text": "Pretty sure dude doesn't live in the u.s... so fuck your laws", "2_Subreddit": "opiates"}], "duuaasj": [{"0_Comment Submission": "Washington Post article, says that Kratom is likely NOT the salmonella culprit", "1_Text": "Not very American at all", "2_Subreddit": "kratom"}], "dv0htb6": [{"0_Comment Submission": "I've lost a lot of weight, a lot of sadness, and a little facial hair. I've gained a whole new appreciation for life. Remember to always love yourself", "1_Text": "Damn bro.  Sick hair", "2_Subreddit": "pics"}], "dv0i60b": [{"0_Comment Submission": "Accurate..", "1_Text": "Y'all's retarded...  Come on bot ...  come on....", "2_Subreddit": "ImGoingToHellForThis"}], "dv9kgtg": [{"0_Comment Submission": "When did you come to your biggest realization about life while on or off opiates and what was your 'revelation'?", "1_Text": "Fuck sobriety and drugs.   Life is a nightmare with long days n short years \n\nEdit.15 years on and off", "2_Subreddit": "opiates"}], "dv9kq5o": [{"0_Comment Submission": "What are the funniest or strangest dealer names you've encountered?", "1_Text": "Nu money high.. chump change when sick.. funny guy", "2_Subreddit": "opiates"}], "dvdl8mq": [{"0_Comment Submission": "fire, are they though?", "1_Text": "They good", "2_Subreddit": "opiates"}], "dvgw5ex": [{"0_Comment Submission": "How much Hydrocodone to OD?", "1_Text": "Oxy, hydro, or jelly donut?", "2_Subreddit": "opiates"}], "dvue3dt": [{"0_Comment Submission": "This hockey game has an \"alone cam\" that shows people who are by themselves", "1_Text": "In germany? Was he a nice guy tho atleast?  Was his fashion sense keen?  How about his appreciation for architecture?", "2_Subreddit": "assholedesign"}], "dwjt1mm": [{"0_Comment Submission": "Drug test for work on Monday morning and I CANNOT lose this job!! Help?", "1_Text": "You will pass.  I'm from a navy town and the squiddies love H or \"H\" partly because with the chinsy, cheap ass navy tests.. they are good In straight 24 hours sometimes.  My boy, close close pal in navy, did it for years and I saw first hand.   If you're thin with fast metabolism and us drink f-loads of water then it's like a 99% your good assuming it's not a super hyper advanced lab spectrocephslorandybandyscope test, which.. I just dunno what's up with them.  They Get Yo Ass on weed tho.", "2_Subreddit": "opiates"}], "dwpjzji": [{"0_Comment Submission": "Now that Easter is over...", "1_Text": "You wouldn't happen to be from  a criminally shitty beach town in the eastern US, mr flipper?", "2_Subreddit": "natureismetal"}], "dwpoyh6": [{"0_Comment Submission": "Elon musk is my god", "1_Text": "Sooo... we all hate Facebook now.?  It seemed so monolithic and permanent.  Nice", "2_Subreddit": "memes"}], "dwsfb4i": [{"0_Comment Submission": "I tossed my rigs tonight - Do the work and you’ll be blessed.", "1_Text": "Digging through the dumpster for the civil war dull rig you stuffed in the empty almond milk carton 2 days previous.\n The thrill.. oh I miss it", "2_Subreddit": "opiates"}], "dwte66g": [{"0_Comment Submission": "Wish me luck, I think a controlled delivery is underway", "1_Text": "What this guy said... who gives s fuck if he is creeped out by trans people.  Being the epitome of the morals of your time means nothing.  Morality is relative, life is meaningless and I bet half y'all ragging on him hardly stand up to the measure of your own moral codes.  Also being a bigot does not mean you are stupid necessarily.. trans people kinda creep me out too.... sorry.  And well..I think dude is half troll", "2_Subreddit": "Drugs"}], "dwtec3b": [{"0_Comment Submission": "Wish me luck, I think a controlled delivery is underway", "1_Text": "Clever.  You sound a bit racist yourself", "2_Subreddit": "Drugs"}], "dwteod3": [{"0_Comment Submission": "HALP", "1_Text": "Am a cop...  need heroin.. dm heroin", "2_Subreddit": "opiates"}], "dwterlw": [{"0_Comment Submission": "And they say they are hard to get .. 🧐", "1_Text": "Is dey weawoow?", "2_Subreddit": "opiates"}]}], "1_submissions": [{"751p1e": [{"0_Title": "Music from the youtube. Junkie folk", "1_Text": "No big dicking but I'm jealous.. years later and I'm still looking at needing 3 blues for half a nod", "2_Subreddit": "opiates"}], "752m3o": [{"0_Title": "Trouble finding mr. Caleb", "1_Text": "No big dicking but I'm jealous.. years later and I'm still looking at needing 3 blues for half a nod", "2_Subreddit": "kratom"}], "7i6jjv": [{"0_Title": "JJ SAVES. JJ HEALS. be kind (to reposters) and JJ will shine his light on YOU!", "1_Text": "No big dicking but I'm jealous.. years later and I'm still looking at needing 3 blues for half a nod", "2_Subreddit": "opiates"}], "7leg15": [{"0_Title": "https://youtu.be/P3QkcAO6b8E World never chances and neither do I", "1_Text": "No big dicking but I'm jealous.. years later and I'm still looking at needing 3 blues for half a nod", "2_Subreddit": "opiates"}], "7lpgk8": [{"0_Title": "Wasting the love of another.(guilty shitpost)", "1_Text": "No big dicking but I'm jealous.. years later and I'm still looking at needing 3 blues for half a nod", "2_Subreddit": "opiates"}]}]}]}