{"ImmaculateConsumptiv": [{"0_comments": [{"dvrggr5": [{"0_Comment Submission": "Thanks to Buzzfeed I now know this exists as a patch for the DEA.", "1_Text": "Not drug related, but the NRO spy satellite patches are pretty cool too https://www.popularmechanics.com/space/satellites/g2728/best-spy-mission-logos/", "2_Subreddit": "opiates"}], "dvri7lf": [{"0_Comment Submission": "Thanks to Buzzfeed I now know this exists as a patch for the DEA.", "1_Text": "Have you seen [WWII-era souvenir lingerie sets](https://www.guermantesvintage.com/wwii-lingerie/)?", "2_Subreddit": "opiates"}], "dvrj880": [{"0_Comment Submission": "Thanks to Buzzfeed I now know this exists as a patch for the DEA.", "1_Text": "Completely. The overtones of possession and objectification are unsettling, but the kinky undercurrent is kinda fascinating.", "2_Subreddit": "opiates"}], "dvwx5gs": [{"0_Comment Submission": "Walgreens won't fill rx bc I bought syringes...", "1_Text": "Inhumanity does seem like policy at Walgreens. The pharmacists there treated me like a violent criminal when I'd go in to get a Suboxone script filled. Granted, that location was very close to a known open-air drug market so I imagine they've dealt with some shit, but I was just a calm, polite person coming in after work to pick up the medicine I was using to try and fix my life. You'd think they'd view that more favorably. Luckily I had an empathetic doctor who was able to suggest a friendlier pharmacy and I stopped going there.", "2_Subreddit": "opiates"}], "dwbw9t3": [{"0_Comment Submission": "Another policy update: the community members have spoken!", "1_Text": "You joke, but at a party I attended in a decadent maze of a west coast drug hippie house, in a half-height room that was mostly lounge cushions was the Agar-Agar Bar-Bar, serving homemade vegan drug jello-shots: Orange Oxycodone, Coconut Codeine, etc. They were just a few dollars each.", "2_Subreddit": "opiates"}], "dwbxemn": [{"0_Comment Submission": "Continuing the poppy fashion posts:Poppy flower shoes!", "1_Text": "I enjoy these, please keep posting finds. Also [look at these damn pants!!](https://cdna.lystit.com/photos/3161-2015/07/18/alexander-mcqueen-poppy-poppy-brocade-trousers-red-product-1-912966341-normal.jpeg)", "2_Subreddit": "opiates"}], "dwwitzc": [{"0_Comment Submission": "Do you acquire your suboxone from your family doctor, clinic or psychiatrist?", "1_Text": "I got mine from a clinic when I was on them too. I was lucky enough to live in a city with access to a clinic that had a really progressive addiction treatment program, although they offered primary care, emergency and other services as well. Being respected by the doctors there was an important part of my recovery (usually do not trust drs at all), and I'm sure it would have gone much differently for me if I had not been dealing with people that treated me like a human being. Happy to answer any questions about my experience. \n\nIf you want to know which clinic it was, you can pm me. Don't want to get in trouble for naming a location (even though I don't live there anymore) unless mods think its okay.", "2_Subreddit": "opiates"}], "dwwj3pl": [{"0_Comment Submission": "Taper Schedule--Need help.", "1_Text": "Volumetric dosing will help you taper with the sub pills. If you crush and dissolve each pill in the same amount of water, you can measure the dosing a lot more accurately. You just need a calibrated dropper.", "2_Subreddit": "opiates"}], "dwwjb9c": [{"0_Comment Submission": "Do you acquire your suboxone from your family doctor, clinic or psychiatrist?", "1_Text": "Thought so. :) Appreciate you guys running a tight ship.", "2_Subreddit": "opiates"}]}], "1_submissions": [{"82wdlp": [{"0_Title": "Comfort in Chaos??", "1_Text": "Not drug related, but the NRO spy satellite patches are pretty cool too https://www.popularmechanics.com/space/satellites/g2728/best-spy-mission-logos/", "2_Subreddit": "opiates"}]}]}]}