{"katakl": [{"0_comments": [{"dvuk4nf": [{"0_Comment Submission": "Four-Leaf Clover", "1_Text": "Yes- if you wrote this, it is amazing. I relate to it a lot and it’s very well written", "2_Subreddit": "opiates"}], "dvvlfht": [{"0_Comment Submission": "jj was looking out big time yesterday", "1_Text": "I love hearing this, I’ve alwayss said drug dealing needs to be run like any other business, supply and demand, take the drug part out of it and pretend you’re selling any other product. Lol if only. That’s awesome, though. Happy nodding.", "2_Subreddit": "opiates"}], "dvwbu7a": [{"0_Comment Submission": "Not directly linked to opiates but still...", "1_Text": "Same here", "2_Subreddit": "opiates"}], "dvwl8rd": [{"0_Comment Submission": "Friends Vs Junkie Friends", "1_Text": "Damn I’ve been thinking about this lately too, I really don’t have anyone and I’ve outgrown a lot of my friends if that makes sense. Sorry to hear about it bro, you’ve only got yourself.", "2_Subreddit": "opiates"}], "dw33q76": [{"0_Comment Submission": "DJ screw is perfect music for the opiate high", "1_Text": "haven’t met anyone on here from htown, nice to meet you 😄", "2_Subreddit": "opiates"}], "dw33vmb": [{"0_Comment Submission": "Frequently waking up at night after getting high?", "1_Text": "Lol!! I love this too, I was just wondering why it happened. I’m always burning holes in my sheets too.", "2_Subreddit": "opiates"}], "dw6e1j5": [{"0_Comment Submission": "The frustration of losing a dealer’s contact info..", "1_Text": "This doesn’t go for all dealers as it can be super sketch, but I used to chill with my dealer too and we had mutual buddies and I have his Facebook. Maybe try something like that in the future. Sorry about that man.", "2_Subreddit": "opiates"}], "dwbdg5h": [{"0_Comment Submission": "E795 10MG PANDA", "1_Text": "I just teared up a little, omg. I can’t find any in my area.", "2_Subreddit": "opiates"}], "dwhvsje": [{"0_Comment Submission": "Well, we have all been in this predicament.....", "1_Text": "Lmao!! I did this once with a little pill bottle, smaller than the 3 hr energy. It worked.", "2_Subreddit": "opiates"}], "dwhzghh": [{"0_Comment Submission": "Relatable addict story", "1_Text": "The drug test, ruined the whole thing", "2_Subreddit": "opiates"}], "dwi3ndz": [{"0_Comment Submission": "Relatable addict story", "1_Text": "Appreciate it! She can kick me out at anytime, I’ve learned it’s always way better for me to just not argue with her. I’m moving out this summer. \n\nAlso, no I really didn’t mean to drop it, I knew either way I was going to have to take a test. We had to drive and get another one. It was just ironically the worst thing that could’ve happened and I managed to do it. Lol. \n\nLastly, I didn’t have 5 months, but that’s what she thought so this was a big deal. I’ve been chipping for the last 6 months.", "2_Subreddit": "opiates"}], "dwih993": [{"0_Comment Submission": "Relatable addict story", "1_Text": "Lmao!! It rained hard the next morning but I still went back. Didn’t find it. I wish I had been sober and smarter and just put it somewhere more logical. This new dope had me gone.", "2_Subreddit": "opiates"}], "dwjwesg": [{"0_Comment Submission": "Relatable addict story", "1_Text": "I wasn’t on top of it, that’s the problem in my story. I usually am, I’ve faked many tests and passed with her but this new dope was better than I expected it to be. It all worked out though, I didn’t get kicked out and things are good. lol.", "2_Subreddit": "opiates"}], "dwk90hs": [{"0_Comment Submission": "What grandma said", "1_Text": "Underrated reply, lol", "2_Subreddit": "WhitePeopleTwitter"}], "dwkauqv": [{"0_Comment Submission": "I think we can all relate", "1_Text": "True", "2_Subreddit": "opiates"}], "dwkc4h5": [{"0_Comment Submission": "I think we can all relate", "1_Text": "I do workout, it’s actually the only healthy outlet I have hahah, thanks dude!! It’s more like when I’m waiting in my car for my dealer to pull up and he’s like an hr late. Over a span of time, I don’t even want to know what it’s added up do. But I might start telling them to meet me by a gym or something and stay productive lol.", "2_Subreddit": "opiates"}], "dwklg3f": [{"0_Comment Submission": "Going to sleep high makes your bed feel like it does when you wake up in the morning but at night [7]", "1_Text": "Never heard it in words but I love it", "2_Subreddit": "trees"}], "dwl5zwo": [{"0_Comment Submission": "Want to be a police officer but also want to try weed", "1_Text": "Honestly I bet most cops have smoked weed in the past.. cope aren’t perfect angels lmao. trying it a couple times now and not doing it again would be perfectly fine. I don’t see why it would come up in your career other than them asking if you have had a previous drug problem but smoking were a couple times isn’t a drug problem.", "2_Subreddit": "trees"}], "dwlfhe6": [{"0_Comment Submission": "Cold copped China white for the 1st time", "1_Text": "There’s China in the USA..", "2_Subreddit": "opiates"}], "dwlkskx": [{"0_Comment Submission": "I like getting high and making these", "1_Text": "I would buy some of these, omg", "2_Subreddit": "trees"}], "dwm6quj": [{"0_Comment Submission": "Just out of curiosity", "1_Text": "White chick, only know white people that use tbh and one Hispanic", "2_Subreddit": "opiates"}], "dwm6xl5": [{"0_Comment Submission": "Runny nose wasting dope??", "1_Text": "This happens to me too and the dope makes my nose runny. I usually blow my nose before, snort it and lay down for a few mins. That way it will stay in my nose. If it’s still runny and you feel like it’s coming out, try to snort a little bit of water to get the drip down. Hopefully that helps", "2_Subreddit": "opiates"}], "dwmbvr3": [{"0_Comment Submission": "i’m fiending like a bitch rn", "1_Text": "This is what I feel like after taking stims and painfully watching the sun come up for the 3rd day in a row", "2_Subreddit": "opiates"}], "dwofl9w": [{"0_Comment Submission": "Meth Vaping Noob", "1_Text": "I totally agree with the other person who replied to this, just wanted to add that you can wipe it on a dry towel after you’re done to wipe off the bottom of the bowl where the flame was so you don’t have to clean it as much. It’s not really that important honesty, personal preference. Start rolling as soon as you see a little smoke come out the top. Good luck.", "2_Subreddit": "Stims"}], "dww82bx": [{"0_Comment Submission": "Quitting is impossible because I'd rather die than be sober", "1_Text": "I felt this too, sad shit.", "2_Subreddit": "opiates"}]}], "1_submissions": [{"81z6z2": [{"0_Title": "Frequently waking up at night after getting high?", "1_Text": "Yes- if you wrote this, it is amazing. I relate to it a lot and it’s very well written", "2_Subreddit": "opiates"}], "84ndiq": [{"0_Title": "Addicted again ? :/", "1_Text": "Yes- if you wrote this, it is amazing. I relate to it a lot and it’s very well written", "2_Subreddit": "opiates"}], "8851ax": [{"0_Title": "Relatable addict story", "1_Text": "Yes- if you wrote this, it is amazing. I relate to it a lot and it’s very well written", "2_Subreddit": "opiates"}]}]}]}