{"Fullofit619": [{"0_comments": [{"du8q0zm": [{"0_Comment Submission": "Fuck me to your heart's content for Valentine's Day [f]", "1_Text": "Keeper", "2_Subreddit": "RealGirls"}], "dufmne8": [{"0_Comment Submission": "Backyard bowling alley, with pins resetting via strings", "1_Text": "Well that's sure a /r/killthecameraman if I've ever seen one.", "2_Subreddit": "pics"}], "dv26di7": [{"0_Comment Submission": "You all asked for the blunt passer in action...", "1_Text": "I think he's saying forget to use it altogether, not when it arrives.", "2_Subreddit": "StonerEngineering"}], "dvetjuk": [{"0_Comment Submission": "A harmless prank", "1_Text": "And also, I don't think cops would ever actually arrest a kid of this age, so there's that, as far as that type stuff goes. Yes. And also, maybe but probably.", "2_Subreddit": "funny"}], "dvkelgq": [{"0_Comment Submission": "I would like to take a moment to vent about the frustrating physics of addiction.", "1_Text": "How do you feel about getting some fake piss from a local smoke shop? It's like $30, comes in a powder form and you just mix it with water and tape the bag to your leg an hour or more before the test to warm it up to body temp. It perfectly mimics urine, it's used to calibrate urine tests. Do you have anything against using it?", "2_Subreddit": "opiates"}], "dvliiaw": [{"0_Comment Submission": "I would like to take a moment to vent about the frustrating physics of addiction.", "1_Text": "I understand your fear of doing something that is against the rules and shady acting, and at the same time I can totally relate to the pain you're feeling, now even stronger than when I wrote you last. So if you need to get some dope so you can get well for now and get some Subs and a good time to kick properly, using the fake pee is really the only sure option you have. It's highly unlikely they'll supervise your UA, even being a government job. They usually only observe in rehabs and parole/probation tests. I used to have to test for work through this testing facility that only did drug tests, and they only had me empty my pockets and lock them in a case while I UA'd. No pat down, just sent me in the bathroom alone. Idk man just trying to give you an option because I know how bad youre feeling, and adding the stress of the upcoming test can't be helping. Not tryin to push you in any direction, just wanted to help. Hope you feel better soon, whatever the case may be.", "2_Subreddit": "opiates"}], "dvomw0a": [{"0_Comment Submission": "Brown", "1_Text": "Sauceeeee", "2_Subreddit": "Innie"}], "dvpb9ta": [{"0_Comment Submission": "My father in law just made us this awesome bookshelf", "1_Text": "I thought this was just made out of rare cracked cedar. Grows in small, remote forests in Western Syria. I could be wrong though. Not likely, but certainly possible.", "2_Subreddit": "pics"}], "dvpq5xk": [{"0_Comment Submission": "'Splitting From The Norm'. A 16-year old from a local school has made an insanely awesome piece.", "1_Text": "Are there any \"first person to do X loses\" type of rules? Or is everyone just drinking to the song cues only? And do you alternate who starts each time? Seems like the same position in the circle would get fucked every time, and it seems like it'd be easy to determine and stand elsewhere. Probly looking way too far into it, just had to ask to clarify because I love me a good drinking game.", "2_Subreddit": "woodworking"}], "dw1cubd": [{"0_Comment Submission": "2meirl4meirl", "1_Text": "This isn't the Onion.", "2_Subreddit": "2meirl4meirl"}], "dw5hjye": [{"0_Comment Submission": "I would like to take a moment to vent about the frustrating physics of addiction.", "1_Text": "What ended up happening? Are you still maintaining with the kratom? You will have some withdrawals from the kratom if you take it too long, usually for a couple months or more. The way to use the kratom is to take only how much you need to curb the withdrawal symotoms for about a week, then start tapering down your dose, by about a gram or 1,5 per day, depending on how much you're taking. Hope all is well with you.", "2_Subreddit": "opiates"}], "dw8xuml": [{"0_Comment Submission": "I hand fed a bumblebee today", "1_Text": "Hi there, nice to see ya. Bumblebee tuna.", "2_Subreddit": "mildlyinteresting"}], "dw9onyu": [{"0_Comment Submission": "Hospital staff of Reddit, what is an ER moment that has scarred you for life? [NSFW]", "1_Text": "Why didn't he get in the car with her to drive to the nearest city (where hopefully there was a hospital) rather than drive there for the ambulance to have to drive back? I mean, no skin on the torso is gnarly, and he was probably bleeding a lot. Although if it's a matter of time to save his life, seems like waiting there would take too long.", "2_Subreddit": "AskReddit"}], "dwarbrv": [{"0_Comment Submission": "Let’s put her face right in the middle", "1_Text": "Dental. Plan.", "2_Subreddit": "CrappyDesign"}], "dwbqx3e": [{"0_Comment Submission": "These two mates saw their opportunity and took it.", "1_Text": "Yeah if you're lucky enough to live in one of the states where medicinal and/or recreational use has been legalized, they sell those \"genetic modifications\" in a storefront. They call them \"dispensaries\" for some reason.", "2_Subreddit": "videos"}], "dwcpet6": [{"0_Comment Submission": "TIL an ad had children looking at the ad see a photo of an abused boy, a help hotline and the message “if somebody hurts you, phone us and we’ll help you” while adults can only see an unbruised photo of the boy with the text “Sometimes child abuse is only visible to the child suffering it.”", "1_Text": "The Poopsmith..", "2_Subreddit": "todayilearned"}], "dwdekir": [{"0_Comment Submission": "Japanese sunrise dovetail joint", "1_Text": "Gorilla glue. Strong stuff. Food doesn't stand a chance against one of those joints.", "2_Subreddit": "woahdude"}], "dwenoh0": [{"0_Comment Submission": "Canada teen wins $1000 a week for life on 18th birthday", "1_Text": "Those taxes aren't factored in when calculating an annual salary.", "2_Subreddit": "news"}], "dwik8zq": [{"0_Comment Submission": "Next level trick shot", "1_Text": "My fingers hurt. Awww, well now your back's gonna hurt, cuz you just pulled landscaping duty. Anyone else's fingers hurt?", "2_Subreddit": "gifs"}], "dwmalij": [{"0_Comment Submission": "Sinclair's script for the local news stations that they own", "1_Text": "This is extremely dangerous for our democracy.", "2_Subreddit": "television"}], "dwnu8m5": [{"0_Comment Submission": "Anyone know what this is? I’m used to getting BTH, but this showed up today....", "1_Text": "Soooo... How was it?", "2_Subreddit": "opiates"}], "dwxxymh": [{"0_Comment Submission": "I enjoy combining animals in photoshop. Here's the stupidest one so far", "1_Text": "Exactly what I was gonna put, manatee!", "2_Subreddit": "pics"}], "dwxy5oo": [{"0_Comment Submission": "[OC] Kangarooster", "1_Text": "Cockadoodledon't ya reckon mate?", "2_Subreddit": "HybridAnimals"}], "dwxynnw": [{"0_Comment Submission": "I enjoy combining animals in photoshop. Here's the stupidest one so far", "1_Text": "Threeché", "2_Subreddit": "pics"}], "dwyd484": [{"0_Comment Submission": "Picture of a Single Atom Wins Science Photo Contest", "1_Text": "Bob Ross", "2_Subreddit": "interestingasfuck"}]}], "1_submissions": [{"2b227l": [{"0_Title": "Stay With Me - Sam Smith (Cover by Dylan Hyde)", "1_Text": "Keeper", "2_Subreddit": "coversongs"}], "2btjy6": [{"0_Title": "Wait, how much for that new Samsung TV?", "1_Text": "Keeper", "2_Subreddit": "pics"}], "2btlfx": [{"0_Title": "Wait, how much is that new Samsung TV?", "1_Text": "Keeper", "2_Subreddit": "pics"}], "2n0z6k": [{"0_Title": "Otherwise known as Taco Bell..", "1_Text": "Keeper", "2_Subreddit": "funny"}], "6m826g": [{"0_Title": "Lake Huron also has caps for sale", "1_Text": "Keeper", "2_Subreddit": "pics"}]}]}]}