{"katbitch143": [{"0_comments": [{"dvpdh4f": [{"0_Comment Submission": "Anyone else really happy about Kevin? [SPOILER]", "1_Text": "Yes!!! Omg lmao that’s exactly what I thought", "2_Subreddit": "thisisus"}], "dw1du54": [{"0_Comment Submission": "My parents won’t quit smoking. Help?", "1_Text": "If they want to quit, they will. It has nothing to do with you. They love you very much, but they made the decision to smoke before you and it’s a hard addiction to overcome. The only way for them to quit is them to want to, which them ignoring your concerns shows that they don’t want to and they don’t do it to hurt you. I understand you’re worried, I’m sorry to be blunt but some people smoke and some people don’t. Maybe try to get them a vape with nicotine in it? They can puff on that while still smoking, and they can try to taper off it. A lot cheaper too! Good luck 😌 your parents love you and aren’t smoking to try to hurt you! ❤️", "2_Subreddit": "confessions"}], "dw4ybk2": [{"0_Comment Submission": "You know you're an adult when you actually don't google something someone tells you not to.", "1_Text": "Why would someone tell you not to google something unless you’re in school? And why would that make you an adult...? I find this post sort of pointless. Sorry.", "2_Subreddit": "Showerthoughts"}], "dw4yviw": [{"0_Comment Submission": "Halo Beauty Customer Service", "1_Text": "Wish this launch didn’t make me dislike Tati. I’ve always enjoyed her videos, and after the videos she’s made about this brand and what’s she’s said about her consumers having concerns and blocking them, I’ve lost all respect. She needs to grow up. I can’t even watch a new video that doesn’t relate to this without rolling my eyes because of her behavior. :(", "2_Subreddit": "BeautyGuruChatter"}], "dw51ddv": [{"0_Comment Submission": "You know you're an adult when you actually don't google something someone tells you not to.", "1_Text": "I think being an adult would mean knowing what those are without a google search. Lol", "2_Subreddit": "Showerthoughts"}], "dwg9nag": [{"0_Comment Submission": "Safiya dresses up like the Bratz Dolls from the 2000s", "1_Text": "But why..? Lol no hate I just don’t really get the point haha. Love her videos buying stuff from websites and ads and whatnot.\nEdit: chill out. Lol.", "2_Subreddit": "BeautyGuruChatter"}], "dwhnqhd": [{"0_Comment Submission": "What do you guys like to do when you’re on benzos?", "1_Text": "Second this! No seizure worry. I like to smoke a few bowls, eat everything in sight and eventually fall asleep. I tend to be pretty responsible on xanax actually and rarely agree to going out on it and if I do, always leave my wallet at home. A few years back me and my boyfriend took a couple bars walked to the gas station and apparently I took 120 dollars out and spent it on cigs and all candy. Called the bank the next day, said I had no recollection of ever doing that (wasn’t exactly a lie, haha) and got my money back. Lol. From that day I always hide my money before I take bars.", "2_Subreddit": "benzodiazepines"}], "dwhnztb": [{"0_Comment Submission": "After around 10 - 14 days of benzo use...", "1_Text": "No, you should have some trouble falling asleep but no seriously wd symptoms at all. If you smoke weed, that does the trick for me to fall asleep after a benzo binge. Was prescribed 90 a month for 3 months, stopped getting them, smoked bud as I usually do and had no problem. Also gone on longer binges before and never had a problem and I don’t know why. Guess I’m just lucky? Watched my mom go through TERRIBLE wds using the same amount of time I did while I was fine. Weird stuff. But after 2 weeks, you should most definitely be good dude.", "2_Subreddit": "benzodiazepines"}], "dwho7dh": [{"0_Comment Submission": "Does sleeping kills benzo high?", "1_Text": "Yes and no. Most of the time it does, but with larger doses I’ve woken up the next morning stumbling getting out of bed. I almost always get an afterglow though.", "2_Subreddit": "benzodiazepines"}], "dwimmv9": [{"0_Comment Submission": "When I am bored I watch Younique lives on Facebook. This chick is one of the best to watch. She calls people retarded, her make up is awful, she is always trying to get people to join her team, and there is a good chance she is high in every single video. Proves anyone can pay to join this company.", "1_Text": "Can I have a pm please? ❤️", "2_Subreddit": "antiMLM"}], "dwn54ta": [{"0_Comment Submission": "In for a night of restless legs.", "1_Text": "Worst feeling ever. Never gotten it from WDs as I’m not a daily user of opioids(only stick to pills when I come across them) but I get crazy RLS a lot. Even gotten it in my arms at times, no clue why. Been getting it since I was young. Sucks to wake up with it at 3 am and have no choice but to take a walk around the block. Good luck! Smoking weed helps me sometimes, or at least I like to think it does.", "2_Subreddit": "opiates"}], "dwn5bki": [{"0_Comment Submission": "Dr Phil trying to help Heroin addicts by threatening them and looking down on them pisses me off", "1_Text": "Dr. Phil is mostly scripted. Obviously, the people on there do have a problem and need help, most of the time end up so going to rehab, but the show always makes one person be a protagonist and an antagonist, making one person seem worse than they are and editing it to portray it that way. Sorry if I’m not explaining this right. So, a lot of it is fake if it’s keeping you up at night. Lmfao. I think it’s a good thing though that he gets these people help.", "2_Subreddit": "opiates"}], "dwn5gbm": [{"0_Comment Submission": "So I got a care package from back home and it was a box of highschool nostalgia enjoy my cringey I'm a cool kid Vicodin ES shirt.", "1_Text": "Where did your friend get it?! Lol I love it!", "2_Subreddit": "opiates"}], "dwnbsjy": [{"0_Comment Submission": "So I got a care package from back home and it was a box of highschool nostalgia enjoy my cringey I'm a cool kid Vicodin ES shirt.", "1_Text": "Thanks!", "2_Subreddit": "opiates"}], "dwnph0y": [{"0_Comment Submission": "No One.", "1_Text": "Happy birthday!!🎉🎂🎊 ❤️", "2_Subreddit": "confession"}], "dwpgavb": [{"0_Comment Submission": "Jeffree Star commenting on Tarte’s April Fools palette", "1_Text": "Unfortunately the Jaclyn hill palette was also really warm too :(", "2_Subreddit": "BeautyGuruChatter"}], "dwrijps": [{"0_Comment Submission": "Hate to beat a dead horse, but help with undertones and foundation shade?", "1_Text": "Very confused with my undertones, have no clue what I am. Pink undertones tend to look orange and very gray-like on me, where as very yellow foundations also look dark and funny on me. I believe I was wearing the nyx cover drops in porcelain in this picture. Also don’t mind my eyebrows, I was growing them out at the time hahaha. Thanks in advance! ❤️", "2_Subreddit": "PaleMUA"}], "dwrouia": [{"0_Comment Submission": "Hate to beat a dead horse, but help with undertones and foundation shade?", "1_Text": "It just doesn’t match me correctly? I feel it pulls a little cool. I’m sorry. I’m not confident in my naked face.", "2_Subreddit": "PaleMUA"}], "dwrq7tk": [{"0_Comment Submission": "Hate to beat a dead horse, but help with undertones and foundation shade?", "1_Text": "Thank you!! ❤️", "2_Subreddit": "PaleMUA"}], "dws1zx6": [{"0_Comment Submission": "Hate to beat a dead horse, but help with undertones and foundation shade?", "1_Text": "Never had a thought that I was olive! Thank you! ❤️", "2_Subreddit": "PaleMUA"}], "dws2ude": [{"0_Comment Submission": "Starting EMT certificate in May. Would love some advice.", "1_Text": "Oh my this helped me open my eyes to all the other posts on here. But thank you so much for this amazing comment. I feel so attached to EMS because of the times I have been in an ambulance. I’ve been so inspired by what they do and how they do it with family members. Thank you so much! I’m sure I have a lot to study before my classes so that is why I posted this waaay before my classes began.  ❤️ this made me smile so much. Thank you! ❤️", "2_Subreddit": "ems"}], "dws2zni": [{"0_Comment Submission": "Starting EMT certificate in May. Would love some advice.", "1_Text": "I’d love you to PM me as I am new to reddit. You sound very informative and I’d love to get information from you! Thank you! ❤️❤️❤️", "2_Subreddit": "ems"}], "dws3oxt": [{"0_Comment Submission": "Starting EMT certificate in May. Would love some advice.", "1_Text": "Full/time employee.", "2_Subreddit": "ems"}], "dwu0gy2": [{"0_Comment Submission": "Hate to beat a dead horse, but help with undertones and foundation shade?", "1_Text": "Thank you! I believe it was wet and wild liquid lipstick in give me mocha! ❤️❤️", "2_Subreddit": "PaleMUA"}], "dwu0he1": [{"0_Comment Submission": "Hate to beat a dead horse, but help with undertones and foundation shade?", "1_Text": "Thank you!!❤️❤️", "2_Subreddit": "PaleMUA"}]}], "1_submissions": [{"821y0q": [{"0_Title": "Will alcohol subside anxiousness during a trip?", "1_Text": "Yes!!! Omg lmao that’s exactly what I thought", "2_Subreddit": "LSD"}], "89muha": [{"0_Title": "Starting EMT certificate in May. Would love some advice.", "1_Text": "Yes!!! Omg lmao that’s exactly what I thought", "2_Subreddit": "ems"}]}]}]}