{"Hercules88": [{"0_comments": [{"dvshui3": [{"0_Comment Submission": "Porter potty Kratom break", "1_Text": "Lol Kratom hardly does anything for me besides lift my mood. But I also used to be a raging drug addict. So obviously I don’t find Kratom to be a “high” at all. It’s very subtle.", "2_Subreddit": "kratom"}], "dwjptxt": [{"0_Comment Submission": "Drug test for work on Monday morning and I CANNOT lose this job!! Help?", "1_Text": "I actually was looking into that. My head shop in my town carries the kind “ X stream” but I’m nervous if those things actually work. Have you ever heard of it?", "2_Subreddit": "opiates"}], "dwjq2qb": [{"0_Comment Submission": "Drug test for work on Monday morning and I CANNOT lose this job!! Help?", "1_Text": "Oh nice thank god . I don’t know why I’m still stessing about it then when I know I have the answer. lol I just have kid number 3 on the way and he should be here anyway now and I pay all the bills for my household so if I were to lose this job my family would be so fucked.", "2_Subreddit": "opiates"}], "dwjq891": [{"0_Comment Submission": "Drug test for work on Monday morning and I CANNOT lose this job!! Help?", "1_Text": "I don’t know. I just get sent to an urgent care to get my test done. I don’t know if they dip it there or sent it to a lab.", "2_Subreddit": "opiates"}], "dwjwvpz": [{"0_Comment Submission": "Drug test for work on Monday morning and I CANNOT lose this job!! Help?", "1_Text": "I thought of that. Until I remembered that my girlfriends dad is my bosses , bosses , boss. Lol!!", "2_Subreddit": "opiates"}], "dwmlbz1": [{"0_Comment Submission": "Hey guys don't be like me, I just want to mention something to watch out for.", "1_Text": "Kratom helps me go? After I dose about five minutes later it’s time to go! Lol I just must be a lucky one.", "2_Subreddit": "kratom"}], "dwmmszz": [{"0_Comment Submission": "Holy shit (just was cleaning out garage and found these!!) how do I get the most use out of these?", "1_Text": "I used to get the 75mcgs and cut them in half and put them in my bottom lip like you would with chewing Tabacco. Except you don’t spit . You swallow ;) lol enjoy", "2_Subreddit": "opiates"}], "dwn53zs": [{"0_Comment Submission": "Different types of NY Dope? New user", "1_Text": "100 a bun is twice what you should be paying. But if your enjoying it than so be lol", "2_Subreddit": "opiates"}], "dwnnrim": [{"0_Comment Submission": "Different types of NY Dope? New user", "1_Text": "True. Yeah I pay 40-50", "2_Subreddit": "opiates"}], "dwtjpic": [{"0_Comment Submission": "Over 2 grand right here", "1_Text": "2 G’s? Your crazy. But cheers!", "2_Subreddit": "opiates"}], "dwtkpvw": [{"0_Comment Submission": "Over 2 grand right here", "1_Text": "Good thing. Or else I would have considered you retarded. Either that or just filthy rich and don’t give a fuck about money. 😂", "2_Subreddit": "opiates"}], "dwtktpb": [{"0_Comment Submission": "I passed my drug test for my job using “XSTREAM” synthetic urine. THANK GOD!!!", "1_Text": "Hmm she must of bought a shitty brand... I always do my research for reviews online before I ever try to do such a thing requiring that much risk. And it payed off. Normally I use a friends clean piss and just heat it up and use hand warmers to keep it at 98-100 degrees . But since I moved to a new state for this job I didn’t know anyone and had to take the synthetic route.", "2_Subreddit": "opiates"}], "dwtlgyz": [{"0_Comment Submission": "I passed my drug test for my job using “XSTREAM” synthetic urine. THANK GOD!!!", "1_Text": "That sucks man. I know a lot of friends that have used the same kind that I got and others.... works everytime . Which is why I bought the brand that I bought. Luckily I didn’t go into it blind like her. Sorry about your guys luck tho fella! Hopefully you start to get better things happening your guys way..", "2_Subreddit": "opiates"}], "dwtnfow": [{"0_Comment Submission": "I passed my drug test for my job using “XSTREAM” synthetic urine. THANK GOD!!!", "1_Text": "Lmao nice", "2_Subreddit": "opiates"}], "dwtokde": [{"0_Comment Submission": "Anyone tried kratom from local tobacco store?", "1_Text": "Yeah it’s a bit or miss honestly... don’t take any ones word on tobacco/head shops Kratom except for your own experience. So many people on this site swear up and down that you can get “ no good Kratom” from a local store. But I have come to find it is total bull shit. Don’t get me wrong you can find some great vendors online...but let me fill you in ( and everybody else in) on a little information... EVEN PEOPLE THAT OWN HEAD SHOPS HAVE TO BUY IT BASICALLY FROM THE SAME ONLINE VENDORS AS EVERYONE ELSE IN THE UNITED STATES. And I’m sure that they don’t want to be buying and selling garbage Kratom to get a bad rep for their selves . So with that being said it wouldn’t be logical to sell shitty Kratom out of your store. Is it possible that people have gotten shitty Kratom from a head shop? Absolutly. And it’s just as possible to get shitty Kratom from and online vendor ... bad batches are bad batches no matter who orders them. Now one substantial difference I can tell you basically is the price. Obviously tho because the store has to make their money as well.. cheers!", "2_Subreddit": "kratom"}], "dwtope2": [{"0_Comment Submission": "Nothing beats having enough that I can probably out running withdrawal for a while", "1_Text": "That looks like having enough to keep me from witdrawal for about 6-8 hours lol.", "2_Subreddit": "opiates"}], "dwtowuh": [{"0_Comment Submission": "I dosed 4 grams of kratom at 11am. How long should I wait to snort my H so that I don't waste the high?", "1_Text": "I normally am fine after about 3 hours .. especially if I eat something too! If you want to get High really bad... eat something to fill your stomach to wear off the Kratom efffects faster so that you can get High quicker.", "2_Subreddit": "opiates"}], "dwtoyqu": [{"0_Comment Submission": "I dosed 4 grams of kratom at 11am. How long should I wait to snort my H so that I don't waste the high?", "1_Text": "For me... I still get just as high! No doubt. But for some reason the rush isn’t as strong... still get one. Just not as intense if that makes sense", "2_Subreddit": "opiates"}], "dwtp2r0": [{"0_Comment Submission": "Pin point pupils", "1_Text": "I have green eyes.. and the same thing happens to mine! They turn even more bright bright green SCREAMING HEY LOOK AT ME IM ON DOPE 😂", "2_Subreddit": "opiates"}], "dwtp80t": [{"0_Comment Submission": "I passed my drug test for my job using “XSTREAM” synthetic urine. THANK GOD!!!", "1_Text": "Good SHIT! Mine wasn’t a DOT. Just a regular one. I just wear very tight boxer briefs that day and hide the bottle under my nuttsack in between that and my asshole/buttcheeks and then bam. Stays nice and hot and I pass the piss test. 😁😂", "2_Subreddit": "opiates"}], "dwtpd9u": [{"0_Comment Submission": "I passed my drug test for my job using “XSTREAM” synthetic urine. THANK GOD!!!", "1_Text": "The stuff I used was literally $16 after tax.... has all the metabolites like creatine, etc. that piss should have in it. Even has a slight smell of piss to it as well. Looks just like it and bubbles just like it. And I didn’t even spent $20. But like I said earlier... I did my research on the internet for a few hours to find the best synthetic urine and the best bang for my buck....", "2_Subreddit": "opiates"}], "dwtphg0": [{"0_Comment Submission": "I passed my drug test for my job using “XSTREAM” synthetic urine. THANK GOD!!!", "1_Text": "Lol yeah that would call for a long day! And yeah thanks bro . I was sweatin it honestly. Cause like I said earlier... this was my first time using synthetic urine. Normally I use a friends piss that is clean . And I know that stuff can’t fail because well... it’s real pee! Lmao. But thank god I did my research and I passed!!", "2_Subreddit": "opiates"}], "dwtuekz": [{"0_Comment Submission": "I passed my drug test for my job using “XSTREAM” synthetic urine. THANK GOD!!!", "1_Text": "Lol no. Some ECP/fent mix.", "2_Subreddit": "opiates"}], "dwv42ud": [{"0_Comment Submission": "I passed my drug test for my job using “XSTREAM” synthetic urine. THANK GOD!!!", "1_Text": "Fetish for passing drug tests lol", "2_Subreddit": "opiates"}], "dww0f9r": [{"0_Comment Submission": "I passed my drug test for my job using “XSTREAM” synthetic urine. THANK GOD!!!", "1_Text": "Just got it from my local head shop. It’s call “Xstream” . That’s the name of it. Xstream synthetic urine. You can buy it online if yuh want to. But from what I have noticed almost every head shop that carries synthetic piss carries Xstream.🔑", "2_Subreddit": "opiates"}]}], "1_submissions": [{"83o9hy": [{"0_Title": "Trainwreck", "1_Text": "Lol Kratom hardly does anything for me besides lift my mood. But I also used to be a raging drug addict. So obviously I don’t find Kratom to be a “high” at all. It’s very subtle.", "2_Subreddit": "kratom"}], "84ifh0": [{"0_Title": "Why does Kratom foam when mixed with juices? Lol I have always wandered that.", "1_Text": "Lol Kratom hardly does anything for me besides lift my mood. But I also used to be a raging drug addict. So obviously I don’t find Kratom to be a “high” at all. It’s very subtle.", "2_Subreddit": "kratom"}], "84mrmf": [{"0_Title": "Porter potty Kratom break", "1_Text": "Lol Kratom hardly does anything for me besides lift my mood. But I also used to be a raging drug addict. So obviously I don’t find Kratom to be a “high” at all. It’s very subtle.", "2_Subreddit": "kratom"}], "88dalw": [{"0_Title": "Drug test for work on Monday morning and I CANNOT lose this job!! Help?", "1_Text": "Lol Kratom hardly does anything for me besides lift my mood. But I also used to be a raging drug addict. So obviously I don’t find Kratom to be a “high” at all. It’s very subtle.", "2_Subreddit": "opiates"}], "89u907": [{"0_Title": "I passed my drug test for my job using “XSTREAM” synthetic urine. THANK GOD!!!", "1_Text": "Lol Kratom hardly does anything for me besides lift my mood. But I also used to be a raging drug addict. So obviously I don’t find Kratom to be a “high” at all. It’s very subtle.", "2_Subreddit": "opiates"}]}]}]}