{"70xyz": [{"0_comments": [{"dfq7d36": [{"0_Comment Submission": "I can't stop relapsing", "1_Text": "since middle school, I'm in my last year of highschool", "2_Subreddit": "SuicideWatch"}], "dhnjcfa": [{"0_Comment Submission": "tomorrow might be the day", "1_Text": "they're abusive and i don't have any friends", "2_Subreddit": "SuicideWatch"}], "dr81qhh": [{"0_Comment Submission": "Autistic friend won't respect my boundaries", "1_Text": "Thank you, I definitely don’t deserve that kind of stress. I think I kept giving him the benefit of the doubt but I knew something was wrong with all of this and I should’ve trusted my gut. Thank God nothing severely escalated, I’m cutting him off entirely.", "2_Subreddit": "offmychest"}], "drtvlnv": [{"0_Comment Submission": "What complications arise if you amputate a leg, sew on a different human leg and than remove it so it’s amputated again?", "1_Text": "Why do you do that to everyone?", "2_Subreddit": "morbidquestions"}], "drtvtf2": [{"0_Comment Submission": "What complications arise if you amputate a leg, sew on a different human leg and than remove it so it’s amputated again?", "1_Text": "I watch a lot of Grey's Anatomy and I love reading up on rare medical cases. The question came into mind when I couldn't sleep and I knew that some complications arise but I couldn't think of anything else other than infections, I was just curious to know is all.", "2_Subreddit": "morbidquestions"}], "dvgonuh": [{"0_Comment Submission": "I just can't hit myself no matter how hard I try.", "1_Text": "I know I’m still having trouble, a tourniquet helped at first. When that doesn’t work and I’m still struggling for half an hour, I take a hot, steaming shower. \n\nI hold my arms together, outward and under the shower water, I make sure the water directly hits the area of my veins and I clench my fists. The water doesn’t have to be painfully hot, just hot enough to your comfort.  \n\nI do this throughout my shower for at least 2 minutes or 5 or until I feel like i’m ready. This has worked wonders for me, I inject as soon as I get out of the shower and dry my arms off. I’m able to hit a vein on the first shot. I have tried running my arms under hot water on the sink as an alternative but I haven’t had luck. And my skin feels softer too when I inject after the hot shower method. \n\nI usually do this after I get fed up with looking but I suggest you do it first and than start getting in there.  If you have a detachable shower head it’ll be more convenient to just run the water on your arm. \n\nAlso, I try flailing my arms like a pinwheel to the best of my ability. My bathroom is small so it’s hard to do a complete circle in the shower. I read that it helps sometimes but I haven’t tried it by itself without the shower.\n\nI definitely get the frustration when you can’t find a vein, I once got so worked up and sweaty, I almost had an anxiety attack and I was trying for nearly an hour. I’ve had better luck when someone else does it for me but half the time I don’t have access to another helping hand. \n\nThe shower method has been the second closest thing to having someone do it for me lol. It’s a learning process but you’ll get it. You should take breaks in between try’s and using a new needle after piercing a few times can help. Stay hydrated and relaxed when you’re looking for veins. I hope you’re able to find something that works for you soon!", "2_Subreddit": "opiates"}], "dwmw821": [{"0_Comment Submission": "Just out of curiosity", "1_Text": "Black, Latina, Native American here", "2_Subreddit": "opiates"}]}], "1_submissions": [{"6320jz": [{"0_Title": "I can't be helped and I can't receive it", "1_Text": "since middle school, I'm in my last year of highschool", "2_Subreddit": "SuicideWatch"}], "6b1yqi": [{"0_Title": "Being alive is mentally painful", "1_Text": "since middle school, I'm in my last year of highschool", "2_Subreddit": "SuicideWatch"}], "6bdj4y": [{"0_Title": "tomorrow might be the day", "1_Text": "since middle school, I'm in my last year of highschool", "2_Subreddit": "SuicideWatch"}], "6fdtww": [{"0_Title": "Being blackmailed", "1_Text": "since middle school, I'm in my last year of highschool", "2_Subreddit": "rape"}], "6fxbe8": [{"0_Title": "Child abuse", "1_Text": "since middle school, I'm in my last year of highschool", "2_Subreddit": "legaladviceofftopic"}], "6osgfk": [{"0_Title": "Pennsylvania, US. Slow walking, quarter size, always found dead near the porch in the morning.", "1_Text": "since middle school, I'm in my last year of highschool", "2_Subreddit": "whatsthisbug"}], "70usbh": [{"0_Title": "Why do some animals show off their babies to humans?", "1_Text": "since middle school, I'm in my last year of highschool", "2_Subreddit": "NoStupidQuestions"}], "7jok5b": [{"0_Title": "Autistic friend won't respect my boundaries", "1_Text": "since middle school, I'm in my last year of highschool", "2_Subreddit": "offmychest"}], "7mcv8z": [{"0_Title": "What complications arise if you amputate a leg, sew on a different human leg and than remove it so it’s amputated again?", "1_Text": "since middle school, I'm in my last year of highschool", "2_Subreddit": "morbidquestions"}], "81lg7m": [{"0_Title": "My syringe exchange count was 100", "1_Text": "since middle school, I'm in my last year of highschool", "2_Subreddit": "opiates"}]}]}]}