{"PillMomThrow": [{"0_comments": [{"dwiga4h": [{"0_Comment Submission": "I just broke into my mom's CVS account...guys, this is bad.", "1_Text": "Thought she had a moderate drug problem but that she was scared since I started calling her out, see her CVS account and shetually has a ridiculous amount of drugs", "2_Subreddit": "opiates"}], "dwiv8l7": [{"0_Comment Submission": "I just broke into my mom's CVS account...guys, this is bad.", "1_Text": "Would be lying if I said I didn't think about it", "2_Subreddit": "opiates"}], "dwiva58": [{"0_Comment Submission": "I just broke into my mom's CVS account...guys, this is bad.", "1_Text": "Yeah that was a solid excuse when she just had my meds, now it's clear she had mine, the dogs, her overseas stash, and what she was getting prescribed. Things keep disappearing and she flipped a shit the last time I tried to take inventory of my meds, even though she swears up and down she never takes my meds she just stockpiles them", "2_Subreddit": "opiates"}], "dwivdiq": [{"0_Comment Submission": "I just broke into my mom's CVS account...guys, this is bad.", "1_Text": "Yeah I don't give a fuck that she's an addict, it's the stealing, lying, and completely breaking down in front of me that I can't watch. She gets absolutely annihilated and begs me to hang out with her every few days and it's just beyond pathetic. She got fucked up last night and went from being really cautious around me to banging on my door laughing all night. If she just had her fucking script, or even my fucking script, and would just be okay I really wouldn't care. It seems like this is getting worse and worse and worse every fucking day.", "2_Subreddit": "opiates"}], "dwivduy": [{"0_Comment Submission": "I just broke into my mom's CVS account...guys, this is bad.", "1_Text": "👌", "2_Subreddit": "opiates"}], "dwivfo0": [{"0_Comment Submission": "I just broke into my mom's CVS account...guys, this is bad.", "1_Text": "I think about that a lot, it would effectively burn the bridge to the entire family though so I need 100% confidence I can be self sufficient first. The main reason I would do it is because she fucking drives with pills every single time she gets in the car. And I mean my morphine in a different bottle with her name on it", "2_Subreddit": "opiates"}], "dwjan1a": [{"0_Comment Submission": "I just broke into my mom's CVS account...guys, this is bad.", "1_Text": "Trigeminal Neuralgia due to spinal injury for me, she was in a major car accident years ago", "2_Subreddit": "opiates"}], "dwjanjf": [{"0_Comment Submission": "I just broke into my mom's CVS account...guys, this is bad.", "1_Text": "20", "2_Subreddit": "opiates"}], "dwjybl6": [{"0_Comment Submission": "I just broke into my mom's CVS account...guys, this is bad.", "1_Text": "Yes because I'm terrified my family will find my account", "2_Subreddit": "opiates"}]}], "1_submissions": [{"8877hd": [{"0_Title": "I just broke into my mom's CVS account...guys, this is bad.", "1_Text": "Thought she had a moderate drug problem but that she was scared since I started calling her out, see her CVS account and shetually has a ridiculous amount of drugs", "2_Subreddit": "opiates"}]}]}]}