{"MaudioTech": [{"0_comments": [{"dmdnse8": [{"0_Comment Submission": "Middleman came thru", "1_Text": "You're an excellent model for the ideal consumer. Good on ya lad", "2_Subreddit": "opiates"}], "dmdq46p": [{"0_Comment Submission": "Any other guys who work for a major audio hardware company?", "1_Text": "I don't get why you capitalized \"major\"...\n\nI asked one question and it's really not a loaded question either. The music business in general is a breeding ground for employees who do every type of drug, hence my curiosity for any people here who work for a similar type of company that I work for that may do opiates. Simple as that", "2_Subreddit": "opiates"}], "dmeliwb": [{"0_Comment Submission": "Any other guys who work for a major audio hardware company?", "1_Text": "Your comment serves no purpose here, you have no reason to contribute at all with that kind of tone.", "2_Subreddit": "opiates"}], "dmeq1ac": [{"0_Comment Submission": "Any other guys who work for a major audio hardware company?", "1_Text": "> I don't get why you capitalized \"major\"...\n\nHow is this hostile in the slightest? Really what is your purpose here you aren't contributing anything useful to this thread whatsoever, please just take your assumptions and false definitions elsewhere", "2_Subreddit": "opiates"}], "dmf3dvp": [{"0_Comment Submission": "My trusty supplier", "1_Text": "I feel like I read about someone who got caught via security footage doing this kind of a stint in this sub a little while ago...", "2_Subreddit": "opiates"}], "dmf3fko": [{"0_Comment Submission": "I think these have become my \"lucky/pickup\" shorts.", "1_Text": "Put on full blast sheesh hahahah", "2_Subreddit": "opiates"}], "dmf4ubn": [{"0_Comment Submission": "I think these have become my \"lucky/pickup\" shorts.", "1_Text": "> For me, I love the placebo effect it has. Since you've just snorted way more powder/lines/pills it feels like you had more than you actually had.\n\nPlacebo is a majorly overlooked phenomenon when it comes to the ritual for doing drugs, especially opiates via insufflation. The whole process before anything goes up your nose yet while it's all ready to go straight to your face plays a big role in how satiated you feel when all is said and done.", "2_Subreddit": "opiates"}], "dmf501r": [{"0_Comment Submission": "Just some pill porn...and....", "1_Text": "What a rarity, a real green xan on here for once lol", "2_Subreddit": "opiates"}], "ds7z7ni": [{"0_Comment Submission": "500 bucks and a guilty mind....", "1_Text": "J you're a prick you deserve this all", "2_Subreddit": "opiates"}], "dticuo1": [{"0_Comment Submission": "Check your bank accounts. Tax return just hit mine.", "1_Text": "Damn I did mine last week too and have direct deposit setup with no luck yet. They even told me in an email after I filed that I should expect the return sooner than the rest since I filed relatively early. Ideally I should have filed earlier than last week but I procrastinated for no reason whatsoever lol.", "2_Subreddit": "opiates"}], "dtvb60b": [{"0_Comment Submission": "Best book on Opiates you’ve read?", "1_Text": "GoT series", "2_Subreddit": "opiates"}], "dwmestf": [{"0_Comment Submission": "Kinda looks like Spongebob", "1_Text": "Those trails look pretty grimy man", "2_Subreddit": "opiates"}], "dwmez3e": [{"0_Comment Submission": "Tips and Tricks", "1_Text": "Bananas contain quinine just fyi", "2_Subreddit": "opiates"}], "dwmezc9": [{"0_Comment Submission": "Tips and Tricks", "1_Text": "Do not buy kratom from smoke shops it's not worth it. Online only", "2_Subreddit": "opiates"}], "dwmxv66": [{"0_Comment Submission": "New to Reddit! Picked up half a ball of some decent tar for $75 a couple days ago. What I have left of it. Pretty good deal if you ask me. Stuff is real solid and has a nice smell.", "1_Text": "In title: \"What I have left of it.\"", "2_Subreddit": "opiates"}], "dwp12pe": [{"0_Comment Submission": "Took an RP30... 30mg is what I normally take... in about an hour I was gasping for air, passed out for about 30 mins and woke up in an ambulance... I assume this was cut or pressed with fent but now I’m scared to do it again.", "1_Text": "It's not about lying we just want to see how the pill looked since it was most likely pressed and would serve as a reference more than anything", "2_Subreddit": "opiates"}], "dwspzmg": [{"0_Comment Submission": "Can you mix hydrocodone with cyclobenzaprine?", "1_Text": "I've been prescribed both of those at the same doctors visit and was told it was a safe combination and to just not over do it. You'll be fine. Don't take more than 1 of the flexeril (cyclobenzaprine), it'll just put you to sleep. Works well to potentiate the hydrocodone though", "2_Subreddit": "opiates"}], "dwt71ro": [{"0_Comment Submission": "HALP", "1_Text": "Name checks out", "2_Subreddit": "opiates"}], "dwt8izh": [{"0_Comment Submission": "Tramadol XR (best way to use)", "1_Text": "300mg is a good starting amount.", "2_Subreddit": "opiates"}], "dwwfx53": [{"0_Comment Submission": "Little dirty but definitely one of my faves for 10 dollars each", "1_Text": "That's because it's one of the strongest opiates in pill form which in turn causes severe withdrawals", "2_Subreddit": "opiates"}], "dwwg0os": [{"0_Comment Submission": "Holy Trinity, last of my OC 80, charlie rock and 2× 2mg clonazepam", "1_Text": "Interesting, haven't seen those Roche kpins in a while. Usually all I see is the Mylan's or generic one's with the \"C 2\" on one side...forget that manufacturer's name atm", "2_Subreddit": "opiates"}], "dwwg66j": [{"0_Comment Submission": "Ran out of Jones", "1_Text": "Pineapple fanta is one of the best sodas to pour up with. No caffeine and tastes fire no matter what kind of juice you pour with (ex: caraco, quali, tech etc). I guess personal preference is real in this case. Legit never heard anyone talk down on pineapple fantas before like this", "2_Subreddit": "opiates"}], "dwwgbaw": [{"0_Comment Submission": "Update; My dboy accepted the ones.", "1_Text": "LOL", "2_Subreddit": "opiates"}], "dwwgbs3": [{"0_Comment Submission": "Update; My dboy accepted the ones.", "1_Text": "What a homie", "2_Subreddit": "opiates"}], "dwwgfq3": [{"0_Comment Submission": "Roxys Vs Pandas", "1_Text": "First time I ever heard someone be apprehensive that opana might be too weak compared to oxycodone lol", "2_Subreddit": "opiates"}]}], "1_submissions": [{"6xz02z": [{"0_Title": "Nodding shitpost", "1_Text": "You're an excellent model for the ideal consumer. Good on ya lad", "2_Subreddit": "opiates"}]}]}]}