{"offthedone": [{"0_comments": [{"dvnqgio": [{"0_Comment Submission": "Shoutout to my northeastern homies that are doing what they gotta do in the storm", "1_Text": "Northern New England.... we got 14 inches, still flurry’s right now", "2_Subreddit": "opiates"}], "dvpm0ac": [{"0_Comment Submission": "Hey Everyone! This is my story of overcoming addiction and what I have learned! Thought some of you might take interest! Enjoy", "1_Text": "Dude.... alcoholism can be just as bad, if not worse than opiates. I’m married to an alcoholic, shit gets really serious. It’s just as deadly as opiates, just not for as many people or as quickly .", "2_Subreddit": "opiates"}], "dvt8202": [{"0_Comment Submission": "Pretty positive I got sold a few fake m 30s last night.", "1_Text": "Those are %110 fake bro... color is all wrong", "2_Subreddit": "opiates"}], "dvwcsdu": [{"0_Comment Submission": "The epic whisper cold cop... story in the comments.", "1_Text": "So, this was fucking awesome. I’m out of state for the weekend, back in my hometown. It’s roughly a 2 hour drive from point A to point B, but it’s 3 states away. I️ decide to try the whisper app.... again. It’s totally useless where I️ live, back here is way more populated more big cities etc. some one posted “blues” .... I️ jumped right on it. Than it gets confusing. Dude is like “I️ don’t live in — anymore, I️ live in — now”. So it turns out that he is originally from — where I️ live now, but he now lives close to my hometown. We talked last night, seemed legit. Decided to meet this morning, naturally I️ was pretty sketched out. We meet at a busy diner in the parking lot. It turns out we both have out of state plates.... from the same state! We shoot the shit, make the transaction. We both leave and get on the same highway and everything. It was the most “not obvious “ deal ever. You would have thought I️ was meeting someone I️ knew and we where headed to the same place.", "2_Subreddit": "opiates"}], "dvyiyee": [{"0_Comment Submission": "The epic whisper cold cop... story in the comments.", "1_Text": "Wtf.... lol. In my area, it’s totally useless. You won’t find anything, no one replies if you try and look", "2_Subreddit": "opiates"}], "dvyj2gr": [{"0_Comment Submission": "The epic whisper cold cop... story in the comments.", "1_Text": "They seem %110 legit. Color, shape and feel is all spot on. I️ only chip these days (besides an ounce of kratom or so on a daily basis) I️ take a 1/4 at a time, just get the littlest buzz....", "2_Subreddit": "opiates"}], "dvyj4fp": [{"0_Comment Submission": "The epic whisper cold cop... story in the comments.", "1_Text": "The one time I️ did get a reply in my area, it was some kid who thought I️ was a surfer... Bahahaha (the roxy logo)", "2_Subreddit": "opiates"}], "dvyj8bb": [{"0_Comment Submission": "The epic whisper cold cop... story in the comments.", "1_Text": "They seem totally legit, color, shape and size are right on. They feel right. I️ only chip these days (besides kratom daily) so I️ get really sketched out about them these days", "2_Subreddit": "opiates"}], "dvyo3rx": [{"0_Comment Submission": "Research on opioid usage for school", "1_Text": "Done. Took all of 3 seconds.... no personal questions", "2_Subreddit": "opiates"}], "dvyzcnu": [{"0_Comment Submission": "Package Never Arrived (HELP!)", "1_Text": "So... I’m I️ literally just stopped hauling tractor trailer loads of mail. Shit gets lost/misplaced constantly. They don’t hurry to make it right either.... also, the trailers get full of scrap paper that is used for tagging the destination etc. Small packages fall out and get buried sometimes, like pretty often. If it’s at an airport.... than you might have a problem. If it’s at a normal distribution center, a lot less to worry about", "2_Subreddit": "opiates"}], "dvyzxkr": [{"0_Comment Submission": "The epic whisper cold cop... story in the comments.", "1_Text": "I️ can’t disagree with you there bud.... I️ jumped methadone cold turkey awhile back, been on the kratom diet since. To be completely honest, I’m not doing super well chipping my 3 blues this time around.... sucks. I️ had gotten pretty good about it too.", "2_Subreddit": "opiates"}], "dw4pceh": [{"0_Comment Submission": "Was doing a walk though of the roughed-in units and found this fine apprentice loop.", "1_Text": "Love the zip tied romex bundle.... lol", "2_Subreddit": "electricians"}], "dw8bitw": [{"0_Comment Submission": "Who can spot my PMs screw up?", "1_Text": "Is it 480 or 208? The world may never know....", "2_Subreddit": "electricians"}], "dwbw2m4": [{"0_Comment Submission": "I fucked up. Twice.", "1_Text": "Yah.... this is shitty, have to be honest. Go on methadone, totally safe for you and that child. Call your closest clinic and explain that you’ve relapsed, they’ll have you in there ASAP.", "2_Subreddit": "opiates"}], "dwc11pq": [{"0_Comment Submission": "Preferred Opiate/Opioid", "1_Text": "Oxys.... allll day.", "2_Subreddit": "opiates"}], "dwf45as": [{"0_Comment Submission": "Crazy shit my roommate says volume 3 : hardcore edition", "1_Text": "Dude... is this the chick that turns sugar into dope, or something similar? I️ couldn’t handle it man, I’d lose my fucking mind! Haha", "2_Subreddit": "opiates"}], "dwjul15": [{"0_Comment Submission": "\"It's happening. We're getting pulled over.\"", "1_Text": "The worst.... and the best, all at once. Kinda like opiates. 😂", "2_Subreddit": "opiates"}], "dwlwvfh": [{"0_Comment Submission": "Man I’m just having good day after good day! Love serving!", "1_Text": "I️ can tell from the stem.... that rockolla is fucking fire.", "2_Subreddit": "opiates"}], "dwmshys": [{"0_Comment Submission": "Man I’m just having good day after good day! Love serving!", "1_Text": "Only the finest rock does that to a stem.... oils in the middle like that", "2_Subreddit": "opiates"}], "dwnyrid": [{"0_Comment Submission": "Happy April Fool's, guys.", "1_Text": "Hahaha.... you had me fooled, nothing would surprise me with Reddit anymore though!", "2_Subreddit": "opiates"}], "dwq21y8": [{"0_Comment Submission": "Cloth wiring and breakers that just kinda do whatever. Yay.", "1_Text": "First day? Nothing unusual here....", "2_Subreddit": "electricians"}], "dwr8gnq": [{"0_Comment Submission": "Posted awhile back from here. Still laughing.... lol", "1_Text": "This is tragically accurate.... and no, no one diddled me thank god.", "2_Subreddit": "opiates"}], "dwtaocc": [{"0_Comment Submission": "Lmao this is reddit. When you post outside of T_D and see the ridiculous posts from lefties that infest this site, keep in mind that this is who is behind those posts.", "1_Text": "There’s literally one (1) fuckable chick....", "2_Subreddit": "The_Donald"}], "dwxnwuz": [{"0_Comment Submission": "Not going down", "1_Text": "FUCK THEM. If you are using subs or methadone to stay in check, and are otherwise clean/sober.... you ARE CLEAN AND SOBER. There’s a lady with 15 years in my area, she was a heroin addict. She is like 55-60, give or take. She is on a prescription for oxy daily, from her doctor, because she needs to be on it. You never see her buzzed, you never see her noddy, when she shares her story; she makes sure to tell everyone in the room. Some people may not like it, fuck them. That woman is absolutely clean and sober. Being a “drug addict” isn’t about taking drugs, it’s about what taking drugs do to you. Principles before personalities bro.", "2_Subreddit": "opiates"}], "dwxo4vr": [{"0_Comment Submission": "I never loved pink so much 💕 she took off one of my doses a day but at least I still get 90. She told me I'm too young to need that much 😂.", "1_Text": "Those are my absolute favorites... and you don’t have to worry about presses.", "2_Subreddit": "opiates"}]}], "1_submissions": [{"7leufk": [{"0_Title": "Hello r/opiates!", "1_Text": "Northern New England.... we got 14 inches, still flurry’s right now", "2_Subreddit": "opiates"}], "7n310l": [{"0_Title": "While I don’t dabble much these days.... a little something for the new year!", "1_Text": "Northern New England.... we got 14 inches, still flurry’s right now", "2_Subreddit": "opiates"}], "7t9ze0": [{"0_Title": "Apparently there is a panda somewhere in this photo....", "1_Text": "Northern New England.... we got 14 inches, still flurry’s right now", "2_Subreddit": "opiates"}], "7tsb5c": [{"0_Title": "Looking for some input on my situation", "1_Text": "Northern New England.... we got 14 inches, still flurry’s right now", "2_Subreddit": "alcoholicsanonymous"}], "7y6msr": [{"0_Title": "Wd’s.....", "1_Text": "Northern New England.... we got 14 inches, still flurry’s right now", "2_Subreddit": "opiates"}], "7yj8jq": [{"0_Title": "What’s your opinion on this CL add?? Has a phone #, is this a pretty standard post? Only one I’ve found in my area", "1_Text": "Northern New England.... we got 14 inches, still flurry’s right now", "2_Subreddit": "opiates"}], "7z6xqa": [{"0_Title": "I think I found a legit CL plug......", "1_Text": "Northern New England.... we got 14 inches, still flurry’s right now", "2_Subreddit": "opiates"}], "81ufv1": [{"0_Title": "The Jones’s..... real bad (prob. A shit post)", "1_Text": "Northern New England.... we got 14 inches, still flurry’s right now", "2_Subreddit": "opiates"}], "85cf72": [{"0_Title": "The epic whisper cold cop... story in the comments.", "1_Text": "Northern New England.... we got 14 inches, still flurry’s right now", "2_Subreddit": "opiates"}]}]}]}