{"diacetyImorphine": [{"0_comments": [{"dnpp9uu": [{"0_Comment Submission": "Saturday AM wake up coming for my east coast niggaz... What are y'all loaded on this fine day?", "1_Text": "smoking weed with my boyfriend, omw to dose at our methadone clinic. saved a shot of dope for tonight.\n\n\n\nwhat's the potency of methoxyacetylfent (compared to morphine or fent)?", "2_Subreddit": "opiates"}], "do30dvb": [{"0_Comment Submission": "How long have you been using?", "1_Text": "IV heroin user of 6.5 years. using since 2007-2008. addicted to heroin since 2009-2010.\n\nI'm 23 years old currently.", "2_Subreddit": "opiates"}], "doz86sw": [{"0_Comment Submission": "Is this Fent? 😳😐😬 I'm scared. And is it the same process? Just add water and heat?", "1_Text": "Fentanyl hcl is readily soluble in water, no heat necessary. Same for heroin #4 hcl. Tar & heroin #3 should be heated for injection.\n\nThe heroin you have most likely has some cut in it (substances you normally would not want to inject - some inert, others harmful). By heating it, you are essentially increasing the solubility of these other molecules which allows them to enter the solution & be part of what is injected into the vein.", "2_Subreddit": "opiates"}], "dp3j0i4": [{"0_Comment Submission": "Also I got these, fentanyl lollies. Thought you guys might enjoy ha. ✌🏼", "1_Text": "how and where did you find them? I need these as a birthday treat", "2_Subreddit": "opiates"}], "dprzpgh": [{"0_Comment Submission": "Methadone blocking effects", "1_Text": "I get high on methadone (meaning I shoot up daily & get a rush + high).\n\nMy methadone dose doesn't hold me for more than half a day. I'm on 125mg methadone daily & I still experience withdrawal 10hours after my dose! if I was on 170mg-200mg, it would hold me 24hours and it would prevent me from getting withdrawals and getting high on heroin. Unfortunately my clinic won't take me or anyone I've met there higher than 125mg so I will have to keep using heroin so I can sleep at night or find a clinic willing to stabilize me on the proper dose of methadone. I'm jealous you can take so little methadone & it keeps you well until you dose the next day. I would kill for that", "2_Subreddit": "opiates"}], "dqvqixy": [{"0_Comment Submission": "Whats your worst part of withdrawal?", "1_Text": "throwing up & diarrhea at the same exact time. can't eat during withdrawal so I'm puking stomach acid plus its so forceful & nonstop, I just accept the fact that I may choke on my vomit & die.", "2_Subreddit": "opiates"}], "dqwoyzi": [{"0_Comment Submission": "Whats your worst part of withdrawal?", "1_Text": "yep! I'm on the philly harm reduction website & used to post on topix but it got shut down.", "2_Subreddit": "opiates"}], "drjsukx": [{"0_Comment Submission": "Heroin use and your period.", "1_Text": "I'm a female heroin user of 7 years (I'm 23 years old) and I still get my period. I know my experience isn't common though. pretty much most of my girl friends either were late or stopped getting it at all. stress definitely affects your cycle though along with many other things inxluding drug use.", "2_Subreddit": "opiates"}], "drranf1": [{"0_Comment Submission": "How to turn a visa gift card into cash quick?", "1_Text": "Ask friends or family. I had my old roommate and my boyfriend's mom trade us $400 for 400 on Visa giftcards. Pretty helpful and you don't get 60% of the value like when you pawn it! That extra money helps/adds up", "2_Subreddit": "opiates"}], "dsodhb9": [{"0_Comment Submission": "Gf controls my usage, it's making me hate her.", "1_Text": "I understand this situation because I'm a female in a relationship & I buy the dope. Its my connect too, I'm the one who showed him the ropes of my city (though he knew the dope game well before we met, he's not new at this).\n\n If I give my bf his portion he will go through it too quickly & end up asking me for even more! Try talking to her about it amd see if a compromise could be worked out. My bf usually has to ask me for dope if he wants to do a shot so when I read your post I tried to imagine it from my bf's perspective.", "2_Subreddit": "opiates"}], "dsodo26": [{"0_Comment Submission": "Gf controls my usage, it's making me hate her.", "1_Text": "Anyway let me know what happens. My bf and I have a similar situation as you and your gf although I'm the one with the money so he can't afford to buy much dope even though he can cop by himself. \n\nDo you put up half the money for the 3g's or a decent amount of the money?", "2_Subreddit": "opiates"}], "dssc7uo": [{"0_Comment Submission": "This graph shows the average purity level of heroin in major hubs of the USA", "1_Text": "I miss the dea microgram bulletins :( ps do you have any old microgram references for the 65%+ purity?\n\nOn the subject of, I'm actually copping in north philly right now as I type this.", "2_Subreddit": "opiates"}], "dt4aeis": [{"0_Comment Submission": "Makeup junkie", "1_Text": "you guys have no idea lol. it's also annoying because the default for most girls is being made-up so god forbid we don't do our make-up, hair & put on cute clothes one day, we don't look \"as good\" as the ones who did their make-up, hair, etc even if we are naturally pretty, we still could look better. it's even more of a struggle when you're withdrawaling.", "2_Subreddit": "opiates"}], "dt4se3s": [{"0_Comment Submission": "Makeup junkie", "1_Text": "it's possible, but I think most girls look better with make-up to enhance their features unless they take it too far (like you said with layers of foundation). I've noticed my boyfriend (and guy friends & ex-bfs) will comment on a girl looking pretty etc. who has make-up on but rarely will they say a girl without make-up or her hair done looks pretty. & I get told I'm gorgeous when I wear no make-up but I might not look AS good as I do when I wear a little mascara, fill my brows in. I agree with you though that girls who can pull off light to no makeup look better than ones who are caked up but most guys I meet/boyfriends I've had seem to like girls who wear a little more. I've had plenty of boyfriends tell me I still look good without make-up, and I did modelling so I know I'm decent looking but every girl I know, including me, gets hit on more when we wear make-up/are done up. Good to know there's people out there who still appreciate natural beauty though :) My boyfriend told me I still look good without make-up and it doesn't change my appearance to the point of not recognizing who he is waking up to. Some of his ex gfs are gorgeous with makeup, but look like a horribly different person without it.", "2_Subreddit": "opiates"}], "dt60vyu": [{"0_Comment Submission": "Dunno where else to ask this... boyfriend caught me on heroin", "1_Text": "completely agree with this.", "2_Subreddit": "opiates"}], "duepafj": [{"0_Comment Submission": "Single, White, Female.", "1_Text": "I'm a professional looking, put together white female & I never have trouble copping in the hood. Are you new to dope in general? Usually even when I walk around dressed nice I still never have a problem. Normally I have to make eye contact with one of the people at the set/block so they know I'm looking for stuff... otherwise they just assume I don't use any drugs and don't advertise their product like they do to people who look like they obviously use. I'm actually thankful I look put together because most cops don't give me a second look.", "2_Subreddit": "opiates"}], "duj88bc": [{"0_Comment Submission": "Just lost my cold copping virginity", "1_Text": "not always.. I've been copping in an open air market for 6 years. My boyfriend always insists on asking homeless junkies around here what the best stamp/dope is. They always throw us suggestions but when we try it, its not THAT good. The corner/set I go to always ended up being better/stronger. Idk if its because they have less money so their tolerance is lower compared to us who spend ~1k a week on dope which allows our tolerance to shoot through the roof. Our reasoning was homeless junkies have less money so they find the best dope to make the most out of their money. But my boyfriend said I was right after trying multiple suggestions, sometimes you already have the best product around and don't need to look around.\nA lot of homeless people are really cool tho, most of the time they would point us in the right direction if our block is shut down due to cops or strike force without asking for a bag of dope or anything. They usually look out of other users.", "2_Subreddit": "opiates"}], "duke6zu": [{"0_Comment Submission": "Drug usage and age started?! Favorites? Least favorites? Why?", "1_Text": "23 year old female living in the east coast US. raised in an upper-middle class family, parents are very loving. No addiction or mental health issues in my family (they never smoked cigarettes or weed). Feel guilty because I had an amazing upbringing & family. I happened to be curious about trying drugs.\n\n* Weed - 14\n* Alcohol - 14  \n* LSD - 14\n* Oxycodone - 15\n* Adderall - 15\n* Benzos - 15\n* Nitrous oxide - 15\n* Shrooms/Psilocybin - 15\n* Cocaine - 16\n* MDMA & Ecstasy - 16\n* Oxymorphone - 16\n* Salvia div. - 16\n* Heroin - 16/17\n* Methadone - 18 (methadone clinic)\n* Fentanyl & Fent analogs - 19\n* PCP & Ketamine - 23 (accidentally because I thought I bought bags of dope from a corner/block I never go to)\n* might be missing a few but these are the main ones I can think of.\n* fentanyl, heroin, weed & LSD are my favorites. least favorites were PCP & Ketamine because I felt too paranoid & like I was out of my body looking into my life from a different perspective.", "2_Subreddit": "opiates"}], "dunnujq": [{"0_Comment Submission": "Week 3 of MMT for my 17 year old son", "1_Text": "Has your son tried other ways to get clean? I started MMT at age 18, have been on and off methadone for 5 years. I'm a 23 year old female, started using at 15 years old. \n\n\nI'm lucky I had my dad to support my decisions and be there for me. Most parents don't understand the medical aspect of MMT & write it off as a legal replacement for heroin. The only thing I'm worried about is did he try other ways to get off opioids? Whether that's rehab, detox, suboxone/subutex, etc. My concern is you guys may have jumped into MMT too soon without exhausting all other options. MMT is used as a last resort when all else fails. That's why they usually require you to be physically addictedm (not RECREATIONAL use) for at least 2 years, even then, they don't like to let people start MMT unless they were abusing IV heroin or stronger opioids. Most people still snorting heroin or using oxycodone have a relatively mild withdrawal or if they haven't been physically addicted for 2years+, making it worse for them to get on methadone because they don't need to resort to long term treatment with a strong opioid (when they haven't been addicted for long or only using weaker opioids like oxycodone, hydrocodone, etc). Some people find methadone is harder to get off, and on top of that he is still young & his brain hasn't fully devoloped so methadone may cause some health effects (such as prolonged QT interval increasing risk of heart arrhythmia).", "2_Subreddit": "Methadone"}], "duszm2t": [{"0_Comment Submission": "Are open air markets a thing near you? How do they run them?", "1_Text": "I live in the Northeast coast US by a major open air market (actually I live near 2 major cities with open air markets). I refuse to get my dope from anywhere else.\n\n\nThe way it works is there are blocks in certain large areas of the city with sets selling their product. The dope comes in stamped bags which is their \"brand\". At the sets, there are lookouts (who watch for the cops), singles (sell single bags), caseworkers (sell bundles/larger amounts), block manager (rarely/if ever is out there, the ones who bring the supply to the set), above that the boss who runs the block/set. They have 1 or 2 stash houses within a couple blocks so the block manager doesn't have to walk far to get the product/drop it off. Usually people start at the bottom of the chain of command & work their way up to higher responsibility (I have a phone connect I met when I copped on the block. He was doing singles sales at the time, in the 5 months I've known him he worked his way up to being the block manager & being the one who brings the bricks of dope to the block for them to sell & its awesome because he has access to the stash house so he's never not had dope when I call).\n\n\nNew blocks give out samples to attract potential customers & get the word out about their stamp/brand. Sets/blocks shout the name of their stamp as you walk by, along with other products they sell there like weed, coke, crack, k2, sometimes pcp, etc. there's SO many sets, sometimes 3 different ones on the same block right next to each other. compiled a list just to see & I think theres 50-100 sets total in our area - if not more. some blocks sell the same dope in 3 different corners with 3 different names, meaning they all have the same owner & product. I love it because I can always get dope 24/7, no need to call anyone you just have to know what area to go to. And the competition between so many blocks makes it so they have to have good product or their set/business will fail quickly. \n\n\n*lots* of people living & shooting up in abandos (abanadoned rowhomes) as well as homeless people living on the street in tents & users **panhandling everywhere!**\n\nalso this is the hood so lots of wandering sketchy people & cops (bike cops, strike force, walking cops). \n\nmost people (like me & my boyfriend) park up near the block they wanna go to & walk a few minutes because you're more likely to get pulled over driving. but most junkies here don't have cars & resort to public transportation.", "2_Subreddit": "opiates"}], "duxh8k3": [{"0_Comment Submission": "1g Raw Afghan #4 Perks of being connected to the brick man", "1_Text": "Mexico actually now supplies most of the heroin in the US.", "2_Subreddit": "opiates"}], "duxh8w1": [{"0_Comment Submission": "1g Raw Afghan #4 Perks of being connected to the brick man", "1_Text": "Mexico actually now supplies most of the heroin in the US.", "2_Subreddit": "opiates"}], "dv5bg7k": [{"0_Comment Submission": "Got my take home today", "1_Text": "Thats crazy to me. I'm on 140mg of methadone with no side effects, actually my dose is too low for me & doesn't keep me out of withdrawal for 24 hours.", "2_Subreddit": "opiates"}], "dvz2hx0": [{"0_Comment Submission": "\"Dope\" that makes you trip when i shot it", "1_Text": "sounds like an pcp/ketamine or a structurally related analog. Had an awful experience similar to this, with full on disassociation & out of body perspective & I felt like I was tripping and it did nothing to alleviate my withdrawal. one of the most disturbing things me and my boyfriend ever experienced. we did research online & asked a few friends who copped from the same people/area & they confirmed it was ketamine or an analog of it.", "2_Subreddit": "opiates"}], "dwusjvl": [{"0_Comment Submission": "I'm Eric Hafner, I'm running for U.S. Congress in Portland, Oregon (OR-3). I want to legalize all drugs, including opiates, but offer ibogaine therapy too, and free drugs for addicts via prescription.", "1_Text": "looks like you're perpetuating the hysteria & misinformation fed to you by the media, or you're just really uninformed in the area of pharmacology.\n\n“Fentanyl, applied dry to the skin, will not be absorbed. There is a reason that the fentanyl patches took years [for pharmaceutical companies] to develop,” - Ed Boyer, M.D., Ph.D., a medical toxicologist at Harvard Medical School and Brigham and Women’s Hospital.", "2_Subreddit": "opiates"}]}], "1_submissions": [{"2ext9j": [{"0_Title": "High dose, still withdrawing pretty bad in the afternoon/night. Anyone else have similar experiences?", "1_Text": "smoking weed with my boyfriend, omw to dose at our methadone clinic. saved a shot of dope for tonight.\n\n\n\nwhat's the potency of methoxyacetylfent (compared to morphine or fent)?", "2_Subreddit": "Methadone"}], "5jlx1n": [{"0_Title": "birthday bundles. it's my birthday today!", "1_Text": "smoking weed with my boyfriend, omw to dose at our methadone clinic. saved a shot of dope for tonight.\n\n\n\nwhat's the potency of methoxyacetylfent (compared to morphine or fent)?", "2_Subreddit": "opiates"}], "5oby9w": [{"0_Title": "Today's pickup. Dope porn & some weed.", "1_Text": "smoking weed with my boyfriend, omw to dose at our methadone clinic. saved a shot of dope for tonight.\n\n\n\nwhat's the potency of methoxyacetylfent (compared to morphine or fent)?", "2_Subreddit": "opiates"}], "66xijr": [{"0_Title": "Bundles of dope ❤", "1_Text": "smoking weed with my boyfriend, omw to dose at our methadone clinic. saved a shot of dope for tonight.\n\n\n\nwhat's the potency of methoxyacetylfent (compared to morphine or fent)?", "2_Subreddit": "opiates"}]}]}]}