{"ItsTheXandMan": [{"0_comments": [{"dsjptpz": [{"0_Comment Submission": "Tianeptine for Depression, Anxiety, and Opiate Withdrawal.", "1_Text": "I'll be that guy. Why?", "2_Subreddit": "Tianeptine"}], "dsop7t4": [{"0_Comment Submission": "Electrum sent more BTC than was supposed to and I'm not sure where it is/how to to get it back...", "1_Text": "https://www.blocktrail.com/BTC/tx/98660b4ffb860df051d468a30a79c5eb01a652cdb948a38de33ff5054a04eaac", "2_Subreddit": "Electrum"}], "dsox7uo": [{"0_Comment Submission": "Electrum sent more BTC than was supposed to and I'm not sure where it is/how to to get it back...", "1_Text": "Thanks you explained that well. I just dragged the \"fee\" slider until it was at the lowest amount for fees (so I thought). How am I supposed to know when is best to send btc etc? What is a a good range for good - bad as far as what you want to pay not pay for the fees sat/byte etc. Thanks again!", "2_Subreddit": "Electrum"}], "dtauem7": [{"0_Comment Submission": "O-DSMT dose equivalent to hydrocodone", "1_Text": "I'm from Canada. Morphine is not OTC. Lol. I wish. And Codeine is being moved to script only I'm pretty sure.", "2_Subreddit": "researchchemicals"}], "dtsc0b3": [{"0_Comment Submission": "Tianeptine and Vein Maintenance Tips", "1_Text": "Tianeptine is a full MOR agonist! If you shoot 100 - 300mg its JUST like dillies or mid grade dope. For real! But don't do it, it is the worst thing I've ever done to my veins. I have pharma-grade powder btw I'd never shoot the tabs. I did do research, as I said though \"I had to try it for myself\" unfortunately lol. Thanks for the reply though and thank you for caring. I appreciate it. I only copped this cause I was almost broke and it was 50 bucks for 5 g's and a dose is 100mg, vs 60 bucks for 0.2 of alright dope where I live (usually fent dope tho). So I figured wtf I'll give er a shot, no intent of long term use I just finished what I had a minute ago (I took most of it orally but injected it like 10 times. Anyways when I said veins maintenance I meant for shooting other things that aren't super caustic. So dope or something else. Thanks again!", "2_Subreddit": "opiates"}], "dtv7yyn": [{"0_Comment Submission": "I got some 2 methyl maf from a trusted place but...", "1_Text": "Yes larger flakes and sandy. I flushed it.", "2_Subreddit": "fentanyl"}], "dtv82at": [{"0_Comment Submission": "So on an impulse I acquired some 2 methyl maf, but...", "1_Text": "I agree. I only shot the citric once and only used like a third of the shot before being like \"okay somethings definitely not right\" and just that was WAY worse on my vein than a week of Tianeptine use (also reckless I know). Then I grabbed some ascorbic and it worked like a charm. The effects however were not very nice. Nothing like classic f, carf, straight H, or any fun pharma. There's a new -logue out right now, not many know of it. After this though I'm not in too big of a rush to try it out first. Thanks for the reply and insight girl, take care.", "2_Subreddit": "opiates"}], "dtv855h": [{"0_Comment Submission": "I got some 2 methyl maf from a trusted place but...", "1_Text": "Lol a sleepy market. I lol'd. No sir, we were in the clear.", "2_Subreddit": "fentanyl"}], "dtv8b0a": [{"0_Comment Submission": "ortho-methyl-desfluoroocfentanyl (2-me-maf) experiment.", "1_Text": "Wow. On the money. So it wasn't just me then... \"Psych x Stim describes it PERFECTLY. I was having a real bad trip lol. Anxiety through the FUCKIN ROOF. Are any other analogues known to be like this or is it unique to 2 me maf? Cause it was my first -logue and it scared me the fuck off like precipitated WD from Subs scare some people off of subs. So unpleasant all my nope receptors were in full nope.", "2_Subreddit": "fentanyl"}], "dtvqfcu": [{"0_Comment Submission": "I got some 2 methyl maf from a trusted place but...", "1_Text": "I felt the same way man, except it shouldn't have been WD cause the only thing I'm on is methadone and I haven't missed any doses. So yea it was fucked, I agree though felt like precipitated WD basically. It was fucking horrible. I hope our exchange of words here helps steer someone away from this Chem.", "2_Subreddit": "fentanyl"}], "dtw2dqi": [{"0_Comment Submission": "How is Everyone Coping with the collapse of the fentalogue industry", "1_Text": "Not sure why u caught that downvoted but thanks for taking the time to write that. I appreciate it and agree. There's a new one that JUST came out last month, NO reviews so far. I'm so curious but after my 2 me maf experience, I'm a little scared. Honestly. And that doesn't happen a lot with drugs. I'd like to ask yall about it but if I post its name and source it could heat it out and cause it to be banned sooner. But I'll just say it's a clearnet site that used to be called something else, and they claim to be the only factory manufacturing this -logue. Price is right, but considering they give no info besides the abbreviation of the name and that it's a powder, no IUPAC, mol. Mass, nothing, it could just be a banned logue they're trying to off load.", "2_Subreddit": "fentanyl"}], "dtwlgj6": [{"0_Comment Submission": "So on an impulse I acquired some 2 methyl maf, but...", "1_Text": "UPDATE: I shot it, and it was THE WORST FUCKING FEELING IVE EVER HAD FROM A SUBSTANCE. Imagine just all of a sudden being hit with intense fear like feeling like you're going to die and not knowing why. My vision was fucked my head felt fucked, it was fucked. NEVER TRY 2 ME MAF. I did it for you, it fuckin sucks.", "2_Subreddit": "opiates"}], "dtwulw4": [{"0_Comment Submission": "ortho-methyl-desfluoroocfentanyl (2-me-maf) experiment.", "1_Text": "It'd be one thing if it were just psychedellic, I can handle my psychs (LS25, 1P, etc), but it was just a very unpleasant feeling. It had no positivity to it whatsoever. At least with regular psychs you just have a chance of having a bad trip, with 2 me maf it's seems like a guarantee. Thanks again for the post. You put words to my feelings and thoughts.", "2_Subreddit": "fentanyl"}], "dtxyr1x": [{"0_Comment Submission": "Will relapse in a few days", "1_Text": "Username checks out.", "2_Subreddit": "opiates"}], "dtzxp0u": [{"0_Comment Submission": "Xianchong", "1_Text": "Omg 2 me maf. Don't get me started.", "2_Subreddit": "fentanyl"}], "du51e6t": [{"0_Comment Submission": "Xianchong", "1_Text": "Yes I know. I've had pure 2 me maf. We've discussed this. Lol. And I don't think it has much to do with experience with psychedelics at all honestly cause, I'm pretty seasoned with the psychs I'll leave it at that. I can handle my shit if the energy of the compound provides the opportunity to do so. this one however, did not. And it was THE MOST uncomfortable stimulation so I wouldn't say \"a rock of the best crack\" cause at least with coke/crack there is some nice rush before the unpleasant stimulation. Fr. Barely felt like fent or an opioid at all. not sure where the euphoria was supposed to be. It was pure anxiety.", "2_Subreddit": "fentanyl"}], "du5405y": [{"0_Comment Submission": "Xianchong", "1_Text": "Yup, same stuff. Except I used ascorbic acid and it worked.", "2_Subreddit": "fentanyl"}], "du56c04": [{"0_Comment Submission": "Xianchong", "1_Text": "Yea I tried a tonne of citric which did work but turned it into a think glue so no shooting. Then I tried acetic (vinegar), nada, lastly, after mangling my veins with those two, I got ascorbic. It worked amazingly, very little was needed, then it was IV'd, and hell ensued. Lol.", "2_Subreddit": "fentanyl"}], "duq2wow": [{"0_Comment Submission": "Syntarise has some goodies like Pregabalin, DXM HBr, Gabapentin, etc.", "1_Text": "Great vendor. But they stopped stocking Pregabalin a while ago.", "2_Subreddit": "RXSources"}], "duqasey": [{"0_Comment Submission": "Syntarise has some goodies like Pregabalin, DXM HBr, Gabapentin, etc.", "1_Text": "I stopped buying it for the time being. I am importing some currently and it will be for sale within 3-4 weeks. Pricing is $25/g for 1g then lower the more you buy.", "2_Subreddit": "RXSources"}], "duqibp8": [{"0_Comment Submission": "Syntarise has some goodies like Pregabalin, DXM HBr, Gabapentin, etc.", "1_Text": "If you need it before then though, ReChem.", "2_Subreddit": "RXSources"}], "dwj5yh9": [{"0_Comment Submission": "(F) Do she got da butt? She dooo", "1_Text": "Technically labia but I mean, you're on the right track. ;)", "2_Subreddit": "opiates_gonewild"}], "dwq3y51": [{"0_Comment Submission": "Pray for post!", "1_Text": "I really hope the postman has your stuff!! Be sure to update! :) Take care.", "2_Subreddit": "opiates"}], "dwy6xty": [{"0_Comment Submission": "If you could have an opiate-sesh with anybody, dead or alive, who would it be and why?", "1_Text": "Gus, Aka Lil Peep. :(", "2_Subreddit": "opiates"}], "dwy9c1i": [{"0_Comment Submission": "RIP all sourcing subreddits :(", "1_Text": "good bot", "2_Subreddit": "1P_LSD"}]}], "1_submissions": [{"7nrifp": [{"0_Title": "I wanna know how....", "1_Text": "I'll be that guy. Why?", "2_Subreddit": "DarkNetMarketsNoobs"}], "7o1nn7": [{"0_Title": "Hahahahaha yayyyyyy!!!", "1_Text": "I'll be that guy. Why?", "2_Subreddit": "TheResearchCollective"}], "7o1ygy": [{"0_Title": "Can't be hard to see why I created a new sub... lol. Dis gaii", "1_Text": "I'll be that guy. Why?", "2_Subreddit": "TheResearchCollective"}], "7o1z89": [{"0_Title": "This is why I created this post. So people didn't have to deal with people (mods at that) speaking to them like this.", "1_Text": "I'll be that guy. Why?", "2_Subreddit": "TheResearchCollective"}], "7o1zhx": [{"0_Title": "This is why I created this sub, so people can speak to each other like human being. :)", "1_Text": "I'll be that guy. Why?", "2_Subreddit": "TheResearchCollective"}], "7o1zqp": [{"0_Title": "This why I created this sub, so people don't have to worry about being berated by a power-tripping mod.", "1_Text": "I'll be that guy. Why?", "2_Subreddit": "TheResearchCollective"}], "7o2140": [{"0_Title": "Hey yall, I'm starting a company.", "1_Text": "I'll be that guy. Why?", "2_Subreddit": "opiates"}], "7o2d26": [{"0_Title": "Vendor Review: RCD Canada", "1_Text": "I'll be that guy. Why?", "2_Subreddit": "TheResearchCollective"}], "7o2dlk": [{"0_Title": "Vendor Review: Syntharise", "1_Text": "I'll be that guy. Why?", "2_Subreddit": "TheResearchCollective"}], "7o2e7l": [{"0_Title": "Vendor Review: Lysergi", "1_Text": "I'll be that guy. Why?", "2_Subreddit": "TheResearchCollective"}], "7ox8yp": [{"0_Title": "I don't want to be a script kiddy, but I have no idea where to start... And every time I think about diving in I just get overwhelmed. Any advice?", "1_Text": "I'll be that guy. Why?", "2_Subreddit": "hacking"}], "7qf742": [{"0_Title": "Electrum sent more BTC than was supposed to and I'm not sure where it is/how to to get it back...", "1_Text": "I'll be that guy. Why?", "2_Subreddit": "Electrum"}]}]}]}