{"Moonmaulerz": [{"0_comments": [{"dveoxn0": [{"0_Comment Submission": "After pot's success, could Denver legalize mushrooms next?", "1_Text": "Because some people are cunts?", "2_Subreddit": "Drugs"}], "dvfdt6l": [{"0_Comment Submission": "Examine.com updated their \"how much protein do I need?\"", "1_Text": "I drink 180g worth of protein from shakes a day. They taste fine and cost me a whopping $30 a week. I get another 100+g a day from my unremarkable diet.\n\n\nAlso...anti-social? I dont undertand.", "2_Subreddit": "Fitness"}], "dvfecjf": [{"0_Comment Submission": "Virtually every famous actor that has to get jacked for a movie, is put under a HIIT weight lifting routine... Is it better to build lean mass or it's just the same as doing traditional lifting + cardio in two different moments?", "1_Text": "One study looking at 43 men from 22 years ago?", "2_Subreddit": "Fitness"}], "dvfenlo": [{"0_Comment Submission": "Having a shower after gym", "1_Text": "I think its borderline psychotic how disgusted people are by the naked human body.\n\n\nWhy the fuck does everyone care so much? We all look mostly the same. \n\n\nDont you think going to the gym would be a lot more fun if everyone trained naked like in ancient Greece?", "2_Subreddit": "Fitness"}], "dvfevvt": [{"0_Comment Submission": "Examine.com updated their \"how much protein do I need?\"", "1_Text": "You cant standardize that though. 100g of glucose isnt going to have the same impact on my body as it does a diabetic.", "2_Subreddit": "Fitness"}], "dvgfnmv": [{"0_Comment Submission": "Examine.com updated their \"how much protein do I need?\"", "1_Text": "Body fortress. $16 a tub from kroger or walmart. I use about 2 a week.\n\n\nI make three double (2 scoops) per day mixed with water and heavy cream. Its 30g of protein per scoop.", "2_Subreddit": "Fitness"}], "dvhccqs": [{"0_Comment Submission": "How do you know when you have \"done enough\" at the gym?", "1_Text": "Man, people here LOVE their soy! \n\n\nhttps://www.ncbi.nlm.nih.gov/pmc/articles/PMC2981010/\n\n\nThere isnt enough info to make a definitive statement one way or the other.\n\n\nBut personally, im going to avoid eating a food that menopausal women eat for hormone therapy.", "2_Subreddit": "Fitness"}], "dvhsajt": [{"0_Comment Submission": "How do you know when you have \"done enough\" at the gym?", "1_Text": "That article admits soy protects against menopausal hot flashes. Isnt hormone manipulation the most immediate and obvious explanation for that?\n\n\nThe article also takes the \"animal fats and cholesterol cause CV disease and cancer\" stance, while also stating its nonsense to think soy is bad because people have been eating soy for 3,000 years.\n\n\nWell, people have been eating animals and cholesterol A LOT longer than 3,000 years, so...wtf?", "2_Subreddit": "Fitness"}], "dviz9ko": [{"0_Comment Submission": "How do you know when you have \"done enough\" at the gym?", "1_Text": "Animals fed soy are inherently not going to have nearly the same concentration of soy-compounds as the plant itself.\n\n\nIs there any evidence soy-fed animal meat has significant amounts of phytoestrogens?\n\n\nOf course, your response is pretty much an ad hominem anyway, but i figured id humor you.", "2_Subreddit": "Fitness"}], "dvjc20u": [{"0_Comment Submission": "Just how damaging is poor form and high intensity?", "1_Text": "Arnold Schwarzenegger swore by cheat curls. Plenty of top lifters do.", "2_Subreddit": "Fitness"}], "dvqeytv": [{"0_Comment Submission": "Eric Serrano - Overhead Deadlift", "1_Text": "For real. When i saw the title i thought \"do they mean overhead squat lockouts off the pins?\"", "2_Subreddit": "weightroom"}], "dvsg6u6": [{"0_Comment Submission": "Trump's opiod policy will include death penalty for dealers. It doesn't include the death penalty for pharma execs who pump pills by the millions into poor communities, which is how the addiction starts. No, the guys being executed will be the guy who just happens to sell smack to someone who OD's.", "1_Text": "I would be fine with it. The liquor store down the street from me sells highly addictive, toxic substances...like liquor.\n\n\nIts quite convenient actually.", "2_Subreddit": "Drugs"}], "dvue9dy": [{"0_Comment Submission": "Pfizer CEO gets 61% pay raise—to $27.9 million—as drug prices continue to climb", "1_Text": "I wouldnt be so sure about that.\n\n\nCombat infantryman is probably more stressful than corporate CEO. Im not one, but i have friends who were. And they got paid dick.\n\n\nBut anyway, how much someone makes isnt about how stressful the job is. Everyone takes as much as they can get. Simple as that. The fat cats can take a lot, so they do.", "2_Subreddit": "Drugs"}], "dvwa18t": [{"0_Comment Submission": "Gainers with labour intensive jobs, what is your diet, recovery and training like?", "1_Text": "I'm an apprentice mason/laborer.\n\n-Shakes during the day with a lot of heavy cream totaling 180g of protein. A light lunch cause i get sluggish if i eat a lot. Thats why I like the shakes. Large dinners, usually lb+ amounts of meat with veggies. Multivitamins and a vitd during the day. 3500+ cals, ~300g of protein daily.\n\n\n-Better living through chemistry: coffee, tea, ephedrine, nicotine gum during the work day with l-theanine supplements so my nervous system doesnt explode. Cannabis and whiskey after work for recovery, but no drugs 2 hours before sleep so i can rest. And no stimulants at least 6 hours before sleep.\n\n\n-Contrast showers. Start hot to clean, then switch to max cold to rinse. Really helps give me energy after a long day. I imagine the cold water helps with inflammation. Stretching/foam rolling when i feel like it.\n\n\nI think the key is to do things in the gym you dont do when working. For example, I dont jump at work, so I do some jump squats when I train.", "2_Subreddit": "gainit"}], "dvz12s5": [{"0_Comment Submission": "Working out everyday", "1_Text": "Its a bad idea to use your whole body every day?\n\n\nI disagree.", "2_Subreddit": "Fitness"}], "dw5n9b5": [{"0_Comment Submission": "Is it fine to eat most of your protein during breakfast?", "1_Text": "People dont know how the human digestion system works.\n\n\nThe larger the meal, the slower its digested, for all macronutrients. If you ingest a large amount of protein at once, it could be 8 hours or more before it all enters your intestines. Yeah, your body can only handle so much protein at once. The rest sits in your stomach waiting to be digested!\n\n\nSo if you eat your breakfast at 9am, you could easily still have protein in your stomach at 5pm.\n\n\nYou guys overthink this WAY too much. Give the human body a little more credit.", "2_Subreddit": "gainit"}], "dw5ogig": [{"0_Comment Submission": "Reducing overall mass for MMA", "1_Text": "Are you high? Trolling?", "2_Subreddit": "Fitness"}], "dw6clb4": [{"0_Comment Submission": "Your best tricks for beating low self esteem when lifting?", "1_Text": "Fuck that! Looking at all the smoking hot, half-naked, sweaty women sticking their asses in the air is just about the most motivating thing there is.\n\n\nIn fact, that would be my answer to OPs question: i look around for the hottest chick in the gym and feel the testosterone pump through me.", "2_Subreddit": "Fitness"}], "dw9dpuh": [{"0_Comment Submission": "Are work out gloves good for you?", "1_Text": "Well, you want your skin to stay soft instead of hard.\n\n\nSo you literally want to be soft.", "2_Subreddit": "Fitness"}], "dwbkspf": [{"0_Comment Submission": "Steamed guns", "1_Text": "\"I love owning slaves!\" -Thomas Jefferson", "2_Subreddit": "The_Donald"}], "dwcxglm": [{"0_Comment Submission": "Is it okay to follow a program for my main lifts, but do what I want for the accessories? (Assuming I'm not slacking)", "1_Text": "Man, its not like were building nuclear reactors here.\n\n\nYou use your muscles to give gravity the middle finger. Thats mostly it. \n\n\nThis shit takes about 20 min to learn, not decades.", "2_Subreddit": "Fitness"}], "dwevs94": [{"0_Comment Submission": "Rant Wednesday", "1_Text": "Why do you care?", "2_Subreddit": "Fitness"}], "dwo57kz": [{"0_Comment Submission": "Sugar addict", "1_Text": "Whats the difference? White rice is essentialy a big pile of glucose.", "2_Subreddit": "Fitness"}], "dwsfmjt": [{"0_Comment Submission": "Found in /trashy. While y'all striking out on Whisper this chick letting the drugs find her.", "1_Text": "This one time he fucked a chick. She stole his wallet and gave him AIDS.", "2_Subreddit": "opiates"}], "dwuhwjy": [{"0_Comment Submission": "[x-posted w/ permission] Here's 41 pages of notes I've taken from 22 podcasts/interviews/seminars from 3 leading strength and conditioning coaches: Stan Efferding, Matt Wenning, and Charles Poliquin. Summaries, cliffnotes, and personal lessons all provided.", "1_Text": "Whats up with peoples fixation on \"broscience\"?\n\n\nThese guys are highly successful professionals with long track-records of coaching the best in the world.\n\n\nThey are fantastic sources of info on this topic even though they arent wearing lab coats and dont have fancy pieces of paper from a university saying how smart they are.", "2_Subreddit": "Fitness"}]}], "1_submissions": [{"6raehm": [{"0_Title": "A Few Minutes on My Front Porch (a rambling about nothing and everything)", "1_Text": "Because some people are cunts?", "2_Subreddit": "opiates"}]}]}]}