{"colemariemns": [{"0_comments": [{"dwirviq": [{"0_Comment Submission": "What did people dismiss as fake that was actually 100% real?", "1_Text": "Toby is the Scranton strangler.", "2_Subreddit": "AskReddit"}], "dwis6w6": [{"0_Comment Submission": "I guess it was a good day", "1_Text": "I've been fortunate enough too have quite a few good dboys but my favorite one really came thru for me when I was in a shitty spot. My crib got raided at like 7am I'm handcuffed outside in my underwear for like two hrs. They take me in and I'm back and forth interagation holding interagation holding all fucking day by the time I get to the jail it's midnight I made bond but none of my family was answering the phone so I left messages and gave up I was just going to wait till morning at like 3am they call my boyfriend and my name and said y'all made bond let's go. I'm thinking it's my dad or some shit but nah I walk out and my dboy is standing there talking bout I been calling up here all day tryna get y'all out 😂 so he's driving us home can see that we are both sick af throws me his sack (about a ball) tells me get well don't worry about it and get with him tomm. He was honestly the last person I expected to see but we ended up being really close after that he would pay my car payment and shit if it was due before payday and when I actually did go to jail he put money on my books the whole year ha.", "2_Subreddit": "opiates"}], "dwishyq": [{"0_Comment Submission": "What's the most legal trouble you've been in?", "1_Text": "Intent to distribute sch 1/2\nConspiracy distribution sch 1/2\nDistribution sch 1/2\nDistribution sch 1/2\nTrafficking, manufacturing distribution sch 1/2\n\nThat all stemmed from a raid on my house after they had been following my SO and I for about 3 months after my SO did a deal with an undercover fast forward about a month I missed pretrial and they put out a warrant that I was not made aware of about a week after it was issued I get pulled over and the cop goes heeheeehee I been waitin to see your car step out of the vehicle I get arrested again and get charged with  2 more felony possession charges. \n\nIt sucked I didn't make bond for that lol.", "2_Subreddit": "AskReddit"}], "dwisls1": [{"0_Comment Submission": "I guess it was a good day", "1_Text": "Yeah he did alot for me honestly but I was paying a months rent or more for him every week he honestly couldn't afford to take the loss. He was hurting for a while when I first got locked up. I ended up releasing my property to him so he could get my phone and get with all my people That's why he kept me straight all year. We ended up getting into it over some dumb shit and just kinda cut ties tho. I do miss him sometimes lol", "2_Subreddit": "opiates"}], "dwisogx": [{"0_Comment Submission": "Drugs in Nice, Fr ?", "1_Text": "I wouldn't bring anything airports have body scanners", "2_Subreddit": "Drugs"}], "dwisrcz": [{"0_Comment Submission": "Mobile users of reddit, what sentence does your phone come up with when you keep pressing the first predictive text?", "1_Text": "I will be there at this time and I will be there at the same time as yesterday I don't have a lot so I will have to get a new bag and the only thing I can think of is that the one you sent me is not enough.", "2_Subreddit": "AskReddit"}], "dwiwbdv": [{"0_Comment Submission": "I guess it was a good day", "1_Text": "Doesn't everyone 🙄", "2_Subreddit": "opiates"}], "dwiwde9": [{"0_Comment Submission": "I guess it was a good day", "1_Text": "He wasn't worried about that. I've been in trouble many of times and never told on anyone and he's been around for it.", "2_Subreddit": "opiates"}], "dwiwiou": [{"0_Comment Submission": "I guess it was a good day", "1_Text": "And I was originally charged with 6 felonies for distro2x intent to distro  2x conspiracy to distro and trafficking/manufacturing bc my ex sold to an undercover and I was there they stalked us for 3 months and then hit me one morning", "2_Subreddit": "opiates"}], "dwiwlcn": [{"0_Comment Submission": "If you could choose,how would you die?", "1_Text": "Heroin overdose", "2_Subreddit": "AskReddit"}], "dwj1swz": [{"0_Comment Submission": "I guess it was a good day", "1_Text": "Yeah what is crazy is idk if you ever used opiate roll call up here they took it down shortly after this happened but a guy that I helped one day bc he was sick and like begging for help ended up getting him right for probably like six months pretty regularly and one day he was like hey can you help my cousin I'm not in town and he's sick. It ended up being an undercover cause he got caught up and was a lil bitch about it.", "2_Subreddit": "opiates"}], "dwj1vvx": [{"0_Comment Submission": "I guess it was a good day", "1_Text": "It was only one time but it's was a pretty decent amount of hb and boy all in all I think it was around 500 for the whole transaction.", "2_Subreddit": "opiates"}], "dwj69df": [{"0_Comment Submission": "Post ice. Morning air makes me sick", "1_Text": "Outside makes me uncomfortable af all throughout and after tbh", "2_Subreddit": "Stims"}], "dwj9csd": [{"0_Comment Submission": "Post ice. Morning air makes me sick", "1_Text": "The sun really fucks me like legit makes me feel like something is really wrong lol", "2_Subreddit": "Stims"}], "dwjy7ct": [{"0_Comment Submission": "Post ice. Morning air makes me sick", "1_Text": "Yeah I get all that but That's not it. it happens even when I just start. I don't like going out side I won't even go out to smoke a cig lol idk how to explain it", "2_Subreddit": "Stims"}], "dwjybap": [{"0_Comment Submission": "Post ice. Morning air makes me sick", "1_Text": "Yes dude", "2_Subreddit": "Stims"}], "dwpu0ek": [{"0_Comment Submission": "How to put something up my gayhole and not want to poop", "1_Text": "Right? 🤔", "2_Subreddit": "Stims"}], "dwpu5ey": [{"0_Comment Submission": "Why can’t this bish get high and be cool? It’s like damn, it’s cool if yo ass wanna get yo meff on AND sucky sucky too of course but not if you gonna start acting like a crazy MF acting a fool. Damn.", "1_Text": "You already got top and the bitch is wylin ain't no rock an no hard place. Tell her gtfo 😂", "2_Subreddit": "Stims"}], "dwpu9sh": [{"0_Comment Submission": "How to put something up my gayhole and not want to poop", "1_Text": "Lmao or this sub.", "2_Subreddit": "Stims"}], "dwpudiz": [{"0_Comment Submission": "How to put something up my gayhole and not want to poop", "1_Text": "There is a Dr involved why doesn't the Dr know?", "2_Subreddit": "Stims"}], "dwrltd4": [{"0_Comment Submission": "How my Bad Trip Turned into the Most Traumatic Day of My Life.", "1_Text": "Sounds more like 2ci or something in my opinion for the little amount you took you shouldn't have been hallucinating all types of crazy like that. Colors should have brightened things a little wavy maybe but I've never heard some shit like that off l.   Personally I've had a pretty tramatic experience with just a tab of 2ci tho 🤷 sorry you had such a terrible first trip dude.", "2_Subreddit": "Drugs"}], "dws3ys8": [{"0_Comment Submission": "First time combining coke and edibles. It’s weiiiiiird. Is the term “softball” already coined in the drug world?? Anyone else tried this combo?", "1_Text": "Softball is Coke", "2_Subreddit": "Drugs"}], "dws4loy": [{"0_Comment Submission": "First time combining coke and edibles. It’s weiiiiiird. Is the term “softball” already coined in the drug world?? Anyone else tried this combo?", "1_Text": "Nah at least in my state it's pretty widly understood. Hardball is crack softball is Coke it's more a dealer word than a user word in my opinion I just call it girl or soft most of the time", "2_Subreddit": "Drugs"}], "dwsy5h3": [{"0_Comment Submission": "I hate it when", "1_Text": "Omg 😂", "2_Subreddit": "Stims"}], "dwsytia": [{"0_Comment Submission": "I hate it when", "1_Text": "Not Everytime tho lol it usually only starts if I'm high in my room in the middle of the night or someone else starts it but it's kinda funny that you say that bc my supplier is actually the one who started all of it by wanting to bring all of it to my house to show me and now I have 2 habits and the gelpen one might cost me more in the long run", "2_Subreddit": "Stims"}]}], "1_submissions": [{"81bybl": [{"0_Title": "So is this strange or..", "1_Text": "Toby is the Scranton strangler.", "2_Subreddit": "opiates"}], "81d0ac": [{"0_Title": "Waited and waited for the sandman to show but he never came so day 3 here we go", "1_Text": "Toby is the Scranton strangler.", "2_Subreddit": "Stims"}], "81otxl": [{"0_Title": "To crash or not to crash", "1_Text": "Toby is the Scranton strangler.", "2_Subreddit": "Stims"}], "81rmn0": [{"0_Title": "When you finally finish but the video is still going and you tryna figure out how you got this way", "1_Text": "Toby is the Scranton strangler.", "2_Subreddit": "u_colemariemns"}], "81rndv": [{"0_Title": "When you finally finish but the video is still going", "1_Text": "Toby is the Scranton strangler.", "2_Subreddit": "Stims"}], "826qhb": [{"0_Title": "For those who were keeping up, it finally happened", "1_Text": "Toby is the Scranton strangler.", "2_Subreddit": "Stims"}], "82uak0": [{"0_Title": "Dead&co novrmber 21st 2017 in DC", "1_Text": "Toby is the Scranton strangler.", "2_Subreddit": "LSD"}], "83sc85": [{"0_Title": "But you haven't slept in 92 hrs and you're pretty sure its not true but there actually might be someone in there.", "1_Text": "Toby is the Scranton strangler.", "2_Subreddit": "Stims"}], "84lzms": [{"0_Title": "The worst part", "1_Text": "Toby is the Scranton strangler.", "2_Subreddit": "Stims"}], "859p41": [{"0_Title": "Where'd the last five hrs of my life go? Oh there they are. Fuck.", "1_Text": "Toby is the Scranton strangler.", "2_Subreddit": "Stims"}], "85m3a3": [{"0_Title": "🙃", "1_Text": "Toby is the Scranton strangler.", "2_Subreddit": "opiates"}], "86fcvh": [{"0_Title": "Creeds a pens fan", "1_Text": "Toby is the Scranton strangler.", "2_Subreddit": "DunderMifflin"}], "8785vr": [{"0_Title": ".", "1_Text": "Toby is the Scranton strangler.", "2_Subreddit": "u_colemariemns"}], "89hmn3": [{"0_Title": "I hate it when", "1_Text": "Toby is the Scranton strangler.", "2_Subreddit": "Stims"}], "8aetxj": [{"0_Title": "This wish ad made me laugh and also made me so uncomfortable with how much my phone is listening to me 😂🤔", "1_Text": "Toby is the Scranton strangler.", "2_Subreddit": "Stims"}], "8aetyl": [{"0_Title": "This wish ad made me laugh and also made me so uncomfortable with how much my phone is listening to me 😂🤔", "1_Text": "Toby is the Scranton strangler.", "2_Subreddit": "Stims"}]}]}]}