{"mdyguy": [{"0_comments": [{"dwidvwt": [{"0_Comment Submission": "I think I'm falling down the hole again", "1_Text": "awww I've done my own xanax detox before. It took me like 3 months but I was drinking at the same time and they're like substitutes for each other. So I never had a seizure but I also did it slow. If you need help with xanax absolutely get help--one of the few drugs that causes death from withdrawal not to mention it's deadly complications.\n\nPlease care for yourself. You sound like you might be a codependent.  I am too. It's not easy. But you have to put yourself first sometimes.", "2_Subreddit": "opiates"}], "dwih75j": [{"0_Comment Submission": "So I'm gonna tell you a story, and I want to know what you think really happened.", "1_Text": "Usually the simple answer is the right answer in real life but in drug life, I've learned there is no easy answer. Who knows what he was thinking? I mean, there is a chance he had OCD and his mind would only allow him to buy 6 bags at once. There is any number of reason why he did what he did lol.", "2_Subreddit": "opiates"}], "dwivndk": [{"0_Comment Submission": "Robbed my connect", "1_Text": "What if he didn't know you robbed him until you told him? Like if he didn't count the cash. Or didn't count the cash until later and thought he could have lost it.  \n\nI've shorted my dealer once by accident. Only for $20 on a $100 sale. He never said anything about it. He regularly shorts me too though btw...by accident as well because he has a shitty scale. He shorts me a point all the time. I always weigh my shit without the bag on one of those really accurate gem scales from Amazon....and so often it'll be .9 or even .84 instead of 1.00g. It's annoying as hell but if I called him out on it I would look like a little bitch for weighing it out.", "2_Subreddit": "opiates"}], "dwj1e31": [{"0_Comment Submission": "Thanks to Bethesda, MD for acknowledging men as victims", "1_Text": "I read it as \"Everyone deserves to feel afraid\" because I skimmed it really fast. I was like wtf!", "2_Subreddit": "maryland"}], "dwjc2ig": [{"0_Comment Submission": "Robbed my connect", "1_Text": "you pull out a scale with a man, a baltimore gang member, as he weighs out your shit with a pistol in the console, and tell him he's short... it's not happening for me....I'll take the loss. \n\nIf I didn't pull it out in front of him then it wouldn't matter at that point. His scale is one of those cheap headshop ones--on his scale it says 1g. I'm with him while he weighs it out 90% of the time.", "2_Subreddit": "opiates"}], "dwjjxca": [{"0_Comment Submission": "\"It's happening. We're getting pulled over.\"", "1_Text": "omg same thing happened to me 2 weeks. As soon as I passed a cop pulled over on the side of the road, he flashes his lights on, I pull over, and he flies by and gets someone further down the road who I assume ran a stop sign. I didn't even have time to put the shit in my pants--I would have had to do it while he was approaching--that's how little time I had between the time I passed him and the time his lights went on.", "2_Subreddit": "opiates"}], "dwjwet9": [{"0_Comment Submission": "Robbed my connect", "1_Text": "He comes to the county and delivers so it's convenience. Plus, there's two different types of dope in baltimore. One is called scramble and it's really only for shooting. It's in crack vials mixed with quinine and that's what most of the corner dboys have. Actually, now we have a 3rd and it's fent and I'm not sure how available it is but my dude has that too.  It would be hit or miss on the corner, but mostly miss, finding someone with weight. You can def get pulled over for being white. 3 of my friends have the very first times they went to the hood to cop.", "2_Subreddit": "opiates"}], "dwk8098": [{"0_Comment Submission": "Lying to your doctor for opiates is an art, and I’m Salvador Dopi", "1_Text": "I've actually heard of this. Did you read about doing this online or did you come up with it yourself?", "2_Subreddit": "opiates"}], "dwkd0t4": [{"0_Comment Submission": "Waiting is the fucking worst", "1_Text": "Are you good now? It's 11:50 pm EST. I hope you are. I really couldn't imagine him not being available by now if he said he might be available before 9pm. But I know how this works. Whatever time he says, ****DOUBLE IT.****", "2_Subreddit": "opiates"}], "dwl23u2": [{"0_Comment Submission": "Waiting is the fucking worst", "1_Text": "shittt thats awful--so sorry", "2_Subreddit": "opiates"}], "dwmt6sg": [{"0_Comment Submission": "Fuckable", "1_Text": "I'd make out with him", "2_Subreddit": "broslikeus"}], "dwn7mgs": [{"0_Comment Submission": "Phones still broken :( But heres a little something :P", "1_Text": "Gorgeous per usual", "2_Subreddit": "twinks"}], "dworkiu": [{"0_Comment Submission": "Lost my job of 4 years--the one thing is was proud of in my life", "1_Text": "This is why we need universal healthcare! Right now, you can probably get Medicaid. I would do that and then try to get some really good treatment.", "2_Subreddit": "opiates"}], "dwrw20z": [{"0_Comment Submission": "what you think? adding people on kik and snap.", "1_Text": "hottt", "2_Subreddit": "boysgonewild"}], "dwsoz7z": [{"0_Comment Submission": "First ball python.", "1_Text": "I don't know much about ball pythons but I just watched Brian Barcyzk's video today where he said he had some ball pythons not feed for 14 months before. He def said this as an extreme example though. If I were you I would speak to a vet who is familiar with reptiles.", "2_Subreddit": "ballpython"}], "dwtwc21": [{"0_Comment Submission": "I passed my drug test for my job using “XSTREAM” synthetic urine. THANK GOD!!!", "1_Text": "omg there are so many dumb people in /r/opiates now. I miss when it was normal. You shouldn't have had to even dealt with replying to this idiot. He doesn't know how reddit works. Why would he reply to you and then say he's referring to some random product you're not talking about?", "2_Subreddit": "opiates"}], "dwut3xx": [{"0_Comment Submission": "The brewery I work for just had their first can release! I could not be more proud of our team. That real Florida orange juice", "1_Text": "Love it and want to try it!", "2_Subreddit": "beerporn"}], "dwv8ro8": [{"0_Comment Submission": "You can become $100,000 richer, catch is you get this money by taking $100 from 1,000 charities. No one would ever know, would you do it, why or why not?", "1_Text": "No, because guilt.", "2_Subreddit": "AskReddit"}], "dwviotm": [{"0_Comment Submission": "Nothing like sealed bottles to start my day.", "1_Text": "My friend's dad gets them like this once a month.", "2_Subreddit": "opiates"}], "dwvj0oo": [{"0_Comment Submission": "I'm Eric Hafner, I'm running for U.S. Congress in Portland, Oregon (OR-3). I want to legalize all drugs, including opiates, but offer ibogaine therapy too, and free drugs for addicts via prescription.", "1_Text": "We desparartely need you. Most opiate addicts who start with pills do so, so they can be *more* productive not to nod out. People begin to enjoy nodding out when they make the switch to heroin because it really is the pinnacle of a heroin high, while we would much rather be oxy-ed up and doing work. Just how people take adderall to be more productive.   \nEDIT: I just realized I wrote this assuming you know that people stop taking oxy because there is a shortage on the streets and prices are high.", "2_Subreddit": "opiates"}], "dwvjgj2": [{"0_Comment Submission": "Around 200 pressed busses, just woke up from a long blackout", "1_Text": "Wait so you live in Florida now? What part? I always wanted to move to Florida. Good for you if that's what you really wanted to do.", "2_Subreddit": "opiates"}], "dwvjyp9": [{"0_Comment Submission": "I'm Eric Hafner, I'm running for U.S. Congress in Portland, Oregon (OR-3). I want to legalize all drugs, including opiates, but offer ibogaine therapy too, and free drugs for addicts via prescription.", "1_Text": "Yep, drug prohibition is the root cause of all the drug problems we have in the United States. It's not natural for a society to run drug-free. Even in ancient times people used drugs. Improving our lives with chemistry is just natural.", "2_Subreddit": "opiates"}], "dwy4zh2": [{"0_Comment Submission": "My 2 favorite possessions", "1_Text": "Dude, that's an amazing gun.", "2_Subreddit": "opiates"}], "dwy507b": [{"0_Comment Submission": "My 2 favorite possessions", "1_Text": "Why .45 instead of 9mm?\n\nI was going to get an FN but I now want a CZ...I'll never get it lol", "2_Subreddit": "opiates"}], "dwy564l": [{"0_Comment Submission": "Around 200 pressed busses, just woke up from a long blackout", "1_Text": "You're my spirit animal", "2_Subreddit": "opiates"}]}], "1_submissions": [{"7l7ag5": [{"0_Title": "What did I get?", "1_Text": "awww I've done my own xanax detox before. It took me like 3 months but I was drinking at the same time and they're like substitutes for each other. So I never had a seizure but I also did it slow. If you need help with xanax absolutely get help--one of the few drugs that causes death from withdrawal not to mention it's deadly complications.\n\nPlease care for yourself. You sound like you might be a codependent.  I am too. It's not easy. But you have to put yourself first sometimes.", "2_Subreddit": "opiates"}], "7o8vtx": [{"0_Title": "When you're trying to register...", "1_Text": "awww I've done my own xanax detox before. It took me like 3 months but I was drinking at the same time and they're like substitutes for each other. So I never had a seizure but I also did it slow. If you need help with xanax absolutely get help--one of the few drugs that causes death from withdrawal not to mention it's deadly complications.\n\nPlease care for yourself. You sound like you might be a codependent.  I am too. It's not easy. But you have to put yourself first sometimes.", "2_Subreddit": "opiates"}], "840ko4": [{"0_Title": "Are some drug users seeking validation from their dealers?", "1_Text": "awww I've done my own xanax detox before. It took me like 3 months but I was drinking at the same time and they're like substitutes for each other. So I never had a seizure but I also did it slow. If you need help with xanax absolutely get help--one of the few drugs that causes death from withdrawal not to mention it's deadly complications.\n\nPlease care for yourself. You sound like you might be a codependent.  I am too. It's not easy. But you have to put yourself first sometimes.", "2_Subreddit": "opiates"}]}]}]}