{"BudDwyer666": [{"0_comments": [{"dw8ss47": [{"0_Comment Submission": "World's 9th Largest Stock Exchange To Launch Cryptocurrency Brokerage", "1_Text": "Happy birthday", "2_Subreddit": "litecoin"}], "dw97pny": [{"0_Comment Submission": "Let's hear those stories", "1_Text": "Don’t have any real stories. I work in a warehouse and we’re all pretty open about being high at work. The first time I went in though I didn’t know this, and had smoked a good bit of weed before I walked in. I was struggling to remember where I had to go and one of the higher ups saw me and said “you’re high out of your mind aren’t you?” And I startle-yelled “NO” and fast walked to the bathroom.", "2_Subreddit": "opiates"}], "dw9hqeb": [{"0_Comment Submission": "FREE TALK WEEKEND - [March 23, 2018]", "1_Text": "I wonder if it’s named after the water or the pornstar.", "2_Subreddit": "G59"}], "dwdigoe": [{"0_Comment Submission": "Round 1 Voting: Unrendered vs DeadBoy / PaidProgramming2 vs HermitOfEastGrandRiver", "1_Text": "Unrendered,paid programming", "2_Subreddit": "TeamSESH"}], "dwgfg8q": [{"0_Comment Submission": "I'm a bit sad, is it ok to vent a little?", "1_Text": "I really agree with that Suicide part and it’s the only reason I haven’t yet really. Life feels like a good grandparent. Like, you’ve gotta do a lot of shit you don’t want to do, and you could go home (end it), but it would really upset your grandkids if you didn’t hang out and be nice to them. You’re just here for them because you love them, even though it’s not something you’d do yourself.", "2_Subreddit": "cripplingalcoholism"}], "dwgyvli": [{"0_Comment Submission": "Base tryptamines - MiPT, MET, DPT, DiPT, research experiences?", "1_Text": "Also getting samples of these soon and I am eagerly awaiting my package.", "2_Subreddit": "researchchemicals"}], "dwi78lx": [{"0_Comment Submission": "Vaporized dissos (regarding forms and subjective experience differences, and forms)", "1_Text": "Recommended to freebase most salts before smoking. I’m unsure about pce but I have freebased 3-Meo-pcp before and it worked well. Just same standard operation to freebase any chemical, it should form a yellow oil.", "2_Subreddit": "DissonautUniverse"}], "dwlkf8k": [{"0_Comment Submission": "Anatomy of a dope fiend (original artwork)", "1_Text": "Perhaps he means stealing. Have a few friends who caught felonies with those sticky fingers.", "2_Subreddit": "opiates"}], "dwlki8m": [{"0_Comment Submission": "ARGGGHHHH BITCOIN!!!", "1_Text": "Try litecoin. Less transfer fees. \n\nAlso, been thinking about ordering some dope to a friend’s house. He’s ok with it but the last thing I want to do is get him in trouble. How is ordering dope with the epidemic going on? I figured it wasn’t safe to order powders or pills atm.", "2_Subreddit": "opiates"}], "dwlkox7": [{"0_Comment Submission": "On vacation and really craving", "1_Text": "Jesus this is true. I’ve been trying to drop some habits but always come back. I can always remember my first opiate nod and how great I felt, but when I go back to it I remember it no longer works for me. I just sit there feeling normal and reflect on myself and what a piece of shit I have become.", "2_Subreddit": "opiates"}], "dwlzqt4": [{"0_Comment Submission": "ARGGGHHHH BITCOIN!!!", "1_Text": "I really didn’t consider domestic honestly. Will have to get some soon then. I just ordered a bunch of RC psychs from Canada in hopes I’ll have a life changing trip and want to quit doing drugs and change my life for the better, but it’ll most likely be another failed attempt at escape from what dreams like that have turned me into.", "2_Subreddit": "opiates"}], "dwm0wak": [{"0_Comment Submission": "Death Toll of Capitalism", "1_Text": "I’d say militarism and imperialism caused ww1, which really got the ball rolling on ww2. Capitalism was just a tool used in the process. After Germany was forced to pay reparations after ww1, they had some serious economic issues. Because of this it left their angry poor population susceptible to anyone with a group to blame, which happened to be Hitler saying that the Jewish bankers were responsible for the poor economic state of Germany. I sometimes wonder if he really believed this or if he was just smart enough to ride the wave of Jewish hate he started to the top. Either way, he’s still a disgusting person. Imo capitalism and imperialism go hand in hand, and are both equally as problematic.", "2_Subreddit": "communism"}], "dwmm2vj": [{"0_Comment Submission": "ARGGGHHHH BITCOIN!!!", "1_Text": "Right now I wish I had the freedom for a hobby. I wake up at 5:30 and hit school (I’ll be done with it soon so that’s a relief) and then I go straight to work. I don’t get home till 7-8 most nights. My dboy is a close friend that I work with so he’s almost always around but I think if I tell him I’m done he’ll understand. Ive honestly though about starting a cactus garden but just for mescaline. Rn all I do is get home, play Xbox and nod until I fall asleep and wake up and start the day again.", "2_Subreddit": "opiates"}], "dwmm6k7": [{"0_Comment Submission": "ARGGGHHHH BITCOIN!!!", "1_Text": "Honestly I see a resourcefulness in the drug communities more than I do in regular life and I really enjoy it. That’s a great plan lmao.", "2_Subreddit": "opiates"}], "dwmztac": [{"0_Comment Submission": "Death Toll of Capitalism", "1_Text": "Ahhh. I’ve always wondered so thank you for answering this for me.", "2_Subreddit": "communism"}], "dwmzvbj": [{"0_Comment Submission": "Death Toll of Capitalism", "1_Text": "I hadn’t really thought about the history of jewish people when I was thinking about that honestly.", "2_Subreddit": "communism"}], "dwo3y72": [{"0_Comment Submission": "How do I tell if seeds are washed or not?", "1_Text": "I also had weak grocery store seeds. Try using lemon juice in your wash. Half a bag did nothing, then I used lemon juice hand had some DXM prior to dosing and it knocked me on my ass.", "2_Subreddit": "PoppyTea"}], "dwo5dah": [{"0_Comment Submission": "What’s an Eric Andre quote that could go in my Instagram bio?", "1_Text": "Is that a band or a song?", "2_Subreddit": "ericandre"}], "dwo5gfn": [{"0_Comment Submission": "What substance has made your friends who aren't themselves in the scene (except when you share with them) the most impressed or most enjoyed it?", "1_Text": "It took you two?", "2_Subreddit": "researchchemicals"}], "dwomrg6": [{"0_Comment Submission": "Random Baby just puked on me", "1_Text": "That’s the fucking line", "2_Subreddit": "Drugs"}], "dwrkhkl": [{"0_Comment Submission": "An oldie but a goodie", "1_Text": "I fucking love Mac Demarco. Can play a couple songs on guitar by him. I don’t know a single person irl that likes him but he’s huge online.", "2_Subreddit": "opiates"}], "dwt8xhd": [{"0_Comment Submission": "An oldie but a goodie", "1_Text": "Personally his newest is my favorite but if I had to recommend an album to start with it’d be 2.", "2_Subreddit": "opiates"}], "dwxnu2x": [{"0_Comment Submission": "Did anyone feel the urge to lie during their evaluation?", "1_Text": "I’m an impulse liar about stupid things. In real life, I lead hundreds of different lives. I don’t mean to do this, I just rather people not know what to think of me. I’m honest with friends of mine, they are my friends because I do not feel the need to hide my life from them. I just find it very easy to make people think what they want of me. Dating has always been easy for me because I know what I’m supposed to say or supposed to feel, but the problem is my feelings for that person last a couple months tops and I’ll end up with them for almost a year normally.", "2_Subreddit": "sociopath"}], "dwyrif2": [{"0_Comment Submission": "What drug did I take?", "1_Text": "Normal dose for 2c-b-fly orally is like 10-12 mg. I tried it snorted and plugged as well. Snorted was the most agonizing experience I’ve had on a drug. I had 5 mg and it felt like someone was pulling barbed wire out of my nose.", "2_Subreddit": "Drugs"}], "dwyuy8d": [{"0_Comment Submission": "\"I'll add one or two more lockers JUST in case.\" 15 minutes later...", "1_Text": "I labeled all of mine all of the different resources and filled them before I completed the game.", "2_Subreddit": "subnautica"}]}], "1_submissions": [{"5zdqa2": [{"0_Title": "DBoy story", "1_Text": "Happy birthday", "2_Subreddit": "opiates"}], "60hhxw": [{"0_Title": "Gift card fraud at Walmart", "1_Text": "Happy birthday", "2_Subreddit": "Scammingcommunity"}], "66vtuq": [{"0_Title": "Antifa website?", "1_Text": "Happy birthday", "2_Subreddit": "Anarchism"}], "697h4g": [{"0_Title": "PsychRollCall?", "1_Text": "Happy birthday", "2_Subreddit": "Psychedelics"}], "6b17jx": [{"0_Title": "Hydroxycut", "1_Text": "Happy birthday", "2_Subreddit": "Stims"}], "6c6mq0": [{"0_Title": "3-Meo-PCP... Did I get shorted?", "1_Text": "Happy birthday", "2_Subreddit": "researchchemicals"}], "6dkcp4": [{"0_Title": "3-MEO-PCP dips", "1_Text": "Happy birthday", "2_Subreddit": "researchchemicals"}], "6fe5p4": [{"0_Title": "General worry about getting older", "1_Text": "Happy birthday", "2_Subreddit": "opiates"}], "6g1twu": [{"0_Title": "Plan-It-X", "1_Text": "Happy birthday", "2_Subreddit": "FolkPunk"}], "6jeps8": [{"0_Title": "How do I get rid of trams?", "1_Text": "Happy birthday", "2_Subreddit": "opiates"}], "6ln3vj": [{"0_Title": "Nasal 2C-B-FLY dosage", "1_Text": "Happy birthday", "2_Subreddit": "researchchemicals"}], "6nqjpa": [{"0_Title": "Reddit DS3 official in game password?", "1_Text": "Happy birthday", "2_Subreddit": "darksouls3"}], "6ovp6i": [{"0_Title": "Drug testing and my unnecessary paranoia", "1_Text": "Happy birthday", "2_Subreddit": "Drugs"}], "6q3yd0": [{"0_Title": "Apparently weed can be laced with heroin", "1_Text": "Happy birthday", "2_Subreddit": "opiates"}], "6qlloj": [{"0_Title": "Consecutive 3-Meo-PCP use", "1_Text": "Happy birthday", "2_Subreddit": "researchchemicals"}], "6tzdq8": [{"0_Title": "Soreness in right leg when I try hallucinogens?", "1_Text": "Happy birthday", "2_Subreddit": "Psychedelics"}], "71rrzp": [{"0_Title": "3-m-furanylfentanyl", "1_Text": "Happy birthday", "2_Subreddit": "fentanyl"}], "724rri": [{"0_Title": "A week off the wagon", "1_Text": "Happy birthday", "2_Subreddit": "cripplingalcoholism"}], "73o3jx": [{"0_Title": "BRM still active or no?", "1_Text": "Happy birthday", "2_Subreddit": "PoppyTea"}], "861olk": [{"0_Title": "Fear of not shitting", "1_Text": "Happy birthday", "2_Subreddit": "opiates"}]}]}]}