{"3nigma_": [{"0_comments": [{"dvylkjg": [{"0_Comment Submission": "Is it Necessary to Do Cold Water Extraxtions", "1_Text": "Kratom counts, it affects your opioid tolerance", "2_Subreddit": "opiates"}], "dw2rr2x": [{"0_Comment Submission": "Best drugs with opiates?", "1_Text": "Yh that's what I normally do but had no weed today :(", "2_Subreddit": "opiates"}], "dw2rs9x": [{"0_Comment Submission": "Best drugs with opiates?", "1_Text": "Is it actually dangerous? I didn't know xanax was a cns depressant, I just thought that it made you drowsy\n\nEdit: dangerous in the sense that say I smoked x amount of heroin on its own its fine but if I smoke that much and have 2mg xanax I'd die?", "2_Subreddit": "opiates"}], "dw2vu5j": [{"0_Comment Submission": "Best drugs with opiates?", "1_Text": "Doesn't that shit make you hallucinate?", "2_Subreddit": "opiates"}], "dw3f97c": [{"0_Comment Submission": "Best drugs with opiates?", "1_Text": "Thanks, I didn't know that. The xans ruined the high anyways", "2_Subreddit": "opiates"}], "dw5f5us": [{"0_Comment Submission": "Runescape an opiates", "1_Text": "We should make an opiate fc on osrs lol", "2_Subreddit": "opiates"}], "dw6fwur": [{"0_Comment Submission": "Man i fucking love morphine", "1_Text": "How does this work? Aren't opiates pain killers?", "2_Subreddit": "opiates"}], "dw6gdtc": [{"0_Comment Submission": "Man i fucking love morphine", "1_Text": "Maybe dehydration? I always get the dirtiest headaches after a H binge", "2_Subreddit": "opiates"}], "dw6h1ij": [{"0_Comment Submission": "Any Reddit forums with stamp reviews????", "1_Text": "Like u/er1cl said all the good subs were banned for sourcing because of vice articles :'(", "2_Subreddit": "opiates"}], "dw6h7m7": [{"0_Comment Submission": "Any Reddit forums with stamp reviews????", "1_Text": "I can't see the comment you thelastcig said but I'm assuming you're talking about dread?", "2_Subreddit": "opiates"}], "dw7gduu": [{"0_Comment Submission": "Best drugs with opiates?", "1_Text": "I took .5 wth no tolerance because it's not my DoC and then took about 1.5mg more because, you know, you always convince yourself you're not high when you're fucked.  :)", "2_Subreddit": "opiates"}], "dw7gi01": [{"0_Comment Submission": "Best drugs with opiates?", "1_Text": "I've blacked  out on them before, I know it can fuck you,  I just thought the xanax would add to the high without adding to the respiratory depression.", "2_Subreddit": "opiates"}], "dw7gu7y": [{"0_Comment Submission": "Any Reddit forums with stamp reviews????", "1_Text": "Yeah I was high when you originally posted it but I still can't see the originals comment! I can see your reply though with the img link in it,like you said I think Reddit allows all comments to be posted but not all of them are seen by other people", "2_Subreddit": "opiates"}], "dw8pnax": [{"0_Comment Submission": "Rare Form of Amnesia Linked to Fentanyl Overdoses is Spreading", "1_Text": "LSD fucked me up. Badly. All drugs have negatives to them and there's always some people that experience them. The so called profound realisations you have about life on lsd I already got from weed. LSD just made me experience ego death and an overwhelming feeling of impending doom. This was both times I tried it.", "2_Subreddit": "opiates"}], "dwha28w": [{"0_Comment Submission": "The worst withdrawal symptom", "1_Text": "I think the OP's point wasn't that his tragedy is bigger so you should stop complaining, rather his is worse due to him being a user for longer and I think he's trying to advise you to quit while you're ahead - those WD's only get worse down the road. Although you probably already know that.", "2_Subreddit": "opiates"}], "dwhkp9y": [{"0_Comment Submission": "Proper way to do a CWE?", "1_Text": "This isn't true. When extracting the water needs to be cold, yes, but when your initially putting the crushed pills in water it can be easier to use warm water.", "2_Subreddit": "opiates"}], "dwhl6pu": [{"0_Comment Submission": "Proper way to do a CWE?", "1_Text": "I agree when you say newbies fuck it up, but his original question was based off of the fact that he saw conflicting answers online, so your answer doesn't help when you know it's wrong & you shouldn't then downvote me for being right, when you know I'm right.", "2_Subreddit": "opiates"}], "dwswsvo": [{"0_Comment Submission": "1st CWE try", "1_Text": "looks exactly how it's supposed to", "2_Subreddit": "opiates"}], "dwv9qqu": [{"0_Comment Submission": "How dangerous...", "1_Text": "Long as you're not nodding, you'll be fine. The issue is you may have one beer, think you're fine and have another and then another and then another...honestly though, for me, I've downed vodka and smoked h just to find the alcohol ruins the high but I never OD'd or had a very low heart rate, that's just for me though YMMV so be careful and if you're going to do it put as much time in between your last line and your first beer and keep track of your heart rate.", "2_Subreddit": "opiates"}], "dwvcjon": [{"0_Comment Submission": "How dangerous...", "1_Text": "tbf that was a social event, just with a bunch of friends who tend to have less socially acceptable ideas for fun haha", "2_Subreddit": "opiates"}]}], "1_submissions": [{"84uhve": [{"0_Title": "Difference between Turkish and afghan?", "1_Text": "Kratom counts, it affects your opioid tolerance", "2_Subreddit": "opiates"}], "866n1y": [{"0_Title": "Best drugs with opiates?", "1_Text": "Kratom counts, it affects your opioid tolerance", "2_Subreddit": "opiates"}]}]}]}