{"Boost_Attic_t": [{"0_comments": [{"dt2112m": [{"0_Comment Submission": "NFC CHAMPIONSHIP RECAP THRRAD", "1_Text": "Yeah I really think I would have preferred another heartbreaking loss in a game we played our dicks off. Instead of watching a game that looks like we were paid to lose", "2_Subreddit": "minnesotavikings"}], "du4ect8": [{"0_Comment Submission": "LPT: Most modern microwaves have a mute function to turn off the beep. Typically it's by holding 0 for 3 seconds", "1_Text": "I was so excited to try microwave tetris...", "2_Subreddit": "LifeProTips"}], "du4eq3l": [{"0_Comment Submission": "If you are the person who invented this type of sticker nobody likes you.", "1_Text": "Never even thought about how many possible items have been invented by a person, to solve a problem from another item invented by the same person....", "2_Subreddit": "funny"}], "du4f1rn": [{"0_Comment Submission": "TIL Michael Jackson used to relentlessly prank call Russel Crowe, even though they never met each other in person.", "1_Text": "Do more! Do more!", "2_Subreddit": "todayilearned"}], "du4f30f": [{"0_Comment Submission": "TIL Michael Jackson used to relentlessly prank call Russel Crowe, even though they never met each other in person.", "1_Text": "Kinda sounds like a bad porno", "2_Subreddit": "todayilearned"}], "du4fl5w": [{"0_Comment Submission": "LPT: Most modern microwaves have a mute function to turn off the beep. Typically it's by holding 0 for 3 seconds", "1_Text": "That takes all the fun out of it, the man really has a way with words", "2_Subreddit": "LifeProTips"}], "du4fm57": [{"0_Comment Submission": "LPT: Most modern microwaves have a mute function to turn off the beep. Typically it's by holding 0 for 3 seconds", "1_Text": "Just go through his post history pretending it's the first time again...its magical..", "2_Subreddit": "LifeProTips"}], "du4fto1": [{"0_Comment Submission": "TIFU by shitting on my computer.", "1_Text": "Plus the fact he puts a pause on cleaning all this liquid shit from his entire room just to post about it..", "2_Subreddit": "tifu"}], "du4fvmp": [{"0_Comment Submission": "A clean sweep", "1_Text": "Wtf kind of bird did you marry???", "2_Subreddit": "funny"}], "du4fxnj": [{"0_Comment Submission": "A clean sweep", "1_Text": "I see you haven't learned any new vocabulary since your last post", "2_Subreddit": "funny"}], "du4fzj6": [{"0_Comment Submission": "A clean sweep", "1_Text": "I'm curious if you're the victim of the whoosh, or me", "2_Subreddit": "funny"}], "duvs1ck": [{"0_Comment Submission": "Mom found my old McDonald’s food toys that turned into robots.", "1_Text": "Ugh this makes me wish I held on to all the different toys I've gotten over the years as a kid...i specifically remember trying to get all the different pokemon they had in the little pokeballs", "2_Subreddit": "pics"}], "duvsaye": [{"0_Comment Submission": "Mom found my old McDonald’s food toys that turned into robots.", "1_Text": "I got a car with a turbo...got addicted to boost...", "2_Subreddit": "pics"}], "dvw3feo": [{"0_Comment Submission": "2018 Live Offseason Event Tracker", "1_Text": "Man I'm so excited for next season! I can't wait to see dalvin cook and Kirk cousins working together", "2_Subreddit": "minnesotavikings"}], "dvw5msr": [{"0_Comment Submission": "As it stands, there are only six players left from the roster Mike Zimmer took over: Griffen, Rhodes, Robison, Rudolph, Smith, Sendejo", "1_Text": "/s , I think you dropped this.", "2_Subreddit": "minnesotavikings"}], "dvw6rat": [{"0_Comment Submission": "About Eagles Fans: Don't Feed Trolls", "1_Text": "Why does anyone even care what other people think/say? It has absolutely no effect on your life at all", "2_Subreddit": "minnesotavikings"}], "dvw70vy": [{"0_Comment Submission": "About Eagles Fans: Don't Feed Trolls", "1_Text": "Exactly. Why bother even making threads like this, just let them bitch and moan and talk shit about us. Let next season take care of any shit talking.", "2_Subreddit": "minnesotavikings"}], "dvxnna5": [{"0_Comment Submission": "Broncos fan here", "1_Text": "Man at times you can watch his highlights and see these perfect throws in tight ass windows and think \"man this guy is something special\". But as others have said, sometimes he just makes poor decisions and you retract those words. All in all i think he has huge potential, just needs a great supporting cast and a little more discipline for not taking risky chances at the wrong moments.\n\nEdit. Also theilen and diggs might have made him look better than he is. Those guys made some ridiculously insane contested  catches", "2_Subreddit": "minnesotavikings"}], "dvxo9zo": [{"0_Comment Submission": "Vikings Hit the Needs: Free Agency Grades", "1_Text": "For 15% or less of the cap space per year I feel like there's nothing wrong with this deal. With the players we have around cousins I think it's safe to say he will do well. We really just need him to play slightly better than keenum did last year and let theilen and diggs do the rest.", "2_Subreddit": "minnesotavikings"}], "dvxoxvy": [{"0_Comment Submission": "Who is or was your favorite Viking?", "1_Text": "Seriously lol I'd say Harrison Smith for the number 1, but Jared Allen, Theilen, and randy moss are all right there with him! \n\nHow can you possibly pick just one player?! =[", "2_Subreddit": "minnesotavikings"}], "dvxp1ik": [{"0_Comment Submission": "Who is or was your favorite Viking?", "1_Text": "I feel the same way. Underrated, undrafted, coming out of Minnesota, he's just such a special person. I love that he's starting to get the respect he deserves, and I hope we never get rid of him!", "2_Subreddit": "minnesotavikings"}], "dw4r4lr": [{"0_Comment Submission": "NFL sub since the superbowl.", "1_Text": "Let's be honest here, I think everyone knows that for whatever reason, almost none of our players seemed to be \"trying\" to win that game. It's sad but it's true, watching those replays it should be obvious. Everyone was playing at like 40% effort and it's sad because we all know they're better than that", "2_Subreddit": "minnesotavikings"}], "dwevm3b": [{"0_Comment Submission": "TIFU by falling in actual love, nearly wrecking a marriage and a church", "1_Text": "I say go for it, heroin will never cheat on you bro! She's always there for you, and only asks for your soul and every penny you'll ever earn.", "2_Subreddit": "tifu"}], "dwlhbb1": [{"0_Comment Submission": "Need some opinions...", "1_Text": "Man I can't tell you how much money I've wasted over the first 5 years doing oxy from snorting pills. One day I had a stuffy nose, chewed and swallow. Never looked back since, the high is so much better/longer lasting. It's seriously rediculous how much better it is to eat them.\n\n\nExcept dillys. Complete opposite for me with dillys.", "2_Subreddit": "opiates"}], "dwmet1w": [{"0_Comment Submission": "Need some opinions...", "1_Text": "Yeah dillys are weird man. I could eat 4 8mg within an hour and just feel alright, but if I snort 1.5 or 2 max at once I'm high as balls for hours\n\n\nI used to love doing the snort half/eat half back in the day with blues. But this was when you could get them for 10-15$ each. Now they're just stupid expensive and I just stick with OP's.  They sell for so cheap since everyone hates the time release lol I just suck the outer coating off and chew it. Feel good in 20 min or less.", "2_Subreddit": "opiates"}]}], "1_submissions": [{"6az3p4": [{"0_Title": "Trying to change the sheets", "1_Text": "Yeah I really think I would have preferred another heartbreaking loss in a game we played our dicks off. Instead of watching a game that looks like we were paid to lose", "2_Subreddit": "dogpictures"}]}]}]}