{"littlepurpleunicorn": [{"0_comments": [{"dwqrtgx": [{"0_Comment Submission": "[Serious] Redditors who have killed/seriously injured someone and dont regret it, whats the story behind it?", "1_Text": "As the saying goes, never bring a knife to a gun fight", "2_Subreddit": "AskReddit"}], "dwu97uj": [{"0_Comment Submission": "Alberta set to introduce bill mandating safe zones around abortion clinics", "1_Text": "I'll be moving to Calgary in a month or two and if it's not too bothersome, can someone explain to me why that happens in the first place? The protesting outside abortion clinics etc. They don't do that where i'm from and as someone who has had an abortion before, i'd be pretty terrified to seeing all this outside the clinics.", "2_Subreddit": "Calgary"}], "dwuda9n": [{"0_Comment Submission": "Women who wear jeans give birth to transgenders and autistic children, says Kerala professor", "1_Text": "Sometimes when I hear someone say something stupid, I feel like i'm in a hidden camera TV show where I just turn my head and stare into space trying to comprehend the stupidity that just left that person's mouth. But I don't know how I'm supposed to react to reading something stupid. Where do I look?!", "2_Subreddit": "nottheonion"}], "dwuzlag": [{"0_Comment Submission": "Alberta set to introduce bill mandating safe zones around abortion clinics", "1_Text": "First thought that pop up in my head was \"Those mothers need a hobby.\" I don't know how people have so much time to do those things when we all have 24 hours in a day and I can barely even find time for myself with school, work etc. But thank you for the answer. As long as there are no violence etc involved.", "2_Subreddit": "Calgary"}], "dwuzooo": [{"0_Comment Submission": "Alberta set to introduce bill mandating safe zones around abortion clinics", "1_Text": "Thank you", "2_Subreddit": "Calgary"}], "dww8ay5": [{"0_Comment Submission": "Alberta set to introduce bill mandating safe zones around abortion clinics", "1_Text": "Thank you for the reply. I understand it now.", "2_Subreddit": "Calgary"}], "dww8dcx": [{"0_Comment Submission": "Alberta set to introduce bill mandating safe zones around abortion clinics", "1_Text": "Beautiful place, the falls. But thank you for the reply. Is it throughout Canada? Protesting is not legal where I am from. But I understand over there you're allowed to.", "2_Subreddit": "Calgary"}], "dwwl7gh": [{"0_Comment Submission": "Rant: Narrow standards of beauty frustrate me", "1_Text": "My mom, being an Asian lady, sometimes talk the same way, berates my weight-lifting and dieting. She doesn't see the need to lift weights and \"do all that squats\". Now I don't usually talk back to her but one day I got fed up and told her that the reason why I lift weights is because as women gets older and our hormones go bonkers (menopause etc.) our bones become more porous and fragile. That combined with the drastic loss of muscle mass, I don't want to fall and break my hips, possibly troubling my future kids to take care of me when I could have done something good for myself to prevent that in my earlier years. That shut her up real quick. Not saying that would work, but that's how weight lifting helps. Stronger bones, more muscles = less falls, less chance of breaking hips when older. \n\nBut just ignore what she says and keep doing you. The older generations tend to be more stuck in their old ways and there is absolutely no point in arguing with them. Just tune them out and keep lifting!", "2_Subreddit": "xxfitness"}], "dwwyrsi": [{"0_Comment Submission": "I have never done any opiates. I've been browsing this sub for ~2 hours now.", "1_Text": "I also don't use opiates, or any drugs for that matter unless you consider cigarettes a drug. I like browsing through this sub because I like to educate myself on various things and drugs is one of them. I know for sure, especially after this sub, that I would never try opiates. I also like to see the support that people give one another over here. Junkies are always painted in a bad light but after looking through what some of ya'll have to say, it made me realise that you guys are humans too and are just doing what you gotta do.", "2_Subreddit": "opiates"}], "dwx09rl": [{"0_Comment Submission": "Why do you go on one last binge before rehab?", "1_Text": "Hmm but won't you miss it even more afterwards? I kinda understand what you mean.", "2_Subreddit": "opiates"}], "dwx0bm9": [{"0_Comment Submission": "Why do you go on one last binge before rehab?", "1_Text": "That's true. But won't you miss the party afterwards? Maybe that's just my mind. But yeah I can understand the \"one last time then no more\".", "2_Subreddit": "opiates"}], "dwx0dbg": [{"0_Comment Submission": "Why do you go on one last binge before rehab?", "1_Text": "That's true. But I understand that \"one last time\" can be a couple times before it truly becomes the last. Won't you miss it even more afterwards?", "2_Subreddit": "opiates"}], "dwx1537": [{"0_Comment Submission": "What types of people do you have trouble getting along with?", "1_Text": "People who constantly insults other while out. Especially people who insults someone else over something they can't change like the colour of their skin or a funny looking mole etc. I hate commenting on another person's looks, and it makes me uncomfortable to hear someone else do that. It is negative and I don't need that in my life.", "2_Subreddit": "AskReddit"}], "dwx1ay0": [{"0_Comment Submission": "[Serious] What's your best story about listening to a gut feeling?", "1_Text": "Always, always trust your gut and never let anyone gaslight you. I know myself and my responses so well that I know the difference between my being paranoid and my guts telling me something is off. My ex kept lying to me about many things and even when I caught on, he would still lie about it and sometimes I have zero proof so i'm forced to believe it. But my guts were just.. screaming at me to gtfo away from him.", "2_Subreddit": "AskReddit"}], "dwx7xe8": [{"0_Comment Submission": "Why do you go on one last binge before rehab?", "1_Text": "I understand conclusion cause I like concluding things. Thank you for the insight", "2_Subreddit": "opiates"}], "dwx82sk": [{"0_Comment Submission": "Why do you go on one last binge before rehab?", "1_Text": "I understand. Maybe some of them wants to stop at their own discretion. I don't know if that's the right word to use. For example, I smoke cigarettes. If I said I wanted to quit and someone took my cigarettes from me and locked me up for a week, sure I'd live, but I might want to still smoke a cigarette once i'm out because I didn't get to do it when I wanted to at my own accord. But for some people it's like, if i'm going to do it, why wait?", "2_Subreddit": "opiates"}], "dwx859z": [{"0_Comment Submission": "Why do you go on one last binge before rehab?", "1_Text": "Hmm that's true.. thanks for the input.", "2_Subreddit": "opiates"}], "dwx86mb": [{"0_Comment Submission": "Why do you go on one last binge before rehab?", "1_Text": "Thanks for the input. I understand.", "2_Subreddit": "opiates"}], "dwx87gu": [{"0_Comment Submission": "Why do you go on one last binge before rehab?", "1_Text": "Well if you put it that way I understand it better.", "2_Subreddit": "opiates"}], "dwx889m": [{"0_Comment Submission": "Why do you go on one last binge before rehab?", "1_Text": "Keep moving forward and congratulations!", "2_Subreddit": "opiates"}], "dwy9b3d": [{"0_Comment Submission": "Why do you go on one last binge before rehab?", "1_Text": "Got it, thanks for the analogy. If i'm about to go to jail for sure i'd do all that.", "2_Subreddit": "opiates"}], "dwy9buj": [{"0_Comment Submission": "Why do you go on one last binge before rehab?", "1_Text": "That's really sad.", "2_Subreddit": "opiates"}], "dwy9czk": [{"0_Comment Submission": "Why do you go on one last binge before rehab?", "1_Text": "I hope you are doing okay. Be strong & stay safe.", "2_Subreddit": "opiates"}], "dwy9i55": [{"0_Comment Submission": "I have never done any opiates. I've been browsing this sub for ~2 hours now.", "1_Text": "Thank you for the response.", "2_Subreddit": "opiates"}], "dwy9jwy": [{"0_Comment Submission": "Why do you go on one last binge before rehab?", "1_Text": "I understand. Are you doing okay now?", "2_Subreddit": "opiates"}]}], "1_submissions": [{"7e05ui": [{"0_Title": "My 2nd attempt. Lunches for the week. Brown rice, broccoli and seasoned chicken quarters.", "1_Text": "As the saying goes, never bring a knife to a gun fight", "2_Subreddit": "MealPrepSunday"}], "8aa5au": [{"0_Title": "Why do you go on one last binge before rehab?", "1_Text": "As the saying goes, never bring a knife to a gun fight", "2_Subreddit": "opiates"}]}]}]}