{"makingmovesa215": [{"0_comments": [{"dvv5hhs": [{"0_Comment Submission": "jj was looking out big time yesterday", "1_Text": "yeah he gave me cash but i just ended up using it to buy dope anyways. did have the option of walking away with my money though. the guy is awesome. good peoples", "2_Subreddit": "opiates"}], "dvv8h84": [{"0_Comment Submission": "jj was looking out big time yesterday", "1_Text": "yeah the corner boys usually get paid with bags for looking out and alerting the block when cops are driving by or coming. he sells works there too so i assumed it was good compensation", "2_Subreddit": "opiates"}], "dvvv5aj": [{"0_Comment Submission": "jj was looking out big time yesterday", "1_Text": "that's exactly how it is. they usually work their way up if they have potential.", "2_Subreddit": "opiates"}], "dvylg0a": [{"0_Comment Submission": "Yaaaaaaaa hold up, I don’t know what planet I’m on 😏", "1_Text": "damn that's a beautiful stash right there. what's the 3 orange pills at the bottom? i'm assuming those are the green 15's but i'm not familiar with the orange ones. happy nods bussin!", "2_Subreddit": "opiates"}], "dvylkok": [{"0_Comment Submission": "Suboxone induction question", "1_Text": "you should be pretty good to take more if you aren't getting enough relief. you're damn near that 24 hour mark which is what i wait for if i've taken 8+ bags in a day.", "2_Subreddit": "opiates"}], "dvylm7b": [{"0_Comment Submission": "Suboxone induction question", "1_Text": "chance for PWD is essentially 0 if you've already taken 1-2mgs of sub. they're on your receptors now and you should be good to take more if you feel like you need it. as you know less is always better if you can manage it. best of luck to you.", "2_Subreddit": "opiates"}], "dvylpr3": [{"0_Comment Submission": "Perks after 2mg sub", "1_Text": "for 2mg of sub and you're taking oxy (what's your ROA) i'd wait atleast 12-18 hours after taking the sub to use. you could break through taking enough oxy but you don't want to waste it. i'd say 12-18 hours in you should be golden", "2_Subreddit": "opiates"}], "dvylsy0": [{"0_Comment Submission": "Suboxone induction question", "1_Text": "just remember it sometimes takes subs about 30-45 minutes to get the full effects. doesn't have that quick onset as you DOC most likely does. my rule of thumb is to wait an hour after dosing to see if i need more.", "2_Subreddit": "opiates"}], "dvys14f": [{"0_Comment Submission": "Yaaaaaaaa hold up, I don’t know what planet I’m on 😏", "1_Text": "anyone know what the orange pills at the bottom are? i'm super curious. i know the 15's but i've never seen those orange guys.", "2_Subreddit": "opiates"}], "dvys50k": [{"0_Comment Submission": "Could use some support", "1_Text": "r/OpiatesRecovery is a great place to go and get support and advice on how to possibly quit. they are a great bunch of folks over there who really look out for one another. this sub can be a massive trigger for most people trying to get clean hearing stories of people getting high and picking up their stashes. best of luck to you Stu, we are rooting for you!", "2_Subreddit": "opiates"}], "dvz0rx2": [{"0_Comment Submission": "Could use some support", "1_Text": "Could not have said it better myself Bagz. I'm glad you found the help and support you needed there. Hopefully OP drops in and can get some help as well.", "2_Subreddit": "opiates"}], "dvz0v1n": [{"0_Comment Submission": "Suboxone induction question", "1_Text": "I only said essentially 0 because of the time frame he mentioned and the amount of sub he had already taken and attached to his receptors. You are absolutely right though, micro-dose sub can definitely not cause PWDs if it's not a sufficient amount. Thank you for clearing that up for OP Fash.", "2_Subreddit": "opiates"}], "dw462ss": [{"0_Comment Submission": "When cold copping, what steps do you take to avoid getting burned?", "1_Text": "Never let your money walk, only buy in small amounts at first, do not let them lead you into a shady area where you can be taken advantage of or where you are vulnerable, and if possibly try to bring someone along.", "2_Subreddit": "opiates"}], "dw504gb": [{"0_Comment Submission": "[F]eeling very fuzzy and happy this Monday evening. :)", "1_Text": "good lord. you have the body of a goddess. unbelievably fit and sexy. would love to see some pictures of you with your DOC. please post more!", "2_Subreddit": "opiates_gonewild"}], "dw85gzr": [{"0_Comment Submission": "How Has Fentanyl Changed How You Use? (Journalist Inquiry)", "1_Text": "I switched to dope because I was paying $30 a pill for fentanyl pressed 30s which is a complete ripoff. Saw no risk in switching as the fent was most likely more dangerous than dope I could get.", "2_Subreddit": "opiates"}], "dw9i39x": [{"0_Comment Submission": "How Has Fentanyl Changed How You Use? (Journalist Inquiry)", "1_Text": "It was obvious which ones were pressed with fentanyl as the color and shape were different. It also broke up with a different consistency. I was getting pharmaceutical oxy on the street for a long time before the fentanyl presses came into the market. The change happened around 2015/2016 and forward. Before that there was plenty of normal IR oxys around. Thank you for your interest in this subject. I'm a huge fan of Vice News and all that you guys do.", "2_Subreddit": "opiates"}], "dw9ktwu": [{"0_Comment Submission": "Scored a 100 pack of blues... Last hooray before getting sober for good", "1_Text": "such an epic stash. couldn't go out in a better way. enjoy my friend! that looks so amazing. love the diversity too.", "2_Subreddit": "opiates"}], "dw9lwqd": [{"0_Comment Submission": "Happy about my new Calvin Klein and bralette and the fact I can fit in a size 1 now", "1_Text": "damn looking good girl. looking forward to more posts. sexy as hell", "2_Subreddit": "opiates_gonewild"}], "dwe8xw0": [{"0_Comment Submission": "16 weeks — feeling worse than ever. Tested positive for Hep B and hit rock bottom all over again.", "1_Text": "Hep B is not a death sentence my friend! You are so young and have so much life to live. While this may seem like a major setback at the moment, I guarantee you there are millions of men who will not give 1 fuck about your Hep because of the awesome person you are without drugs. Millions of people live everyday with Hepatitis and treatments are only becoming better and better. The rapid advancement of medicine may even be able to get rid of it completely one day. Don't beat yourself up over this, think of all that you have accomplished in such a short amount of time. I'm rooting for you Shes_always_sleeping and I guarantee you 98% of this sub is as well. Keep your head up and try to distract yourself. Treat yourself if possible and try not to get too down. Best of luck friend. I'm around to talk if you need some more support.", "2_Subreddit": "OpiatesRecovery"}], "dwhzyk9": [{"0_Comment Submission": "Meet OG_Trapstar. Relapsed and blew entire savings on blues. Don't be like OG_Trapstar.", "1_Text": "Honestly if you're just using them as maintenance to stay well and not really looking to get high and they're oxycodone, I'd just swallow them. They have crazy high oral bio availability and will last longer that way. I'd break them into halves or quarters and take a piece at the onset of the worst part of withdrawal (extreme RLS, sneezing, yawning, and hot/cold sweats). I'm sure others will have better advice than I, but that is just what I would do. Good luck brother, we're rooting for you!", "2_Subreddit": "opiates"}], "dwiaw2q": [{"0_Comment Submission": "2 a.m. [f]reak, get down", "1_Text": "boobies!! i love boobies", "2_Subreddit": "opiates_gonewild"}], "dwp770s": [{"0_Comment Submission": "Staying at home when i'm high as fuck feel like a waste ?", "1_Text": "nothing old and lame about that at all. you're keeping your brain active which beats nodding so hard you sleep through your high.", "2_Subreddit": "opiates"}], "dwvvftj": [{"0_Comment Submission": "Anybody else freezing on subs?", "1_Text": "I find myself freezing on subs when I induct. It's the most uncomfortable feeling. I know the feeling man. The struggle is real.", "2_Subreddit": "opiates"}], "dwvyq68": [{"0_Comment Submission": "Anybody else freezing on subs?", "1_Text": "Yeah usually by the 3rd day it gets normal. Then I will sweat when I try to sleep (which is never on subs) but my body temp gets all fucked up when I switch to subs.", "2_Subreddit": "opiates"}], "dwwkjav": [{"0_Comment Submission": "Giving up", "1_Text": "Dude don't give up. You have so much to live for. Don't make a permanent decision because of a temporary problem. Find someone to talk to. There are amazing people in this community who can help you achieve the goals you want to. I've met some incredible people who have changed my life here. Please do not think like that. You are just stuck in a rut my friend, we all get in them from time to time. It's time to ask for some help and evaluate your situation. Please feel better.", "2_Subreddit": "opiates"}]}], "1_submissions": [{"6jr7nc": [{"0_Title": "Switched from ir oxy 30s to dope", "1_Text": "yeah he gave me cash but i just ended up using it to buy dope anyways. did have the option of walking away with my money though. the guy is awesome. good peoples", "2_Subreddit": "opiates"}], "6k25ta": [{"0_Title": "does anyone else deal with corners instead of a specific person?", "1_Text": "yeah he gave me cash but i just ended up using it to buy dope anyways. did have the option of walking away with my money though. the guy is awesome. good peoples", "2_Subreddit": "opiates"}], "6mff19": [{"0_Title": "terrible start to the week (shit post kind of)", "1_Text": "yeah he gave me cash but i just ended up using it to buy dope anyways. did have the option of walking away with my money though. the guy is awesome. good peoples", "2_Subreddit": "opiates"}], "6ucmsf": [{"0_Title": "3 months since switching from oxy to dope", "1_Text": "yeah he gave me cash but i just ended up using it to buy dope anyways. did have the option of walking away with my money though. the guy is awesome. good peoples", "2_Subreddit": "opiates"}], "856nha": [{"0_Title": "jj was looking out big time yesterday", "1_Text": "yeah he gave me cash but i just ended up using it to buy dope anyways. did have the option of walking away with my money though. the guy is awesome. good peoples", "2_Subreddit": "opiates"}], "868n7w": [{"0_Title": "Did anyone else wait for the snow to slow down/stop to go out and score? This guy sure did. Just got back", "1_Text": "yeah he gave me cash but i just ended up using it to buy dope anyways. did have the option of walking away with my money though. the guy is awesome. good peoples", "2_Subreddit": "opiates"}]}]}]}