{"korbysage": [{"0_comments": [{"dvhz06u": [{"0_Comment Submission": "The Dope Bubble", "1_Text": "I was picturing like an economic bubble", "2_Subreddit": "opiates"}], "dw8leci": [{"0_Comment Submission": "If I were a girl I would totally wear this poppy flower dress", "1_Text": "thumbnail on browser straight up looks like a white dress someone got murdered in. actually my first thought was someone stabbed wearing a white garden glove.", "2_Subreddit": "opiates"}], "dwfidki": [{"0_Comment Submission": "Girlfriend and her friend got popped over the weekend. Fml.", "1_Text": ",", "2_Subreddit": "opiates"}], "dwfiq1h": [{"0_Comment Submission": "Not bad for $40", "1_Text": "[Pic related](https://i.imgur.com/uX7hOKl.jpg)", "2_Subreddit": "opiates"}], "dwimajb": [{"0_Comment Submission": "And Now a Word from Reddit’s Engineers…", "1_Text": "You could rewrite the colossal nugget of ass that is the backend without fucking up the perfectly sound frontend. \n\n\nHell they could rewrite the whole thing to be react components styled as the old site, server render that and send it as plain html like the current site, but instead they’ve decided to reinvent the front end as the suck to “drive engagement” and “sell ads”", "2_Subreddit": "announcements"}], "dwimgyn": [{"0_Comment Submission": "And Now a Word from Reddit’s Engineers…", "1_Text": "There’s no reason for reddit to be a web app, as evinced by the high level of productivity and functionality people derive from the current, barebones front end. \n\n\nNo matter how you try to couch it, this is clearly about trying to monetize, and I really hope that you pay the price for ignoring the concerns of your core long term users.", "2_Subreddit": "announcements"}], "dwimmwe": [{"0_Comment Submission": "And Now a Word from Reddit’s Engineers…", "1_Text": "Hallelujah kind of, except that if they’ve managed to bollocks a simple real time chat app that bad, this redesign is going to be a total bloody nightmare.", "2_Subreddit": "announcements"}], "dwimwww": [{"0_Comment Submission": "And Now a Word from Reddit’s Engineers…", "1_Text": "The thing is, there are use cases where a JavaScript web app are literally the only means to achieve a good user experience, and indeed without some of the newer JS apis they might not even exist. \n\n\nMy current company’s (very profitable, very performant) client facing product would not have been possible without the features found in ES2015. \n\nJust because a lot of web devs are shity and make ill informed, follow the crowd type choices regarding what tech to use to achieve their vision, doesn’t mean you can discount the apps that wouldn’t exist without new web tech.", "2_Subreddit": "announcements"}], "dwin1cg": [{"0_Comment Submission": "And Now a Word from Reddit’s Engineers…", "1_Text": "Disable JS by default and only whitelist sites as needed. If the dev is too incompetent to provide server rendering for their react app, so I can use it without JS, odds are it’s going to run like dogshit, and should be avoided entirely if possible.", "2_Subreddit": "announcements"}], "dwin4g2": [{"0_Comment Submission": "And Now a Word from Reddit’s Engineers…", "1_Text": "That’s what happens when you hire incompetents to write your react app. \n\n\nSince this is part of my job, it’s painfully funny to see them make these dead simple mistakes, with a whole team of people on it no less (allegedly).", "2_Subreddit": "announcements"}], "dwina7h": [{"0_Comment Submission": "And Now a Word from Reddit’s Engineers…", "1_Text": "Caching that data is super basic shit, and the html5 history API has been around for a hot minute", "2_Subreddit": "announcements"}], "dwinfmf": [{"0_Comment Submission": "And Now a Word from Reddit’s Engineers…", "1_Text": "Also they’ve been straight up banning subs which would offend advert clients", "2_Subreddit": "announcements"}], "dwini4k": [{"0_Comment Submission": "And Now a Word from Reddit’s Engineers…", "1_Text": "Not to mention the darknetmarkets sub", "2_Subreddit": "announcements"}], "dwinkd9": [{"0_Comment Submission": "And Now a Word from Reddit’s Engineers…", "1_Text": "Gotta get that money to pay for the team of incompetent H1Bs they hired to hack together the new react front end no one asked for or wants.", "2_Subreddit": "announcements"}], "dwio1hg": [{"0_Comment Submission": "Is the media serious with this narcan party shit!!!!", "1_Text": "I’m.. Ron burgundy?", "2_Subreddit": "opiates"}], "dwio4i8": [{"0_Comment Submission": "Is the media serious with this narcan party shit!!!!", "1_Text": "Pharmaceutical company X has a new narcan competitor coming to market?", "2_Subreddit": "opiates"}], "dwj9u6s": [{"0_Comment Submission": "And Now a Word from Reddit’s Engineers…", "1_Text": "I’m definitely not anti react, it’s just a totally inappropriate technology for what reddit is (in terms of the functionality Reddit provides, a simple html page with some js to handle upvoting and downvoting, and lazy comment loading, is more than adequate — delivering rendered plain html is still the most performant you’re gonna get assuming your backend engineers aren’t terrible).", "2_Subreddit": "announcements"}], "dwje5s5": [{"0_Comment Submission": "And Now a Word from Reddit’s Engineers…", "1_Text": "I wish I could go into greater detail about my current company because I think they’re a rare exception to what you’ve said.", "2_Subreddit": "announcements"}], "dwjhrbv": [{"0_Comment Submission": "And Now a Word from Reddit’s Engineers…", "1_Text": "I’ve unfortunately been here since 2006 lol, I work with the tech behind both the redesign and the original monolithic app for a living; there has been no attempt at such a radical change in the 12 long years I’ve been here, and I feel like I know what I’m talking about in this specific instance. Only time will tell tho.", "2_Subreddit": "announcements"}], "dwre2ar": [{"0_Comment Submission": "OxyContin from Mundipharma, just like the original Purdue ones from 1996", "1_Text": "For decoration lmao just moved will you be my decorator?", "2_Subreddit": "opiates"}], "dwreov6": [{"0_Comment Submission": "{NSFW} Boof Queen!", "1_Text": "Dude pinching the money? From that and the rest of your posts Id swear you we’re my friend if you didn’t have bigger titties haha, thanks for settling it", "2_Subreddit": "opiates"}], "dwszmdt": [{"0_Comment Submission": "I have to meet police chief and mayor", "1_Text": "Whether I’d even consider bring it up really depends on the politics of the chief and the mayor, do you think they’d be sympathetic to your pov?", "2_Subreddit": "opiates"}], "dwttc0v": [{"0_Comment Submission": "Oh boy... I've seriously done it now...", "1_Text": "Hartford sucks haha", "2_Subreddit": "opiates"}], "dwumz08": [{"0_Comment Submission": "today would’ve been your 23rd birthday. i miss you everyday darlin’ 💔", "1_Text": "The phrase always makes me think of dick cheney", "2_Subreddit": "opiates"}], "dwv8odr": [{"0_Comment Submission": "Around 200 pressed busses, just woke up from a long blackout", "1_Text": "But why", "2_Subreddit": "opiates"}]}], "1_submissions": [{"7m3485": [{"0_Title": "Demerol?", "1_Text": "I was picturing like an economic bubble", "2_Subreddit": "opiates"}]}]}]}