{"PoisonKiss43": [{"0_comments": [{"dwlxa3v": [{"0_Comment Submission": "How do you go about explaining prior tolerance to a doctor without looking like a addict or drug seeker?", "1_Text": "Lol! You are so right, I was clear not awake or did not have my glasses on...... my bad!!!!!", "2_Subreddit": "opiates"}], "dwnoe64": [{"0_Comment Submission": "What's your favorite movie about heroin?", "1_Text": "No, I just meant it was weird and reminded me of drugs and stuff. I don’t remember any heroin in it specifically.", "2_Subreddit": "opiates"}], "dwnot5n": [{"0_Comment Submission": "I think I fucked up.", "1_Text": "OP I read your username as “Da. Gene. Rat.” \n\nYou know like 👨‍🔬🌡🔬🐀..... if that makes sense lol", "2_Subreddit": "opiates"}], "dwnp11o": [{"0_Comment Submission": "How to tell my dealer I'm pregnant?", "1_Text": "Berry, what in the actual fuck is happening to you? Even s.paranoid was really worried about you commenting on all your posts. It seems like EVERYONE is commenting on every post about how you are off your rocker, or high on meth, or whatever. These delusional thoughts about your animals and your surroundings are very worrisome. Your current state, or at least the state that you portray online, seems totally unfit to carry a child. Again I’m speculating because I don’t know you behind your posts. Please get some help, talk to someone, do something..... I’m concerned. Whatever I can do I’ll do.", "2_Subreddit": "opiates"}], "dwnpvbt": [{"0_Comment Submission": "My pet dog Jeff", "1_Text": "April fools..... duh", "2_Subreddit": "opiates"}], "dwo2j85": [{"0_Comment Submission": "How to tell my dealer I'm pregnant?", "1_Text": "That’s good. That makes me feel hopeful. It’s definitely true. I have been around for a good while, I didn’t always reply or comment but I knew you. It feels good you acknowledge things, but you need to stop the dope asap. I’m just glad you are ok.", "2_Subreddit": "opiates"}], "dwo2olt": [{"0_Comment Submission": "I think I fucked up.", "1_Text": "Oooolol lo", "2_Subreddit": "opiates"}], "dwoqyue": [{"0_Comment Submission": "Micron filters", "1_Text": "I don’t use them because I don’t inject.....but I heard that they have them in pet stores by the aquarium stuff.", "2_Subreddit": "opiates"}], "dwoskfa": [{"0_Comment Submission": "How to tell my dealer I'm pregnant?", "1_Text": "All and all this is a bad idea. Even with your back and forth with fash proves to me that you aren’t ready....your motives are all wrong. I wish the best for you, but for fucks sake. This is 100% not the correct move. Fuck what your mom says, you don’t deserve to be treated like that.", "2_Subreddit": "opiates"}], "dwpe7ta": [{"0_Comment Submission": "Sorry lurker don't post much. But how do you post a photo from mobile?", "1_Text": "Use Imgur, upload then post as a link", "2_Subreddit": "opiates"}], "dwpfus6": [{"0_Comment Submission": "I’m worried about my sister. What’s the general addiction timeline look like from beginning to end?", "1_Text": "Underrated comment lol...... but OP is right it was someone who commented that said something about the bipolar.\n\nYour use of “...” made me laugh out loud!", "2_Subreddit": "opiates"}], "dwpg191": [{"0_Comment Submission": "I’m worried about my sister. What’s the general addiction timeline look like from beginning to end?", "1_Text": "“Just a bitch” 🙌🙌🙌🙌 yasssss that’s hilarious and true!\n\n\nIs she on drugs? Does she have a mental illness?\n\n“Oh no she’s just a bitch.”\n“That explains it!”", "2_Subreddit": "opiates"}], "dwpgngq": [{"0_Comment Submission": "why do you people pat each other on the back for getting clean but at the same time post pictures of syringes full of heroin & ready to shoot up?", "1_Text": "I love seeing this persons post history, you can see the hate post they deleted from the Aspergers sub. \n\nI don’t do dope, I don’t do anything illegal come to think of it (lame). I post pictures of my Rx’s as many people here do. I also work in the medical field(ER/Trauma) so I offer advice on that side for people too. \n\nThe real question is.......Why the fuck do you care OP? Don’t be barging up in this sub if you are just going to bitch. I’m sure there’s a closed minded-hateful-negative-pessimistic sub that Im sure you would fit right in with instead. \n\n\nIf I’m misjudging your intentions and you are just wanted to get an honest answer..... I apologize for being rude AF, and welcome!!!!!", "2_Subreddit": "opiates"}], "dwphufl": [{"0_Comment Submission": "So apparently all emergency departments don't treat addicts like garbage.", "1_Text": "We don’t typically numb when we stable because it’s such a large area we would have to do up and down the lac on both sides. So each little pinch you felt when the staples went in.... imagine that twice, one on each side. Pinch and burn", "2_Subreddit": "opiates"}], "dwpi37g": [{"0_Comment Submission": "Might be diahrrea of the mouth but I value yalls opinion and being an ex-junkie I wanna know if I am about to make a dumb decision.", "1_Text": "Honestly I would just keep it in a lock box in your dorm...... unless they search all your stuff locks boxes and all? Hidden in plain site. Especially if you can carry, you never know where the next school shooter will be, they might be thankful you broke the rules if came down to shooting someone in the head while they are killing your dorm-mates. \n\nMaybe that’s extreme but I have mine in me. Even in places I’m not “supposed” too. School and hospitals for example", "2_Subreddit": "opiates"}], "dwpj2ba": [{"0_Comment Submission": "Opiate Strength Spectrum", "1_Text": "You have been on reddit for 6 days..... \n\nYou have posted one post on this sub everyday...\n\nYou always ask questions, many of which are easily found on google.....\n\nIf I were you, if you are really just a new guy trying  to “contribute” to this sub I would advise on using the search feature first. They if none of your questions are answered ask. I know this seems sketchy to me and I’m sure if does for other people too.", "2_Subreddit": "opiates"}], "dwpj5b3": [{"0_Comment Submission": "why do you people pat each other on the back for getting clean but at the same time post pictures of syringes full of heroin & ready to shoot up?", "1_Text": "Anddddd deleted!!!", "2_Subreddit": "opiates"}], "dwpj7mr": [{"0_Comment Submission": "Opiate Strength Spectrum", "1_Text": "Awww! I have never got gold on reddit. I guess I’m still a noob. Thank you so much though!", "2_Subreddit": "opiates"}], "dwpjhsd": [{"0_Comment Submission": "I hate this. (shitpost)", "1_Text": "If I could understand all of the stuff that seems so difficult I would give it a try, but I just can’t comprehend it. I have tried..... I’m smart enough but not at that apparently", "2_Subreddit": "opiates"}], "dwqwxxx": [{"0_Comment Submission": "Getting off loperamide!! Please help!", "1_Text": "Honestly if you think it’s just the crazy diet you have then you need to stop that and your stomach/bowel movements will go back to normal. If you think it’s something else you need to the hospital. You could have colitis, Cdiff, crohns, ibs, and a ton of other stomach issues.... I’m listening to first few that come to my head but I mean cancer, gal bladder issues, appendicitis, there’s just so much that can go wrong in there. Either way you are going to end up killing your self from the lope. Go to the ER.\n\nSource: I work in the ER", "2_Subreddit": "opiates"}], "dwrlgro": [{"0_Comment Submission": "Flying to Pakistan shitpost", "1_Text": "I don’t think it would look different on an X-ray. Both powders should be radiolucent vs radiopaque so the color differences will be minor. Point is they aren’t going to search through your medication bottles to make sure every ibuprofen is actually ibuprofen. The capsules are all the same size, that’s perfect legit. I have traveled with tons of pills all the time back when I didn’t have my own RX. I never even thought about it honestly. You should be all set!", "2_Subreddit": "opiates"}], "dwrlie5": [{"0_Comment Submission": "Waiting on my guy after the wat u need text.", "1_Text": "Ugh I’m so sorry OP, the worst!!!", "2_Subreddit": "opiates"}], "dwtyc35": [{"0_Comment Submission": "today would’ve been your 23rd birthday. i miss you everyday darlin’ 💔", "1_Text": ".", "2_Subreddit": "opiates"}], "dwtyqql": [{"0_Comment Submission": "I passed my drug test for my job using “XSTREAM” synthetic urine. THANK GOD!!!", "1_Text": "“Quit while you’re behind”\n\nHoly shit why have I never heard this????\nBahahahahaha!\n\nOh the things reddit teaches me. 😍", "2_Subreddit": "opiates"}], "dwwgwb6": [{"0_Comment Submission": "Damned if I do damned if I don't", "1_Text": "You will want it tomorrow. I get you cant sleep as clearly I can’t either...... we got this", "2_Subreddit": "opiates"}]}], "1_submissions": [{"805prn": [{"0_Title": "Pros and cons of chronic pain medicine.", "1_Text": "Lol! You are so right, I was clear not awake or did not have my glasses on...... my bad!!!!!", "2_Subreddit": "opiates"}], "817qig": [{"0_Title": "I hate being tired...", "1_Text": "Lol! You are so right, I was clear not awake or did not have my glasses on...... my bad!!!!!", "2_Subreddit": "opiates"}], "81b1ff": [{"0_Title": "Not sure if y’all have tried these yet....", "1_Text": "Lol! You are so right, I was clear not awake or did not have my glasses on...... my bad!!!!!", "2_Subreddit": "opiates"}], "85htk7": [{"0_Title": "A Pt taught me something new yesterday at work. Her secret method to combat opiate induced constipation.... females only. (This is kinda gross)", "1_Text": "Lol! You are so right, I was clear not awake or did not have my glasses on...... my bad!!!!!", "2_Subreddit": "opiates"}], "869x2d": [{"0_Title": "Not souring just reminiscing", "1_Text": "Lol! You are so right, I was clear not awake or did not have my glasses on...... my bad!!!!!", "2_Subreddit": "opiates"}], "86hxz2": [{"0_Title": "Has anyone heard from u/sixcylinder777 ?", "1_Text": "Lol! You are so right, I was clear not awake or did not have my glasses on...... my bad!!!!!", "2_Subreddit": "opiates"}], "87mrgs": [{"0_Title": "Refill day! 🌪", "1_Text": "Lol! You are so right, I was clear not awake or did not have my glasses on...... my bad!!!!!", "2_Subreddit": "opiates"}], "89j6ar": [{"0_Title": "Best Candles I have ever bought!!!!!", "1_Text": "Lol! You are so right, I was clear not awake or did not have my glasses on...... my bad!!!!!", "2_Subreddit": "Candles"}]}]}]}