{"PitifulAnonymous2469": [{"0_comments": [{"ddf1cuz": [{"0_Comment Submission": "Schemes for $$", "1_Text": "Usually you can take it to a BoA ATM and overdraw around $200. I'd advise against doing so because it's a $35 fee if it's not paid back by the end of the business day and then it's another $35 fee for every 5 days it goes unpaid.", "2_Subreddit": "opiates"}], "ddrya5d": [{"0_Comment Submission": "UPDATE : 2 hours later 20mg oxycodone taken and feeling slightly drowsy but nothing more", "1_Text": "You went about this entirely wrong. Having a full stomach, spacing your dose out over several hours, and having incredibly high expectations all lead to you being severely underwhelmed. If you'd like to experience the feeling that everyone else always talks about, then next time do the exact opposite of what you did this time.", "2_Subreddit": "opiates"}], "de7u357": [{"0_Comment Submission": "Etolizam VS alprazolam", "1_Text": "I too would also appreciate a PM good sir", "2_Subreddit": "opiates"}], "dea11if": [{"0_Comment Submission": "Warm welcome pin-shot, greetings friends!", "1_Text": "Better take this down before someone shows your mom and she finds out you stole one of her 500mg Vicodin", "2_Subreddit": "opiates"}], "dedz2p0": [{"0_Comment Submission": "Broke people", "1_Text": "Hellllooooooo up there! How's the weather up on your high horse? I'd almost feel bad for your fiancé for marrying you, except we all know she's using you for your bankroll and is going to leave your pathetic superiority complexed ass as soon as she becomes entitled to half your shit. Good luck with that sir doucher.", "2_Subreddit": "opiates"}], "dee1eq0": [{"0_Comment Submission": "Broke people", "1_Text": "I'm not jealous at all, especially since you had to spend 300k on a damn apartment rather than buying a large chunk of land and building the house of your desires. I'd much rather live in a double-wide located on enough acreage to construct a badass shooting range and immaculate work shop, but different strokes for different folks I suppose. \n\nI respect you trying to motivate people but your tactics were severely flawed as your post just came off as you looking down on everyone stuck in hard times (many on their of accord of course) and shoving what you have in their faces. I work damn hard for everything I've got in life, as I'm sure you do as well, and I make a very comfortable living all while not attending college so hopefully I can be a motivation to people as well. \n\nIt doesn't matter what kinds of material possessions you have or the amount of government issued paper you have accumulated, if you're satisfied and comfortable in life then that's all that matters and fuck everyone and everything that tries to tell you differently. If you're struggling to get but I truly hope you can find the right path and maybe catch a few breaks on the way until you've created a satisfactory living situation but until then, life is a struggle for everyone and no matter your situation getting to where you want to be in life will take work but I hope everyone can get there someday.", "2_Subreddit": "opiates"}], "degpb9s": [{"0_Comment Submission": "whats the best way to vet if someone is an undercover / CI ?", "1_Text": "Water boarding is usually a pretty quick and efficient method.", "2_Subreddit": "opiates"}], "degpg51": [{"0_Comment Submission": "wtf man", "1_Text": "He knows too much!", "2_Subreddit": "opiates"}], "degplgt": [{"0_Comment Submission": "ok so get this y'all", "1_Text": "Soda bad. Powder good.", "2_Subreddit": "opiates"}], "degpxnj": [{"0_Comment Submission": "Drug dogs.", "1_Text": "Although I honestly wouldn't put it passed our backwards ass system of government and law enforcement, I find it highly unlikely that this is the case as it is blatantly unconstitutional. What state do you live it?\n\nP.S. I'm not saying you're wrong, I'm just curious how the hell shit like this can become law/protocol.", "2_Subreddit": "opiates"}], "dewxcwt": [{"0_Comment Submission": "H - Worried about choking on vomit in sleep?", "1_Text": "Wow I never thought of it like that. Thank you sir or madam for bringing such simple yet powerful advice to we humble addicts. Now that we have the answer we can all stop using heroin just like that. You have truly saved countless lives with this message and you must do everything in your power to preach this gospel to the unwashed masses.", "2_Subreddit": "opiates"}], "dg4hl7u": [{"0_Comment Submission": "Close fucking call", "1_Text": "It means stick your drugs in your ass but you could always go the easier route and just get used to walking with a baggie between the cheeks and not necessarily inserted into your asshole.", "2_Subreddit": "opiates"}], "dg7ovq4": [{"0_Comment Submission": "Am I the only one who thinks the whole United Airlines thing is being blown out of proportion?", "1_Text": "\"And definitely needs to change the way he disrespects law enforcement.\"\n\nHow does that leather taste?", "2_Subreddit": "opiates"}], "dibqf59": [{"0_Comment Submission": "Holy Shit Batman", "1_Text": "Did you know that if you put an aluminum foil helmet on a sea turtle they will lose all sense of direction and swim in circles?", "2_Subreddit": "opiates"}], "dk3jxlv": [{"0_Comment Submission": "Strategies when getting pulled over", "1_Text": "I miss interpreted the rules", "2_Subreddit": "opiates"}], "dkuxd4v": [{"0_Comment Submission": "OMG GUISEEE MY GF IS PREGNANT!!! No wonder her tits be even bigger than normal! I'm sooo happy I can't stop laughing! *hands out cigars to my whole opi fam! Love you guys!!!", "1_Text": "That's not a beer, it's a bud light.", "2_Subreddit": "opiates"}], "dleqe33": [{"0_Comment Submission": "Anyone else have problems dealing with people in the normal world?", "1_Text": "What would you like to see implemented in place of capitalism that would be more beneficial and less alienating? \n\nI'm generally curious, not trying to call you out or anything.", "2_Subreddit": "opiates"}], "dlutbup": [{"0_Comment Submission": "Missed in Nashville abcess open", "1_Text": "OlDirtyBurton does have a point you know", "2_Subreddit": "opiates"}], "dnuym3p": [{"0_Comment Submission": "something out there in the universe was watching over me tn, fam! i got pulled over omw home from grabbing; & when i got home, i realized that i spoke to the cop w my pupils THIS damn pinned 😨 but he was a rly nice guy :) &he let me go! just asked me to drive carefully and get home safe! thx JJ🙏🏼", "1_Text": "This comment made my unborn child cringe.", "2_Subreddit": "opiates"}], "dporl32": [{"0_Comment Submission": "Desperate times..wish me luck", "1_Text": "Cotton fever isn’t actually caused by the cotton itself, it’s from the bacteria that has grown on the cotton from improper and unsanitary storage of the used cottons.", "2_Subreddit": "opiates"}], "dqgo9nm": [{"0_Comment Submission": "Gooood mornin’!", "1_Text": "Do they still taste like burnt marshmallows?", "2_Subreddit": "opiates"}], "dttqwsj": [{"0_Comment Submission": "Sent home from work after doing this. Oops.", "1_Text": "If anyone ever questions you about something like this ever again just repeat after me: I was up all night arguing with my gf/bf/mom/dad/brother/sister/uncle etc. I highly doubt your manager is gonna wanna hear about your imaginary down-and-out uncle who called you at 2AM crying and begging you for money and a place to crash for a while.", "2_Subreddit": "opiates"}], "dtu0ijx": [{"0_Comment Submission": "Who else thinks it's no coincidence that the invasion of Afghanistan and the Heroin Epidemic started at the same time?", "1_Text": "Too bad the government, DEA, and law enforcement know damn well that prohibition doesn’t work but they don’t give a shit about actually solving the problem. If prohibition were ended thousands of government employees would essentially be out of a job and those greedy sadistic fucks will do anything and everything in their power to keep things the way they are.", "2_Subreddit": "opiates"}], "dv9wnpu": [{"0_Comment Submission": "Quick cash schemes for dope. Let's here it.", "1_Text": "If you’ve got a paypal account you can “apply” for PayPal credit and you’ll automatically be approved and given a minimum of $250. Send money via PayPal credit to a trustworthy person’s PayPal account, the person on the receiving end proceeds to transfer said money to their bank account, then they can either transfer the money over to your checking account or they can go to the bank and withdraw the cash and give it to you.", "2_Subreddit": "opiates"}], "dwipe7y": [{"0_Comment Submission": "First time for everything I guess", "1_Text": "Mmmmm burnt marshmallows", "2_Subreddit": "opiates"}]}], "1_submissions": [{}]}]}