{"kawi_l0ve": [{"0_comments": [{"dv0iq95": [{"0_Comment Submission": "Off kratom for 18 days, had a procedure today and they gave me an opiate.", "1_Text": "If anyone is interested about the outcome today, I feel great! Had my first real sleep lastnight (about a solid 8 hours..woohoo!!) and feel the best I’ve felt yet throughout this journey! I hope it continues throughout the day but for now I’m just so grateful the administered fentynal from my procedure yesterday did not send me back into any acutes or amplify my paws..  sad the addict in me was overly excited to hear I was going to get a dose of the good ol’ fent yet it did next to nothing but take the edge off, so if I ever get a craving I’m just gona remind myself about the procedure and how the fentynal didn’t do much and if i did feel it/got high from it I would be right back to the vicious cycle of opioid addiction...  thanks for anyone who’s listening.\nI will report back tonight after work and let you all know how I’m doing by then.", "2_Subreddit": "quittingkratom"}], "dv0z686": [{"0_Comment Submission": "Off kratom for 18 days, had a procedure today and they gave me an opiate.", "1_Text": "I agree with this 100% if I was to be given any more opiates I would be right back where I started, so I took that comment with a grain of salt lol \n\nI was honest with the nurses and doctors about my addictions so they administered the minimal dose of fentynal and sent me on my way home after a couple hours with just the recommendations of Tylenol/Advil and heating pads.   \n\nAt work and feeling pretty much like my old self so I’m Beyond happy about that, almost forgot how it felt to be “normal” lol", "2_Subreddit": "quittingkratom"}], "dv2klkq": [{"0_Comment Submission": "Daily Check-in Thread - March 02, 2018", "1_Text": "I am having the exact same problem. I’m on day 20 also and most of my acutes are gone just dealing with some paws now but the sleep is not returning to pre kratom!! I love sleep and need it desperately for my work so it’s very frustrating especially when I’m taking a ton of natural sleep herbs and THC before bed...", "2_Subreddit": "quittingkratom"}], "dv2l91h": [{"0_Comment Submission": "Daily Check-in Thread - March 02, 2018", "1_Text": "Well I was on strong opioids before taking kratom(used it to detox off oxy/fentynal that I abused for a year prior, then got addicted to kratom for about 5 months, was taking about 30-50GPD) then went cold turkey 20days ago (tapering never works for me and my addict mind lol)", "2_Subreddit": "quittingkratom"}], "dveve6k": [{"0_Comment Submission": "Failed at my first attempt to taper....oh and supplement question", "1_Text": "I CT off about 50GPD for about 5 months 26 days ago and I feel amazing and free!! (used kratom to come off hard opiates, specifically fentynal) and I have found that magnesium before bed and Advil help to calm the restlessness and pain a bit. In the morning I would take B12, potassium, and something someone recommended online that has been a huge help is a supplement called “Adrenal PS” purchased on amazon. I take one cap in the morning and one around 3 or 4pm. It’s a mix of natural herbs(ashwagandha, vit c, b6, L-tyrosine, ginseng, and a bunch of other natural stuff that im to tired to type out Lol) it really helps the adrenals which is key in withdrawal since it seriously affects that area. I found it helped calm my anxiety and restlessness (specifically anxiety) and gave me a little energy boost/motivation which helped while I was at work through withdrawals. I also used a lot of weed through the acutes and still do in the evening because it helped me tremendously and I just really enjoy it, always have lol. If your able to see a doctor Clonidine was helpful thew the acutes to help with restlessness/ hot&cold sweats and I found it helped relax me while I tried to sleep. I also used a benzo for the acutes (NO more than 7 days) but I don’t recommend that route as it is highly addicting and way worse to get off once you are dependent(it can happen very quickly too so I cannot stress enough to proceed with extreme caution if you do get a script for a benzo, also having someone you trust to hold them for you and only give them to you if you are in absolute need... helps so you are not tempted to pop them all day and night)\nHope this helps! You can do this! Just don’t give up and think about how beautiful the other side will be once you’re finally free!! Time heals all...", "2_Subreddit": "quittingkratom"}], "dvfm5gr": [{"0_Comment Submission": "Failed at my first attempt to taper....oh and supplement question", "1_Text": "Thank you.. \nHmm strange, I just looked it up in my end and it came right up, maybe search the brand it’s called “botanica research” product name “adrenal ps” it’s a product from the USA and I’m in Canada so not sure where your located maybe it has something to do with that? \n\nOr even just take a look at the other adrenal products on amazon and look at the ingredients, if it contains most/more of the ingredients I listed above (specifically  ashwaganda, L-tyrosine, and other vitamins and herbs) then I can assure you it will be just as good, if not better! But I honestly swear by this stuff, I’m only taking one capsule daily at this point(rather than the 2 I was taking morning/3-4pm) but will soon stop since I feel pretty good these days :) \nHope this helps!!", "2_Subreddit": "quittingkratom"}], "dvfmbem": [{"0_Comment Submission": "Failed at my first attempt to taper....oh and supplement question", "1_Text": "I meant to reply to this but instead I just wrote it as a comment! I’m slow at this reddit stuff hahah so just check out the comment below! :)", "2_Subreddit": "quittingkratom"}], "dw1sxu8": [{"0_Comment Submission": "39 days kratom free, question about one lingering withdrawal symptom ..", "1_Text": "ah good to know! I guess I should take my own advice about “giving it time” lol thanks!", "2_Subreddit": "quittingkratom"}], "dw1usxf": [{"0_Comment Submission": "39 days kratom free, question about one lingering withdrawal symptom ..", "1_Text": "It’s always nice to know that you’re not going through this shit alone... \nNo pun intended ! Heh =P", "2_Subreddit": "quittingkratom"}], "dw1v8mn": [{"0_Comment Submission": "39 days kratom free, question about one lingering withdrawal symptom ..", "1_Text": "Yes I do, as I was just sipping on my coffee I realized what a contradiction that was. Coffee is something I will never be able to give up so I will just suffer the consequences I guess! I try to keep it to one in the morning and then decaf after that (even though there is some caffeine in decaf)", "2_Subreddit": "quittingkratom"}], "dw1w99g": [{"0_Comment Submission": "39 days kratom free, question about one lingering withdrawal symptom ..", "1_Text": "Yeah me too!!! \nAnd my body temp is still kinda off also but I don’t know if it’s jus time or the kratom cause I’ve always had fluctuating body temps! It’s still cold where I live so maybe that’s a factor, do you live where it’s colder??", "2_Subreddit": "quittingkratom"}], "dw1zojh": [{"0_Comment Submission": "39 days kratom free, question about one lingering withdrawal symptom ..", "1_Text": "Thanks :) me too!! \nIll give it another few weeks and if no improvement I’ll go to my doctors to make sure everything’s okay..", "2_Subreddit": "quittingkratom"}], "dw21cto": [{"0_Comment Submission": "39 days kratom free, question about one lingering withdrawal symptom ..", "1_Text": "Wow who knew! I will try that, thanks!", "2_Subreddit": "quittingkratom"}], "dw2282m": [{"0_Comment Submission": "39 days kratom free, question about one lingering withdrawal symptom ..", "1_Text": "Yeah it helps for sure  but I’m trying my best to stay away from anything that’s not natural these days", "2_Subreddit": "quittingkratom"}], "dw2ehch": [{"0_Comment Submission": "39 days kratom free, question about one lingering withdrawal symptom ..", "1_Text": "Thanks! \nAw damn this does not ship to Canada :/ \nI’ll search around tho!", "2_Subreddit": "quittingkratom"}], "dw2epal": [{"0_Comment Submission": "39 days kratom free, question about one lingering withdrawal symptom ..", "1_Text": "I’m very intrigued by psyllium as another poster recommended it also. I’m going to have to give it a try!\nI’m super curious about how kratom affected my gut microbiome as well...", "2_Subreddit": "quittingkratom"}], "dw2et9c": [{"0_Comment Submission": "39 days kratom free, question about one lingering withdrawal symptom ..", "1_Text": "Good info! I will take this advice! \nThanks :)", "2_Subreddit": "quittingkratom"}], "dw2j1lx": [{"0_Comment Submission": "39 days kratom free, question about one lingering withdrawal symptom ..", "1_Text": "Hey awesome with 40days! (Ps I’m a girl ;)) Haha at your comment about being on the toilet!! Dkm!! \nI take magnesium sporadically so that might be contributing and also sometimes I eat like garbage also so that prob doesn’t help my case!\nI’m honestly not sure what baseline really is to be honest(since I’ve been messing with drugs since I was 13 now 26)  but I’m just assuming I’m at baseline only cause my humour and personality came back, sleep is better, not feeling like shit all the time, I’m happy.. so that’s my idea of “baseline” lol I could be way off about actually being there but I’ll take it!!", "2_Subreddit": "quittingkratom"}], "dw2j34f": [{"0_Comment Submission": "39 days kratom free, question about one lingering withdrawal symptom ..", "1_Text": "Good to know. Awesome job on 5.5 months that’s huuuuge!", "2_Subreddit": "quittingkratom"}], "dw5m2i4": [{"0_Comment Submission": "Quitting Kratom Music Thread 2.0", "1_Text": "Any Song by the artist “mogli” ... some of her songs are “two lungs” “wanderer” “road holes” “winter sun” “bird” youtube has them all!  \nShe sounds like an angel and her music is so soft and soothing, it will help give you a bit of relief from withdrawal, help reduce anxiety, and great to fall asleep too!! :)", "2_Subreddit": "quittingkratom"}], "dwbgouk": [{"0_Comment Submission": "Opiod and Repeat of PAWS?", "1_Text": "It’s from the hydros. Stay away from all opioids when going through withdrawal, you’re only prolonging the suffering unfortunately..", "2_Subreddit": "quittingkratom"}], "dwedm8i": [{"0_Comment Submission": "Shadow", "1_Text": "My dream bike <3", "2_Subreddit": "motorcycles"}], "dwedzxc": [{"0_Comment Submission": "Shadow", "1_Text": "I bet, she’s a beaut", "2_Subreddit": "motorcycles"}], "dwqm39b": [{"0_Comment Submission": "RLS in a single leg?", "1_Text": "Always find RLS is worse in my right leg every time I detox", "2_Subreddit": "opiates"}], "dwsvanq": [{"0_Comment Submission": "Saw this baby, but felt scared to take a picture of it, so it came out blurry; I thought it might be rude or suspicious for some reason? Stupid question probably but do you guys find it rude when randoms take pictures of your motorcycle?", "1_Text": "I think it’s great when someone thinks my bike is sexy enough to want their own pic of it!! Just as long as they don’t take pics with my licence plate in it or touch my bike!! :)", "2_Subreddit": "motorcycles"}]}], "1_submissions": [{"81110u": [{"0_Title": "Off kratom for 18 days, had a procedure today and they gave me an opiate.", "1_Text": "If anyone is interested about the outcome today, I feel great! Had my first real sleep lastnight (about a solid 8 hours..woohoo!!) and feel the best I’ve felt yet throughout this journey! I hope it continues throughout the day but for now I’m just so grateful the administered fentynal from my procedure yesterday did not send me back into any acutes or amplify my paws..  sad the addict in me was overly excited to hear I was going to get a dose of the good ol’ fent yet it did next to nothing but take the edge off, so if I ever get a craving I’m just gona remind myself about the procedure and how the fentynal didn’t do much and if i did feel it/got high from it I would be right back to the vicious cycle of opioid addiction...  thanks for anyone who’s listening.\nI will report back tonight after work and let you all know how I’m doing by then.", "2_Subreddit": "quittingkratom"}], "862fmu": [{"0_Title": "39 days kratom free, question about one lingering withdrawal symptom ..", "1_Text": "If anyone is interested about the outcome today, I feel great! Had my first real sleep lastnight (about a solid 8 hours..woohoo!!) and feel the best I’ve felt yet throughout this journey! I hope it continues throughout the day but for now I’m just so grateful the administered fentynal from my procedure yesterday did not send me back into any acutes or amplify my paws..  sad the addict in me was overly excited to hear I was going to get a dose of the good ol’ fent yet it did next to nothing but take the edge off, so if I ever get a craving I’m just gona remind myself about the procedure and how the fentynal didn’t do much and if i did feel it/got high from it I would be right back to the vicious cycle of opioid addiction...  thanks for anyone who’s listening.\nI will report back tonight after work and let you all know how I’m doing by then.", "2_Subreddit": "quittingkratom"}]}]}]}