{"ggenius1": [{"0_comments": [{"dse57yn": [{"0_Comment Submission": "thought loops before the internet", "1_Text": "Eternal recurrence resonates  a great deal, how different the world would be, if everyone came to the understanding, even temporarily, that we are currently experiencing eternity, indoctrination takes away the freedom of thought from many, shrooms can pierce the veil.", "2_Subreddit": "shrooms"}], "dserneg": [{"0_Comment Submission": "Has anyone tried waking up early, eating shrooms, going back to sleep for an hour and then waking up already tripping?", "1_Text": "I have fallen asleep tripping before and woke up very, very confused, or at least believe I woke up, my life did take some bizarre “turns” after that, so who knows.", "2_Subreddit": "shrooms"}], "dshw5j8": [{"0_Comment Submission": "What is the most aesthetic move/play in basketball?", "1_Text": "Hesi pull-up crossover fade-away jimbo.", "2_Subreddit": "nba"}], "dsigaeu": [{"0_Comment Submission": "My job is highly confrontational and it makes me sad/want to die", "1_Text": "No job is worth that, quit now, do what makes you happy, I know you can find the way, life is too beautiful.", "2_Subreddit": "SuicideWatch"}], "du147l3": [{"0_Comment Submission": "Just a silly conspiracy theory", "1_Text": "Same goes for the crack epidemic and aids epidemic, thin the herd of unsavory people, profit off the sale of drugs, rehab, treatments, and so forth, it has always been about money and control.", "2_Subreddit": "opiates"}], "dvlsplo": [{"0_Comment Submission": "Why would the government hide the earth being flat?", "1_Text": "Money.", "2_Subreddit": "flatearth"}], "dvltwkx": [{"0_Comment Submission": "Some things just don’t make any sense.", "1_Text": "Omg, you just don't get it! The earth is moving so fast, that you just can't perceive it, since it's SoOo fast, because science!!!!! Who cares if this behavior isn't demonstrated anywhere in the observable world, it's not like that's relevant to scientific theory or anything?", "2_Subreddit": "flatearth"}], "dvlup2x": [{"0_Comment Submission": "If the earth is flat how does GPS work?", "1_Text": "Land-based towers.", "2_Subreddit": "flatearth"}], "dvml54a": [{"0_Comment Submission": "Being alive fucking sucks", "1_Text": "powerful post.", "2_Subreddit": "death"}], "dvpk601": [{"0_Comment Submission": "I'm high asf and have to go to college", "1_Text": "I graduated law school and went to every class high, I was never once called out for it, but one time a professor drilled me with questions, I could sense she knew something might be up, but I answered them all, and was left alone,  hopefully you at least did your hw.  My tip would be not to make eye-contact with anyone, keep your head buried in your book or laptop.", "2_Subreddit": "opiates"}], "dvpr7ui": [{"0_Comment Submission": "I hate Tramadol.", "1_Text": "Tramadol is complete garbage, I’d rather sit in agony than take one.", "2_Subreddit": "opiates"}], "dvprm3u": [{"0_Comment Submission": "Is there a reason I shouldn’t re-use a syringe that has no needle on the end if I’m “boofing”. As long I wash the rig off with antibacterial soap? Like I’m not risking contracting some disease by reusing the same plunger am i? Also I don’t think it needs to be said, but no I’m not sharing it lol.", "1_Text": "Lmao", "2_Subreddit": "opiates"}], "dvvk74a": [{"0_Comment Submission": "<SAFETY QUESTION> (tramadol + hydrocodone)", "1_Text": "yeah, it's fine to take both", "2_Subreddit": "opiates"}], "dvwwp7e": [{"0_Comment Submission": "Can Oxy make your heart spasm and stop?", "1_Text": "There are no guarantees in life, that being said, you’ll be fine, 20mg oxy is relatively low dosage, if such a low dosage gives you anxiety I’d reconsider doing them.", "2_Subreddit": "opiates"}], "dvz0qcb": [{"0_Comment Submission": "30 years old existential crisis", "1_Text": "A lot depends on how you take care of yourself, a 30 yr old with good genetics, that takes care of themselves, looks way better and has more energy than a 19 yr old that eats doritos all day, nothing comes free or easy anymore though, if you focus and work hard at taking care of yourself, you can apply the mistakes you learned from in your 20's and slay in your 30's...goodluck.", "2_Subreddit": "Anxiety"}], "dw4zogx": [{"0_Comment Submission": "I ran out of Oxy. Is Tramadol or Tilidin a good replacement?", "1_Text": "Go to your local smoke shop and get kratom till the oxy arrives, smoke shops will overcharge for it, but if you need it immediately, it's the best route.", "2_Subreddit": "opiates"}], "dwfxfl5": [{"0_Comment Submission": "Why don't you just do hookers?", "1_Text": "Brother, you can pay a hooker to do all those things you mentioned, why don't you try negotiating? If you're talking about \"love\" and \"genuine\" feelings between people, it doesn't exist, everything is conditional, humans are a complex set of needs bundled together, we're all using each other to get what we think we want. Call the hooker.", "2_Subreddit": "SuicideWatch"}], "dwfxwgx": [{"0_Comment Submission": "I want to kill myself because I can’t finish school.", "1_Text": "Listen, you're not dumb, if you don't want to go to school, and it's making you suicidal, then don't do it, focus on yourself and healing your mind and body, school will always be there if you want to go back.", "2_Subreddit": "SuicideWatch"}], "dwfya2v": [{"0_Comment Submission": "I'm accomplished and respected and I'm about to graduate with my BA but I still want to die", "1_Text": "I graduated from college magna cum laude, and went for a law degree after, trust me, if you think superficial accolades will fill any kind of void, you're in for a rough ride.  Take a step back, reassess what you want out of life,  getting more degrees will not fix your depression.", "2_Subreddit": "SuicideWatch"}], "dwfz1pt": [{"0_Comment Submission": "All my friendships end in loneliness and sorrow", "1_Text": "Put all your focus into your guitar, keep playing, hone your craft, even if you're not wildly talented, you'll still be better than most,  the rest will take care of itself, ignore the shitty people at your school, it only gets worse once you're out, most people have an axe to grind because they allowed other people to get under their skin, and now they want to take other people with them.", "2_Subreddit": "SuicideWatch"}], "dwjw6o4": [{"0_Comment Submission": "I'm accomplished and respected and I'm about to graduate with my BA but I still want to die", "1_Text": "I understand, it sounds like your mind is set on academia, do yourself a favor though, do not pay for your PHD, whatever you do, they should be paying YOU, also, do everything within your power to get into a top 10 program, otherwise you may find yourself hustling for adjunct positions at community colleges, making less than someone working at mickey d's, the ivory tower of academia is a tough cookie to crack, good luck.", "2_Subreddit": "SuicideWatch"}], "dwk1y40": [{"0_Comment Submission": "Ready to kill myself, one question for y'all", "1_Text": "I had a NDE involving a car crash, did the whole I love you, you only get one life talk to the then love of my life, things were ok for a bit, but ended up getting destroyed, wish i'd died in the car crash, shit maybe I did and this is hell, I hope you find peace.", "2_Subreddit": "SuicideWatch"}], "dwtkmv3": [{"0_Comment Submission": "How addictive is OPIUM?", "1_Text": "It’s addicting, but depends on the person, I’ve casually done opiates for years and I handle my shit, too many people act like it’s all or nothing with opiates use, when really it’s the shitboxes that don’t understand moderation, that give it a bad name.", "2_Subreddit": "opiates"}], "dwtv7hd": [{"0_Comment Submission": "how do I fucking poop", "1_Text": "Good advice, i keep a gallon jug next to my bed, it makes a huge difference.", "2_Subreddit": "opiates"}], "dwuji72": [{"0_Comment Submission": "How addictive is OPIUM?", "1_Text": "The reddit community here is, in my personal experience, not representative of the whole in terms of opiates users, obviously there’s going to be people that dgaf and post pictures of themselves with needles in their arms, and that probably skews the perception of the average opiate user.", "2_Subreddit": "opiates"}]}], "1_submissions": [{"6877u0": [{"0_Title": "We Need to Overthrow the Powers that Be", "1_Text": "Eternal recurrence resonates  a great deal, how different the world would be, if everyone came to the understanding, even temporarily, that we are currently experiencing eternity, indoctrination takes away the freedom of thought from many, shrooms can pierce the veil.", "2_Subreddit": "conspiracy"}], "6fj3nr": [{"0_Title": "The Alternative (conspiracy) Narrative is Controlled by Them.", "1_Text": "Eternal recurrence resonates  a great deal, how different the world would be, if everyone came to the understanding, even temporarily, that we are currently experiencing eternity, indoctrination takes away the freedom of thought from many, shrooms can pierce the veil.", "2_Subreddit": "conspiracy"}], "8410wf": [{"0_Title": "Almost every thread here is a spam link", "1_Text": "Eternal recurrence resonates  a great deal, how different the world would be, if everyone came to the understanding, even temporarily, that we are currently experiencing eternity, indoctrination takes away the freedom of thought from many, shrooms can pierce the veil.", "2_Subreddit": "conspiracy"}]}]}]}