{"kt0k0v0": [{"0_comments": [{"dw1938h": [{"0_Comment Submission": "Music major", "1_Text": "I mean, congratulations on her appreciating it. It’s sort of irrelevant how you go about succeeding in bagging some pussy, but don’t pride yourself on the tactics.", "2_Subreddit": "Tinder"}], "dw19zr8": [{"0_Comment Submission": "Music major", "1_Text": "Bag pussy, go on a date, succeed in some way, who gives a shit? the terminology is not very important. In that case, if you employed those lines purely for the sake of entertainment, your target audience must be simpletons", "2_Subreddit": "Tinder"}], "dw1oenk": [{"0_Comment Submission": "23 emotions people feel, but can't exactly explain", "1_Text": "L’appel du vide", "2_Subreddit": "coolguides"}], "dw360dh": [{"0_Comment Submission": "Switching from unhealthy to healthier diet lowers depressive symptoms more than social support sessions", "1_Text": "Did we have any scientific response to this? I think this is interesting", "2_Subreddit": "science"}], "dw4duzp": [{"0_Comment Submission": "Wasn’t sure whether to post this here or on r/trees..", "1_Text": "People have used this method, not with the zipper, to bring contraband into jails", "2_Subreddit": "trashy"}], "dw54ttu": [{"0_Comment Submission": "No one really thinks about you.", "1_Text": "People give enough of a shit to fuck your life up and then forget about you.", "2_Subreddit": "howtonotgiveafuck"}], "dw57gz5": [{"0_Comment Submission": "Future Dorm Room by Jarlan Perez", "1_Text": "This reminds me of a jail dream", "2_Subreddit": "Cyberpunk"}], "dw7t50f": [{"0_Comment Submission": "Kid who went to school in the 2000s starter pack", "1_Text": "Yeah same this must be like kids born 95-99", "2_Subreddit": "starterpacks"}], "dw8vltk": [{"0_Comment Submission": "Let's rob this convenience store!", "1_Text": "What if he had killed them? I guess I’m asking when is the use of lethal force justified by a security card? Would it matter if he worked there? Could anyone walk in and shoot those guys? I don’t necessarily have an issue with it I’m just genuinely curious", "2_Subreddit": "instant_regret"}], "dwahbpe": [{"0_Comment Submission": "Donald Trump Returns to White House Without Melania Ahead of Stormy Daniels’ Tell-All Interview", "1_Text": "It’s been said before, but congress will not impeach trump short of him running around naked on the White House lawn and it’s not even clear that would be enough", "2_Subreddit": "politics"}], "dwahujb": [{"0_Comment Submission": "Just Ate a 1,500mg Edible, help", "1_Text": "I haven’t ingested THC in a very long time but I once ate way too many edibles and felt like I was going to die. It wasn’t like mushrooms or LSD where I have literally lost my mind, I just felt incredibly sick and potentially also thought I had heart palpitations. I think I just lay on the couch forever. Trees suck.", "2_Subreddit": "trees"}], "dwb03df": [{"0_Comment Submission": "Just Ate a 1,500mg Edible, help", "1_Text": "To each their own. I was much younger but I never really enjoyed it. I am sober now but I found my home with cns depressants a la opiates and benzos", "2_Subreddit": "trees"}], "dwbuiav": [{"0_Comment Submission": "Her bio said “if you peaked in high school, stay away from me”", "1_Text": "This bitch was probably incredibly wack in high school and thinks she has now hit her stride, projecting this insecurity on to potential mates. Unbeknownst to her, she is still wack,always will be", "2_Subreddit": "Tinder"}], "dwcib2p": [{"0_Comment Submission": "Nation Thrilled Grayson Allen Returned to Duke for One More Crushing NCAA Loss (The Onion)", "1_Text": "It can’t be worse than UMich. All from the Tri-state area with their fathers old 2010 Audi’s and Canada goose jackets. Enjoy your investment banking job in Manhattan you fucking capitalist pigs", "2_Subreddit": "CollegeBasketball"}], "dwegsjp": [{"0_Comment Submission": "Man escapes from county jail Indiana Jones style under a closing garage door.", "1_Text": "It sounds like this guy would have been released on bond barring preexisting warrants or probation, which aren’t mentioned in the article. Either way this is radically stupid", "2_Subreddit": "videos"}], "dwelcmb": [{"0_Comment Submission": "Did the Jews know that the \"showers\" were actually gas chambers?", "1_Text": "For something more visceral, watch Son of Saul, a recent Hungarian film about the sonderkommando", "2_Subreddit": "AskHistorians"}], "dwhv8ql": [{"0_Comment Submission": "An amusing tweet from Richard Dawkins: “Do dogs go to Heaven? Only pets, not wild animals? If only humans go to Heaven, how far back? Homo erectus? Australopithecus? Only people who lived after Jesus? Not Abraham, Moses or Elijah, then. Which “you” will be in Heaven? Senile you with dementia?...", "1_Text": "Heaven is so clearly an imaginary concept that it almost seems like a complete waste to devotes one’s life work to arguing the issue. How about redirecting that energy into help real people, living real lives, with real material considerations?", "2_Subreddit": "atheism"}], "dwkcehj": [{"0_Comment Submission": "PsBattle: A sleeping Redditor", "1_Text": "He looks like he’s in a bam bam suit. Put him in PC", "2_Subreddit": "photoshopbattles"}], "dwkclmu": [{"0_Comment Submission": "Steven Colbert and Dana Carvey in Skinheads From Maine (Dana Carvey Show)", "1_Text": "Louis ck talks about writing this bit", "2_Subreddit": "television"}], "dwnubxs": [{"0_Comment Submission": "All set for the week", "1_Text": "But a drawer full of bundles of heroin wouldn’t be treated as benignly or praised. There are major differences obviously. Heroin has the ability to be acutely fatal in a way alcohol doesn’t but the contrast in optics can not be solely accounted for on this dimension. Heroin and other illicit substances are immensely stigmatized. We should be moving towards compassion not single-mindedness. With complete unawareness or malicious intent, this post demonstrates the scorn and vilification of heroin users", "2_Subreddit": "MealPrepSunday"}], "dwsfm36": [{"0_Comment Submission": "First post... My lucky pickup whilst in ward", "1_Text": "This def looks like #4 hcl. You see this in Chicago Detroit all the time", "2_Subreddit": "opiates"}], "dwtezwh": [{"0_Comment Submission": "Samuel L Jackson standing outside, 1969", "1_Text": "A charismatic sociopath since day 1", "2_Subreddit": "OldSchoolCool"}], "dwtnu5i": [{"0_Comment Submission": "San Francisco 2076", "1_Text": "Joke if you think climate change won’t have fucked up shop", "2_Subreddit": "evilbuildings"}], "dww647y": [{"0_Comment Submission": "Fat nut", "1_Text": "Is that your penis and ball sack, the face you are making as you lay down on the pillow, or both?", "2_Subreddit": "BikiniBottomTwitter"}], "dwwm1of": [{"0_Comment Submission": "That Video The Church Of Scientology Tried To Take Down Where Tom Cruise Salutes The Portrait Of Its Dead Founder", "1_Text": "The dude is clearly a repressed homosexual", "2_Subreddit": "videos"}]}], "1_submissions": [{}]}]}