{"liluglydude_0": [{"0_comments": [{"ds7tw2p": [{"0_Comment Submission": "Is black mirror recycling technology on purpose? [Plus bonus question]", "1_Text": "Many of the ways the tech in black mirror behaves or affects the characters have been philosophical notions for quite some time. Many of the themes and positions at play are on problems that explore much of what has been discussed by contemporary philosophers before, specifically with the tech/mechanical/AI/ whatever else.\n\nThese include notions such as the Mind as a Program, turning hardware into software, Created Selves versus Free Will, etc/etc. Looking at it this way it’s not as unoriginal, or “recycled” or what have you as it may seem. Most of the plots explore the ramifications of these in a way that’s probably more relevant than most shows, today, but that’s just an opinion.", "2_Subreddit": "blackmirror"}], "ds7u3pp": [{"0_Comment Submission": "What episodes would you like to see in S5?", "1_Text": "Definitely something to play into the AI Box concept. If you haven’t heard of it before check it out, it’s a hypothetical proposed way to keep a dangerous AI in a virtual prison. The caveats are that the AI could “talk someone into letting them out.”", "2_Subreddit": "blackmirror"}], "ds7uax0": [{"0_Comment Submission": "What episode gave you chills?", "1_Text": "It made my skin crawl to see everyone recording the atrocity trough their phones and ignoring any notion of humanity. But then of all the episodes, it was White Bear where I had to sit down and think, is this really all that different from the state of affairs today?\n\nEven the dialogue in the beginning-ish, where they’ve retreated to the convenience store. Not verbatim but something like “yea one day they just changed bc of the messages and there’s only a few of us normal ones left, the message didn’t work on everyone,” the whole trope of living in a world where most people are just brain dead sheep", "2_Subreddit": "blackmirror"}], "ds7uera": [{"0_Comment Submission": "What episode gave you chills?", "1_Text": "Definitely this episode. I assume many people have been cheated on, or cheated, or went through it one way or another.  \n\nIt can create an obsession over the trauma: wanting to know all the details, what was said, and generally the offending party feels so guilty they reveal a lot of stuff but not all, holding back the shit they know would kill their SO. \n\nin this episode, the idea of being able to actually watch that shit as it happened would be truly tragic like nothing else", "2_Subreddit": "blackmirror"}], "ds7ul95": [{"0_Comment Submission": "What episode gave you chills?", "1_Text": "That exact aspect haunted me the first time I saw the episode, then, the second time around it was the final scene where he goes into his moms room and sees her crying and completely disheveled, making it worse it’s like she can’t see or hear him. \n\ni’m an only son and my parents but particularly my mom has always been ultra protective, even into my 20s, blowing my phone up constantly. It’s fucking aggravating, just like the way he reacts to it, it’s always a burden, blah blah.\n\nthe thing i’ve learned from having a mom that’s similar to that level of behavior but having been through it so much I know that most, if not all mothers feel that way towards their son. some show it in different ways, or maybe sadly not at all, but I think the trope is “overprotected son who’s trying to leave the matriarch harbors resent but ultimately still loves mom with all his fucking heart,” just broke my heart to see it. made me think of all the times I did the same things, ignored calls etc. But he meant the world to his mom.\n\nSorry that ended up being way longer of a reply than expected", "2_Subreddit": "blackmirror"}], "ds8wi0y": [{"0_Comment Submission": "[Serious]Besides money, what's something that would greatly improve your life?", "1_Text": "Not having anxiety. Maybe it’s an inextricable part of being human, maybe it’s maladaptive. Maybe, it’s adaptive, or maybe it’s a misappropriated response to adaptivity. Nonetheless it is an umbrella for a host of other problems. I have digestive issues as well, specifically GERD. It’s kind of like heartburn, but differs in symptoms from acid reflux. This condition in itself runs a close second to the improvement of my life if it were absent. However it’s hard to distinguish between the two since i’m sure that the issues can work in tandem. \n\nIt’s hard to have an appetite when you have anxiety, and when you do eat, you may find you are a “nervous eater,” as people have pointed out in me before. When you’re anxious, your food doesn’t digest fully. You don’t get the same satisfaction and benefits from a good meal, instead, you’re just still at “dis-ease.” There’s been times where I have been less anxious than others, and surely anxiety has a way of coloring a persons personality with idiosyncrasies that can really shape up a unique person. \n\nBut that’s just optimistic, the rest of the time is spent internalizing most things people say, and that stems from a low self esteem. Even if one has a great worth they are aware of inside, one that lays deep rooted “behind the scenes” of all the cinematics of anxiety, it still doesn’t quell the ways in which anxiety runs rampant in ones life. It can reduce the good in ones life as a happenstance, and turn the bad in ones life as a doom that was long impending. \n\nNot to sound masochistic, but after enough reinforcement and conditioning, it’s hard to distinguish where one bad seed came to fruition and from which fruit the seed was laid. Maybe i’d be more calm, cool, collective, without anxiety. Maybe i’d be more poised, unreactive, and composed, but I wouldnt really be the “me,” that in fact many people have come to love. But the longer I stew on the matter, I have to wonder if the idea of “me” is really even an “idea” I want to entertain anymore... and maybe that’s really the source of it all in the first place. \n\nI’ve more or less reduced it all to the spirit of the times, and that I should be anxious, because the world is an uncertain place, or atleast my world (sense of security) has always been largely uncertain. Anxiety as a mood disorder is one thing, Anxiety as a complex is another intricate web that is spun by the ebb and flow of environment and internalization. \n\nMaybe, Anxiety in an existential context might keep you vigilant. Maybe it just ruins your quality of life. Be careful what you wish for, what would be left of me without it? Would it be something I loved, or would there be a greater effect overtaking me to which, in a parallel universe, I would be responding this question with a different answer.", "2_Subreddit": "AskReddit"}], "ds8xabo": [{"0_Comment Submission": "What are you exceptionally skilled at doing that you keep secret, avoid discussing, or intentionally (not out of modesty) downplay?", "1_Text": "The near-ness of thought that all people share. It’s generally a situational thing, a group of people are all in the same room, more or less observing and reacting to the same things. It’s not a far shot to be thinking the same exact thing in response to something as someone else, the trick is to just simply say what you’re thinking. \n\nBy doing this it’s a very common reaction from any person no matter who they are or where i’m at to say “I swear I was just thinking the exact thing!” It’s like low grade mind reading, except you’re really just saying what you’re thinking, which in most casual social settings is (i’m willing to bet) exactly, if not in the same words, what others are thinking. Not that any of this in itself is special, or esoteric, but I think there’s a quaint awareness that plays off of a belief that the mind is something we’re all sort of tapped into at the same time. To shorten all that, don’t be afraid to mention exactly what your reaction to something is as soon as it happens, that’s where the magic is. \n\nBut this isn’t something i’d discuss otherwise, it actually benefits me.", "2_Subreddit": "AskReddit"}], "ds8xe83": [{"0_Comment Submission": "What is that random song on your work playlist, that just motivates you to push yourself further?", "1_Text": "Almost anything by Liquid Ritual or Plastician", "2_Subreddit": "AskReddit"}], "ds8xg4g": [{"0_Comment Submission": "What is something that you do in your group of friends that would just seems weird to the rest of the world ?", "1_Text": "Haha It’s kind of weird to actually put this into words.... but talk like a baby.", "2_Subreddit": "AskReddit"}], "ds8xwtn": [{"0_Comment Submission": "How did you react to a friend or family member's suicide/attempted suicide?", "1_Text": "My best friend at 19 committed suicide with a rifle he took from his parents house. I called him that night and told him I loved him, he later shot himself and his gf found him after he sent some disturbing messages. She was the one to find him.\n\nI went into shock, I found this out while eating inside McDonald’s with my dad. I was sad and explosively impulsive, I ripped my shirt off after his wake, I don’t expect that to make any sense. I had hallucinations while I slept many night, each with a different theme. Surely that was the denial phase. I quit doing drugs and deemed myself “too emotionally unstable” for all the drugs I liked to do at that age, mostly acid. \n\nI found acceptance after I had a lucid dream with him in it, where we spoke and made eye contact, and I told him “we can still meet like this, no one has to know.” and he looked me in the eyes and said “i’m pretty sure that violates some kind of rule or something.” And that was the end of it.\n\nI think all the things I went through were all parts of different stages. But anger was the last one, after that, I just accepted it: Became more casual about discussing it, became more aware of how much guilt all of his friends including myself felt.", "2_Subreddit": "AskReddit"}], "ds8xxsu": [{"0_Comment Submission": "How did you react to a friend or family member's suicide/attempted suicide?", "1_Text": "Thanks for sharing that.", "2_Subreddit": "AskReddit"}], "ds90mg9": [{"0_Comment Submission": "On new year's day I suggested my friend to watch Black Mirror", "1_Text": "Somehow I just noticed the capital “i” and lowercase “L” are slightly differing in height. I thought they were identical up to this point.", "2_Subreddit": "blackmirror"}], "ds9gi99": [{"0_Comment Submission": "White Bear [Episode Rewatch Discussion] - S02E02", "1_Text": "Just watched White Bear and i’m wondering what the significance of that is, considering at the end of Metalhead the item they were trying to get for the dying man was a white stuffed bear.", "2_Subreddit": "blackmirror"}], "dsdunuo": [{"0_Comment Submission": "[SPOILER] Can we all agree that this is the worst character in the entire series?", "1_Text": "What’s really interesting is that the system puts them at 1 year based on compatibility, when they’re painfully incompatible from the jump.", "2_Subreddit": "blackmirror"}], "dstgcgc": [{"0_Comment Submission": "What is the scariest, most terrifying thing that actually exists?", "1_Text": "Normality: a conformity that is in and of itself in highest demand.", "2_Subreddit": "AskReddit"}], "dsx25ge": [{"0_Comment Submission": "What products are pointlessly gendered?", "1_Text": "Shaving cream, deodorant", "2_Subreddit": "AskReddit"}], "dwpcs9u": [{"0_Comment Submission": "I’m worried about my sister. What’s the general addiction timeline look like from beginning to end?", "1_Text": "I’ve really never thought about it critically but my current girlfriend met her for the 3rd or 4th time today. She was asking if my sister was manic, citing the extreme low she was on two days ago and how today she’s swung up into this mental high. \n\nShe was rambling off in a pretty batshit/conspiracy theory type way. My girlfriends currently doing her Masters in Psych and brought up the manic thing., since apparently it has a lot to do with “nonsensical speech and getting ideas and trying to shape their whole life around some new random idea that only makes sense to them.” \n\nI’ve never really thought about it critically, it’s a blind spot for me. I just want her to be OK. But yea, the conversation my sister was having was pretty much the Tom Cruise on Scientology interview, it was pretty out there.", "2_Subreddit": "opiates"}], "dwpd6kj": [{"0_Comment Submission": "I’m worried about my sister. What’s the general addiction timeline look like from beginning to end?", "1_Text": "The word diagnosed wasn’t even used in the post", "2_Subreddit": "opiates"}], "dwpejhh": [{"0_Comment Submission": "I’m worried about my sister. What’s the general addiction timeline look like from beginning to end?", "1_Text": "Thanks a lot. I know Suboxone blocks the receptors to null the effects of opioids but does that (i’m gonna use the word very loosely) “guarantee” that they won’t use? Could she still abuse opioids? Or, even though not universal could be somewhat typical to move on to a harder drug that might be hard enough and stimulating enough to give her a sense of normalcy (like meth.) \n\nFor reference, the doctor told her she would never experience happiness again in a normal sense. I know there’s varying degrees of addiction but let’s just imagine she prolly had an extreme case the entire 10 years. She’s burnt out hard, and kinda just seems doped up all the time.\n\nI hope she’s just making progress, I fear she may lean on a hard substance for a “mood boost” or something since she seems down a lot. Then, it’s certain she has friends that are involved in hard ass shit, she tells me about them. And come on, if you’re trying to recover and you still even associate with people who are not in that same recovery mindset and actively using it’s a cause for concern for me, that’s my only sister and only sibling", "2_Subreddit": "opiates"}], "dwpeq8z": [{"0_Comment Submission": "I’m worried about my sister. What’s the general addiction timeline look like from beginning to end?", "1_Text": "I see. Generally when I go stop by there’s an opened Suboxone packet on the ground or in the trash, and 98% of the time I see her she’ll talk to me for a while and then nod off the rest of the time. Over and over", "2_Subreddit": "opiates"}], "dwpf0n5": [{"0_Comment Submission": "I’m worried about my sister. What’s the general addiction timeline look like from beginning to end?", "1_Text": "Yea, I think that’s sort of her bedrock, is my mom saving the day somehow, and my sister not admitting and facing her consequences is probably in part because somehow this support system does enable her, by keeping her from completely falling apart, as sad as that is.\n\nThanks for the perspective on that, i think personal accountability is of the utmost importance. I wasn’t as specific as possible but the “pieces” we pick up for her are her children, my nephews and nieces. She’s got a strong support system (us and her husband,) but it’s a constant battle. and always has been, through her last marriage and this one.", "2_Subreddit": "opiates"}], "dwpf6tg": [{"0_Comment Submission": "I’m worried about my sister. What’s the general addiction timeline look like from beginning to end?", "1_Text": "Ballpark figure about 5 years i’d say. All I recall in the timeline of everything was that her life was going one way (she was still using pain pills and prolly many other substances) and then everything changed. She went to a doctor, and had to give urine samples, and so she just started smoking fake weed and Subs after that.", "2_Subreddit": "opiates"}], "dwpfzyr": [{"0_Comment Submission": "I’m worried about my sister. What’s the general addiction timeline look like from beginning to end?", "1_Text": "I’ll have to try that one day and be super impossibly nice about it. If I even do, she’d probably take that so personally and feel judged", "2_Subreddit": "opiates"}], "dwpg6sg": [{"0_Comment Submission": "I’m worried about my sister. What’s the general addiction timeline look like from beginning to end?", "1_Text": "Now that you say that i’m even more concerned, because she eventually got out of the piss test thing and smokes normal weed now. I’m assuming she might just be getting the subs off the street or some shit if a UA is required for a refill.", "2_Subreddit": "opiates"}], "dwqqaw3": [{"0_Comment Submission": "First post... My lucky pickup whilst in ward", "1_Text": "what is this?", "2_Subreddit": "opiates"}]}], "1_submissions": [{"7kgskd": [{"0_Title": "In the 2003 comedy Stuck On You, there’s a face under the bed in the opening scene", "1_Text": "Many of the ways the tech in black mirror behaves or affects the characters have been philosophical notions for quite some time. Many of the themes and positions at play are on problems that explore much of what has been discussed by contemporary philosophers before, specifically with the tech/mechanical/AI/ whatever else.\n\nThese include notions such as the Mind as a Program, turning hardware into software, Created Selves versus Free Will, etc/etc. Looking at it this way it’s not as unoriginal, or “recycled” or what have you as it may seem. Most of the plots explore the ramifications of these in a way that’s probably more relevant than most shows, today, but that’s just an opinion.", "2_Subreddit": "MovieDetails"}], "7m6qxj": [{"0_Title": "In an even termed “revolutionary suicide,” over 900 people died in the Jonestown Massacre on November 18, 1978. Those who refused to “drink the Kool Aid” were either forcibly injected with poison or shot by guards. True to it’s terminology: they even poisoned the dog. [1080X1080]", "1_Text": "Many of the ways the tech in black mirror behaves or affects the characters have been philosophical notions for quite some time. Many of the themes and positions at play are on problems that explore much of what has been discussed by contemporary philosophers before, specifically with the tech/mechanical/AI/ whatever else.\n\nThese include notions such as the Mind as a Program, turning hardware into software, Created Selves versus Free Will, etc/etc. Looking at it this way it’s not as unoriginal, or “recycled” or what have you as it may seem. Most of the plots explore the ramifications of these in a way that’s probably more relevant than most shows, today, but that’s just an opinion.", "2_Subreddit": "HistoryPorn"}], "7oetts": [{"0_Title": "What does the out-of-5 blue star rating mean in r/blackmirror?", "1_Text": "Many of the ways the tech in black mirror behaves or affects the characters have been philosophical notions for quite some time. Many of the themes and positions at play are on problems that explore much of what has been discussed by contemporary philosophers before, specifically with the tech/mechanical/AI/ whatever else.\n\nThese include notions such as the Mind as a Program, turning hardware into software, Created Selves versus Free Will, etc/etc. Looking at it this way it’s not as unoriginal, or “recycled” or what have you as it may seem. Most of the plots explore the ramifications of these in a way that’s probably more relevant than most shows, today, but that’s just an opinion.", "2_Subreddit": "AskReddit"}], "896zpg": [{"0_Title": "I’m worried about my sister. What’s the general addiction timeline look like from beginning to end?", "1_Text": "Many of the ways the tech in black mirror behaves or affects the characters have been philosophical notions for quite some time. Many of the themes and positions at play are on problems that explore much of what has been discussed by contemporary philosophers before, specifically with the tech/mechanical/AI/ whatever else.\n\nThese include notions such as the Mind as a Program, turning hardware into software, Created Selves versus Free Will, etc/etc. Looking at it this way it’s not as unoriginal, or “recycled” or what have you as it may seem. Most of the plots explore the ramifications of these in a way that’s probably more relevant than most shows, today, but that’s just an opinion.", "2_Subreddit": "opiates"}]}]}]}