{"_degeneRAT": [{"0_comments": [{"dwqo1kt": [{"0_Comment Submission": "😪", "1_Text": "Feel this shit so hard lmao", "2_Subreddit": "opiates"}], "dwqoe8q": [{"0_Comment Submission": "Advice I guess?", "1_Text": "You're not alone. And I'm glad I'm not alone either.. From sober people's perspective, we're being fucking ridiculous.. but I feel like until they've gone thru it, they got no right talking down on us or giving us shit for feeling this way.. even though I feel like I'm being a weak piece of shit.. We can get thru the suicidal ideation during WDs together!! Feel free to message me when you're feeling like shit and just need someone to talk to/listen!", "2_Subreddit": "opiates"}], "dwqohlu": [{"0_Comment Submission": "Advice I guess?", "1_Text": "How do you guys even get out of bed when you're going thru WDs? Haha.", "2_Subreddit": "opiates"}], "dwqoywr": [{"0_Comment Submission": "Advice I guess?", "1_Text": "Yeah.. I would think exercise would help. I just don't have the motivation or lack the discipline to do something... Healthy. Lol. I'm jealous.", "2_Subreddit": "opiates"}], "dwqpyd1": [{"0_Comment Submission": "So i got arrested for paraphernalia today and", "1_Text": "No fucking way.. are you being serious when you say that you're getting your rigs for your cat?!?! Hahahaha that's fucking awesome. Do they ask you for proof??", "2_Subreddit": "opiates"}], "dwqui5t": [{"0_Comment Submission": "Craziest thing you’ve done to avoid WDs?", "1_Text": "Stole and pawned my mom's real LV handbag.. I know... I'm a piece of shit. She really liked it and she spent a good couple bills on it.. I pawned it for a measly $45. Couldn't even get me a whole g.. so not worth it. My mom forgave me because I came clean about it when I couldn't hide my usage anymore.. she said as long as I go to rehab, she'll forgive me. So guess who's off to rehab? This worthless, useless bitch right here.", "2_Subreddit": "opiates"}], "dwqx2es": [{"0_Comment Submission": "IV use is not for everyone", "1_Text": "Dude, I hope you never IV again. I felt like it was a hassle for me too. No one taught me and I have shitty veins.. my bf had to shoot me up. But I started trying on my own cuhs smoking seriously can't fucking compare to shooting.. it was like trying blk for the very first time... For me at least.. so I started trying it on my own... I never thought I'd make the switch man.. been using this stuff for 3-4 years and I just made the switch.. I haven't gotten a single abscess since I've started IVing. Just lumps on my arms from missed shots. I'm happy that you don't like IVing. Keep on snorting!", "2_Subreddit": "opiates"}], "dwr9br0": [{"0_Comment Submission": "$180 for a gram is fuckin killing me.", "1_Text": "I cry for all of you that pay more than $70 a g... I'm so sorry y'all get fucked so hard by those prices.. it's truly unfair.. when I had my LA connect, I was paying $40 a g. I seriously cry for yous..", "2_Subreddit": "opiates"}], "dwraegr": [{"0_Comment Submission": "Fucking dilemma on my hands... Advice needed.", "1_Text": "This is a good example of why I appreciate this community.. everyone's always looking out for each other even though we're total strangers. Keep spreading the knowledge, love, and experiences! ❤️\n\nSeriously, like everyone's saying.. don't get into H. It's not worth it.. your habit will get more expensive and you'll have a harder time quitting because your tolerance gets fucked really fast. Play it safe (it's addiction... No one's safe, but ya feels me.. right? Lol) and stick to your pills. You don't have a legit reason to cross that line.", "2_Subreddit": "opiates"}], "dwrco95": [{"0_Comment Submission": "Fuck relationships..", "1_Text": "Oh.. nah this boy didn't take my virginity. But I wish he did! Haha. I love him dearly.. I'm sorry about your experience with that ex, but it sounds like he's tryna make amends? I bet it felt good to get that apology.. I wish mine would apologize to me.. cuhs then that would mean that he knows that he was tripping on me.. but I feel like it's gonna be a long time before I get any form of apology from him. He's in denial of all his flaws.. I don't know what it is, but I feel like he denies his wrongdoings because if he denies it, then he'll never have to face it and do something about it.. it fucking sucks. I want him to just man the fuck up! Take some goddamn responsibility for his actions.. after two years of being with him, I realize there's really nothing that I can do about everything I have a problem with in him.. all I can do is leave him and hope that one day he realizes how stupid he was and that I actually did treat him to the best of my ability.. I'm so glad that someone can relate.. thank you for sharing and reading.. really! It means a lot... I don't have anyone to talk to about.. basically anything.. it sucks to hear that he was the one to give you your first hit.. I'm ashamed to admit that I was the one to introduce this substance to him.. he's worse off than me in his addiction. And his family (rightfully) hates my fucking guts. I know that I should leave him.. everything that's happened and continues to happen proves to me that he and I were just not meant to be.. at least not now.. and it fucking breaks my heart man. I just want to be with him. I just want it to be like the good times.. when we both weren't so consumed by our addiction.. I hope you're better off now chica! I hope that I will be too..", "2_Subreddit": "HeroinHeroines"}], "dwremp9": [{"0_Comment Submission": "Fuck relationships..", "1_Text": "He loves them speedballs.. lol. I don't think he's cheating on me. He's just extremely paranoid/got really bad trust issues. Idk he's choosing to believe something that isn't going on/has never happened.. sigh..", "2_Subreddit": "HeroinHeroines"}], "dwrf4us": [{"0_Comment Submission": "Fuck relationships..", "1_Text": "Yeah.. sometimes I get the feeling that he has and that's why he's always calling ME a dope whore. It's some fucked up logic bruh.. thank you opidabs! I'll shoot you a PM next time I'm in need of some girl talk. Appreciate you!!", "2_Subreddit": "HeroinHeroines"}], "dwrfjoo": [{"0_Comment Submission": "Fuck relationships..", "1_Text": "Likewise!! No friends or life either. Hehe I'm here for you too!", "2_Subreddit": "HeroinHeroines"}], "dwrp61i": [{"0_Comment Submission": "Fuck relationships..", "1_Text": "I introduced him to dope.. we started to use together and then I left him for 6 months and during those 6 months.. he started going hard.. like switched to IVing and using a lot more than he was with me. So.. I indirectly ruined his life. Or I started the snowball effect..\n\nI'm trying to forget him. I realized I shouldn't value him as much as I did. He clearly doesn't feel that I'm worth much. Whatever. Lesson learned. Time to clean up. Get a job. And hopefully, I'll find someone who will treat me right..", "2_Subreddit": "HeroinHeroines"}], "dws2k21": [{"0_Comment Submission": "Fuck relationships..", "1_Text": "Honestly, thanks girl. I really love this sub and r/o.. y'all are super supportive.. know that I'm always around if you wanna bitch about how shit went wrong or whatever.", "2_Subreddit": "HeroinHeroines"}], "dwt70pr": [{"0_Comment Submission": "So I'm gonna tell you a story, and I want to know what you think really happened.", "1_Text": "$120 of cocoa powder... 😭😂", "2_Subreddit": "opiates"}], "dwtjrke": [{"0_Comment Submission": "Fuck relationships..", "1_Text": "I know for a fact he would never put his hands on me. Been thru something similar. I was never black and blue, but yahhhh..\n\nI'm having a hard time letting him go :(", "2_Subreddit": "HeroinHeroines"}], "dww15jh": [{"0_Comment Submission": "Fuck relationships..", "1_Text": "Well, he knows now that I've always been faithful. I just found out that he, without a doubt, cheated on me with a former housemate...  Ugh, fuck my love life. It needs to be non-existent.. like a year ago!!!", "2_Subreddit": "HeroinHeroines"}], "dww1b79": [{"0_Comment Submission": "Fuck relationships..", "1_Text": "Ughhh!! I so relate! I fucking throw my pride out window and come running back to him.. Like, fuck him. How could someone treat their supposed love like this?! I just can't comprehend..", "2_Subreddit": "HeroinHeroines"}], "dwwi899": [{"0_Comment Submission": "Am I being unreasonable?", "1_Text": "Ugh I'm jealous of your relationship.. Yeah, when I made the decision to pay the entire debt, I also decided I was going to end things with him completely.. I'm cleaning up anyways and I know I can do better. Without a doubt. Fuck people like him. Fucking selfish..", "2_Subreddit": "HeroinHeroines"}], "dwwi8ym": [{"0_Comment Submission": "Am I being unreasonable?", "1_Text": "Thanks chica. I appreciate you. ❤️", "2_Subreddit": "HeroinHeroines"}], "dwwici1": [{"0_Comment Submission": "Am I being unreasonable?", "1_Text": "He's not that shitty/shady.. just selfish..\nI'm happy you're in a relationship where you guys both help each other out. Sounds healthy! It's okay, I don't take this as bragging  I'm glad you found someone that does you right. I know I will soon!!", "2_Subreddit": "HeroinHeroines"}], "dwxgqes": [{"0_Comment Submission": "Am I being unreasonable?", "1_Text": "I mean... It's my fault he was even able to rip off my grandma so if I pay her back.. I guess he can't even rip her off?", "2_Subreddit": "HeroinHeroines"}], "dwxkm2l": [{"0_Comment Submission": "Am I being unreasonable?", "1_Text": "Thanks. I'll figure something out.", "2_Subreddit": "HeroinHeroines"}], "dwxp3qi": [{"0_Comment Submission": "Am I being unreasonable?", "1_Text": "I know where I'm at fault and I understand this. It's not that he intended to be manipulatuve, things just turned out this way.. I didn't really ask him to help out till I realized I reached my limit.", "2_Subreddit": "HeroinHeroines"}]}], "1_submissions": [{"82d7t5": [{"0_Title": "Goodbye", "1_Text": "Feel this shit so hard lmao", "2_Subreddit": "opiates"}], "84xd4f": [{"0_Title": "Shoot", "1_Text": "Feel this shit so hard lmao", "2_Subreddit": "opiates"}], "85o9qs": [{"0_Title": "How do you properly", "1_Text": "Feel this shit so hard lmao", "2_Subreddit": "opiates"}], "88od5g": [{"0_Title": "Just out of curiosity", "1_Text": "Feel this shit so hard lmao", "2_Subreddit": "opiates"}], "88w2xe": [{"0_Title": "I think I fucked up.", "1_Text": "Feel this shit so hard lmao", "2_Subreddit": "opiates"}], "89iowj": [{"0_Title": "Fuck relationships..", "1_Text": "Feel this shit so hard lmao", "2_Subreddit": "HeroinHeroines"}], "89jbie": [{"0_Title": "Sometimes, the people you meet at detox facilities..", "1_Text": "Feel this shit so hard lmao", "2_Subreddit": "u__degeneRAT"}], "8a5lue": [{"0_Title": "Am I being unreasonable?", "1_Text": "Feel this shit so hard lmao", "2_Subreddit": "HeroinHeroines"}], "8a6z9h": [{"0_Title": "You know what's fucking ridiculous and a joke?", "1_Text": "Feel this shit so hard lmao", "2_Subreddit": "u__degeneRAT"}]}]}]}