{"mwebber242": [{"0_comments": [{"dwllolz": [{"0_Comment Submission": "10 minutes, papi", "1_Text": "He literally wouldn't turn around for an extra 40 seconds. Fuck", "2_Subreddit": "opiates"}], "dwlmtat": [{"0_Comment Submission": "Something to add to your Withdrawal remedies~", "1_Text": "I do this every day after work. Im always to hot after a shower so i crank the cold and kill the hot. I've gotten used to it to the point i usually stand under the cold longer than the hot. I work manual labor and it helps with my body feeling good to", "2_Subreddit": "opiates"}], "dwlrjjd": [{"0_Comment Submission": "The worst feeling", "1_Text": "I didn't read all the comments so im not sure if this has been mentioned yet. Have you spoken to a dr. About possible depression? You don't Have to be sad to be depressed. I have depression and i describe it as a lack of joy instead of being sad. Im not sad or in a foul mood but things that would bring most people joy don't bring me any feelings. Its more of a bored contentness with me. Just a thought to check out if u wanted. Good luck.", "2_Subreddit": "opiates"}], "dwlskvx": [{"0_Comment Submission": "I gotta ask how do you guys come up with money for your habit? I’m not employed and I’m about to lose my hustle for good and it’s been giving me panic attacks all week. I been applying for jobs all week with no luck ugh", "1_Text": "19 when i started. 2nd real job, never looked back. Doing it 14 years now comin up on 15.", "2_Subreddit": "opiates"}], "dwnms9l": [{"0_Comment Submission": "Girlfriend of 3 1/2 gets hooked on opiates, robs me blind.", "1_Text": "Well. Opiates do change the way the brain works and its the addict stealing not sober her but she chose drugs over withdrawal by stealing.  Many many people dont turn to stealing to get their drug. So i think its more a sign of the person's morals and not just the addict in them.\n\nFor example my parents always have around 1k in cash at their house. I know where it has by accidentally finding it while helping them move some things. They have no idea i know its there so i could easily steal it and claim ignorance. Especially cuz they often leave their door unlocked when they leave giving me the break in excuse. I have suffered through many days of withdrawal knowing that money is there. O could even just take like 50 bucks and pay it back and they'd never known. But I DONT and never will cuz it doesnt belong to me. Moral of the story is she still made the choice to steal and didn't have to", "2_Subreddit": "opiates"}], "dwnqute": [{"0_Comment Submission": "Prison guards of reddit, what's the scariest day on the job you've ever had?", "1_Text": "Your name.... does it mean what i think it does??", "2_Subreddit": "AskReddit"}], "dwp1k06": [{"0_Comment Submission": "What is a random fact that you know?", "1_Text": "If she doesn't come in 15 minutes she's not much of a teacher.", "2_Subreddit": "AskReddit"}], "dwp3gmz": [{"0_Comment Submission": "What is a random fact that you know?", "1_Text": "How old are you now? Just trying to figure out your average pants shitting per year escapades.", "2_Subreddit": "AskReddit"}], "dwpavy5": [{"0_Comment Submission": "Dboy wants to put apartment in my name", "1_Text": "Theres a reason he wants to put it in your name, and it's not a good reason. Either he can't get a place in his name cuz of felonies or bad credit. Or he knows its gonna be a drug house and wants someone else to take the blame when it gets raided. Neither of those are worth any amount of dope if and when you get caught up in some bullshit. Thak junky jesus you said there's no way your doing it, so that's good.", "2_Subreddit": "opiates"}], "dwqczid": [{"0_Comment Submission": "IV use is not for everyone", "1_Text": "Iv heroin for 3-4 months.missed shots, hassle to do and so many negative possibilities. I went back to smoking.", "2_Subreddit": "opiates"}], "dwqo84l": [{"0_Comment Submission": "Point for 25, gram for 180", "1_Text": "Time to drive southeast to your neighbor", "2_Subreddit": "opiates"}], "dwrfabm": [{"0_Comment Submission": "Are they any good?", "1_Text": "No. U need to dissolve them in water and shoot that up the poop chute. Use a kids medication syringe. U can get 5ml ones they have no needle. Dissolve pill in 2-4 ml of water. Suck it up into oral syringe. Stick a couple inches up your butt. Slowly inject into exit. Lay on stomache for 10-15 to let it absorb. Make sure your bowels are empty otherwise the naughty poop monster chilling by your villian hole will just absorb all ur drugs.", "2_Subreddit": "opiates"}], "dwrfswm": [{"0_Comment Submission": "Are they any good?", "1_Text": "No clue. I've never done hydromorphone. Sorry.", "2_Subreddit": "opiates"}], "dwtnmzd": [{"0_Comment Submission": "And they say they are hard to get .. 🧐", "1_Text": "Its the insurance companies that cap it at 360. And if ur paying cash for 360 u may as well wear a t shirt that says i divert my script.lol", "2_Subreddit": "opiates"}], "dwtw407": [{"0_Comment Submission": "13 year old freeystyle skateboarder Isamu Yamamoto", "1_Text": "Rodney mullen must be this kids Mr. Miyagi.", "2_Subreddit": "Damnthatsinteresting"}], "dwtwd5q": [{"0_Comment Submission": "After leaving a movie theater on Sunday I found these text messages on my phone.", "1_Text": "The lack of derogatory name calling amazes me. No \"slut\" ,\"whore\",\"Stacy\",\"you must be busy fuckin Chad since you haven't answered in an hpur\". This nice guy needs to learn to be nicer and include name calling in his texts.", "2_Subreddit": "niceguys"}], "dwu9ten": [{"0_Comment Submission": "This Jacked Toddler Mannequin", "1_Text": "Damn, beat me to it.", "2_Subreddit": "mildlyinteresting"}], "dwu9ugs": [{"0_Comment Submission": "This Jacked Toddler Mannequin", "1_Text": "Mom, I'm out of juice.  Mommm, juice", "2_Subreddit": "mildlyinteresting"}], "dwvxu7c": [{"0_Comment Submission": "What is the most unreasonable thing you've been asked to do at work?", "1_Text": "Seconded on needing the career ending story. Sorry there even is a story.", "2_Subreddit": "AskReddit"}], "dww587n": [{"0_Comment Submission": "What is the most unreasonable thing you've been asked to do at work?", "1_Text": "At least you got paid. Way more than most people would get.", "2_Subreddit": "AskReddit"}], "dww61tk": [{"0_Comment Submission": "What is the most unreasonable thing you've been asked to do at work?", "1_Text": "I had this happen about 2 hours into my day my best friend and old roomate. I was literally in shock and worked another 2 or 3 hours. Finally i went to my supervisor who i had already told right after i got the phone call that i just needed to leave. He said go right on ahead and I'm thankful you stayed as long as you did you didnt have to. My supervisor was always an ass who wanted everyone at work no matter what. Sick ass kid... bring him with and make him sit in an empty office all day miserable feeling and bored. He was that boss. To see him have compassion was unreal to me.", "2_Subreddit": "AskReddit"}], "dww7tts": [{"0_Comment Submission": "What is the most unreasonable thing you've been asked to do at work?", "1_Text": "Sooo... you aren't an absolute unit? No one is in awe of your size?", "2_Subreddit": "AskReddit"}], "dww8onp": [{"0_Comment Submission": "What is the most unreasonable thing you've been asked to do at work?", "1_Text": "Fuck no he is not overpaying you. If you worked 7 days a week for 30 days at 11 hours per day. Thats 330 hours. Figure half those days are only 10 hours cuz u take your 1 hour lunch break that you are LEGALLY required to take if scheduled for 8 or more hours. That brings you down to 315 hours per month. At 2800 per month pre tax i assumed you are making a whole 8.88 per hour pre tax if the 2800 is gross pay and not net. Plus your boss is breaking the law by letting u skip lunch. Even if u want to skip break they are legally spose to make u take a break. So i would say your getting the shaft.", "2_Subreddit": "AskReddit"}], "dww92u5": [{"0_Comment Submission": "What is the most unreasonable thing you've been asked to do at work?", "1_Text": "Did u take legal action against them? You definitely could have.", "2_Subreddit": "AskReddit"}], "dww9g2v": [{"0_Comment Submission": "What is the most unreasonable thing you've been asked to do at work?", "1_Text": "Everytime a company has someone succesfully claim unemployment its documented and given points. Kinda like car insurance where and accident will give u points. The more points you have the more the insurance costs you. Same thing with a companies unemployment insurance. It may not be exactly like i explained but close.", "2_Subreddit": "AskReddit"}]}], "1_submissions": [{"59m5zp": [{"0_Title": "i think a junkie jesus angel helped me today.", "1_Text": "He literally wouldn't turn around for an extra 40 seconds. Fuck", "2_Subreddit": "opiates"}], "5lz5h0": [{"0_Title": "Straight foils make nice trails! Gotta love the 1st of the morning.", "1_Text": "He literally wouldn't turn around for an extra 40 seconds. Fuck", "2_Subreddit": "opiates"}], "5q8621": [{"0_Title": "Sharing drugs and dope", "1_Text": "He literally wouldn't turn around for an extra 40 seconds. Fuck", "2_Subreddit": "opiates"}], "5yfs1e": [{"0_Title": "Dboy shit post vent", "1_Text": "He literally wouldn't turn around for an extra 40 seconds. Fuck", "2_Subreddit": "opiates"}], "6cq73d": [{"0_Title": "Who's doing the funny ass title flairs", "1_Text": "He literally wouldn't turn around for an extra 40 seconds. Fuck", "2_Subreddit": "opiates"}], "6hc4s9": [{"0_Title": "Does Pit win the cup without Fleury?", "1_Text": "He literally wouldn't turn around for an extra 40 seconds. Fuck", "2_Subreddit": "hockey"}], "6n5yr4": [{"0_Title": "Hit artery", "1_Text": "He literally wouldn't turn around for an extra 40 seconds. Fuck", "2_Subreddit": "opiates"}], "7kuuai": [{"0_Title": "Cat may be ded", "1_Text": "He literally wouldn't turn around for an extra 40 seconds. Fuck", "2_Subreddit": "AnimalsBeingDerps"}], "7lrlyz": [{"0_Title": "Dad teaching son to skate", "1_Text": "He literally wouldn't turn around for an extra 40 seconds. Fuck", "2_Subreddit": "hockeyplayers"}]}]}]}