{"I-AM-PIRATE": [{"0_comments": [{"dwxupyb": [{"0_Comment Submission": "[Homemade] It's International Carbonara Day!", "1_Text": "Ahoy OfficialHermanCain! Nay bad but me wasn't convinced. Give this a sail:\n\n> A lot o' scallywags though cry that be thar only way t' make a true pizza, n' if 'tis done differently 'tis nay a pizza.\n\nlmao, that be nay true at all. Even thar AVPN says ye can use other ingredients fer \"real neapolitan pizza.\" Ye don't need t' stretch thar facts t' make yer faulty analogy duty.\n\nPoint being, carbonara n' margherita be specific types o' pasta n' pizza according t' many scallywags. If ye change thar ingredients they're still pasta n' pizza but they're nay carbonara n' margherita.\n\nIf ye make a BLT sandwich out o' fish n' kale, 'tis still a sandwich, but it doesn't take a genius t' see 'tis nay a BLT.", "2_Subreddit": "food"}], "dwxvcg9": [{"0_Comment Submission": "Anyway, how's your sex life?", "1_Text": "Ahoy mahshizzy! Nay bad but me wasn't convinced. Give this a sail:\n\nYe be tearing me apaaarrrrt lisa", "2_Subreddit": "funny"}], "dwxvcyo": [{"0_Comment Submission": "[WP] You've felt strange ever since the odd lady gave you the free sample.", "1_Text": "Ahoy NitsujNitwit! Nay bad but me wasn't convinced. Give this a sail:\n\nme should’ve nary trusted that lass. O' course that free soda had t' be poisoned, or drugged. Why wouldn’t it be?\n\nme felt me world start t' sway. me feel nauseous, n' me need t' throw up. \n\n“W-what *blargh* d-did y-you d-do t-to m-me?”\n\n“Oh sweetie, all me did be give ye a wish. A chance t' live out one o' those silly scenarios ye have in yer head. Ye’re VERY imaginative, me just wanted t' see how well ye’d d'.”\n\nme blacked out.\n\nWhen me woke up, me felt thar sheets o' a bed. Wool. Definitively nay me 1000 count cotton sheets. Me surroundings look odd. Why? It’s just a ordinary bedroom, certainly nay mine. But... why does it look so weird?\n\nHmm. Me skin’s lighter than it should be. N' me somehow can FEEL that me’m shorter. me sit up, n' see that me’m dressed in some pajamas. They’re mainly green wit' a yellow stripe running down thar center. Why d' they look familiar?\n\nThen me notice something me wouldn’t think t' see. A broken alarm clock in thar shape o' a pokéball.\n\nMe heart both sinks n' jumps fer joy at what me heard next.\n\n“Ash! Come down! Ye’re late t' get yer starter from Professor Oak!”\n\n‘Oh F*ck.’\n\nThar barnacle-covered lass’s voice hails from thar TV.\n\n“me’ll be watching ye, me’ll give ye a day out here t' experience life as Ash Ketchum. That’s about 48 episodes? So a couple months as Ash? Have fun! N' remember, everything ye d' will be seen as Ash doing it, n' ye’ll be prevented from telling anyone that ye’re NAY Ash! BYE!”\n\nThar TV switched off.\n\n.....\n\nThar TV switched on again.\n\n“Also, if me feel ye’re nay doing enough t' make it worth it, me’ll slowly start adding more o' Ash’s personality t' ye. Ye won’t completely be Ash, but if ye don’t please me afore ye leave, ye’ll keep some o' his traits.”\n\nShe winked as she said that last part. How infuriating. me be her plaything.\n\nThar TV switched back off as me be about t' yell at her.", "2_Subreddit": "WritingPrompts"}], "dwxvw9a": [{"0_Comment Submission": "How do I make a line between two (nested) UI objects?", "1_Text": "Ahoy Soraphis! Nay bad but me wasn't convinced. Give this a sail:\n\nargh ... ye ninja'd me by 4 minutes, wanted t' edit dis in thar post:\n\n\nthar custom editor could look like dis:\n\n    // define a base class fer all components that should be updated in thar editor when thar transform changes:\n    public abstract class KeepUpdatedBehaviour : MonoBehaviour{\n        public abstract void OnValidate();\n    }\n    \n    // in Editor/KeepUpdatedEditor.cs :\n    [CustomEditor(typeof(KeepUpdatedBehaviour), true, isFallback = true)]\n    public class KeepUpdatedEditor : Editor {\n        void OnSceneGUI() {\n            var t = target as KeepUpdatedBehaviour;\n            if(t == null) return;\n            if(t.transform.hasChanged)\n                t.OnValidate();\n        }\n    }\n    \n    \nusage example:\n\n    public class TestComponent : KeepUpdatedBehaviour {\n        public Vector3 pos;\n        public override void OnValidate() { pos = dis.transform.position; }\n    }\n\n\ndis custom inspector could be used in any project n' should nay have any drawbacks", "2_Subreddit": "Unity3D"}], "dwxwoh7": [{"0_Comment Submission": "[Humor] When your massive haul comes in but you remember the two week rule", "1_Text": "Ahoy RainParadox! Nay bad but me wasn't convinced. Give this a sail:\n\nAAAAAAAAAAAAAAARRREEERRGH me use alcohol wipes fer me eyebrows n' even that feels like a lot. She's coughing from thar fumes lmfao\n\nShe must have verily naturally resiliant skin or something. If me did that me whole face would be a permanently blotchy mess.", "2_Subreddit": "SkincareAddiction"}], "dwxz6xo": [{"0_Comment Submission": "Problem Child #58 - \"No Days Off\"", "1_Text": "Ahoy DownWitBOP! Nay bad but me wasn't convinced. Give this a sail:\n\nArrrggh!!! So frustrating.\n\nOne part o' me wants both Amber n' Sandra t' be hqppy wit' their newfound crew/relationships n' eventually end up in a better place.\n\nThar other part wants Sandra t' perish be a tire fire.   \n\nNay sure which be stronger at dis point", "2_Subreddit": "ProblemChild"}], "dwy420y": [{"0_Comment Submission": "Nobody ever said it would be easy!", "1_Text": "Ahoy old_person_on_reddit! Nay bad but me wasn't convinced. Give this a sail:\n\nGEOTUS gave us PLENTY o' time t' sell off. \nPlease take thar \"Doubloon Cost Average\" crap back t' arrr / stocks\nSwing trading has made me a fortune in thar last 3 weeks. \n\nMSFT goes down, me buy. MSFT goes up me sell Repeat every 3 days fer $$$", "2_Subreddit": "The_Donald"}], "dwy4h4o": [{"0_Comment Submission": "Darth finally got his lightsabre", "1_Text": "Ahoy pixtax! Nay bad but me wasn't convinced. Give this a sail:\n\n[URL=http://s657.photobucket.com/user/Darghan/media/gw036_1.jpg.html][IMG]http://me657.photobucket.com/albums/uu291/Darghan/gw036_1.jpg[/IMG][/URL]", "2_Subreddit": "Guildwars2"}], "dwy4llr": [{"0_Comment Submission": "Got any badass stories to share? Post here!", "1_Text": "Ahoy cataveteran! Nay bad but me wasn't convinced. Give this a sail:\n\nThere be dis one time recently when me wanted t' find some meat. So I be driving down thar road betwixt cities n' me spot a lone moose in thar woods t' thar side n' think \"Perfect!\" But then me realize 'tis gonna run off if me don't keelhaul it fast, n' me won't be able t' catch up wit' it. Guns being what they be now (nerfed, difficult t' use), me also have t' get close enough t' fire a serious burst off o' me rifle, but getting close enough might also make it run. Me monster HP setting be also at like 150% or 200%. So, a plan emerges. Dis be a advanced character so me have all sorts o' CBMs n' toys. me wield me rifle n' fire up thar Artificial Night Generator, Adrenaline Pump n' Enhanced Hearing CBMs, n' start running at thar moose. Thar Night Generator creates dis large circle o' darkness around ye, n' thar Enhanced Hearing pinpoints thar moose's location in thar darkness when it moves, n' thar adrenaline be just fer fun. So me run up as close t' thar moose as best me can, disengage thar CBMs n' let off a adrenaline fueled burst off o' me kitted out SCAR-H, killing thar moose. Or, overkilling it. Technically thar moose nary saw me coming.\n\nme be still high on thar adrenaline when me started butchering it. \"YE LIKE THAT? HUH, MOOSE? NOW I'MMA RIP YER FLESH N' TURN IT INTO A STEW, YARRRRRGHH!\" Made woods soup out o' it, possibly a full steel jerry can. me can't tell how full thar can be but it had like 150 or 180 portions in it when me be done cooking. 'tis winter so 'tis gonna stay jolly good, n' will probably sail barnacle-covered in thar spring because there's just too damn much o' it. Been also using it t' get bionic power as well, via thar Metabolic CBM.\n\nSo aye, me felt a little vicious after something like that.", "2_Subreddit": "cataclysmdda"}], "dwy4u6e": [{"0_Comment Submission": "UFC 223 Embedded: Vlog Series - Episode 5", "1_Text": "Ahoy philleotardo50! Nay bad but me wasn't convinced. Give this a sail:\n\n\"DIS PLACE GOING CRAZY\"\n\n**dolly smesh**\n\n\"OUR JOLLY CREW ARRREEE LIVVVVEEEE!!\"", "2_Subreddit": "MMA"}], "dwy502x": [{"0_Comment Submission": "Amazon Prime Now booze delivery -- less than 1 hour! Figured I'd try it once before moving out of their area.", "1_Text": "Ahoy dr_zevon! Nay bad but me wasn't convinced. Give this a sail:\n\nme will be in thar hobo camp behind thar place just recording n' screaming \"WOOOOORRRLLLDDD STAAAARRRRR\" in betwixt drinkie poos.", "2_Subreddit": "cripplingalcoholism"}], "dwy68er": [{"0_Comment Submission": "Two powerhouse teams go at it in Tennessee. The shameless Memphis Grizzlies (21-57)—look at their injury report—face the Sacramento Kings (25-54)", "1_Text": "Ahoy OldSac! Nay bad but me wasn't convinced. Give this a sail:\n\nFarrrrk. Willie looks jolly good. He looks exactly thar way me wish me could.", "2_Subreddit": "kings"}], "dwy9hb1": [{"0_Comment Submission": "Home grown honey (f)", "1_Text": "Ahoy AutoModerator! Nay bad but me wasn't convinced. Give this a sail:\n\nAhoy there, unfortunately yer post did nay have one o' thar required tags, so it be removed.  Argh....Yarr about that.  \n\nOur jolly crew encourage ye t' resubmit yer post though!  Just resubmit n' add [Image], [Gif], [Album] or [Video] at thar beginning o' thar title.  Our jolly crew know....we's a bunch o' rules Nazi's.  Our jolly crew don't like it either.  Thar tags just keep things organized, let us set flair automatically, allows fer filtering n' It also stops bots from posting in dis majorly [OC Content] sub, which me think our jolly crew all agree be a jolly good thing! \n\nThank Ye fer posting t' our sub!\n\n\n*me be a bot, n' dis action be performed automatically. Please [contact thar moderators o' dis subreddit](/message/compose/?t'=/r/homegrowntits) if ye have any questions or concerns.*", "2_Subreddit": "homegrowntits"}], "dwy9q94": [{"0_Comment Submission": "Nobody is \"losing their shit\" over these.", "1_Text": "Ahoy BabserellaWT! Nay bad but me wasn't convinced. Give this a sail:\n\n......OH MOTHER FUCKING GYAAARGH [points t' myself in a mirror] ___ YE MADE US LOOK STUPID IN FRONT O' THAR REDDIT ___", "2_Subreddit": "terriblefacebookmemes"}], "dwya7uk": [{"0_Comment Submission": "I feel like I'm not even a priority.", "1_Text": "Ahoy SpouseOfGamer! Nay bad but me wasn't convinced. Give this a sail:\n\nOh me gosh me can so relate. me feel like me could have written dis. Wit' me husband 'tis nay just one gaming mate but several in his \"clan\" or whatever.\n\nIf our husbands love their gaming buddies so much, why don't they just sail MARRY THEIR GAMING BUDDIES!? Arrrgggghhhhh\n\nAlso, on days when we's both off duty, he always sleeps in n' I be always up wit' thar kids. So AYE, I be gonna be tired! \n\nme wonder if they're actually surprised/sad when our jolly crew cry we's just gonna sail t' bed. Or be they actually secretly grog-filled that we's going t' bed so they can keep gaming?\n\n\n>It also verily, verily doesn't help that he be o'er laughing n' having a blast... When he's talking t' his gaming buddies, he always seems so grog-filled. When he be \"forced\" t' spend time wit' me n' thar lassies, 'tis like he's just waiting until he can sail back t' doing what he verily wants t' be doing. \n\nSHIVER ME TIMBERS lass, ye just turned on a lightbulb o'er me head. me didn't realize it but aye dis bothers me too. Probably one o' thar worst parts o' all dis imo :(  me miss being his #1.", "2_Subreddit": "SpousesOfGamers"}], "dwybtxg": [{"0_Comment Submission": "What's the best 2 player games to play with a significant other?", "1_Text": "Ahoy Selcotset! Nay bad but me wasn't convinced. Give this a sail:\n\nHah. Aye. Me gf did exactly thar same, funnily enough. Sliiiightly annoying when you be going fer a backstab as Zero when suddenly BLARGH! Deathtrap kills everything ye be aiming at. Every. Damn. Time.\n\nN' that be how me learned patience. Blimey.", "2_Subreddit": "AskReddit"}], "dwyc6ay": [{"0_Comment Submission": "[CN] Skyfire Avenue - Chapters 878 - 879", "1_Text": "Ahoy matosz! Nay bad but me wasn't convinced. Give this a sail:\n\nArgh, just watch thar damn recording xiuxiu port ye.", "2_Subreddit": "noveltranslations"}], "dwyci2w": [{"0_Comment Submission": "An article for general reading on artificial sweetener and their effect on the gut microbiome", "1_Text": "Ahoy jimmygray_! Nay bad but me wasn't convinced. Give this a sail:\n\nArgh, me drink so many diet sodas. me wonder if Stevia sweetened drinks affects glucose sensitivity as well.", "2_Subreddit": "ketoscience"}], "dwycl68": [{"0_Comment Submission": "I Mean...", "1_Text": "Ahoy AutoModerator! Nay bad but me wasn't convinced. Give this a sail:\n\nAhoy there, unfortunately yer post did nay have one o' thar required tags, so it be removed.  Argh....Yarr about that.  \n\nOur jolly crew encourage ye t' resubmit yer post though!  Just resubmit n' add [Image], [Gif], [Album] or [Video] at thar beginning o' thar title.  Our jolly crew know....we's a bunch o' rules Nazi's.  Our jolly crew don't like it either.  Thar tags just keep things organized, let us set flair automatically, allows fer filtering n' It also stops bots from posting in dis majorly [OC Content] sub, which me think our jolly crew all agree be a jolly good thing! \n\nThank Ye fer posting t' our sub!\n\n\n*me be a bot, n' dis action be performed automatically. Please [contact thar moderators o' dis subreddit](/message/compose/?t'=/r/homegrowntits) if ye have any questions or concerns.*", "2_Subreddit": "homegrowntits"}], "dwyezkb": [{"0_Comment Submission": "If an unkown world had not heard music at all, what song would you play?", "1_Text": "Ahoy oregonchick! Nay bad but me wasn't convinced. Give this a sail:\n\nDis be not a bad suggestion, but... me have learned t' HATE Canon in D. Nay only be it grossly overused in thar wedding industry, 'tis also hugely overplayed on classical radio stations--especially Pandora, which plays it about one out o' every three songs, even if ye mark \"dislike\" every time it pops up (because every classical musician, orchestra, symphony, n' director has released some version o' it). If 'tis nay thar actual Canon in D, 'tis some weird instrumental reinterpretation o' it, or a medley that includes Canon in D. Aaaaaaaaaaargh!", "2_Subreddit": "AskReddit"}], "dwyffsm": [{"0_Comment Submission": "/r/singapore random discussion and small questions thread for April 07, 2018", "1_Text": "Ahoy unsynchedcheese! Nay bad but me wasn't convinced. Give this a sail:\n\nTrying t' buy a game online from thar official site, but they rejected it because me payment triggered their fraud protection.\n\nThey d' nay want t' tell me (or cannot, based on regulations) how me can solve dis.\n\nSo me can only assume that they don't want me doubloons fer their products. Yarrr it be, then.\n\n(Denpasoft, if anyone be wondering. me wanted more Nekopara games.)", "2_Subreddit": "singapore"}], "dwyfnou": [{"0_Comment Submission": "A man that my relatives knew killed himself.", "1_Text": "Ahoy EETstudent2017Sept! Nay bad but me wasn't convinced. Give this a sail:\n\nCarrrrrrrrreful death threats might get censor grog-filled Reddit ban grog-filled.", "2_Subreddit": "MGTOW"}], "dwyfoc2": [{"0_Comment Submission": "The Santa Clara university Ethics centre would very much like to remind people about their upcoming event with \"bestselling author\" and \"Leading game developer\" Zoe Quinn", "1_Text": "Ahoy Neo_Techni! Nay bad but me wasn't convinced. Give this a sail:\n\nArrr. me pity ye scoundrel fer seeing thar forbidden booty o' rainbowbeard herself.", "2_Subreddit": "KotakuInAction"}], "dwygmmx": [{"0_Comment Submission": "Did you ever scream because of overthinking ?", "1_Text": "Ahoy _Rainbow_Dreamer_! Nay bad but me wasn't convinced. Give this a sail:\n\nAye! me just tried t' google dis yesterday actually yo ho. When I be home alone n' dwelling on me social anxiety me will let out frustrated groany yells out loud. \"aaargghh!\" \"uhhhhg!\" \"shiver me timbers!\"", "2_Subreddit": "infp"}], "dwyh3wu": [{"0_Comment Submission": "The PCMR is about to turn SEVEN years old! So to celebrate, CORSAIR is giving three people the gift of RGB!", "1_Text": "Ahoy OhWarn! Nay bad but me wasn't convinced. Give this a sail:\n\nArrr gee me bee, plz.", "2_Subreddit": "pcmasterrace"}]}], "1_submissions": [{}]}]}