{"imgaybuttman": [{"0_comments": [{"dvjz9x1": [{"0_Comment Submission": "Is heroin supposed to be clear?", "1_Text": "Sounds like fentanyl and a clear cutting agent. Be careful, or better yet-- don't do it at all.", "2_Subreddit": "opiates"}], "dvkyjsk": [{"0_Comment Submission": "Love you too, F🅱️I agent ❤️😭", "1_Text": "Damn it really 🅱️ like that", "2_Subreddit": "DeepFriedMemes"}], "dvkyrd8": [{"0_Comment Submission": "I would like to take a moment to vent about the frustrating physics of addiction.", "1_Text": "I've never taken a drug test before and I'm honestly too afraid to try anything like that. It's a government job so they may pat me down or observe me, who knows.", "2_Subreddit": "opiates"}], "dvls5si": [{"0_Comment Submission": "I would like to take a moment to vent about the frustrating physics of addiction.", "1_Text": "I took some kratom and I'm surviving. My main fear now is the kratom triggering a false positive for something.  Or that I'm just prolonging my wd's by taking this kratom.", "2_Subreddit": "opiates"}], "dvsryq5": [{"0_Comment Submission": "Japan cronyism scandal linked to Shinzo Abe and wife worsens with suicide note. Japanese official who took his own life said he was forced to alter records linked to sale of public land at 85% discount", "1_Text": "I have watched a lot of anime, allow me to explain,", "2_Subreddit": "worldnews"}], "dwlkz3x": [{"0_Comment Submission": "I would like to take a moment to vent about the frustrating physics of addiction.", "1_Text": "Thanks man. Passed my drug test, but am still using. Or trying to.", "2_Subreddit": "opiates"}], "dwlnomb": [{"0_Comment Submission": "Anyone else have this problem?", "1_Text": "I'm from an area in the south where things actually aren't sold in bundles or bags usually. Purely \"points\" (.1 grams) for 10$ each roughly. But with the middle men bullshit I'm usually getting half a gram for 100. Everything comes in clear, small plastic baggies.", "2_Subreddit": "opiates"}], "dwmk7aj": [{"0_Comment Submission": "I've been taking codeine for years and never built a tolerance", "1_Text": "I said this about oxycodone since age 17. At 21 it stated to lose its power even with weeks in between usage-- It didn't feel as good anymore. At 23 I tried heroin for the first time. At 25 I used the needle and that has started a whole new world (of shit).\n\nhttps://youtu.be/sVxUUotm1P4\n\nYou think the horror stories would never apply to you. \"I'm different,\" you say. \"I'm smart and responsible. It would never get to that point.\" It will. Maybe not now, not even next year, but heroin will eventually chip at you, bit by bit. It's a patient killer. Be careful.", "2_Subreddit": "opiates"}], "dwmk8nt": [{"0_Comment Submission": "What country or geographical area has the best opiates?", "1_Text": "Not where the fuck I live that's for sure 😂", "2_Subreddit": "opiates"}], "dwmkikv": [{"0_Comment Submission": "Virgin asshole and morph ER", "1_Text": "The ER is to flat out prevent injection and to discourage snorting (I don't miss having opana nose the following day one bit... sucks not being able to breathe at all.). Break the pill down with a knife into as fine a powder as possible and mix this into a solution of water-- the amount of water doesn't actually matter. Draw it up into an oral syringe, preferably one with a really big injection hole. It will probably gel up, this is normal. Make sure you put a little petroleum jelly on your bunghole.", "2_Subreddit": "opiates"}], "dwmklw7": [{"0_Comment Submission": "Tolerance", "1_Text": "The way I've looked at it over the years is this-- if you can't tell whether or not you are withdrawing, you are not withdrawing that bad. To me, withdrawal is a plain and apparent agony. I know when I'm withdrawing because it fucking sucks.", "2_Subreddit": "opiates"}], "dwnenmb": [{"0_Comment Submission": "Anyone else have this problem?", "1_Text": "Mississippi, actually.", "2_Subreddit": "opiates"}], "dwr24pk": [{"0_Comment Submission": "I feel like all drugs are shit", "1_Text": "Heroin's p. Good", "2_Subreddit": "Drugs"}], "dwr6tu0": [{"0_Comment Submission": "Hopefully last pick up for a long time getting on sub treatment for a bit tomorrow also have y'all gotten shit that looked like this before?", "1_Text": "My nigga you were sold a chunk of a nature valley granola bar", "2_Subreddit": "opiates"}], "dwr73y5": [{"0_Comment Submission": "Cold cop success! Had 4, down to 3. I'm a happy girl!", "1_Text": "Incredible!! Dillies are the fucking bomb", "2_Subreddit": "opiates"}], "dwr78ma": [{"0_Comment Submission": "When your co worker comes to you with 2mg dillies and asks if you know anyone that can sell them so you get them for half the price for yourself 👌🏾 #DontKnoHeDaPlug", "1_Text": "B O O F       T H E M", "2_Subreddit": "opiates"}], "dwrj9hi": [{"0_Comment Submission": "I know what my problem is-- I want to use heroin forever.", "1_Text": "I actually did.", "2_Subreddit": "Drugs"}], "dwvg3ci": [{"0_Comment Submission": "Help ? Need input on these.", "1_Text": ">retard\n\n\nThat's all you need to know", "2_Subreddit": "opiates"}], "dwvgb0o": [{"0_Comment Submission": "Drug test possibly", "1_Text": "? Tomorrow would make 1 day, friday -> sat-> sunday -> monday is the test, that's 4 days. Am I missing something? I also went 4 days in a situation similar to you and I was fine. All of the detox products are bunk, just make sure you dilute your urine on the day of the test. Make sure it's not the first pee of the day, collect mid stream, etc. You'll be good my dude!!", "2_Subreddit": "opiates"}], "dwvgjci": [{"0_Comment Submission": "Syringes in The US’s cock.", "1_Text": "Just bought some dillies. I shot them for the first time earlier last week and OH MY GOD. IT WAS SO GOOD.  I'm telling you man, wait for the rigs to come in. You won't regret it.", "2_Subreddit": "opiates"}], "dwvh7zj": [{"0_Comment Submission": "Fuck me", "1_Text": "Dude. I was you at one point. Didn't know about kratom. \"How good can it be? Does it really work?\"\n\nIt's the bomb. Yes it really works. You will be withdrawal free within an hour of ingesting, assuming you ate enough.", "2_Subreddit": "opiates"}]}], "1_submissions": [{"83nski": [{"0_Title": "I would like to take a moment to vent about the frustrating physics of addiction.", "1_Text": "Sounds like fentanyl and a clear cutting agent. Be careful, or better yet-- don't do it at all.", "2_Subreddit": "opiates"}], "89ijpi": [{"0_Title": "I know what my problem is-- I want to use heroin forever.", "1_Text": "Sounds like fentanyl and a clear cutting agent. Be careful, or better yet-- don't do it at all.", "2_Subreddit": "opiates"}], "89j3xj": [{"0_Title": "I know what my problem is-- I want to use heroin forever.", "1_Text": "Sounds like fentanyl and a clear cutting agent. Be careful, or better yet-- don't do it at all.", "2_Subreddit": "Drugs"}]}]}]}