{"cassh0le69": [{"0_comments": [{"dsr9ofp": [{"0_Comment Submission": "ACRs wanted for Japanese creepypasta anthology", "1_Text": "Messaged!", "2_Subreddit": "NoSleepOOC"}], "dsw7jax": [{"0_Comment Submission": "I don't even know", "1_Text": "I accidentally downvoted this initially because I was frowning so heavily (so big? so wide? not sure what word to use...).", "2_Subreddit": "iamverybadass"}], "dt3l8x9": [{"0_Comment Submission": "My Girlfriend and I built a custom outside turtle enclosure", "1_Text": "Fuck yeah this is awesome. Thanks for taking the time to build this little guy a super awesome room. He’s so cute and looks healthy! Keep it up :)", "2_Subreddit": "DIY"}], "dt4bz8e": [{"0_Comment Submission": "Oxy made her pretty", "1_Text": "This hit a very sensitive spot. It reads very true. Great job!", "2_Subreddit": "opiates"}], "dt92q4a": [{"0_Comment Submission": "Me [22F] with my partner [25M] of 3 years, he does very disturbing and disgusting things with his pillow and I can't take it anymore", "1_Text": "Im crying laughing, that face is perfect for this.", "2_Subreddit": "relationships"}], "dt9316g": [{"0_Comment Submission": "Me [22F] with my partner [25M] of 3 years, he does very disturbing and disgusting things with his pillow and I can't take it anymore", "1_Text": "Yes! I loved worn out spots on my “blankie.” I think they were softer for it. I would rub the areas on my cheek and sometimes cried because they were “so cute” to me (yes, the worn out/ soft parts of the blanket).", "2_Subreddit": "relationships"}], "dt96311": [{"0_Comment Submission": "PsBattle: An Oddly Shaped Eggplant", "1_Text": "I spat out my water, this is great!", "2_Subreddit": "photoshopbattles"}], "dt96587": [{"0_Comment Submission": "PsBattle: An Oddly Shaped Eggplant", "1_Text": "This is so cute", "2_Subreddit": "photoshopbattles"}], "dt96a6i": [{"0_Comment Submission": "My Uber driver's improvised mats", "1_Text": "They should give a “quiet ride” option that states from the start that the passenger isn’t interested in conversation. It takes away the awkwardness of trying to casually end small talk when you’re exhausted after work and just want to ride home in silence.", "2_Subreddit": "mildlyinteresting"}], "dtbwom9": [{"0_Comment Submission": "Lost tortoise found 350yd away after six months", "1_Text": "Oh no.", "2_Subreddit": "nottheonion"}], "dtbws05": [{"0_Comment Submission": "Lost tortoise found 350yd away after six months", "1_Text": "Oh wow I didn’t expect that ending. Good for him for making it so long otherwise! Your aunt... not so much...", "2_Subreddit": "nottheonion"}], "dtbwxvj": [{"0_Comment Submission": "Lost tortoise found 350yd away after six months", "1_Text": "Baby box turtles for $5, if only I could find that deal today!", "2_Subreddit": "nottheonion"}], "dtpbbns": [{"0_Comment Submission": "A weird situation but I would appreciate any help", "1_Text": "Say goodbye. Give yourself (and probably him) some closure. Rather have a proper end to this than wonder “what if?” Once he leaves, that’s a whole new topic of how things will be between you, but also provides some space for you to sort through your feelings. You don’t owe him anything just by going to see him off; he’s leaving the country after all. I think it seems harmless and he likely won’t go home after your date (or whatever you’d like to call it) expecting to start a long distance relationship with you.", "2_Subreddit": "dating_advice"}], "dtpbuab": [{"0_Comment Submission": "Girl \"loves\" me after two dates, scared and leaning towards ending it", "1_Text": "Your feelings about this are totally rational. It’s normal to want things to progress at a normal pace, and her pace with you for whatever reason is definitely very fast. It’s good you brought up how you feel about this, but admittedly worrisome that she got upset rather than understanding/ realizing that she’s objectively coming off very strong. Even if she feels these ways, the timeline of things makes it a little inappropriate to convey them to you, in my opinion. I think a more reassuring reaction would have been to acknowledge your feelings, register what you said, and try to reel it in a bit to make you more comfortable (which isn’t asking for too much).\n\nMoving forward, I think if you like her, go out for another date and see if she continues to behave that way. If she doesn’t, good! She’d be being considerate of your discomfort with her moving in really fast emotionally. If not, I think that’d be a good indicator of how much she cares about you (versus being infatuated with the /idea/ of you and being afraid of losing you, despite not adjusting appropriately to potentially keep you around).", "2_Subreddit": "dating_advice"}], "dtpm6bh": [{"0_Comment Submission": "[Offer] Purple cards with metallic doodles on them! With bonus Scrabble world puzzles included! [US]", "1_Text": "I’m interested! Would love to send ya a little painted notecard back :)", "2_Subreddit": "RandomActsofCards"}], "duolv27": [{"0_Comment Submission": "People tell me he looks like an egg. I'm inclined to agree.", "1_Text": "Hi cutie!! What is his name?", "2_Subreddit": "reptiles"}], "duti5a2": [{"0_Comment Submission": "When a family argument gets out of hand", "1_Text": "F", "2_Subreddit": "funny"}], "dv3ovjq": [{"0_Comment Submission": "holding your loved one’s hand during difficult times will synchronize your breathing, heart rate, and brain wave patterns, and ultimately ease your pain", "1_Text": "Wait. $39.99 to hold your baby?", "2_Subreddit": "UpliftingNews"}], "dv526u3": [{"0_Comment Submission": "What choice did you make in life knowing that it was the wrong one?", "1_Text": "Trying heroin for the first time. \n\nOn that note, trying it a second, third, fourth, etc.", "2_Subreddit": "AskReddit"}], "dv55n0g": [{"0_Comment Submission": "[Offer] 10 random postcards with an animal drawing on them [NY to United States]", "1_Text": "Heck yeah! I’ll PM you now :)", "2_Subreddit": "RandomActsofCards"}], "dvr05yf": [{"0_Comment Submission": "Trump confesses at Missouri fundraiser: I make up facts", "1_Text": "Out of curiosity, which one DO you ask? I’m not familiar with this riddle.", "2_Subreddit": "politics"}], "dwp7hhg": [{"0_Comment Submission": "got a new stamp that made me feel like I just smoked a bowl of weed..?", "1_Text": "I have heard of a batch from Philly that made my friend feel SUPER weed-high. She said it was exactly like being too high from smoking pot, where her mind was moving way too fast and she was over analyzing everything to a ridiculous extent, from the way she was breathing to how air felt (just some examples she gave me to try to illustrate how insane she was feeling). Exactly like being way too stoned, which was super bizarre because she hadn’t smoked, and her partner who also used from the same batch was also experiencing the same thing. They told me they ended up tossing the rest of their bags from that batch and never went back. This was a month or two ago, and they only ran into it that one time. Something odd tho was that they had picked up from that set prior, and that very same stamp had been “normal” during past pickups, and then suddenly one day the same stamp from the same set caused that bizarre new reaction. They’d even tried a few more bags from that bundle to test if it was the bags or their imagination, and they got the same reaction/ confirmed it was that particular batch. She told me it was extremely unpleasant and that nothing at all helped because even trying to sleep it off sent her into a panic attack/ existential crisis/ complete mental breakdown. Scary to imagine thinking you’re comfortable with a certain dealer/ stamp, and then finding out the contents had changed, so drastically and so negatively.", "2_Subreddit": "opiates"}], "dwp7plv": [{"0_Comment Submission": "got a new stamp that made me feel like I just smoked a bowl of weed..?", "1_Text": "Sorry in advance for how long that comment is. I just hadn’t ever heard anyone else mention this before, and it had been such an insane experience for my friend so she felt somewhat validated upon learning others had encountered this as well, and in our area at that!", "2_Subreddit": "opiates"}], "dwvv8fz": [{"0_Comment Submission": "Always keep the cup in sight.", "1_Text": "Whoa wtf", "2_Subreddit": "gifs"}], "dww9mud": [{"0_Comment Submission": "[Offer] 10 floral cards with your favorite quote written in them! [US]", "1_Text": "Yes! Beautiful, PMing", "2_Subreddit": "RandomActsofCards"}]}], "1_submissions": [{}]}]}