{"discobrian10": [{"0_comments": [{"dep82r3": [{"0_Comment Submission": "The Unfortunate Truths Of Drum Tuning", "1_Text": "I'm glad I saw this post, 81 days late, but I'll make it simple. Every drum has a note it resonates at. You can tap on your shell without heads on it and get an idea of what note it is. Timbre is what this is called. \nThis is how drums work. You tune your reso head to the timbre of the shell, and you can tune the top head up to a minor 3rd above the reso head note. This is where ear comes in. The closer you tune the top head to the reso head the \"flatter\" the tone is. This is what you would do with a floor Tom. The higher above the reso head you go with the batter head depends on how much \"pitch bend and fall\" you want. Find heads that your drums like the best, and stick with them. Or don't. Don't really care, just thought I'd tell you the mechanics of a drum. Cheap drums are \"hard\" to make sound good because of the wood and construction of the shells. You'll find that the more you pay for a kit, the better it will sound because they take a lot of time to choose the right wood, the right grain cut for different plys of the shell makeup. I am a professional studio musician/ touring musician, and record drum samples off my kits that I tune, so people who can't tune or don't have time to tune can rush through a session and replace their drum sounds with my samples. I'm not saying go out and build an sjc kit or get a dw collector series, but I wouldn't take a first act or tama rockstar on stage or into a session and expect it to sound like a $2000 kit. Just remember these are just guidelines on how to tune. Drum tones come down to a lot of factors like drums sticks, rim size, how hard you hit them, where you hit them, and how consistent you are with hitting them. All kits are made different, but the tuning mechanics work the same. \n\nThanks for reading. Take what you want from it, this is how I do it and it works for me EVERY SINGLE TIME. Consistency/ time efficiency is key.", "2_Subreddit": "drums"}], "drakelu": [{"0_Comment Submission": "Need help crushing pills", "1_Text": "I’m a little late posting, but I’ve found the best way to crush is get any body spray can like axe or whatever flip it upside down put your pill in the bottom cupped part of the can and use a screwdriver handle to crush it up. Then just use your favorite tooter. I take a zebra pen apart and use the metal tube because they are small and last a long time compared to plastic pen tubes. Have fun and be safe! Happy nods", "2_Subreddit": "Drugs"}], "du5msfk": [{"0_Comment Submission": "Really relating to Dewey right about now...", "1_Text": "LITERALLY EVERY OTHER DAY!!! lol", "2_Subreddit": "opiates"}], "du5o2xt": [{"0_Comment Submission": "Hydro tolerance", "1_Text": "All just depends on the person really. If i was clean i could take 10mg and feel it but the next time i redose i would take 15mg for a day then go up. Before you know it you’re taking 100mg in one dose (3250mg of acetaminophen lol) i went from 10mg a dose at 6-8 pills a day to 80-100mg a dose at 80-100 pills a day in a month and a half.", "2_Subreddit": "opiates"}], "du5ovkh": [{"0_Comment Submission": "Does anyone else do this to crush??? If not, you’re welcome.", "1_Text": "Used to use crush cards for years, but my group has been doing this for a couple years now and it’s the best way I’ve been able to come up with!", "2_Subreddit": "opiates"}], "du5pr1g": [{"0_Comment Submission": "Does anyone else do this to crush??? If not, you’re welcome.", "1_Text": "If only you could see my living proof collection lol i love this can to crush too because i use it everyday too so it’s already on the counter 😂", "2_Subreddit": "opiates"}], "du5qblo": [{"0_Comment Submission": "Does anyone else do this to crush??? If not, you’re welcome.", "1_Text": "I normally crush roxy or dilly but yeah I’ve done these for years with no problems. That’s just funny to me though, people don’t say anything about smoking black tar but will be worried about someone snorting a little acetaminophen lol mostly just take these orally and snort a half to kick the wds before it kicks in orally", "2_Subreddit": "opiates"}], "du5qhfe": [{"0_Comment Submission": "Does anyone else do this to crush??? If not, you’re welcome.", "1_Text": "Full dry volume blast lol it’s pretty damn good", "2_Subreddit": "opiates"}], "du5qj84": [{"0_Comment Submission": "Does anyone else do this to crush??? If not, you’re welcome.", "1_Text": "Nothing but fent pressed everything around here", "2_Subreddit": "opiates"}], "du5qmh0": [{"0_Comment Submission": "Does anyone else do this to crush??? If not, you’re welcome.", "1_Text": "Cool man, just sharing a technique.", "2_Subreddit": "opiates"}], "du5s7uc": [{"0_Comment Submission": "Does anyone else do this to crush??? If not, you’re welcome.", "1_Text": "And this is why i don’t post. Jesus", "2_Subreddit": "opiates"}], "du5udpn": [{"0_Comment Submission": "Does anyone else do this to crush??? If not, you’re welcome.", "1_Text": "I’m saying if I’m withdrawing, and i take 5 tabs it’s gonna take 30-45 min for me to get well so toot a half so i feel better in 5-10 min till they kick in. The only reason for the post was for the technique though lol", "2_Subreddit": "opiates"}], "dwiqz73": [{"0_Comment Submission": "Had a little slipup. Thankful for these!", "1_Text": "They put me on 3 8mg strips a day but i was doing I’d say 80 a Day was usual but it was between 80-100 a day and he told me 8mg was all he had for me. Those 12s look awesome. You can but that shit up if it’s the same price as 8s and safe some money.  Sorry I’m noddy so i hope that makes sense.", "2_Subreddit": "opiates"}]}], "1_submissions": [{}]}]}