{"pounded_raisu": [{"0_comments": [{"dwtu6l1": [{"0_Comment Submission": "Possible Monthly leak? Someone posted this on Humble Montlhy thread on /v/", "1_Text": "TBH I've never even heard of WTWTLW nor TP....like, ever. Having it released in a HB can be pretty good exposure, no?", "2_Subreddit": "humblebundles"}], "dwty982": [{"0_Comment Submission": "Let's go to the park.", "1_Text": "As someone who watches lotsa gay porn, that last panel could have ended VERY differently.", "2_Subreddit": "comics"}], "dwu1x03": [{"0_Comment Submission": "Why is streaming though my PS4 more efficient than streaming through my elgato HD60?", "1_Text": "Not just that but we also don't know what else is running on his PC that could be using up CPU power.", "2_Subreddit": "Twitch"}], "dwumybi": [{"0_Comment Submission": "Britain believes it has found Russian lab that made nerve agent used in Salisbury attack", "1_Text": "Laziest whataboutism ever.\n\nedit: thanks for clarifying the actual usage of \"whataboutism\". \n\nregardless, I think we know what they're trying to do and it's basically just disprove the original point about pets, etc so that still doesn't change that sole fact =)", "2_Subreddit": "worldnews"}], "dwun1ns": [{"0_Comment Submission": "Britain believes it has found Russian lab that made nerve agent used in Salisbury attack", "1_Text": "Yeah for all we know it could have been aliens from Mars amirite?", "2_Subreddit": "worldnews"}], "dwun5by": [{"0_Comment Submission": "Britain believes it has found Russian lab that made nerve agent used in Salisbury attack", "1_Text": "THE RUSSIANS ARE SCARED FOR THEIR LIVES AND FUTURE. HA.", "2_Subreddit": "worldnews"}], "dwuxruk": [{"0_Comment Submission": "Britain believes it has found Russian lab that made nerve agent used in Salisbury attack", "1_Text": "Who cares about intelligence - that's not what my post was intended to do. It is all about luck and it the Russians are the ones who are ganna get fucked.\n\nbasically, we're taking a massive shit on ya'll.", "2_Subreddit": "worldnews"}], "dwv0tta": [{"0_Comment Submission": "Britain believes it has found Russian lab that made nerve agent used in Salisbury attack", "1_Text": "Nah. I’d rather help others. Fuck the Russians.", "2_Subreddit": "worldnews"}], "dwvlg5l": [{"0_Comment Submission": "Britain believes it has found Russian lab that made nerve agent used in Salisbury attack", "1_Text": "Nah. The fact that many Russians citizens took part in information warfare means they should also be held accountable. If you want to be the change against your shitty Russian government, maybe you should do something about it - just like how the youth in America are.", "2_Subreddit": "worldnews"}], "dww5uvs": [{"0_Comment Submission": "Britain believes it has found Russian lab that made nerve agent used in Salisbury attack", "1_Text": "I'm not really here to have a \"proper\" discussion. It's not about agreeing or disagreeing. \n\nI'm here to mock the Russians who are working as trolls/dissuading the subject. I'm having a hoot.", "2_Subreddit": "worldnews"}], "dwwdpxv": [{"0_Comment Submission": "The Long Dark is Almost Perfect for me", "1_Text": "> Multiplayer is a myth, I know. It's never ever going to happen. But wouldn't it be so much fun? \n\n100% if multiplayer is ever implemented, it'll become a PvP bloodfest unless there are mechanics in place that prevent that. They would have to considerably up the difficulty level if they want co-op to be in place and to allow for players to absolutely rely on each other.", "2_Subreddit": "thelongdark"}], "dwwfaqg": [{"0_Comment Submission": "I have no viewers but my stream is good...", "1_Text": "To add, Darwin is a game that is VERY focused on interaction and streamers. \n\nI've passively streamed playing this game without talking and everything in terms of stream image quality to having a green screen set up and I would have occasional randos popping into my channel.", "2_Subreddit": "Twitch"}], "dwwfl7u": [{"0_Comment Submission": "Could I succeed as a streamer without a layout or a webcam? Also, is two hours per session enough?", "1_Text": "* I think having separate streams is good. Viewers tuning in might just be there for your husband and if they hear you speak, they might not be interested (and vice versa)\n* As for the female streamer part, unfortunately sexual harassment is still prevalent. I can't speak on behalf of women but as an openly gay male streamer, I occasionally have viewers being lewd or stepping out of line. I just play along or ignore what I feel like. If it's someone I am comfortable with, I flirt along. I also have had racists telling me to speak english properly or to go back to my country, etc and to be honest, I just ignore them.\n\n>  I would like to be successful based on my content.\n\nAnd I agree with you - you need to have your own thing going on. While there's nothing wrong with streaming with your husband (could be your channel's niche thing), consider the fact that having two separate streams can potentially mean you guys can up your total viewer count together.", "2_Subreddit": "Twitch"}], "dwx4tqb": [{"0_Comment Submission": "Today I saw some awesome geometric reflections in a pond I was walking by", "1_Text": "Holy fuck.", "2_Subreddit": "woahdude"}], "dwx548m": [{"0_Comment Submission": "Unknown bug appeared at outside balcony (Vietnam)", "1_Text": "Jesus. The fact that there are insects like this on earth I’m surprised that there isn’t one that can affect humans or other mammals this way.", "2_Subreddit": "whatsthisbug"}], "dwx5b1x": [{"0_Comment Submission": "I have never done any opiates. I've been browsing this sub for ~2 hours now.", "1_Text": "I mean....I’ve used opiates before but only in the event of post surgery. Both in pill form and in injection form at the hospital. \n\nI can understand the whole “warm” feeling but it’s not something that I would find myself doing recreationally like pot or LSD. Could opiate addiction just be different for everyone or did I not take enough of a recreational dose to actually reach that point?", "2_Subreddit": "opiates"}], "dwx6iix": [{"0_Comment Submission": "I have never done any opiates. I've been browsing this sub for ~2 hours now.", "1_Text": "I have 2mg dillies in which I've taken in the past \"recreationally\" (meaning I wasn't in pain). Aside from just making me feel relaxed/sleepy, I didn't really care much for it. I even have another script for refills but I didn't bother.\n\nCould it be that I just didn't break past a certain threshold?", "2_Subreddit": "opiates"}], "dwxbodp": [{"0_Comment Submission": "April 2018 Monthly Bundle Overview", "1_Text": "The point of having a “good” game hidden is the gambling aspect of the bundles - never know what you’ll get and it provides an incentive for one to sub (after all, once the the games are revealed, you cannot sub).", "2_Subreddit": "humblebundles"}], "dwxcr4y": [{"0_Comment Submission": "I have never done any opiates. I've been browsing this sub for ~2 hours now.", "1_Text": "That’s the thing - people are describing how they feel euphoria with opiates but for me I’m only feeling “relaxed and warm” (this is with both dilaudid and injections at the hospital).\n\nWhen I think about euphoria, I think about the peak of LSD or ecstasy. \n\nSo I guess you have a point that it may come down to my own personal relationship with the substance. \n\nTo me, the most euphoric I’ve felt in my entire life was tripping on 400uG of acid. It took anything I loved (such as music) and amplified it to indescribable intensity. Opiates felt...muting.", "2_Subreddit": "opiates"}], "dwxl0fd": [{"0_Comment Submission": "April 2018 Humble Monthly Bundle", "1_Text": "First time subbing for a Humble Monthly (annual). Was reallllly on the fence and this pretty much made me not regret subbing.", "2_Subreddit": "humblebundles"}], "dwxl90z": [{"0_Comment Submission": "April 2018 Humble Monthly Bundle", "1_Text": "But are we allowed to criticize criticism?  🤔", "2_Subreddit": "humblebundles"}], "dwxlfla": [{"0_Comment Submission": "April 2018 Humble Monthly Bundle", "1_Text": ">  people know what kinda games to expect by now.\n\nTBH was not expecting Outlast 2", "2_Subreddit": "humblebundles"}], "dwxmjkb": [{"0_Comment Submission": "Where do I go to get the early unlocks for humble monthly?", "1_Text": "Oh wow....so if I understand how this works - it's not automatically redeemed even though I've paid in advance anally?", "2_Subreddit": "humblebundles"}], "dwxt2yt": [{"0_Comment Submission": "The Berry Brothers, making a stunning entrance in the 1942 film 'Panama Hattie'", "1_Text": "Yeah I'm pretty sure if I attempted this I'd be paralyzed for life.", "2_Subreddit": "gifs"}], "dwy7eo1": [{"0_Comment Submission": "If you're wondering whether you should maybe play AER rather than trade/give it away, the answer is yes", "1_Text": "> this game seems to be part of Swedish vagina empowerment program\n\nwhat?", "2_Subreddit": "humblebundles"}]}], "1_submissions": [{"82ngtj": [{"0_Title": "Looking for suggestions to upgrade a 8 year old cpu+MOBO w/ R9 390", "1_Text": "TBH I've never even heard of WTWTLW nor TP....like, ever. Having it released in a HB can be pretty good exposure, no?", "2_Subreddit": "buildapc"}], "83a98q": [{"0_Title": "are these components compatible? (i5-8400 + DDR4 3000)", "1_Text": "TBH I've never even heard of WTWTLW nor TP....like, ever. Having it released in a HB can be pretty good exposure, no?", "2_Subreddit": "buildapc"}], "83j2xm": [{"0_Title": "can i use login authentication with Google Auth on Twitter and not initially authorize my phone number?", "1_Text": "TBH I've never even heard of WTWTLW nor TP....like, ever. Having it released in a HB can be pretty good exposure, no?", "2_Subreddit": "Twitter"}], "84fn8n": [{"0_Title": "Thought I had i5-650 but turns out it's a i5-3570k. Would upgrading from i5-3570k to i5-8400 significant for a streamer?", "1_Text": "TBH I've never even heard of WTWTLW nor TP....like, ever. Having it released in a HB can be pretty good exposure, no?", "2_Subreddit": "buildapc"}], "84pzz3": [{"0_Title": "will the gamedev industry ever mature and grow past its reputation for mistreating its developers or will it always be considered the job where \"you do it for the passion - that's just the nature of the industry and there's nothing the industry can do about it\" ?", "1_Text": "TBH I've never even heard of WTWTLW nor TP....like, ever. Having it released in a HB can be pretty good exposure, no?", "2_Subreddit": "gamedev"}], "84zmwh": [{"0_Title": "any decent music video trackers? I used to use iRC but not sure if that's a thing.", "1_Text": "TBH I've never even heard of WTWTLW nor TP....like, ever. Having it released in a HB can be pretty good exposure, no?", "2_Subreddit": "trackers"}], "8596f1": [{"0_Title": "Jóhann Jóhannsson was one of my favorite composers.", "1_Text": "TBH I've never even heard of WTWTLW nor TP....like, ever. Having it released in a HB can be pretty good exposure, no?", "2_Subreddit": "LSD"}], "85kocb": [{"0_Title": "When you try to copy/paste a title in Wikipedia, it will automatically append \"This is a good article. Follow the link for more information.\" to your paste", "1_Text": "TBH I've never even heard of WTWTLW nor TP....like, ever. Having it released in a HB can be pretty good exposure, no?", "2_Subreddit": "mildlyinfuriating"}], "868zmd": [{"0_Title": "Older generations, tech illiterates tend to have a lesser grasp on social media etiquette are much more likely to share toxic memes on Facebook. In a way, they are the primary drivers of today's circulating propaganda.", "1_Text": "TBH I've never even heard of WTWTLW nor TP....like, ever. Having it released in a HB can be pretty good exposure, no?", "2_Subreddit": "Showerthoughts"}], "869f2z": [{"0_Title": "is it normal for friends to talk behind each other's backs (making negative comments, etc) ? I'm very much weary of anyone who does it but a lot of groups who are tight nit I come across tend to do this in their social circles and I don't know if it's normal or it's just me.", "1_Text": "TBH I've never even heard of WTWTLW nor TP....like, ever. Having it released in a HB can be pretty good exposure, no?", "2_Subreddit": "socialskills"}], "869k75": [{"0_Title": "tutorials on how to remove a face and have it appeared textured with skin in its place to appear as organic as possible?", "1_Text": "TBH I've never even heard of WTWTLW nor TP....like, ever. Having it released in a HB can be pretty good exposure, no?", "2_Subreddit": "photoshop"}], "86o09t": [{"0_Title": "I have a problem with writing journal entries/posts and much of it has to do with excessive adverbs and or adjectives. How can I make my writing more \"efficient\" and to the point?", "1_Text": "TBH I've never even heard of WTWTLW nor TP....like, ever. Having it released in a HB can be pretty good exposure, no?", "2_Subreddit": "writing"}], "86v4gu": [{"0_Title": "what are the signs that tell you someone isn't interested in pursuing a friendship with you and that it is time to just remove them from your life (Facebook, text messages, etc)?", "1_Text": "TBH I've never even heard of WTWTLW nor TP....like, ever. Having it released in a HB can be pretty good exposure, no?", "2_Subreddit": "socialskills"}], "86v7sr": [{"0_Title": "what are the signs that tell you someone isn't interested in pursuing a friendship with you and that it is time to just remove them from your life (Facebook, text messages, etc)?", "1_Text": "TBH I've never even heard of WTWTLW nor TP....like, ever. Having it released in a HB can be pretty good exposure, no?", "2_Subreddit": "AskReddit"}], "86valq": [{"0_Title": "what are the signs that tell you someone isn't interested in pursuing a friendship with you and that it is time to just remove them from your life (Facebook, text messages, etc)?", "1_Text": "TBH I've never even heard of WTWTLW nor TP....like, ever. Having it released in a HB can be pretty good exposure, no?", "2_Subreddit": "AskReddit"}], "873b89": [{"0_Title": "New to the game and encountered my first griefer - they would open the exit gate midway, release and not allow me to reach the switch. They repeated the same thing when I tried to go to another exit gate until the killer reached us, killed me and the griefer escaped. Is this common/acceptable?", "1_Text": "TBH I've never even heard of WTWTLW nor TP....like, ever. Having it released in a HB can be pretty good exposure, no?", "2_Subreddit": "deadbydaylight"}], "873h0r": [{"0_Title": "New to the game and encountered my first griefer - they would open the exit gate midway, release and not allow me to reach the switch. They repeated the same thing when I tried to go to another exit gate until the killer reached us, killed me and the griefer escaped. Is this common/acceptable?", "1_Text": "TBH I've never even heard of WTWTLW nor TP....like, ever. Having it released in a HB can be pretty good exposure, no?", "2_Subreddit": "deadbydaylight"}], "8782ec": [{"0_Title": "As a new player/survivor, what are some things that are considered toxic behavior?", "1_Text": "TBH I've never even heard of WTWTLW nor TP....like, ever. Having it released in a HB can be pretty good exposure, no?", "2_Subreddit": "deadbydaylight"}], "87g5hi": [{"0_Title": "/r/watchpeopledie goes beyond death - it shows us human rights violations committed by countries, social injustices, OSHA violations, penny-pinchers at the expense of human lives, etc. the existence of /r/WPD is more threatening to corporations and politicians than the people.", "1_Text": "TBH I've never even heard of WTWTLW nor TP....like, ever. Having it released in a HB can be pretty good exposure, no?", "2_Subreddit": "Showerthoughts"}], "87x78s": [{"0_Title": "what are some mental reminders that you tell yourself when dealing with an N that won't stop insulting, gaslighting you when you're put in circumstances where you cannot tell them to fuck off or go completely NC?", "1_Text": "TBH I've never even heard of WTWTLW nor TP....like, ever. Having it released in a HB can be pretty good exposure, no?", "2_Subreddit": "raisedbynarcissists"}], "87yjww": [{"0_Title": "is Vermintide 2 a good co-op game to \"veg out\" and just grind with progression? Been playing Dead By Daylight and realized how much I love a grindy, co-op game with progression but the vibes are making me too anxious/nervous :(", "1_Text": "TBH I've never even heard of WTWTLW nor TP....like, ever. Having it released in a HB can be pretty good exposure, no?", "2_Subreddit": "Vermintide"}], "88l0o7": [{"0_Title": "unable to install game from Windows Store w/ gamepass (error after downloading and attempting to install). How do i fix it?", "1_Text": "TBH I've never even heard of WTWTLW nor TP....like, ever. Having it released in a HB can be pretty good exposure, no?", "2_Subreddit": "Seaofthieves"}], "88nn3u": [{"0_Title": "for those who DON'T have severe social anxiety - does it make you uncomfortable when someone opens up to the fact that they suffer from severe social anxiety? do you act differently around them afterwards?", "1_Text": "TBH I've never even heard of WTWTLW nor TP....like, ever. Having it released in a HB can be pretty good exposure, no?", "2_Subreddit": "AskReddit"}], "89a6gg": [{"0_Title": "DAE hate it when an N would give you praise? Like \"Oh you've lost weight!\" for some reason, infuriates me coming from them. Even if they rarely compliment me and insult me all the time, having praise come out from nowhere is even ... WORSE.", "1_Text": "TBH I've never even heard of WTWTLW nor TP....like, ever. Having it released in a HB can be pretty good exposure, no?", "2_Subreddit": "raisedbynarcissists"}], "8a7f0b": [{"0_Title": "At what point do you start becoming comfortable with talking to yourself that you don't become mentally exhausted?", "1_Text": "TBH I've never even heard of WTWTLW nor TP....like, ever. Having it released in a HB can be pretty good exposure, no?", "2_Subreddit": "Twitch"}]}]}]}