{"dontmakemespeak3": [{"0_comments": [{"dtuutgp": [{"0_Comment Submission": "MILITW - “Why are you so slow?!”", "1_Text": "Nah, religion is garbage.", "2_Subreddit": "JUSTNOMIL"}], "dtuzrtc": [{"0_Comment Submission": "MILITW - “Why are you so slow?!”", "1_Text": "Ok, continue believing in fairy tales and hopefully you get to live in the magic fairy kingdom in the sky when you die : /", "2_Subreddit": "JUSTNOMIL"}], "du87rpg": [{"0_Comment Submission": "What about the opposite gender are you jealous of?", "1_Text": "I sometimes think about how if a girl feels like having casual sex, she could literally go up to any semi attractive guy and say \"Take me home and fuck the shit out of me\", and the guy would already be ordering an uber. It makes me jealous because I am pretty sure no girl would ever positively respond if I did the the same thing...", "2_Subreddit": "AskReddit"}], "duhei7k": [{"0_Comment Submission": "What video game was an absolute masterpiece?", "1_Text": "The last of us got me pretty good, couple of replays :)", "2_Subreddit": "AskReddit"}], "duu96v9": [{"0_Comment Submission": "I am so glad I found this sub. Here is my own personal story on why I dislike dogs after being subjected to their shit (literally) for years", "1_Text": "That partially the reason I don't like dogs too! My old GF had a bunch of foster dogs, but they were like the juevenile delinquents of the dog world. Would shit and piss everywhere, plus when you walked them they would bite other dogs. It was an absolute nightmare.", "2_Subreddit": "Dogfree"}], "dvbq2nw": [{"0_Comment Submission": "When do we stop lying?", "1_Text": "I love this!", "2_Subreddit": "childfree"}], "dvkgl8r": [{"0_Comment Submission": "Atheists of Reddit, how did you become an atheist?", "1_Text": "It happened when I was young. After I realized the tooth fairy and Santa wasn't real, I started thinking about how far fetched the whole concept is. Think about it, if you are good you get to live in a fairy kingdom in the sky, and if you are bad you have to live in a volcano with Hitler. When I asked any religion teacher I had to at least try to prove to me that it wasnt all garbage. I pretty much got the response of \"well if you have faith, then God will accept you into heaven\"\nStill haven't been provided any actually factual evidence so I'm gonna stick with calling bullshit it on all.", "2_Subreddit": "AskReddit"}], "dvoa8rp": [{"0_Comment Submission": "What is your Tinder horror story?", "1_Text": "Cried : '(", "2_Subreddit": "AskReddit"}], "dvq4lcr": [{"0_Comment Submission": "Mood....", "1_Text": "Future is the ONE!", "2_Subreddit": "opiates"}], "dvqi1lf": [{"0_Comment Submission": "What's The Most disgusting thing you'll admit to doing?", "1_Text": "Every one's doing it, man.", "2_Subreddit": "AskReddit"}], "dvqi4pf": [{"0_Comment Submission": "What's The Most disgusting thing you'll admit to doing?", "1_Text": "Not doing it for one day is fucked up enough!", "2_Subreddit": "AskReddit"}], "dwet21g": [{"0_Comment Submission": "What a confession.", "1_Text": "You know you can do that all the time if you don't have kids?", "2_Subreddit": "ihavesex"}], "dwo07su": [{"0_Comment Submission": "Wife [32F] is a SAHM but still wants to hire a full-time nanny for our daughter [4F]. I [35M] don't see the point.", "1_Text": "Sounds like she probably should have ticked a few more boxes off before she decided to have kids? Sounds like she wasn't ready to compromise her time for her children.", "2_Subreddit": "relationships"}], "dwpe117": [{"0_Comment Submission": "[22 F] I somehow became known as the \"flirty girl\" to one of my [40 F] managers at my job, but I honestly never tried to flirt with anyone. How do I became less flirtatious if I don't even know what I am doing?", "1_Text": "She is clearly jealous of the attention you get from the males there, all women hate girls that people pay more attention to.", "2_Subreddit": "relationships"}], "dwpjz5o": [{"0_Comment Submission": "Getting rid of a pet because of new bay-bee never ceases to piss me off.", "1_Text": "I hate both dogs and children :/", "2_Subreddit": "childfree"}], "dwpms74": [{"0_Comment Submission": "Getting rid of a pet because of new bay-bee never ceases to piss me off.", "1_Text": "Nah I love cats, or maybe I just like peace and quiet? Dogs and kids produce too much noise.", "2_Subreddit": "childfree"}], "dwpo9ai": [{"0_Comment Submission": "Getting rid of a pet because of new bay-bee never ceases to piss me off.", "1_Text": "Well, alot of the people who use r/childfree talk about how much they love their pets and would much prefer having a dog to a child. I've seen countless \"fur babies\" and \"pet tax\" posts on here. So probably that...", "2_Subreddit": "childfree"}], "dwppgyx": [{"0_Comment Submission": "Getting rid of a pet because of new bay-bee never ceases to piss me off.", "1_Text": "I know right? Still just gonna hate whatever I like.", "2_Subreddit": "childfree"}], "dwppvn0": [{"0_Comment Submission": "Getting rid of a pet because of new bay-bee never ceases to piss me off.", "1_Text": "The topic literally about someone giving their dog away because of a child?", "2_Subreddit": "childfree"}], "dwpzsdm": [{"0_Comment Submission": "found Mr Fantastics side hoe", "1_Text": "Logistically impossible?", "2_Subreddit": "ihavesex"}], "dww4hhe": [{"0_Comment Submission": "What is a filthy business tactic you know that everyone should be aware of?", "1_Text": "I'd love to get paid for that. Reddit my life away.", "2_Subreddit": "AskReddit"}], "dwx4i98": [{"0_Comment Submission": "Yummy #4", "1_Text": "Drooled just looking at this :/", "2_Subreddit": "opiates"}]}], "1_submissions": [{}]}]}