{"Aerumnous_Bones": [{"0_comments": [{"ce7bgk9": [{"0_Comment Submission": "Kayle Only Stream beginning, come join!", "1_Text": "Just began my career as a Kayle Only player in Platinum, making my runs for that Diamond babies. Come hang out!", "2_Subreddit": "leagueoflegends"}], "ckhv2g0": [{"0_Comment Submission": "Anyone interested in making all monk groups to test out different builds and synergy ?", "1_Text": "We should consider making a channel related to all Monk loot shares, both hard and softcore, seasonal and non.", "2_Subreddit": "Diablo3Monks"}], "cos7eeu": [{"0_Comment Submission": "Weekly Raiding Q & A", "1_Text": "https://www.warcraftlogs.com/reports/nca4GAjDk7fQdZyF#fight=1\n\nLead of Misfit here: looking for any advice to help out our Warlocks DPS, since it seems to be our guilds weak-spot (not specifically him, just looking to slowly help all our members). If you see anything that would be helpful, that would be much appreciated; there are more logs under our banner if you need more information, I just picked one of his top fights and a successful clear on a boss. =)\n\nThanks in advance.", "2_Subreddit": "wow"}], "ddsl5wp": [{"0_Comment Submission": "Just because you are a one trick pony doesn't mean you can lock that champ in ranked.", "1_Text": "I don't really think, outside of that single guy, people are actively getting banned from choosing off-meta supports.\n\nIf you don't like your team composition and you think the likelihood of losing is high, dodge. 1st of the day is a 5minute wait timer with an LP loss of 3 (IE: basically nothing).\n\nAlso (and generally people really like to miss this point) if someone is choosing <insert champion here> for support because they're a one trick... it might be better for them to be playing that champion than attempting to play (and learn) a new champion in that same ranked match you're commenting on. They have some mastery with the champion and understand it, since they exclusively play it, so it might actually be more beneficial for them to choose and play it.\n\nJust my 2c.", "2_Subreddit": "leagueoflegends"}], "ddslo6u": [{"0_Comment Submission": "Someone calling you out on your bad plays is not flaming", "1_Text": "Except \"calling you out\" doesn't -do- anything productive toward your mutual goal of winning the game.\n\nIf I come to your lane to gank as Lee and flash-kick into a bad direction... I'm well aware of my own mistake. I don't need some random player telling me about the mistake I just made, nor do you telling me that I made a bad play actually help anything.\n\nI decide to invade enemy jungle and die as I'm placing my ward? Sure, seems like a bad play, but you don't need to be captain point-out-mistakes. Literally every single person playing League of Legends makes mistakes. Every. Single. Person.\n\nAnd that's okay. Mistakes are okay--it's how we learn to improve. But, you should probably save your lessons for yourself, or people you're committed to duoing with, since \"calling out\" your teammate on their bad play is more than likely going to do more damage than it's helping.\n\nSo stop being that guy that points out peoples mistakes and focus on your own gameplay and how you can change your patterns to improve your play and climb.\n\nOr don't. /shrug.", "2_Subreddit": "leagueoflegends"}], "ddslzmj": [{"0_Comment Submission": "Someone calling you out on your bad plays is not flaming", "1_Text": "I tend to go with the... don't say anything route. You just don't have enough time or a good avenue (since you have to type while actively playing the game) in order to appropriately get your constructive criticism across in a way that's healthy and productive for all parties.", "2_Subreddit": "leagueoflegends"}], "ddsn788": [{"0_Comment Submission": "Someone calling you out on your bad plays is not flaming", "1_Text": "I agree.", "2_Subreddit": "leagueoflegends"}], "ddsndn9": [{"0_Comment Submission": "I faced an honest to god scripting yasuo today and it was the most obscene thing I've ever seen.", "1_Text": "Neither Yasuo or Trynd, at two items, will out damage your late game carry in a fight, assuming proper play from both sides.\n\nBoth of the former mentioned champions are melee and are automatically more difficult to deal damage with, while maintaining safety from death.\n\nCrit works with Yasuo and Trynd like it works with every single other champion--well, Yasuo's crits -actually- do -less- damage than other champion's crit, that's the only exception.", "2_Subreddit": "leagueoflegends"}], "ddsngj7": [{"0_Comment Submission": "Just because you are a one trick pony doesn't mean you can lock that champ in ranked.", "1_Text": "What do you mean, \"doesn't work\"? That's an insane claim to make and justify.", "2_Subreddit": "leagueoflegends"}], "dtt9zo0": [{"0_Comment Submission": "Fallen Gate Roleplay", "1_Text": "Thanks for the disingenuous reply. Super useful. Much appreciated.", "2_Subreddit": "EQ2"}], "dtuy74j": [{"0_Comment Submission": "(EQ2) Fallen Gate Roleplay", "1_Text": "Much appreciated, my friend.\n\nI know there are still cliche's that run around AB together, perhaps a few of them fluttered over to Fallen Gate for that 'original' feel experience. I'll be checking the guild tab as soon as I purchase my subscription tonight.\n\nSee you in Norrath!", "2_Subreddit": "MMORPG"}], "dtyrxkj": [{"0_Comment Submission": "Roleplay", "1_Text": "Lmfao. Not.. not exactly what I'm looking for, but uhhh.. yeah. Sounds interesting!", "2_Subreddit": "everquest"}], "dtyrz76": [{"0_Comment Submission": "Roleplay", "1_Text": "R.I.P roleplay.\n\nI suppose maybe I'll have to swing by FV to check it out; I thought it was flooded with people due to the 'open-trade' policies that are enabled over there.", "2_Subreddit": "everquest"}], "dwu1tnr": [{"0_Comment Submission": "dope porn sunrise [nsfw]", "1_Text": "Can't find them like yourself in good ol' OHIO. *le sigh*\n\nWould love to take you out for a sweet Olive Garden dinner, spend our evening cuddled beside the glow of a television screen before we get physical and later drift off in each others warm embrace to nod-land.\n\n....oh well. ;)\n\nPS: missing the lip piercing or closin' it down for good?", "2_Subreddit": "opiates"}], "dwu1y6n": [{"0_Comment Submission": "This window looks like a painting", "1_Text": "Plot twist: it's actually a painting.", "2_Subreddit": "mildlyinteresting"}]}], "1_submissions": [{"1tf8r4": [{"0_Title": "Kayle Only Stream beginning, come join!", "1_Text": "Just began my career as a Kayle Only player in Platinum, making my runs for that Diamond babies. Come hang out!", "2_Subreddit": "leagueoflegends"}], "2snun3": [{"0_Title": "Misfit (H): Wyrmrest Accord", "1_Text": "Just began my career as a Kayle Only player in Platinum, making my runs for that Diamond babies. Come hang out!", "2_Subreddit": "wowguilds"}], "7vlbi2": [{"0_Title": "Fallen Gate Roleplay", "1_Text": "Just began my career as a Kayle Only player in Platinum, making my runs for that Diamond babies. Come hang out!", "2_Subreddit": "EQ2"}], "7vldb6": [{"0_Title": "(EQ2) Fallen Gate Roleplay", "1_Text": "Just began my career as a Kayle Only player in Platinum, making my runs for that Diamond babies. Come hang out!", "2_Subreddit": "MMORPG"}], "7w2770": [{"0_Title": "Roleplay", "1_Text": "Just began my career as a Kayle Only player in Platinum, making my runs for that Diamond babies. Come hang out!", "2_Subreddit": "everquest"}]}]}]}