{"ImPoopnRightNow": [{"0_comments": [{"dv3s7d2": [{"0_Comment Submission": "This developer isn't screwing around", "1_Text": "This actually makes me wanna check out the game.", "2_Subreddit": "gaming"}], "dv7wmzw": [{"0_Comment Submission": "A Thai businessman caught poaching a rare black leopard plans to build a highway through a pristine forest in Myanmar that is home to endangered leopards and connects two tiger sanctuaries. Conservationists, residents, and an armed ethnic group have all expressed concerns about the project.", "1_Text": "This motherfucker doesn't like leopards.", "2_Subreddit": "worldnews"}], "dv8in5a": [{"0_Comment Submission": "I'm bored. Whatcha got?", "1_Text": "Is this a fucking joke?", "2_Subreddit": "RoastMe"}], "dvczph1": [{"0_Comment Submission": "1939: Child poses with the first Mickey Mouse and Minnie Mouse costumes. Walt Disney was very unhappy with the costumes and later had them redesigned.", "1_Text": "This is truly horrifying.", "2_Subreddit": "OldSchoolCool"}], "dvij64t": [{"0_Comment Submission": "It's dangerous to go alone", "1_Text": "That's hilarious. It only took me rereading it 4 times to get it.", "2_Subreddit": "gaming"}], "dvo21ib": [{"0_Comment Submission": "What's your favourite fake memory of our non-existent friendship?", "1_Text": "Remember that time I loaned you $600? Yeah, Imma need to get that...", "2_Subreddit": "AskReddit"}], "dvo2hr9": [{"0_Comment Submission": "Just beat this game for the first time and have a question about the final boss", "1_Text": "If you look at it as a mercy killing it's not so bad.", "2_Subreddit": "darksouls"}], "dvvn01c": [{"0_Comment Submission": "The most bullshit thing I have ever seen in a game", "1_Text": "Everyone seems to find stuff about Facebook they hate but they still use it. I don't know how to fix the problem, (I stopped using it but it's still here) it's just that it's a goliath of a turd that won't go away.", "2_Subreddit": "assholedesign"}], "dvvp6w2": [{"0_Comment Submission": "The most bullshit thing I have ever seen in a game", "1_Text": "Yeah I've just been seeing a lot of posts involving Facebook in some way quite a bit lately and it just seems like another problem that might not be around if Facebook wasn't. It has more to do with me disliking it I guess.", "2_Subreddit": "assholedesign"}], "dvz3wdb": [{"0_Comment Submission": "[Image] Some people just don’t make excuses.", "1_Text": "I hate what cancer does to people. It's crazy to think that one day people may look back and think \"the cure was right under their noses\" like we do now with diseases like scurvy. Can't wait to see his progress. Good luck!", "2_Subreddit": "GetMotivated"}], "dvz8hdi": [{"0_Comment Submission": "Thoughts Of A Jellyfish by Viktor Borg Grelsson", "1_Text": "Wow. It's really good!", "2_Subreddit": "PlayingGuitar"}], "dw0ktjc": [{"0_Comment Submission": "Sir Ringo Starr was knighted today", "1_Text": "I feel like Ringo should be the one knighting people.", "2_Subreddit": "pics"}], "dw4vtce": [{"0_Comment Submission": "One of the many reasons I hate Comcast", "1_Text": "I fucking hate Comcast.", "2_Subreddit": "mildlyinfuriating"}], "dw6ng8m": [{"0_Comment Submission": "Do I as an invader, deserve to lose a CREO every 3-4 invasions due to people purposefully disconnecting?", "1_Text": "I don't necessarily agree with disconnecting but sometimes it's extremely aggravating to get invaded in the middle of a tough area with low health and only a couple estus flasks. I've jumped off cliffs before just so the ass clown invading can't get the satisfaction of taking my last slither of health and sending a \"gg no re\" message. It's argued that invading is a part of the game and that's true but you don't have to be an asshole about it. I like the idea of an invader dropping embers or efigees or whatever, and joking around from time to time. If you really want to play pvp why not join a fight club or something?       \n\ntl;dr- Probably shouldn't disconnect but you also shouldn't be an asshole when invading . It turns off new players and pisses of vets. There's always someone who WANTS to play pvp.", "2_Subreddit": "DarkSouls2"}], "dw8jr0d": [{"0_Comment Submission": "I absolutely love every game in the series but why couldn't they put bonfire ascetics in dark souls III?", "1_Text": "Dark Souls 2 had a lot of great features that I wish DS3 implemented as well. It's super cool how ng+ switches up enemies and items is DS2. All DS3 does is add a couple rings here and there. A missed opportunity. Maybe they didn't have enough time or maybe they were just being lazy.", "2_Subreddit": "DarkSouls2"}], "dw9vpb2": [{"0_Comment Submission": "just randomly starts speaking fluent german", "1_Text": "Did he ever come back?", "2_Subreddit": "thatHappened"}], "dwahidx": [{"0_Comment Submission": "If you died at this very moment, what would be in the loot crate you would drop?", "1_Text": "What's the story with the umbrella cover?", "2_Subreddit": "AskReddit"}], "dwbtq6c": [{"0_Comment Submission": "This tape is dead to me.", "1_Text": "Holy shit, that's like the worst thing that could've happened. I'm so sorry.", "2_Subreddit": "mildlyinfuriating"}], "dwcdi26": [{"0_Comment Submission": "Transitioning scales into something that sounds like music?", "1_Text": "Yeah dude, the apps like $5 and totally worth it. Search by song title or band name and watch the tabs go by as the song is playing. You can repeat a section or cut out the bass or drums. Very cool app.", "2_Subreddit": "guitarlessons"}], "dwieip4": [{"0_Comment Submission": "Iudex Gundyr", "1_Text": "Congrats. You're gonna shit when you see Champion Gundyr. By that point you'll be ready though.", "2_Subreddit": "darksouls3"}], "dwnqtdi": [{"0_Comment Submission": "Too true...", "1_Text": "Not to mention 2 decent Battlefront games! All they had to do is copy the originals!! WTF HAPPENED?", "2_Subreddit": "gaming"}], "dwnrh9a": [{"0_Comment Submission": "I got a name request from our former PRESIDENT!! 😱", "1_Text": "What's the deal with the first pen? I don't think I've ever seen one like that.", "2_Subreddit": "PenmanshipPorn"}], "dwnrrz1": [{"0_Comment Submission": "I got a name request from our former PRESIDENT!! 😱", "1_Text": "Cool thx!", "2_Subreddit": "PenmanshipPorn"}], "dwtwdko": [{"0_Comment Submission": "I'm Eric Hafner, I'm running for U.S. Congress in Portland, Oregon (OR-3). I want to legalize all drugs, including opiates, but offer ibogaine therapy too, and free drugs for addicts via prescription.", "1_Text": "Hafner for President!", "2_Subreddit": "opiates"}], "dwxvc8q": [{"0_Comment Submission": "[GEAR] My PRS SE was stolen this weekend but wanted to serve her memory here", "1_Text": "That sucks so bad. Sorry bro.", "2_Subreddit": "Guitar"}]}], "1_submissions": [{"63p43g": [{"0_Title": "Sitcom laugh tracks are really weird if you over think it.", "1_Text": "This actually makes me wanna check out the game.", "2_Subreddit": "Showerthoughts"}], "6h0le6": [{"0_Title": "It must be expensive to be a friend of the Duggar family.", "1_Text": "This actually makes me wanna check out the game.", "2_Subreddit": "Showerthoughts"}]}]}]}