{"banana_lloyd": [{"0_comments": [{"dwrgdn4": [{"0_Comment Submission": "This purple octopus is adorable!", "1_Text": "This little guy is SO goddamn cute!", "2_Subreddit": "aww"}], "dwrjqr7": [{"0_Comment Submission": "Girl playing with boyfriends gun shoots him in the head on Livestream", "1_Text": "Damn. This is brutal. I can't even fucking imagine.", "2_Subreddit": "watchpeopledie"}], "dwrknlu": [{"0_Comment Submission": "What happens when you think you need to be admitted to a psychiatric hospital?", "1_Text": "Well, it's different everywhere you go. I've been but not for mental health issues...\n\nYes, you can go to the ER. You'll be admitted to the crisis intervention unit. No, they won't handcuff you to the bed unless you're in trouble with the cops (which you obviously won't be since you're admitting yourself). You'll only be restrained if you start acting out in some way that puts yourself or others at risk.", "2_Subreddit": "TrueOffMyChest"}], "dwrlm96": [{"0_Comment Submission": "Naked Shopping", "1_Text": "Man. Go post your soft core somewhere else, bro.", "2_Subreddit": "confession"}], "dwrm0ag": [{"0_Comment Submission": "90’s Baby", "1_Text": "By trashy, you mean awesome, right?  hahaha", "2_Subreddit": "trashy"}], "dwrn7kq": [{"0_Comment Submission": "I swipe left on black guys on tinder.", "1_Text": "What the fuck is this supposed to mean? Because, you know, people of all colors aren't capable of having STDs, being violent, and being single parents. \n\nDon't be a racist piece of shit.", "2_Subreddit": "confessions"}], "dwrnytz": [{"0_Comment Submission": "Is a bra considered a type of pocket?", "1_Text": "Why would it be cool considered a pocket?", "2_Subreddit": "TooAfraidToAsk"}], "dwrovym": [{"0_Comment Submission": "SWIM feel like heroin brought my depression back.", "1_Text": "Dude, you don't have to use \"swim\"", "2_Subreddit": "opiates"}], "dwrp0za": [{"0_Comment Submission": "SWIM feel like heroin brought my depression back.", "1_Text": "Who was saying that? You used the term \"swim\" but then refer to yourself anyway, so what was the point of using it in the first place?", "2_Subreddit": "opiates"}], "dwrqhbu": [{"0_Comment Submission": "Callie will be heartbroken when she's 60+ pounds and won't be able to sleep like this anymore", "1_Text": "She won't be heartbroken because she'll still be sleeping like that.\n\nSource: I used to say the same thing about my boy when he was a baby. Eight years and 90lbs later, he still (tries to, at least) sleeps on me (and my pillow) like that.", "2_Subreddit": "aww"}], "dwrxth8": [{"0_Comment Submission": "Never burn the eagle", "1_Text": "My favorite too!", "2_Subreddit": "Cigarettes"}], "dws0vhe": [{"0_Comment Submission": "So I have a friend. [Unresolved Crime]", "1_Text": "Seems like the wrong sub to post this in...", "2_Subreddit": "UnresolvedMysteries"}], "dws0x8i": [{"0_Comment Submission": "So I have a friend. [Unresolved Crime]", "1_Text": "It's only \"unresolved\" because I assume your friend hasn't done anything about it. I would also assume, since it's a case of incest, he knows the perpetrator.", "2_Subreddit": "UnresolvedMysteries"}], "dws3g80": [{"0_Comment Submission": "Crazy dream involving my professor", "1_Text": "I don't know... do you have a crush on him?", "2_Subreddit": "offmychest"}], "dwszrcn": [{"0_Comment Submission": "When you leave the city, tinder tends to get a lot trashier.", "1_Text": "I feel this so hard. Recently moved from a big city to a much smaller one. So much trash.", "2_Subreddit": "trashy"}], "dwub7fv": [{"0_Comment Submission": "Do white men feel like they’re doing women of color a favor by dating them, or is it just me?", "1_Text": "No, I don't think you speak for all white men, asshole", "2_Subreddit": "TwoXChromosomes"}], "dwubbg9": [{"0_Comment Submission": "Do white men feel like they’re doing colored women a favor by dating them, or is it just me?", "1_Text": "Why would you stay there when he clearly doesn't want you to be there? That just doesn't make any sense. Go find someone that's not a douche.", "2_Subreddit": "dating_advice"}], "dwubhxg": [{"0_Comment Submission": "My neighbor just gave birth to two twin girls, who are now sisters to 3 other children aged 4 to 7. I bought this ADORABLE pitbull (since they’re only as aggressive as their owners) to protect them!", "1_Text": "You're a douche. Stop trolling.", "2_Subreddit": "aww"}], "dwubpf4": [{"0_Comment Submission": "Bdsm relationship??", "1_Text": "Nah, this is not normal. Using the \"BDSM relationship\" excuse is just a justification for his shitty actions.", "2_Subreddit": "offmychest"}], "dwubxsu": [{"0_Comment Submission": "I hate my new puppy.", "1_Text": "How much research did you do on the breed? She will never grow out of the being up your ass phase, she is a German Shepherd and this is what they do. \n\nNothing you've described sounds all that terrible to me at all. She is a puppy, and she actually sounds like an ok one to me. Puppies need to go out every few hours, even during the night. Puppies chew things. All normal.\n\nI honestly think you're being super harsh and maybe didn't think it through hard enough before getting her.", "2_Subreddit": "offmychest"}], "dwuc382": [{"0_Comment Submission": "My neighbor parked me in my driveway the other day forcing me to Uber to work... I left a note asking him to Venmo me for my trip.", "1_Text": "Is he really being a bro for paying for something that you demanded?", "2_Subreddit": "HumansBeingBros"}], "dwug87l": [{"0_Comment Submission": "Douglas Für - GETTING EVEN", "1_Text": "I really really really love this album.", "2_Subreddit": "FolkPunk"}], "dwvyowy": [{"0_Comment Submission": "awh", "1_Text": "I have an almost identical picture of my dogs!!", "2_Subreddit": "aww"}], "dwvyvly": [{"0_Comment Submission": "Need some help with first heartbreak", "1_Text": "Grrl, it never gets better but it gets easier.\n\nSource: currently going through the same thing. \n\nSending you so much love!", "2_Subreddit": "TwoXChromosomes"}], "dww0bfo": [{"0_Comment Submission": "Tonight I am going to bed at 8 o clock my time by choice.", "1_Text": "Just so you know, some women don't want a stomach they can do their laundry on. Not saying you're doing it for anyone but yourself but I wanted to throw that out there.", "2_Subreddit": "confessions"}]}], "1_submissions": [{}]}]}