{"Paask_en": [{"0_comments": [{"dvh8350": [{"0_Comment Submission": "Someone was upset", "1_Text": "Not really creepy, just madcunt", "2_Subreddit": "creepyPMs"}], "dvh8baz": [{"0_Comment Submission": "My friend is in some serious shit, advice?", "1_Text": "Fuuuuuck that bitch, she aint nothin but bad vibes, cut her off, tell her you're tired of her shit and can't have that kind of bullshit in your life, it's too fucking much", "2_Subreddit": "Drugs"}], "dvh9e1g": [{"0_Comment Submission": "Dad found my MDMA", "1_Text": "Is this satire? Because it fucking sounds like satire, jesus", "2_Subreddit": "Drugs"}], "dvhc88i": [{"0_Comment Submission": "Someone was upset", "1_Text": "What is rule 2?", "2_Subreddit": "creepyPMs"}], "dvhfq70": [{"0_Comment Submission": "Someone was upset", "1_Text": "That text was not creepy, just angry, dangit, can't just defy logic due to oppinions", "2_Subreddit": "creepyPMs"}], "dvhgq5t": [{"0_Comment Submission": "Someone was upset", "1_Text": "Yes, it might just be my view on this single one post that I can't find the creepy part with, but if the mods and you agree, I'll probs just change after that, since I would probs trust others more than myself in this case", "2_Subreddit": "creepyPMs"}], "dvihs5h": [{"0_Comment Submission": "Divorcing a recovering addict", "1_Text": "Honestly wish I could help here, but I'm too young to give any advice on marriage and especially when there's A kid involved, but it sounds like you need her to really prove herself, be completely honest and see if you can end up trusting her again, because if you don't and you end up together, you'll probably just keep being suspicious and think about all the bad stuff, and it'll make you miserable (only talking from experience of extreme trust breach in A previous relationship, but again, quite young, so probably not the same as your situation at all)...\n\nHope you find out something for the sake of you and your kid, and hope she gets better too and that she's changed... \n\nWishing the best of luck and positive thoughts to you, your kid and her! Wish I could give better advice", "2_Subreddit": "addiction"}], "dvij376": [{"0_Comment Submission": ">:(", "1_Text": "(G)old", "2_Subreddit": "justneckbeardthings"}], "dvkd1g5": [{"0_Comment Submission": "Scoring from unknown :/", "1_Text": "Yea thought so too, seen way too many of these scammers here in Aus with steam cards too and all that, you have some pretty dodgy \"dealers\"...\n\nBut thanks man! Thankfully I can go without em!", "2_Subreddit": "opiates"}], "dvkjfcq": [{"0_Comment Submission": "Scoring from unknown :/", "1_Text": "Yea, I tried asking him about if they were in blister pack, or loose from bottle and if he could send pics for proof, and there's been no contact since, so guessing he was A fraud 😢", "2_Subreddit": "opiates"}], "dvkjnzm": [{"0_Comment Submission": "1970s Acid head here. Hey guys", "1_Text": "Just found your account, holy shit I love it, please continue posting these stories, I love em!", "2_Subreddit": "Drugs"}], "dvkkizy": [{"0_Comment Submission": "Scoring from unknown :/", "1_Text": "Will reply with further update if there comes an answer!", "2_Subreddit": "opiates"}], "dvkknew": [{"0_Comment Submission": "Not many will care but some KPINS. Well, RIVOTRIL.", "1_Text": "Ohhh galenkia rivotril! Eaten A lot of em, puuure candy! Enjoy!", "2_Subreddit": "benzodiazepines"}], "dvm0ljm": [{"0_Comment Submission": "Meth moons", "1_Text": "Wow this is amazing! Love it!!\n\nEdit: Imo you have potential, you made me feel with your texts (just read some of em), it's like you dragged me into the feelings ish of it, keep up the good work!!", "2_Subreddit": "Drugs"}], "dvm4ulk": [{"0_Comment Submission": "Periods of sobriety feel good af after balling hard", "1_Text": "On A tollerance ish break, plus I got to anxious and paranoid from just the weed even, and this is fucking great, I can enjoy and feel like my day has been very nice and good without drugs even, watch A movie, actually not eat myself to death in snacks and shit, and I can be super productive, have A lot of motivation, and feel fantasticly confident! Very underrated indeed", "2_Subreddit": "Drugs"}], "dvmfdb2": [{"0_Comment Submission": "Periods of sobriety feel good af after balling hard", "1_Text": "Yea indeed! I can actually just wake up and get up and be ready 20 mins after I woke up atm! No need for lying in the bed for an hour before I actually get out of bed!", "2_Subreddit": "Drugs"}], "dvq0moe": [{"0_Comment Submission": "London's known for bendy buses", "1_Text": "Always starts with someone on A bus...", "2_Subreddit": "thatHappened"}], "dvq2toh": [{"0_Comment Submission": "Another early morning pickup of 4 8mg dilaudid with one broken up. Enjoy friends:)", "1_Text": "At first I thought you had carved lines into A plate, lol", "2_Subreddit": "opiates"}], "dvq4fwt": [{"0_Comment Submission": "My dude has obviously started using Walmart bags. Like many others have mentioned, I have no idea how he ties those knots.", "1_Text": "Because you'd probably rather get caught with those kind of things than A load of ziplock bags.\n\nAnd some people are just lazy cunts who aren't very service minded, I've bought 1000 ziplock bags for just 30£, it's really not pricey.", "2_Subreddit": "opiates"}], "dvq4khy": [{"0_Comment Submission": "My dude has obviously started using Walmart bags. Like many others have mentioned, I have no idea how he ties those knots.", "1_Text": "Would you rather be caught with normal bags, or A bunch of ziplock bags? And also, some people are just lazy cunts who can't be fucked.", "2_Subreddit": "opiates"}], "dvsp4mw": [{"0_Comment Submission": "found this pipe in my sons room and i think hes using it to smoke drugs . should i be worried?", "1_Text": "No, just smack him really hard with it on the back of his head, he'll get all the cracks in his head and it'll cure him", "2_Subreddit": "drugscirclejerk"}], "dwfhe8r": [{"0_Comment Submission": "Dr. thinks Seroquel could replace Benzos", "1_Text": "Yea for like A week or two, then it starts working differently", "2_Subreddit": "benzodiazepines"}], "dwfi5v8": [{"0_Comment Submission": "Dr. thinks Seroquel could replace Benzos", "1_Text": "Yea, but it works good for anxiety too for some, and also some addictions, but if it doesn't work for op after thoose 2 first weeks he/she should defo not be on them :)", "2_Subreddit": "benzodiazepines"}], "dwjbe72": [{"0_Comment Submission": "The only lean we have left in Australia 🤪. it’s over the counter tho!", "1_Text": "Wait wait wait wait, didn't they make it prescribtion by the first of feb this year?? That's what I remember it as, and I'm gonna go down and buy 2 bottles tomorrow if not, lmao", "2_Subreddit": "opiates"}], "dwk500a": [{"0_Comment Submission": "The only lean we have left in Australia 🤪. it’s over the counter tho!", "1_Text": "Oh lordie lord, I do have such A bad cough", "2_Subreddit": "opiates"}]}], "1_submissions": [{"83fe1e": [{"0_Title": "Comic books", "1_Text": "Not really creepy, just madcunt", "2_Subreddit": "thatHappened"}], "83kjnc": [{"0_Title": ">:(", "1_Text": "Not really creepy, just madcunt", "2_Subreddit": "justneckbeardthings"}], "83t0zj": [{"0_Title": "Scoring from unknown :/", "1_Text": "Not really creepy, just madcunt", "2_Subreddit": "opiates"}]}]}]}