{"arcoftime89": [{"0_comments": [{"dtwnxl4": [{"0_Comment Submission": "Blackmail", "1_Text": "Love you to man! Ha and you too myopoidwife!", "2_Subreddit": "PoppyTea"}], "dtwok72": [{"0_Comment Submission": "Ultra Sexy SN Review 10/19/18 5# T7R4257 *Direct*", "1_Text": "I'm still shocked by how bitter the 02/20 ftl was. Glad you got a good bag tho! It seems like potency is staying steadier with sn this winter compared to last winter. I mean if the 8/10's and 9/14s are as worse as its going to get, I can take that. 2-3 more months of middle of the road seeds is doable.", "2_Subreddit": "PoppyTea"}], "dtwopup": [{"0_Comment Submission": "Is that all there is my friends then let's keep dancing, let's break out the booze and have some fun, if that's all there is..", "1_Text": "It's like the movie groundhog day I swear, the 8/10's did not even last this long, maybe a month.. but I have been receiving 9/14s since mid december. Still super thankful like you said sence it could always be worse.  \n\nI believe they used two different yields or batches of seeds to fill the 9/14s, maybe even three. It seems they were decent when they first hit with a few unicorn bags here and there. But then there was those really small seeds with just a ton of red that you could see better once they are mixed with water, usually there are some red floaters but these had atleast a quarter inch of them on top, wash was dark but lacked bitterness. Still for mid January I guess we can't ask for much more.", "2_Subreddit": "PoppyTea"}], "dtyb3vm": [{"0_Comment Submission": "Ultra Sexy SN Review 10/19/18 5# T7R4257 *Direct*", "1_Text": "Yeah they have been sold out for 2 maybe going on 3 weeks now.", "2_Subreddit": "PoppyTea"}], "dtybgzu": [{"0_Comment Submission": "Ultra Sexy SN Review 10/19/18 5# T7R4257 *Direct*", "1_Text": "I have never had an inactive bag from ftl, maybe weak, like a 4/10 especially this last year more so then the previous year, but I have always vibed well with the alkaloid profile. I know many people won't even report effects from them and say they are only good for w/d or tapering. But I love them. Customer service told me in november that they were hoping to lower the price some this spring, I really hope so.", "2_Subreddit": "PoppyTea"}], "du092p8": [{"0_Comment Submission": "I don’t like my 10/19s", "1_Text": "This is just winter in pst land for you. I'm thankful sn has atleast stayed at a 4-6 general as an overall rating this winter. It always sucks in winter, this time of the season is always sporadic, but compared to last year's sn winter seeds I think things are going ok. But I feel you, thankfully these seeds help with the pain but are not as mood lifting as summer and fall seeds are.", "2_Subreddit": "PoppyTea"}], "du0azzt": [{"0_Comment Submission": "Great news with a warning", "1_Text": "Me either on a tablet.", "2_Subreddit": "PoppyTea"}], "du0bezl": [{"0_Comment Submission": "I know this isn’t the best place to ask but does anyone have experience in using benzodiazepines before surgery or procedures?", "1_Text": "I understand her point about how the half life of one being longer then the other will increase the time of potential negative results happening. But I see what you mean tho too, even tho xanax for example is digested faster the klonopin, that shorter amount of time you have a heavier effect going on increasing the risk of respiratory depression.", "2_Subreddit": "PoppyTea"}], "du0bkoq": [{"0_Comment Submission": "how’s the seed situation right now? haven’t been in the game for a little while.", "1_Text": "Remember how inconsistent sn was tho last winter? this is normal imo tho when things have been at there best this last year they are no where close to what they were back in 2015-16 at its best.", "2_Subreddit": "PoppyTea"}], "du0bl9a": [{"0_Comment Submission": "how’s the seed situation right now? haven’t been in the game for a little while.", "1_Text": "So true..", "2_Subreddit": "PoppyTea"}], "du0jekz": [{"0_Comment Submission": "I don’t like my 10/19s", "1_Text": "Im not an expert but I have always noticed that the best stuff circulates late spring threw late fall. Even the different pod. vendors i order from have way less potent pods during winter then they do in summer or fall. Last year sn had 2-4/10 rated bags in general from what I remember from around late December to until the .5er bags came out in may I think. Things gradually picked up. This last year was not so hot tho as the previous  two years were better imo. The plants stress levels react differently to heat and cold. The more stress the plant takes too, the more alkaloids it will make. I would say we have another 2 months of these middle of the road seeds until better yields make it into circulation.", "2_Subreddit": "PoppyTea"}], "du2q7yr": [{"0_Comment Submission": "Praise JJ", "1_Text": "One cup, imagine if it was the 7/18 or 6/18 which were twice as strong as the 8/18. I remember everyone was bummed out about that date being not as good as those summer batches I mentioned. But good for you bro!", "2_Subreddit": "PoppyTea"}], "du2zoa8": [{"0_Comment Submission": "Anyone try the 11/6/18 sn?", "1_Text": "Aim at cutting it in half and then keeping it lower for a couple months. Then once the seeds get better into summer you will be really happy you did.", "2_Subreddit": "PoppyTea"}], "duef89v": [{"0_Comment Submission": "In regards to my thread and the state of this sub", "1_Text": "I agree, but I see both sides. I really like this sub but I think for the survival of pst it needs to be deleted now.", "2_Subreddit": "PoppyTea"}], "dukzn1j": [{"0_Comment Submission": "Waiting all day for FedEx", "1_Text": "I could not agree more, I always do a third wash and stack them then freeze them. They are lifesavers when your waitng for your next shipment!", "2_Subreddit": "PoppyTea"}], "dukzvf4": [{"0_Comment Submission": "Afghan seeds?", "1_Text": "I agree, I think mostly because people here are from the usa(same reason some take so much offense over small stuff), most users would be shocked if they saw pods in real life. Tho over east poppies are farmed everywhere. Even out west here in the USA there are a good amount of farmers who grow somniferum which is where \"sweetpaula\" gets her product.", "2_Subreddit": "PoppyTea"}], "dv1dhw8": [{"0_Comment Submission": "Holy darkness...", "1_Text": "I trust your rating and hate to hear that, I have three 5's on the way, placed today. But who knows..and dark color does not indicate strong, just a lot of some type of alkaloids, not always the ones we want. I have had bobs that color and have it be bunk.", "2_Subreddit": "PoppyTea"}], "dve5omo": [{"0_Comment Submission": "SN or FTL?", "1_Text": "I have grabbed 3 ftl 8lbs now each week since they have been back and only the first was good. The last bag which was a 03/20 and now this one, a 04/20 both appear to be the same stock of seeds. Smaller darker immature seeds with a ton of reds revealed when you mix with water. The first good bag I got was lighter navy blues with darker greys but larger seeds and no reds hardly at all. You never know when you might get something different and get lucky with a good bag tho.", "2_Subreddit": "PoppyTea"}], "dvpp3rp": [{"0_Comment Submission": "Did my order ship?", "1_Text": "I had this happen a week ago and mine still came. The invoice was sent after the order but never a shipping confirmation. Tho ups brought it when it should have come.", "2_Subreddit": "PoppyTea"}], "dvpphxl": [{"0_Comment Submission": "Plant matter observation (recent SN)", "1_Text": "Well said.", "2_Subreddit": "PoppyTea"}], "dvww6y0": [{"0_Comment Submission": "Recent brm", "1_Text": "We're they the new zip lock bags or the old regular sealed ones?", "2_Subreddit": "PoppyTea"}], "dvwwl0d": [{"0_Comment Submission": "Bitterness", "1_Text": "Yeah for sure, bitterness can be because of poor storage issues resulting in seeds starting to go bad creating a more bitter taste, at least from my understanding. But most of the time it is a good indicator that you have a high ratio of opiates in my expierence.", "2_Subreddit": "PoppyTea"}], "dvxpti3": [{"0_Comment Submission": "This sucks.", "1_Text": "Are you not in a situation to tapper even a little. A 3 lb habit is going to be so brutal to come off to impossible as I'm sure you know. Maybe even life threatening depending on your health.", "2_Subreddit": "PoppyTea"}], "dw0g3tk": [{"0_Comment Submission": "SN 11/26 TR3738 and TR16**", "1_Text": "I have not had an order of the darkness yet and I just got a t1 and a t10 3738. Wash is dark dark. And no plant matter at all. Not crazy bitter. \n\nUpdate: not inactive so that's good but not very strong either imo. I ordered last friday by the way. I'm still having break threw pain even after dosing a lb.", "2_Subreddit": "PoppyTea"}], "dwqdl52": [{"0_Comment Submission": "Jeff Sessions, Donald Trump say 'tough it out' without opioids but they never felt my pain", "1_Text": "I have seen a few ashville and black mountain papers like once a month already talking about it all.", "2_Subreddit": "opiates"}]}], "1_submissions": [{"6rnyk9": [{"0_Title": "I need some advice", "1_Text": "Love you to man! Ha and you too myopoidwife!", "2_Subreddit": "PoppyTea"}], "6vca1i": [{"0_Title": "Interesting doctors visit.", "1_Text": "Love you to man! Ha and you too myopoidwife!", "2_Subreddit": "PoppyTea"}], "6vnfwu": [{"0_Title": "If you do one benificial thing for pst today, please", "1_Text": "Love you to man! Ha and you too myopoidwife!", "2_Subreddit": "PoppyTea"}], "70rf7g": [{"0_Title": "My dear god!", "1_Text": "Love you to man! Ha and you too myopoidwife!", "2_Subreddit": "PoppyTea"}], "739kxg": [{"0_Title": "Sn spanish", "1_Text": "Love you to man! Ha and you too myopoidwife!", "2_Subreddit": "PoppyTea"}], "747oub": [{"0_Title": "Anybody order new sn spain?", "1_Text": "Love you to man! Ha and you too myopoidwife!", "2_Subreddit": "PoppyTea"}], "76jrty": [{"0_Title": "Current Ftl 10/19 review", "1_Text": "Love you to man! Ha and you too myopoidwife!", "2_Subreddit": "PoppyTea"}], "77fqn1": [{"0_Title": "Review sn 7/15 t4r42897", "1_Text": "Love you to man! Ha and you too myopoidwife!", "2_Subreddit": "PoppyTea"}]}]}]}