{"percstoperkyouup": [{"0_comments": [{"dwfl1id": [{"0_Comment Submission": "Can anyone explain to me what “scripts” are?", "1_Text": "You'll learn what sex lights are if you try to fill a \"blank script\" too. It's highly *highly* likely they are already on the radar of the major agencies. Run away Will Robinson!", "2_Subreddit": "opiates"}], "dwfm2ol": [{"0_Comment Submission": "Crazy shit my roommate says volume 3 : hardcore edition", "1_Text": "Only if she's determined to be a danger to herself or others (physical danger, like the stabby stabby or bangy bangy kind) or cannot provide basic necessities (food, water, shelter, warmth) for herself. Typically only family, doctors or law enforcement can seek an involuntary mental health hold though.", "2_Subreddit": "opiates"}], "dwfmwtc": [{"0_Comment Submission": "Crazy shit my roommate says volume 3 : hardcore edition", "1_Text": "Drug psychosis is real! Thanks for taking one for the team to give those like me entertaining stories to read.", "2_Subreddit": "opiates"}], "dwfo8ez": [{"0_Comment Submission": "$10,000 a week for H???", "1_Text": "When Larry and Jen were so upset with him a couple seasons back and were telling the crew that he had burned his last bridge with them but not why was a huge tipoff. He has been obviously fucked up on the show for so long, but it was a huge surprise that his new wife didn't see he was NQR? I call bullshit! Especially when the audio came out from his swerving while driving to his wedding episode, she knew exactly what the fuck was going on. It's not like the show doesn't have a history of turning their cast into addicts sadly. Or unleashing Farrah on the world.", "2_Subreddit": "opiates"}], "dwfp4ws": [{"0_Comment Submission": "$10,000 a week for H???", "1_Text": "Me too! Those kids are now in the double digits and I remember when their parents were on 16 and pregnant. Most of them have multiple kids and multiple divorces under their belts and I'm still on 1 and 1 (of course I have, albeit questionable at times, morals). \n\nI take it all with a grain of salt since reality shows are notorious for giving false information to string viewers along. He does seem like that big of an idiot who would pay that much without asking questions though.", "2_Subreddit": "opiates"}], "dwfpfz4": [{"0_Comment Submission": "What is the most valuable prescription one could POSSIBLY obtain", "1_Text": "Hypothetically humor me. Why does one want to know?", "2_Subreddit": "opiates"}], "dwfr50f": [{"0_Comment Submission": "Sick hours after small amounts of hydrocodone, wd or allergy? Also found gastritis", "1_Text": "Do you take other medications as well or are you only taking the hydrocodone? A typically allergic reaction is hives, trouble breathing, swelling of the lips, tongue, mouth, rash, itching. It sounds more like something is causing inflammation of your stomach and the hydrocodone is making it worse. I'm wondering if it's not the Tylenol that is the culprit here. You can ask to be put on 2.5 oxycodone without APAP and see if that put an end to your problem. It's probably time to discuss your reaction to certain medication with your GI doctor and get their opinion on it.", "2_Subreddit": "opiates"}], "dwg25pu": [{"0_Comment Submission": "What is the most valuable prescription one could POSSIBLY obtain", "1_Text": "Yeah. Because that is going to get someone anywhere!", "2_Subreddit": "opiates"}], "dwgpwbe": [{"0_Comment Submission": "$10,000 a week for H???", "1_Text": "I have never come across someone that makes me want to shank a bitch more than her! She's a vapid sucking black hole of negativity and narcissism who eats small children, hopes, and joy for breakfast. I am going to laugh my ass off when a judge throws her lawsuit out of court. I'll laugh even more if it does make it and the defense makes her get a psych evaluation because she's a fucking lunatic!", "2_Subreddit": "opiates"}], "dwlw6o2": [{"0_Comment Submission": "The cravings are so bad during WD and I can’t get any dope or subs for a few days... I’m basically begging for advice", "1_Text": "Yeah, because that little plan will never blow up in your face...", "2_Subreddit": "opiates"}], "dwm1f1l": [{"0_Comment Submission": "The cravings are so bad during WD and I can’t get any dope or subs for a few days... I’m basically begging for advice", "1_Text": "This is turning into a \"hold my beer\" train of thought. Unless you have an advanced physics degree the variables are too vast to calculate to achieve minimal injury. White knuckle it unless it gets too severe and then go to any moderately sized ED and explain what is going on. Most allow their doctors to dispense a single dose of Suboxone while the patient is there, but cannot write for a take home script. Spend enough time in an ED and you'll pick up a thing or 2 without inflicting grievous bodily harm to yourself 1st. I accidentally hit a fucking semi 10ish years ago and I'm still having surgery to this day and never hit my face on anything.", "2_Subreddit": "opiates"}], "dwpy6xp": [{"0_Comment Submission": "Doxylamine Succinate in Codeine Pills?", "1_Text": "Doxylamine is an OTC sleep aid that most people know as Unisom. Too much of it can cause seizures, but depending on your tolerance it might knock you out for a good 8 hours.", "2_Subreddit": "opiates"}], "dwq0bff": [{"0_Comment Submission": "Doxylamine Succinate in Codeine Pills?", "1_Text": "Depends on your tolerance really. If you are already taking something to help with sleep then it's going to be higher than a normie. I take 12 of the little blue fuckers every night and it still takes me forever to get to sleep. It can also help pregnant women with morning sickness.\n\nIf you've ever taken the recommended amount for a dose of Nyquil and it knocked your ass out you have shit for tolerance. It contains Doxylamine (hence the NY part of Nyquil) and I think it's 25mg per dose.", "2_Subreddit": "opiates"}], "dwt0osp": [{"0_Comment Submission": "Anyone ever heard of these or taking them ? Just wondering how they make you feel.", "1_Text": "Great for migraines when you're allergic to triptans!", "2_Subreddit": "opiates"}], "dwt4s6q": [{"0_Comment Submission": "Thanks doc", "1_Text": "Is that your urinary catheter dragging on the floor? I rather enjoy a PCA myself with the joy buzzer myself, relief just a button poke away!", "2_Subreddit": "opiates"}], "dwt7beh": [{"0_Comment Submission": "100mg tromidoal?", "1_Text": "It still doesn't mean shit. Unless your doses are at optimal levels and you don't intentionally add something that has a long history of causing seizures you are still at risk of having seizures. Tramadol acts like an SSRI and is especially dangerous if you are already taking an SSRI since it can cause serotonin syndrome. I've been taking 3 or 4 different anti-epileptic medications for years and they didn't do shit when I have had any of my seizures. In fact 1 of them might be binding with my dedicated anti-epileptic and lowering the levels in my blood below therapeutic levels. Don't trust that this or that medication will insulate you from the side effects of one that has a proven history of terrible side effects.", "2_Subreddit": "opiates"}], "dwt7r0d": [{"0_Comment Submission": "Bernese method", "1_Text": "Is it Bernese method (like the region in the Swiss alps where the Bernese Mountain Dog breed comes from) or Burmese method (like the country of Burma)?", "2_Subreddit": "opiates"}], "dwtip9b": [{"0_Comment Submission": "Bernese method", "1_Text": "I went to trusty old Google to look the answer up, then decided to take a shower. It's a fancy name for microdosing which (and I'm sorry if it's worked for you. Rock on with your bad self since you're a minority) seems to have a super low rate of success. Especially since you're still stuck in addict mode and want the pain to stop since as humans we're adept at finding a way to make it stop no matter the method. Should have known it was the Swiss who have proposed the idea of this working. They're always on the forefront of hairbrainded medical studies. Stick to breeding Bernese Mountain Dogs Switzerland!", "2_Subreddit": "opiates"}], "dwtj5wa": [{"0_Comment Submission": "Anyone ever heard of these or taking them ? Just wondering how they make you feel.", "1_Text": "Mine too since I have an allergy to triptans and GI issues that make it painful to take anything other than acetominophin. Ketorolac is the 1st thing you'll get for pain at my hospital unless you ask for something different. It has a history of causing death in older patients (learned this from working in a clinic and needed something to stop a 3 day \"migraine\") so doctors tend to take sides quickly. I had a UC doc try to give me a torodol shot for a kidney stone, but I didn't want to be miserable from the kidney stone on the left and the injection site on my right ass cheek.", "2_Subreddit": "opiates"}], "dwtjinu": [{"0_Comment Submission": "Thanks doc", "1_Text": "How did you do that? 1 cough and I was in tears because the stupid balloon had moved and that was after 8 hours!", "2_Subreddit": "opiates"}], "dwtrj3l": [{"0_Comment Submission": "Felt like you guys would appreciate this", "1_Text": "Yep, that explains Portland, OR to a T!", "2_Subreddit": "opiates"}], "dwvbned": [{"0_Comment Submission": "Getting opiates filled.", "1_Text": "Not with an opiate it isn't. They'll either tell you ice/heat, give you some simple exercises to do, or prescribe you a muscle relaxer. The only time I've seen valium prescribed with opiates is after back surgery.", "2_Subreddit": "opiates"}], "dwvca0l": [{"0_Comment Submission": "These are a LIFE SAVER when using. What’s your favorite anti-nausea medicine or remedy?", "1_Text": "I had the delightful combination of Zofran and Phenergan once.", "2_Subreddit": "opiates"}], "dwvf4va": [{"0_Comment Submission": "Has being on opiates affected your nerves when off opiates?", "1_Text": "I'm a bitch when I'm on my meds. I'm a fucking cuntcake with too big of a mouth and too quick on the snark off of them. Combine Irish ginger with a filter malfunction and too much time on her hands to think with massive pain and a hairtrigger response and you have the super delightful human that is I. I'm surprised I'm still married to a person every day.", "2_Subreddit": "opiates"}], "dwxqqg8": [{"0_Comment Submission": "Getting opiates filled.", "1_Text": "So have I, but never for a broken bone. Valium is most effective as a muscle relaxer in the back, neck, and core and it's typically prescribed after everything else has been tried and failed. If someone can stomach it (literally, it can cause vomiting because it decreases blood flow to the stomach) Tizanidine (Zanaflex) is the best option since cyclobenzaprine has serious side effects. Honestly, splinting it will be the most helpful at getting rid of those muscle spasms.", "2_Subreddit": "opiates"}]}], "1_submissions": [{"7yfv0u": [{"0_Title": "Long time lurker first time posting", "1_Text": "You'll learn what sex lights are if you try to fill a \"blank script\" too. It's highly *highly* likely they are already on the radar of the major agencies. Run away Will Robinson!", "2_Subreddit": "opiates"}], "859o5g": [{"0_Title": "Back in the hospital overnight", "1_Text": "You'll learn what sex lights are if you try to fill a \"blank script\" too. It's highly *highly* likely they are already on the radar of the major agencies. Run away Will Robinson!", "2_Subreddit": "opiates"}], "87p0bc": [{"0_Title": "I'm not on Meth! An update.", "1_Text": "You'll learn what sex lights are if you try to fill a \"blank script\" too. It's highly *highly* likely they are already on the radar of the major agencies. Run away Will Robinson!", "2_Subreddit": "opiates"}]}]}]}