{"Crazylegs100": [{"0_comments": [{"dvyhkny": [{"0_Comment Submission": "How would a revolution take place in a developed economy such as the United States?", "1_Text": "Dope thanks man", "2_Subreddit": "communism101"}], "dw1oon8": [{"0_Comment Submission": "Anyone else have a slew of other legal drugs they use to balance/potentiate their opiates?", "1_Text": "Kratom has agonists and antagonists in there I belive so that makes sense!", "2_Subreddit": "opiates"}], "dw3dla7": [{"0_Comment Submission": "Taking a bath", "1_Text": "those fake tits look absolutely ridiculous", "2_Subreddit": "NSFW_GIF"}], "dw4051q": [{"0_Comment Submission": "Russian winter wonderland", "1_Text": "I'm sayin...You see people openly expressing happiness and your first thought is to post it on snapchat like \"look at these weirdos.\"", "2_Subreddit": "ANormalDayInRussia"}], "dw41bi4": [{"0_Comment Submission": "Wendy's manager gives customer the business", "1_Text": "That warrants a Vince McMahon reaction tbh", "2_Subreddit": "PublicFreakout"}], "dw44015": [{"0_Comment Submission": "Streamer finds out his teammate is playing Fortnite in class", "1_Text": "Playing in class is one thing, but the audacity to be on mic whispering is a whole other level of ballsy lmao.", "2_Subreddit": "ContagiousLaughter"}], "dw6cn6n": [{"0_Comment Submission": "Weekly Free Talk Friday thread!", "1_Text": "I mean, are you being aggressive? Yelling at her forcefully? Posturing? If not, it's good to be conscious of it if you think it may be problematic, but don't trip too hard about it. What behaviors does she seem scared by?", "2_Subreddit": "MensLib"}], "dw6eozs": [{"0_Comment Submission": "Weekly Free Talk Friday thread!", "1_Text": "Seems like your gf is being unreasonable bro. You know what aggressive behavior looks like. You can't control how people percieve you.", "2_Subreddit": "MensLib"}], "dwankwb": [{"0_Comment Submission": "How to cope with depression and revolutionary beliefs?", "1_Text": "May be an unpopular opinion but here goes: chill with telling people how stoked you are about a violent revolution lol. ofc you're wigging people out...use some judgement...get involved in working for labor rights, some shit u are stoked about, but for right now don't push ppl away bc of ur political beliefs\n\nEdit: also seek clinical assistance", "2_Subreddit": "communism101"}], "dwayrjr": [{"0_Comment Submission": "Well guys, one of my older plugs just hit me up a few hours ago and I’m sure you can guess the rest...", "1_Text": "Stay quit duuuuuuuude", "2_Subreddit": "opiates"}], "dwbe0nf": [{"0_Comment Submission": "How to cope with depression and revolutionary beliefs?", "1_Text": "Hey man if you ever want to have a constructive convo feel free to hmu! Not really your style though, huh?", "2_Subreddit": "communism101"}], "dwbrfi0": [{"0_Comment Submission": "How to cope with depression and revolutionary beliefs?", "1_Text": "I didn't tell him to swallow a handful of antidepressants out the gate. Even if psychotherapy was intended to make you economically productive, their goal is to get you functioning at your best. At that point, do what the fuck you want.\n\nBecause doctors are capitalists, we shouldn't seek treatment? Same shit. \n\nMental health care is important", "2_Subreddit": "communism101"}], "dwc81f9": [{"0_Comment Submission": "rock bottom", "1_Text": "lmao dude got rid of the evidence", "2_Subreddit": "BlackPeopleTwitter"}], "dwd9n7e": [{"0_Comment Submission": "My worst nightmare if I’m in a hostage/gunman situation", "1_Text": "Wya? Not available for me in the US :(", "2_Subreddit": "BlackPeopleTwitter"}], "dwf8yux": [{"0_Comment Submission": "Two shorties going at it", "1_Text": "I was waiting for on of em to shoot a double leg", "2_Subreddit": "StreetFights"}], "dwku3h1": [{"0_Comment Submission": "Joe Budden gets into an altercation with racist old man (Action starts at 1:15)", "1_Text": "Nah one of his boys was telling him what he was saying.", "2_Subreddit": "PublicFreakout"}], "dwo7978": [{"0_Comment Submission": "Oxy + nicotine + hot-ass shower = the most relaxed ending to my weekend", "1_Text": "You smokin in the shower witcho nasty ass? Jk bro enjoy", "2_Subreddit": "opiates"}], "dwun1t6": [{"0_Comment Submission": "Most effective least painful way to commit suicide", "1_Text": "Ever think about rolling the dice radically before you go? For example, go be a homeless busker in Europe. Work on foreign organic farms or something. Might as well try a mode of living that you haven't even considered--what have you got to lose?\n\nTotally your choice and I respect that but the bottom can be a really interesting place to take risks. \n\nGood luck brother", "2_Subreddit": "cripplingalcoholism"}], "dwy3g9h": [{"0_Comment Submission": "I have never done any opiates. I've been browsing this sub for ~2 hours now.", "1_Text": "I agree that clean safe opiates should be legally available for those already addicted. But freely available opiates for the public? Nah man, you'll have hella people getting hooked and hooked hard. Maybe I'm confused about what you're arguing for, but there would be so many fucking consequences if you could get oxy at walgreens. \n\nNot tryna come at you sideways, I'd like to hear all arguments on the issue.", "2_Subreddit": "opiates"}], "dwy3i66": [{"0_Comment Submission": "I have never done any opiates. I've been browsing this sub for ~2 hours now.", "1_Text": "Hell yeah brother keep fighting", "2_Subreddit": "opiates"}], "dwy3okh": [{"0_Comment Submission": "I have never done any opiates. I've been browsing this sub for ~2 hours now.", "1_Text": "Skip it all if you can man. DARE is bullshit, but god damn it, they are trying to scare you for a reason.\n\nI've got an addicts brain, so I won't speak for everyone (some people can use safely--is it worth rolling the dice?), but I wish I had never fucked with stims, opiates, benzos, or even alcohol (psychs are ight with me).", "2_Subreddit": "opiates"}], "dwy3sq1": [{"0_Comment Submission": "I have never done any opiates. I've been browsing this sub for ~2 hours now.", "1_Text": "What evidence are you basing this on? I'd  like to see it. Anecdotal as hell, but everybody I know that's fucked with opiates has had a rough go of it.", "2_Subreddit": "opiates"}], "dwy7pp6": [{"0_Comment Submission": "I have never done any opiates. I've been browsing this sub for ~2 hours now.", "1_Text": "I'm familiar with Dr. Hart. Really interesting dude. I actually heard him on Joe Rogan's podcast, and he was talking about how great opi-oids/ates were for all kinds of uses lol. \n\nI'll look into it when I'm at my computer, but I just struggle with the idea that the majority of people using H/Oxy are doing so responsibly and without negative consequences. I might make a post around here about what I find.", "2_Subreddit": "opiates"}], "dwye8w8": [{"0_Comment Submission": "I have never done any opiates. I've been browsing this sub for ~2 hours now.", "1_Text": "I hear that, but I think that the temptation becomes a bit more difficult to resist when you could get it over the counter. I think that most drugs should be legalized but really potent opioids? I think it would be problematic. It's really hard to get people to understand the pull of addiction until they're balls deep.", "2_Subreddit": "opiates"}], "dwyeaqn": [{"0_Comment Submission": "Oops my bad dude.", "1_Text": "Shoot your fuckin shot man. You're gonna die one day", "2_Subreddit": "BikiniBottomTwitter"}]}], "1_submissions": [{"4ovrue": [{"0_Title": "[Music]Hollohan - My Lost Love & Addiction, Most raw and emotional hip hop track", "1_Text": "Dope thanks man", "2_Subreddit": "Frisson"}], "5z2e1m": [{"0_Title": "Tweaker time", "1_Text": "Dope thanks man", "2_Subreddit": "Stims"}], "70hhd8": [{"0_Title": "Simpletons, swipe left", "1_Text": "Dope thanks man", "2_Subreddit": "iamverysmart"}], "73iz41": [{"0_Title": "Personality crisis", "1_Text": "Dope thanks man", "2_Subreddit": "Drugs"}], "741ugr": [{"0_Title": "Physical after effects of hexen & ethylphenidate binge", "1_Text": "Dope thanks man", "2_Subreddit": "researchchemicals"}], "7x628i": [{"0_Title": "Always taper when stopping prolonged use", "1_Text": "Dope thanks man", "2_Subreddit": "phenibut"}], "88epod": [{"0_Title": "And I'm going to say this--is is that...", "1_Text": "Dope thanks man", "2_Subreddit": "TigerBelly"}]}]}]}