{"MeAndTheMoon1612": [{"0_comments": [{"dwu467b": [{"0_Comment Submission": "today would’ve been your 23rd birthday. i miss you everyday darlin’ 💔", "1_Text": "The majority of people on this sub have seen people go far too early and still continue on a pattern of behavior that may leave their loved ones equally bereaved. Honestly, continuing to do drugs when you have children is selfish, but it speaks to how powerful the disease of addiction is, especially when it comes to opiates. How can you begin to make the decision to get clean when you know that doing so hurts so bad?", "2_Subreddit": "opiates"}], "dwu4woq": [{"0_Comment Submission": "I'm Eric Hafner, I'm running for U.S. Congress in Portland, Oregon (OR-3). I want to legalize all drugs, including opiates, but offer ibogaine therapy too, and free drugs for addicts via prescription.", "1_Text": "Instead of taking such drastic measures as legalizing Ibogaine, a drug which has a stark 1 in 300 fatality rate, why not work towards making pharmaceuticals with a better safety profile more readily available? \n\nThere is far more research supporting the use of methadone and buprenorphine for treating addiction, but these medicines aren’t widely available. \n\nBe it waiting lists, patient caps, dry areas, or financial restrictions, many addicts don’t have access to these medications that have already been approved by the FDA to treat addiction disorders. \n\nYou’re only one person, and as you are not a pharmacologist, chemist, or otherwise qualified to conduct pharmacological research, you ought to know that your chances of achieving your goal of legalizing ibogaine are next to nill. \n\nThe last thing that this community of opioid dependent souls needs is more empty promises. And in my opinion , Ibogaine treatment needs to be researched far more, and as admirable as you intentions may be, you lack to resources to do so. \n\nIf you want to make a difference in this community and help stem the opioid epidemic, you would be better off supporting prevention, decriminalization (which you mentioned and I commend you for), harm reduction, availability of services, and accessibility of affordable health care. \n\nThink about it. Even if by some divine miracle Ibogaine became legal tomorrow...who could afford it? Not the people here who are struggling to finance their habits on a daily basis. Pharmaceuticals are most expensive when first released. Take Hepatitis C medications for example...sofosbuvir (sovaldi) treatment when first released to the public cost upwards of 1000 dollars a day! \n\nI admire what you are trying to do, I just don’t think it’s feasible . I think there are several other far more viable treatment options to pursue making more widely available that would benefit those addicted to opioids.", "2_Subreddit": "opiates"}], "dwu6l1m": [{"0_Comment Submission": "The poorer, the fatter: Obesity is not randomly distributed across the U.S. It is linked to demographics, community characteristics, income inequality, and race, 500-city analysis shows.", "1_Text": "I wouldn’t classify beans in a tortilla as healthy at all. Beans and tortillas are both rich in carbohydrates. Some tortillas contain upwards of 50 grams of carbohydrates. Not to mention that a healthy diet is balanced, and two bean tortillas a day is not a balanced diet. So “extremely healthy” is a complete stretch. Not to mention the sodium in canned goods.", "2_Subreddit": "science"}], "dwu74j8": [{"0_Comment Submission": "The poorer, the fatter: Obesity is not randomly distributed across the U.S. It is linked to demographics, community characteristics, income inequality, and race, 500-city analysis shows.", "1_Text": "I agree. My boyfriend and I aren’t well off, I’m a student and he’s a store manager for a retail chain. We have a daughter. Yet, we still manage to plan and eat healthy, balanced meals at home. Our daughter has never once eaten fast food, and we haven’t either in the last five years even though our town is flooded with them. Our schedules are both hectic, but we take the time to cook. We understand nutrition labels and the importance of balanced meals. \n\nI see the drive ways being slammed all day every day, and I have done the math. I think it would be more expensive to eat fast food than the meals I cook, let alone the cost of the toll it takes on your health.", "2_Subreddit": "science"}], "dwy2r2a": [{"0_Comment Submission": "I'm Eric Hafner, I'm running for U.S. Congress in Portland, Oregon (OR-3). I want to legalize all drugs, including opiates, but offer ibogaine therapy too, and free drugs for addicts via prescription.", "1_Text": "Thanks for the reply,! I do understand where you are coming from. I was an IV heroin user for many years. I was on methadone for three years, and subutex for two after that. It’s a lengthy process for sure, but it did save my life. \n\nI do have to say honestly my opinion may be slightly affected by the fact that Ibogaine scares the shit out of me. Hardcore psychedelics like that just scare me. I’ve had a terrible acid trip, and that happened whilst knowing that LSD would not kill me. I can’t imagine how anxious I would be on a drug that could be deadly. \n\nI think Ibogaine has its place, but I think it needs to be researched more. Unfortunately in this country, the FDA, doctors, and big Pharma are a nasty trifecta, with the end goal being financial gain as opposed to the well being of our citizens. \n\nAt least if it were legal, people could take it in a controlled setting where they have access to immediate health care should it be necessary. And in the end I suppose even a 1 in 300 fatality rate is better than the fatality rate of addicts who cannot break their cycle of addiction. I did watch a documentary not too long ago, in which a doctor (in the US) was approved to do a small study on Ibogaine. Maybe if more doctors push for this, it will gain some traction. I’m sure with more research, we could make it safer.", "2_Subreddit": "opiates"}], "dwy2zzx": [{"0_Comment Submission": "I'm Eric Hafner, I'm running for U.S. Congress in Portland, Oregon (OR-3). I want to legalize all drugs, including opiates, but offer ibogaine therapy too, and free drugs for addicts via prescription.", "1_Text": "I do agree that legalizing Ibogaine could hurt the pockets of Big Pharma, and they would not be likely to let that happen. The FDA, Big Pharma, and the prescribing doctors are a nasty trifecta, more concerned with financial gain than the well being of our  citizens. \n\nIf it were legalized and administered in a controlled environment, I’m sure it would be of benefit to many people. I just feel at this point, the little money this country is  spending on treating the opioid epidemic is already being misappropriated, and I wish we would see more money going toward treatment options that have been proven to help. Methadone, buprenorphine, someday maybe even Ibogaine.", "2_Subreddit": "opiates"}], "dwy31vc": [{"0_Comment Submission": "I'm Eric Hafner, I'm running for U.S. Congress in Portland, Oregon (OR-3). I want to legalize all drugs, including opiates, but offer ibogaine therapy too, and free drugs for addicts via prescription.", "1_Text": "I understand that it does get abused, but it does work for many people. I quit my 5 year IV heroin habit by using methadone for three years. So while it may not be the answer for all, it works very well for some. \n\nTreatment options aren’t one size fits all, and I’m sure even Ibogaine would help many people overcome their addictions. I just, for many reasons, don’t think legalizing it is feasible and I wish we would dedicate more of our resources to providing treatment options that have proven successful to addicts.", "2_Subreddit": "opiates"}]}], "1_submissions": [{}]}]}