{"CatharsisOfDisorder": [{"0_comments": [{"dwgf0id": [{"0_Comment Submission": "whisper lingo question", "1_Text": "Meaning I’m going to check this thread for ideas so I can try as well", "2_Subreddit": "opiates"}], "dwgf6ln": [{"0_Comment Submission": "Long time lurker, first time poster", "1_Text": "True true, I would be pretty surprised at myself if I did cop some H but it feels like that would admit that I have a problem I can’t control in my ass backwards mind. I have a mentality that’s saying “if I stick to the drugs I was prescribed, it’s ok” I know that some addiction shit. I’ve also just never tried H so I don’t really know what to expect", "2_Subreddit": "opiates"}], "dwghm46": [{"0_Comment Submission": "Long time lurker, first time poster", "1_Text": "Only because I’ve taken methadone pills before and they were a great high from what I remember.", "2_Subreddit": "opiates"}], "dwh2rt7": [{"0_Comment Submission": "Question about methadone dosing", "1_Text": "I just downed the rest of the little bottle, the woman that took my info told me the methadone won’t allow me to get high off other opiates. Is this true? Is there naltrexone in this stuff? The last time I took it I had just gotten outta jail and it got me really buzzed. Obviously having not dosed anything in 40 days had something to do w that but I’d also taken some in between oxy hookups and don’t remember it having any adverse affects on my DOC’s potency, am I gonna go into PAWS from having dosed this stuff?", "2_Subreddit": "opiates"}], "dwh51n9": [{"0_Comment Submission": "Question about methadone dosing", "1_Text": "Feeling a very nice high from this first dose, definitely happy about this venture. Still wondering if I paid too much though and I have no idea if each bottle is the same dose for everyone or if they’re different from patient to patient.", "2_Subreddit": "opiates"}], "dwh81ql": [{"0_Comment Submission": "Question about methadone dosing", "1_Text": "Ah 10-4 thanks for the heads up. Apologies for my naivety, I’m new here haha", "2_Subreddit": "opiates"}], "dwh89qy": [{"0_Comment Submission": "Question about methadone dosing", "1_Text": "Good to know, he peeled the label off and I forgot to ask him at the time. I did get his number though!!! I asked him “how strong are these? Forgot to ask” in a text. He Hasn’t replied, hope I didn’t piss him off. I’m no spring chicken when it comes to phone etiquette, been doing this for a long time (I’m 35) but some people want zero text allusion to stuff like that", "2_Subreddit": "opiates"}], "dwhugft": [{"0_Comment Submission": "Question about methadone dosing", "1_Text": "Dude just hit me back and said it was 90! God damn no wonder I feel high as gas. How long y’all think I gotta wait to dose a roxy to where it’s worth doing?", "2_Subreddit": "opiates"}], "dwiccrd": [{"0_Comment Submission": "Bought a few bottles of take homes cold copping at the clinic, been high as fuck all day by mistake", "1_Text": "I take 60-90mg/day of roxy and I dosed at 9:30 this morning. Been feeling pretty buzzed all day, I worked from 11-7:30. Definitely did not expect this strength nor did I ever in a million years think that methadone could cause an overdose, I’m fine fwiw. Also I feel like ppl may have misconstrued how much I took, I took one of the doses not all three", "2_Subreddit": "Methadone"}], "dwj97av": [{"0_Comment Submission": "Question about methadone dosing", "1_Text": "Yeah I apologize for coming over there and asking questions along the lines of  “how does my dumb ass get high today?” I do appreciate the info from the folks that responded to the dosing question. I deleted that thread fwiw", "2_Subreddit": "opiates"}], "dwj9wqq": [{"0_Comment Submission": "Late night scavenger hunt", "1_Text": "Mind sharing what those keywords are? In a message maybe? I have had zero luck w craigslist and offer up", "2_Subreddit": "opiates"}], "dwjawmz": [{"0_Comment Submission": "Super embarrassing but I took 10mg of Hydrocodone over the course of about 3 days now. Am I royally fucked for an upcoming drug test?", "1_Text": "Do you not have an old pill bottle for hydro you can bring to the lab w you? Just say Your back was hurting and your weren’t sure if these pills you took are something they test for", "2_Subreddit": "opiates"}], "dwjbvig": [{"0_Comment Submission": "First time for everything I guess", "1_Text": "Did smoking just that little bit get you high? I’ve got 5 blues rn that if love to make last a bit longer and I’d have to eat that whole chunk of pill to get high. I’ve never smoked em before, might try it today", "2_Subreddit": "opiates"}], "dwjczqp": [{"0_Comment Submission": "First time for everything I guess", "1_Text": "After reading all the posts about how smoking blues is a waste I’m just gonna keep eating em, interesting to hear ppls thoughts though", "2_Subreddit": "opiates"}], "dwjrlfd": [{"0_Comment Submission": "What is your experience with urinalysis and old prescriptions to explain positive results?", "1_Text": "Yeah very good point, I realize asking “how long does it stay in my system” is like asking “how long is a piece of string?” Thanks for the info regarding the dose vs original script and the dates. Really glad I didn’t just march in there thinking I’m in good shape. Where would one acquire fake piss? The head shop? Just buy it on the internet? I’ve always passed drug screens in the past using the Detox drinks but the last time I took one was YEARS ago. \n\nI wonder if the employer would give a shit, I imagine they would but I don’t know what their HR/hiring discretion policy is. Prob shouldn’t leave it to chance regardless", "2_Subreddit": "opiates"}], "dwjrrhe": [{"0_Comment Submission": "What is your experience with urinalysis and old prescriptions to explain positive results?", "1_Text": "Also I’m sure any screening is done at a lab like LabCorps or something along this lines. At least this is how it was done the last time I took a screening for a very different job. They sent me to the lab after the interview and had me bring back the results in a sealed envelope", "2_Subreddit": "opiates"}], "dwjsbx1": [{"0_Comment Submission": "What is your experience with urinalysis and old prescriptions to explain positive results?", "1_Text": "It’s kinda similar to like leftover crack ya know?? Ha I just mean the old prescription BOTTLES haha", "2_Subreddit": "opiates"}], "dwk34ew": [{"0_Comment Submission": "What is your experience with urinalysis and old prescriptions to explain positive results?", "1_Text": "Oh Jesus! That must have scared the shit out of you. I wonder if Wellbutrin would show up as an amphetamine? I have a prescription for it and I’ve never actually taken it but I have heard it can act like a stimulant", "2_Subreddit": "opiates"}], "dwk3tjs": [{"0_Comment Submission": "Fuck I don't even like tramadol but it's all I could find .. the cute cougar barber got them for me for 50 cents a piece and threw in a 2mg bupe for free it's what she uses for pain management", "1_Text": "I can still get a decent buzz off trams if I take like 150-250mg even after years of eating roxys daily. Years ago I was buying trams online (not even DWM) like once a month. It was my drug of choice at the time bc of its availability and price, kept me off the harder shit too and kept my pain at bay. I miss that for real.\n\nLast time I bought em online before they were scheduled they arrived and turned out to be fake. No idea what it was, they looked legitimate but they had zero effect. Never ordered anymore after that. When that went away I found a dude who would get 120 count bottles from the VA clinic and he would sell me the entire bottle for $60, pretty sure he got locked up because I haven’t seen him in over a year, pity too cuz I’d have no problem sustaining off just trams, but they’re seriously harder for me to find than blues!!", "2_Subreddit": "opiates"}], "dwk4zwh": [{"0_Comment Submission": "PRAISE JJ! Can’t even believe it HA!", "1_Text": "Been totally dry for days and I was digging around in my stash pocket trying to find a pen when...HOLY SHIT! Look what I fucking found!! I am so pumped haha, granted I’ll only be feeling good for the next few hours but I still can’t fuckin believe it! No idea how long that’s been in there!", "2_Subreddit": "opiates"}], "dwk98oe": [{"0_Comment Submission": "PRAISE JJ! Can’t even believe it HA!", "1_Text": "My best guess is that a few weeks ago I went on a bit of a bender on blues and I thought I ate it. I keep em in this kind of inconspicuous side pocket of my bag that opens up pretty big. Inside that I keep them in a transparent plastic “day/night” two sided pill container. Sometimes I’ll open the pill container with my hand still in the bag while I’m doing something else and it must have just slipped out. Whatever happened I definitely tore into the whole bag tonight trying to find more!!", "2_Subreddit": "opiates"}], "dwk99tn": [{"0_Comment Submission": "PRAISE JJ! Can’t even believe it HA!", "1_Text": "Nailed it", "2_Subreddit": "opiates"}], "dwlii9t": [{"0_Comment Submission": "What’s up with these oxy RP 15’s that look like tramadol?", "1_Text": "Been getting these from one of my dudes that stopped getting the greens bc they’re a cheaper script for him to fill. They’re definitely 100% legitimate, straight from the local pharmacy. They’re 15mg oxycodone IR, they’re big, have no APAP but must have some sorta filler. What do they fill these with and why do they suck? \n\nSnorting them is certainly possible but they yield a huge pile of powder for 15mgs of oxy, I mostly eat my pills anyway but I feel like these are not as strong as greens either. Maybe I’m just imagining it. Anyone else get these things and know any more about em?\n\nAnother question for y’all, he gave me these benzos for free (the pink and white capsules) but I’ve never taken these ones before, they’re 7.5 temazepam. Any recreational value or dosing comparatives to diazepam or the like? I don’t particularly love benzos anymore, kinda lost a taste for em but I always keep a stash.", "2_Subreddit": "opiates"}], "dwov13m": [{"0_Comment Submission": "Found this in my children (17 yo) room.. help identify", "1_Text": "Instead of going on an online forum full of degenerate drug users to try and find out what you found while searching your child’s belongings why don’t you ask your kid? God forbid you have to talk to your children about difficult subjects. Parents that don’t communicate with their almost grown kids piss me off, that’s how how we all ended up here in the first place. 20 years ago when I was your kids age my parents did the same kinda shit. I bet yours did too didn’t they?", "2_Subreddit": "opiates"}], "dwrgf30": [{"0_Comment Submission": "Anyone ever sneak shit on a plane??", "1_Text": "Yes to pills. Every single time multiple times a year in varying amounts and variety, never with a prescription. Don’t try to hide em just put them with all your other toiletries", "2_Subreddit": "opiates"}]}], "1_submissions": [{"87x2kb": [{"0_Title": "Long time lurker, first time poster", "1_Text": "Meaning I’m going to check this thread for ideas so I can try as well", "2_Subreddit": "opiates"}], "881d1a": [{"0_Title": "Question about methadone dosing", "1_Text": "Meaning I’m going to check this thread for ideas so I can try as well", "2_Subreddit": "opiates"}], "88df3h": [{"0_Title": "What is your experience with urinalysis and old prescriptions to explain positive results?", "1_Text": "Meaning I’m going to check this thread for ideas so I can try as well", "2_Subreddit": "opiates"}], "88f8m6": [{"0_Title": "PRAISE JJ! Can’t even believe it HA!", "1_Text": "Meaning I’m going to check this thread for ideas so I can try as well", "2_Subreddit": "opiates"}], "88ls8j": [{"0_Title": "What’s up with these oxy RP 15’s that look like tramadol?", "1_Text": "Meaning I’m going to check this thread for ideas so I can try as well", "2_Subreddit": "opiates"}]}]}]}