{"mydadwillfighturdad": [{"0_comments": [{"do9n87p": [{"0_Comment Submission": "Music shitpost", "1_Text": "good ol' johnny hobo <3", "2_Subreddit": "opiates"}], "dpclfhw": [{"0_Comment Submission": "WTH?? Could be going on with me??", "1_Text": "I had a batch with effects comparable to this maybee 6 months ago. It was my usual fishscale guy and it had all the tell tale signs of it being amazing coke. But later in the night, I felt like i had railed sand paper. I had a very \"raw\" feeling throat if that explains? Never experienced it like that before.", "2_Subreddit": "Drugs"}], "dqf3iqk": [{"0_Comment Submission": "Almost no visuals on 360mics LSD?", "1_Text": "Take all 4 at the same time, tolerance builds up quickly with lucy.", "2_Subreddit": "Drugs"}], "dqw2j5b": [{"0_Comment Submission": "[Connecticut] Need last minute advice on how people think court is going to go for me [Freaking out :(]", "1_Text": "thank for the reassurance, i appreciate it. that might be the best option", "2_Subreddit": "legaladvice"}], "drcn1wy": [{"0_Comment Submission": "Ambien and Xanax ?", "1_Text": "Ahhh good ole' zambien! I did a stupid amount of ambein in high school and I remember mixing the two. It was always a good time but i'd always end up crying over nothing. At least for me, when I mix the two I get a  very strong urge to cry about nothing.", "2_Subreddit": "Drugs"}], "drcs11d": [{"0_Comment Submission": "Ambien and Xanax ?", "1_Text": "It hurts like a fucker but it's not the worst thing i've ever snorted bad. I'd compare it to snorting molly, sting wise.", "2_Subreddit": "Drugs"}], "ds73wkn": [{"0_Comment Submission": "Question relating to LSD and Non Epileptic Seizures", "1_Text": "Just be aware acid lowers the seizure threshhold. I've had a decent amount of non-epileptic seizures; most have happened the morning after tripping or i've had one happen after a hike. I haven't really seeked any medical adivce on it other then when I was at the hospital after my seizure. What i've gathered is vitamins, proper sleep before hand, and good food in the belly usually does it for me. \n\nMe and your amigo could have a completely different situation just offering what i've \nlearned. Hope he has a great trip :)", "2_Subreddit": "Drugs"}], "dsopvfj": [{"0_Comment Submission": "Have some new stuff in my blog, if you haven't checked it out before you should now!", "1_Text": "YES :) keep making more. glad i saw this i hit you up sometime back to tell you how fire theyare!!", "2_Subreddit": "opiates"}], "dtnz8u0": [{"0_Comment Submission": "Should I go back an cop again? Never know when you're getting real pharmaZ and it's annoying! [Wrong sub I kno )", "1_Text": "no brother they're all xanax bars :) some very cute ones might i add! take some for me would yah?", "2_Subreddit": "opiates"}], "duj7wg6": [{"0_Comment Submission": "I couldn’t help but take a picture of the monster rock I got with this pickup", "1_Text": "how much was the whole thing? :o i'd imagine it's a zip with the chunks in the back?", "2_Subreddit": "opiates"}], "duj8p7w": [{"0_Comment Submission": "I couldn’t help but take a picture of the monster rock I got with this pickup", "1_Text": "i've seen people talk about that on here that'd throw me off x.x enjoy my friend :) stay safe", "2_Subreddit": "opiates"}], "dv6idp7": [{"0_Comment Submission": "Verification of carfentanyl in bags?", "1_Text": "what about all the carfent seizures coming from china to the USA", "2_Subreddit": "opiates"}], "dv6k24m": [{"0_Comment Submission": "Verification of carfentanyl in bags?", "1_Text": "i'm confused as to what argument you're trying to hold here o.o so you want proof of carfent coming in to the US but you've done some and are aware what risks it bring. \n\nI think the fact there is so many analogs should be more worrysome instead of which one is in your bag. just my 2 cents", "2_Subreddit": "opiates"}], "dvcab6h": [{"0_Comment Submission": "2gs of #4, quarter g of DMT, and a teenth of fire tweak :3", "1_Text": "whats a tenth o.o expected to see a 10th of a gram and that looks wayyy more than a .1", "2_Subreddit": "opiates"}], "dvcablg": [{"0_Comment Submission": "2gs of #4, quarter g of DMT, and a teenth of fire tweak :3", "1_Text": "enjoy tho!:)", "2_Subreddit": "opiates"}], "dvq9gpn": [{"0_Comment Submission": "Drunk, high, but taste buds to the sky", "1_Text": "clean your bong bro", "2_Subreddit": "shittyfoodporn"}], "dwubg0l": [{"0_Comment Submission": "The come up", "1_Text": "can't say i've ever seen rocked up h look like that before o.o how is it friend? \n\nalso is it ecp?", "2_Subreddit": "opiates"}], "dwubp9j": [{"0_Comment Submission": "The come up", "1_Text": "thank you for the knowledge :)", "2_Subreddit": "opiates"}], "dww21b7": [{"0_Comment Submission": "Dab pens", "1_Text": "yerp", "2_Subreddit": "Drugs"}]}], "1_submissions": [{}]}]}