{"jakehopt": [{"0_comments": [{"dvp7oaj": [{"0_Comment Submission": "Don't try it.", "1_Text": "We're a fucked up bunch that's for sure. I love it, but hate it.", "2_Subreddit": "equelMemes"}], "dvto8e3": [{"0_Comment Submission": "Instant DIY Ultra-Budget gaming wheel (No chair needed)", "1_Text": "Wait what game is this?", "2_Subreddit": "gaming"}], "dvvig63": [{"0_Comment Submission": "285bhp of unreliable, incredible fun", "1_Text": "Those are cool, wish we had them in the states. Reminds me of my Fiat 500... I loved it but damn it was an unreliable POS", "2_Subreddit": "UserCars"}], "dvwdkeu": [{"0_Comment Submission": "Repost: just found on my local...", "1_Text": "When I was using I had to go out of town to Vegas on business once. I used this exact method to pick up; it was awfully scary.", "2_Subreddit": "opiates"}], "dvwduai": [{"0_Comment Submission": "Repost: just found on my local...", "1_Text": "Yeah this isn't a red flag, cops wouldn't waste their time doing something like this. At least not regular cops, it's not a normal way of putting out a sting. They're more traditional, or at least we'd be hearing about stings in this manner. \n\nI literally picked up this way once in Vegas, I was using back then and ended up basically needing this shit. So I hit the chick up, she wanted me to meet at a sketch hotel, I pulled up, walked and saw the car, total beater. I knew then it was legit and the pills were legit. So it all went well, I stayed good for the 4 days I was there finished the last one off as I was boarding to come home.\n\nCrazy what we do to satisfy our addiction isn't it? I would NEVER have thoguht about hitting up a random craigslist ad I saw while literally searching for \"roxy\" and went through each ad, most were for legit Roxy clothing, then came across this random ad that said \"Size 30, really RELAXED fit, 12 pair available, blue's HMU\" and it was an actual person doing that shit legit, idk how long something like that would last but I just made it happen.", "2_Subreddit": "opiates"}], "dvwe7x4": [{"0_Comment Submission": "You too can detox like a pro!!! Magic new formula!!! Pain free, 100% detox in 12 hours!!! Only $59.99!!! (I wish).", "1_Text": "You know how desperate people get in WD... I bet these things sell left and right. People just looking for SOME kind of escape or shortening of the hell. Then by the time they buy it and try it, whether it's a placebo effect or actually helps, it's too late to return it.", "2_Subreddit": "opiates"}], "dvwq3e9": [{"0_Comment Submission": "Repost: just found on my local...", "1_Text": "Ahh yeah, didn't think about that side of things. Definitely didn't while I was out of opiates and in a foreign city.", "2_Subreddit": "opiates"}], "dvx1yp6": [{"0_Comment Submission": "AWESOME FUCKING SCORE TODAY, ASK ABOUT ME AND ILL SHOW YOU HOW TO COP THIS ILL FIRE!!!!!", "1_Text": "It's possible. I thought the same thing as you; then I went to someone close to me for help. They got me into a FREE, I mean 100% didn't cost me a dime to get in or after I was finished. 7-day Medical Detox program in my area. It was a good 2 hour drive from my place but worth it, I came out 5 days later clean as a whistle, past all withdrawal symptoms and a script for some clonidine which was instrumental in getting past WD's. All in all it was completely worth it, sure after that you're going to be mentally vulnerable, but google medical detox in your area and I promise there is a program out there you may qualify for where it won't cost you a dime other than getting to their facility. \n\nI personally had to get there super early, and hope I was one of the 10 they might admit that day depending on how many left. It was sketchy, but all in all I got in. Although after I got in I sat there watching person after person get denied which was kinda sad when they WANT to get clean, but the place can only support so many people at once. \n\nFelt like a prison kind of, and I was around some much harder people than myself. Made friends with some certified fucking psycho's while I was there, but glad when I got out I had just made the plunge and did it. Because after 5 days of very little to no withdrawal thanks to their meds, it blows your mind you get off that easy. The problem after that was the mental cravings, but that was Dec 2015 and I haven't touched that shit since.", "2_Subreddit": "opiates"}], "dw33gu9": [{"0_Comment Submission": "Should I 🅱️ O O F a Tylenol 3.", "1_Text": "Hahhaha", "2_Subreddit": "opiates"}], "dw3ql3g": [{"0_Comment Submission": "So i got my ass aressted for prostitution on 8/12/18.did all happened while my girl was away ad not only once while the prostitution. Because insteAd of pay ing rent or finding an appt.", "1_Text": "Holy shit you made no sense there dude. I kinda got what you were saying but I can assume english isn't your 1st, 2nd or 3rd language?\n\nEDIT: But yes dude, you ARE a piece of shit. I don't know why you'd post this, no one here is going to feel bad for you considering what a fucking asshole you were to her, and yeah, you deserve jail time.", "2_Subreddit": "opiates"}], "dw4xurp": [{"0_Comment Submission": "Just took delivery of my 2010 P7B Ford Crown Victoria Police Interceptor!", "1_Text": "They'll sell cars to twelve year olds?! \n\nHahahh I'm just messing with you; just look young. That's sick man it's gonna be a great car. I've put about 8k miles on my 2007 since I got it and I'm loving every second.", "2_Subreddit": "CrownVictoria"}], "dw4zfyl": [{"0_Comment Submission": "Focus STedan..I’ve decided to start a ST conversion on my 2014 Sedan like fifteen52’s project ST pictured below", "1_Text": "Wait I've seen this car before lol, are you this guy: http://www.focusst.org/forum/other-builds/33455-building-st-ford-won-t-2012-se-sedan-undergoing-st-conversion-10.html", "2_Subreddit": "FocusST"}], "dw7afmk": [{"0_Comment Submission": "Got arrested", "1_Text": "Well then I just don't see the point of this comment at all hahahahahahahahahahahahahahahahha O M E G A LUL", "2_Subreddit": "opiates"}], "dw8nqnx": [{"0_Comment Submission": "Now this is milk drinking!", "1_Text": "I'll try reposting, that's a good trick!", "2_Subreddit": "equelMemes"}], "dwdb8qe": [{"0_Comment Submission": "My Kleemann E-550 4Matic in the garage", "1_Text": "I'm all about tuned German cars, Renntech, AMG, Brabus, Alpina, i'm with it. But the badging for the word KLEEMANN looks straight out of the \"Autozone\" badge isle and looks not at all at home on the back of a modern Merc like yours. What kind of package do you have on it?", "2_Subreddit": "mercedes_benz"}], "dwdy3dw": [{"0_Comment Submission": "My Kleemann E-550 4Matic in the garage", "1_Text": "Yeah I'm with it bud, didn't mean for my comment to sound like I'm talking shit. It's badass for sure to have a modified Mercedes in general, especially one most folks won't know of.", "2_Subreddit": "mercedes_benz"}], "dwk8fyt": [{"0_Comment Submission": "Drug test for work on Monday morning and I CANNOT lose this job!! Help?", "1_Text": "What do you mean \"unsupervised\"? I've had to take all of my job urine screenings at a hospital or small medical facility, definitely supervised. A nurse would bring you into this room that had a smaller room with a toilet and sink, you'd be given a cup, she'd make you run a hand along your waistband to make sure there wasn't anything hiding there, and then you'd have to piss, not be allowed to flush, then you'd set the cup in this swinging cubby door and she'd take it out the other side. \n\nThe only drug tests that are \"supervised\" as in they are WATCHING you whip your junk out and piss, is in government testing like parole, probation, that type of criminal stuff. Otherwise NO test is going to be that kind of supervised.", "2_Subreddit": "opiates"}], "dwkbghi": [{"0_Comment Submission": "This guy with a custom V10 engine in an Audi", "1_Text": "Similar but identical huh? So the exact same? hahaha I know what you were trying to say but I guffaw'd outloud.", "2_Subreddit": "Audi"}], "dwobkk1": [{"0_Comment Submission": "Fell Asleep In My Hometown, Woke Up Stranded Almost 200 Miles Away With Clothes, Writing Supplies, Solar Panels and Excitement To Lose My Hitchhiking Virginity", "1_Text": "I'm sorry but you're telling me you fell asleep, and slept through someone lifting you onto a truck and stealing your shit?\n\nCome on dude.", "2_Subreddit": "opiates"}], "dwogtta": [{"0_Comment Submission": "Got busted drunk asf coming home", "1_Text": "Jesus christ, ti's their house, their rules. Suck it up and live by them until you're 18 then just move out or quit bitching. You're an underage kid, you're ddrinking illegally. Whether she said you could go out or not, assuming that she \"knew I would be drinking\" is a typical young kid answer. Come on bud, you know you shouldn't be drinking.\n\nYes, the addy script thing is unsettling, but if you give her problems because of it you're just stooping to their level. If you really want to stop it, then call the doctor, and cancel it all.", "2_Subreddit": "Drugs"}], "dwsqpi2": [{"0_Comment Submission": "Teenager accepted by all 20 top-ranked universities he applied to — with full scholarships", "1_Text": "Report this spammer... the site is bullshit and he's making multiple posts", "2_Subreddit": "breakingnews"}], "dwswmgq": [{"0_Comment Submission": "\"Is Weed Addictive?\" Shut the fuck up already.", "1_Text": "Jesus christ you seem triggered lol. Stop judging how other people live their lives and just live your own. \n\nI agree with some points you make, but calling someone \"subhuman\" for enjoying smoking alone, playing video games, and just doing things they enjoy in general makes zero sense. It discredits any decent points you made, because now it just reads as \"I'm a mad, angry teenager who thinks I know how the world works, and if you your way of living doesn't match mine then you're a piece of shit\".\n\nGet outtttta here. You'll learn in another 10 years or so that none of this matters.", "2_Subreddit": "Drugs"}], "dwt3qu7": [{"0_Comment Submission": "I believe iPhone X has a major issue that will only become apparent as the US moves into Summer. I am on my 4th iPhone X. All replaced by Apple due to over heating issues. I am in Australia, we have just had our Summer.", "1_Text": "I live in Texas but I got mine shortly after launch while it was cool. I'll say when it's in the Otterbox Defender I got when I purchased the phone that mug gets HOT. I had to stop using certain fast chargers because I'm so freaked out about how hot it's getting. One time it overheated while I was in the middle of a speaker-phone call, had Maps running, and hotspot going. It runs WAYYY too hot.", "2_Subreddit": "apple"}], "dwt6ge5": [{"0_Comment Submission": "\"Is Weed Addictive?\" Shut the fuck up already.", "1_Text": "Look I've seen all the posts about your \"smoking experiment\", and giving advice like your a goddamn doctor to people on the internet. You need to turn off Rick & Morty, and chill out lol. Stop trying to be some beacon of knowledge. What you had your first shroom trip and suddenly you're god's gift to the internet?", "2_Subreddit": "Drugs"}], "dwt7u7h": [{"0_Comment Submission": "\"Is Weed Addictive?\" Shut the fuck up already.", "1_Text": "Hey I would never ask someone to stop learning, go for it. You just go around like some pompous know-it-all. I'm just trying to take you down a peg, you're young, experimenting with different drugs, then spouting out advice as if it's gospel. That's dangerous.\n\nI'm starting to get the feeling you're a pretty quiet, withdrawn person IRL, and the opposite on the internet. I get it. Be safe bud", "2_Subreddit": "Drugs"}]}], "1_submissions": [{"4p3ufb": [{"0_Title": "1988 Ford F-150 302 moves to a 331 Stroker Kit (With Brand New White Factory Color Paint Job)", "1_Text": "We're a fucked up bunch that's for sure. I love it, but hate it.", "2_Subreddit": "Trucks"}], "4p3uro": [{"0_Title": "1965 Chevrolet C10 w/ LS1 Swap [2048x1365]", "1_Text": "We're a fucked up bunch that's for sure. I love it, but hate it.", "2_Subreddit": "carporn"}], "4p3ymk": [{"0_Title": "Massive Cam on Camaro SS [Spotted in Mckinney, Tx]", "1_Text": "We're a fucked up bunch that's for sure. I love it, but hate it.", "2_Subreddit": "Chevy"}], "4plgcc": [{"0_Title": "1971 Dodge Challenger [2896x1944]", "1_Text": "We're a fucked up bunch that's for sure. I love it, but hate it.", "2_Subreddit": "carporn"}], "4q3xyl": [{"0_Title": "Photographed a 2015 Mustang EcoBoost [5184x3456]", "1_Text": "We're a fucked up bunch that's for sure. I love it, but hate it.", "2_Subreddit": "Mustang"}], "4qujw9": [{"0_Title": "Changed the oil in our '16 GT today. 8 quarts of Joe Gibbs Racing Oil", "1_Text": "We're a fucked up bunch that's for sure. I love it, but hate it.", "2_Subreddit": "Mustang"}], "4t1wwx": [{"0_Title": "Looking for a clean, lower-mile FG2", "1_Text": "We're a fucked up bunch that's for sure. I love it, but hate it.", "2_Subreddit": "Honda"}], "55l98j": [{"0_Title": "Washed and Detailed - 95' F-150", "1_Text": "We're a fucked up bunch that's for sure. I love it, but hate it.", "2_Subreddit": "Trucks"}], "56o655": [{"0_Title": "Dodge Charger Hellcat in Bonham, TX", "1_Text": "We're a fucked up bunch that's for sure. I love it, but hate it.", "2_Subreddit": "spotted"}], "578sfi": [{"0_Title": "Porsche 911 Carrera Cabriolet - Very clean", "1_Text": "We're a fucked up bunch that's for sure. I love it, but hate it.", "2_Subreddit": "spotted"}], "599dcm": [{"0_Title": "Back in High School my Father bought me a 2009 Mustang GT for my 18th birthday... I miss the 4.6 big yo", "1_Text": "We're a fucked up bunch that's for sure. I love it, but hate it.", "2_Subreddit": "UserCars"}], "5jnxbh": [{"0_Title": "Started skating a week ago...can't find answers to something", "1_Text": "We're a fucked up bunch that's for sure. I love it, but hate it.", "2_Subreddit": "NewSkaters"}], "5jydd5": [{"0_Title": "Need help determining what brand this is!", "1_Text": "We're a fucked up bunch that's for sure. I love it, but hate it.", "2_Subreddit": "fashion"}], "5k1yyo": [{"0_Title": "Real shit - Never change Reddit", "1_Text": "We're a fucked up bunch that's for sure. I love it, but hate it.", "2_Subreddit": "funny"}], "5k7178": [{"0_Title": "My new 2005 Nissan Altima SL - 2.5L", "1_Text": "We're a fucked up bunch that's for sure. I love it, but hate it.", "2_Subreddit": "Nissan"}], "5rdc48": [{"0_Title": "New Complete - Put it together myself for the first time haha", "1_Text": "We're a fucked up bunch that's for sure. I love it, but hate it.", "2_Subreddit": "NewSkaters"}], "5s501e": [{"0_Title": "Sherman, TX (Or all of Texoma)", "1_Text": "We're a fucked up bunch that's for sure. I love it, but hate it.", "2_Subreddit": "Skatemeetups"}], "5ueyhh": [{"0_Title": "First time trying curbs - video", "1_Text": "We're a fucked up bunch that's for sure. I love it, but hate it.", "2_Subreddit": "NewSkaters"}], "5uqaoc": [{"0_Title": "Replacing Ricta 99a wheels with Mini-Logo 90a's", "1_Text": "We're a fucked up bunch that's for sure. I love it, but hate it.", "2_Subreddit": "NewSkaters"}], "5v9vuy": [{"0_Title": "Learning some cool simpler tricks - Anti Casper", "1_Text": "We're a fucked up bunch that's for sure. I love it, but hate it.", "2_Subreddit": "NewSkaters"}], "63iyij": [{"0_Title": "New board setup", "1_Text": "We're a fucked up bunch that's for sure. I love it, but hate it.", "2_Subreddit": "NewSkaters"}], "7v2c98": [{"0_Title": "Looking to get tint put on the Merc soon but need your guys examples (LF cars w/ 25% tint on front doors, 25% or less on back & rear windshield)", "1_Text": "We're a fucked up bunch that's for sure. I love it, but hate it.", "2_Subreddit": "CrownVictoria"}], "7wq7e1": [{"0_Title": "My first 60% board - KB Paradise V60 Plus Mini - Vintage caps w/ Cherry MX Clears", "1_Text": "We're a fucked up bunch that's for sure. I love it, but hate it.", "2_Subreddit": "MechanicalKeyboards"}], "7zkky7": [{"0_Title": "Hifonics Brutus 1100w w/ Soundqube HDS3.115 (15\" DVC wired @ 1 ohm)", "1_Text": "We're a fucked up bunch that's for sure. I love it, but hate it.", "2_Subreddit": "CarAV"}], "834rpe": [{"0_Title": "[US-TX] [H]CM MasterKey L [W] Venmo/Apple Pay/Square", "1_Text": "We're a fucked up bunch that's for sure. I love it, but hate it.", "2_Subreddit": "mechmarket"}]}]}]}