{"ghettoprinsessa": [{"0_comments": [{"dvq7zur": [{"0_Comment Submission": "DAE just stare into the fridge?", "1_Text": "All the time. When I visit my mum I go stare in the fridge and cupboards first. It's a habit I can't break. :D", "2_Subreddit": "proED"}], "dvq89vn": [{"0_Comment Submission": "Mental Illness and IF", "1_Text": "I suffer from anxiety and have some problems with eating and IF has helped me a bit. Fasting seems to uplift my general mood and make me feel better about myself. It also has reduced binge eating which is amazing. I've suffered with binging since I was a kid, almost 20 years.", "2_Subreddit": "intermittentfasting"}], "dvxs972": [{"0_Comment Submission": "Anyone tried these my friends who hsve had them say they're decent thats all i know tho", "1_Text": "I've had those! Great stuff, took only a half and the roll was perfect imo.", "2_Subreddit": "MDMA"}], "dvy1234": [{"0_Comment Submission": "Thank you (from a chronic pain patient)", "1_Text": "Hey, thank you for the thank you. I know what it's like to live with chronic pain. I got an arthritis when I was 17. I recovered from it... kinda. There's no arthritis anymore but the pain is still there and the doctors aren't willing to help me. I'm turning 23 next month so I've lived with chronic pain for 6 years now. On worst days I can't walk properly, yet the doctors say nothing's wrong. Pfft.\n\nI'm sure I'm not nearly as much in pain as you are but the chronic pain is one of the many, many reasons I am addicted to opiates these days. This is just rambling now but I guess I just wanted to say that I understand your situation.", "2_Subreddit": "opiates"}], "dvy1a6o": [{"0_Comment Submission": "Mental Illness and IF", "1_Text": "It indeed is crazy! It's unbelievable how much eating (and not eating) affects our lives and mental health.", "2_Subreddit": "intermittentfasting"}], "dvzlyot": [{"0_Comment Submission": "Question: MDMA is traditionally known as a party drug, but I'm thinking of getting some for myself and my SO for an evening in, watching movies, dancing, having sex etc. Would MD be enjoyable in this situation i.e just the two of us at home? Thank you!", "1_Text": "Sounds like you'll have the most amazing roll ever. I don't understand how some people get all energetic and dance on MDMA. I just want to lay down and chill every time I roll. :D", "2_Subreddit": "MDMA"}], "dw192xd": [{"0_Comment Submission": "I HATE the binge-restrict cycle!", "1_Text": "I hate it too! Everything's fine when I restrict but after a month or so it switches to binging non-stop and gaining everything I've lost. I'm trying to break a binge cycle right now but it's so hard.", "2_Subreddit": "proED"}], "dw198v4": [{"0_Comment Submission": "DAE go through phases of an eating disorder", "1_Text": "I switch between restricting and binging. My cycles usually last around a month and change again. It's just so frustrating that I never am able to lose weight as much as I want. :(", "2_Subreddit": "proED"}], "dw19dnq": [{"0_Comment Submission": "Whats your favorite meal to skip? Or your favorite time to eat your OMAD?", "1_Text": "Breakfast is the easiest meal to skip for me. Eating right after waking up is a bad idea for me, I can't control my intake when I'm not fully awake.\n\nI don't do OMAD but if I did I would probably eat my meal in the afternoon, between 3 and 5pm.", "2_Subreddit": "proED"}], "dw9xq54": [{"0_Comment Submission": "Finland's homeless crisis nearly solved. How? By giving homes to all who need.", "1_Text": "Yet it is still hard to rent an apartment. I've been homeless for a year next month, my fiancé has been for two years. We are in debt so our credit isn't good and that makes getting a home hard as fuck.", "2_Subreddit": "homeless"}], "dwbjo32": [{"0_Comment Submission": "Things I should know before moving to Rovaniemi, finland?", "1_Text": "The winter in Finland is long and freezing. Right now it's almost April and it's still snowing where I live. The temperature can drop under -30 celsius degrees during the winter. You all will need warm clothing for winter.\n\nThe people are quiet and may seem angry at first but when you get to know them you'll realize Finns aren't that angry. The resting bitch face syndrome is quite in common here.\n\nWelcome to Finland! I hope you and your family will enjoy this country! :)", "2_Subreddit": "Finland"}], "dwbk144": [{"0_Comment Submission": "Opiates are the silver lining in living w/ chronic pain", "1_Text": "I'm not an active poster here but I love this sub. People are nice and I love all the quality memes.\n\nI, too, suffer from chronic pain and that's one of the many reasons why I'm addicted to opiates. I have chronic joint pain from reactive arthritis i got after having chlamydia. On the worst days I can't walk much but the doctors think there's nothing wrong with me as there is no inflammation going on anymore. This sucks but opiates make it a bit less awful.", "2_Subreddit": "opiates"}], "dwbky9s": [{"0_Comment Submission": "[Other] The label says zero sugar but it's the colour of the regular coke... Is it just me or is that stressful af?", "1_Text": "r/mildlyinfuriating\n\nDamn it, coke! >:(", "2_Subreddit": "proED"}], "dwbm6me": [{"0_Comment Submission": "Favorite Snack or drink while nodding?", "1_Text": "Sugar free Sprite/7up ♡ And sour candy tbh. I could live on those.", "2_Subreddit": "opiates"}], "dwbsimb": [{"0_Comment Submission": "Anyone had any experience with bupernorphine? Been on about three weeks and am reading some pretty scary online info....anyone...bueller?", "1_Text": "I'm a buprenorphine addict. Subutex is my go-to choice but I won't say no to Suboxone either. What's scaring you about it?", "2_Subreddit": "opiates"}], "dwd580p": [{"0_Comment Submission": "Anyone had any experience with bupernorphine? Been on about three weeks and am reading some pretty scary online info....anyone...bueller?", "1_Text": "Coming off of it is hard. The withdrawals last long and are painful. I tried to quit last December, was sober (well, on Lyrica but without sub) for 3 weeks and gave up because I still wasn't feeling well.", "2_Subreddit": "opiates"}], "dwd5bh7": [{"0_Comment Submission": "Opiates are the silver lining in living w/ chronic pain", "1_Text": "Actually it's quite in common to get reactive arthritis after you've had an infection of some sort untreated for a while. At least that's what the doctors told me.", "2_Subreddit": "opiates"}], "dwip3ke": [{"0_Comment Submission": "CMV: Siltsu on Suomen kovin/viimeinen rokkitähti", "1_Text": "Go Siltsu!", "2_Subreddit": "Suomi"}], "dwpwpd5": [{"0_Comment Submission": "I like the MDMA comedown", "1_Text": "That's the afterglow. The comedown sucks.", "2_Subreddit": "MDMA"}], "dwq71le": [{"0_Comment Submission": "ashamed", "1_Text": "No need to be ashamed. I don't know why you are homeless but life's hard sometimes. You're a strong person for surviving this.", "2_Subreddit": "homeless"}], "dwq7zo0": [{"0_Comment Submission": "Suboxone to get through the night and tomorrow day. Cost $15 for one strip ($10 pharm.)What price do u get them for?", "1_Text": "It's up to 80€ for 8mg here in Finland. I usually pay 45-60€ for 8mg here. It's cheaper in the south Finland and get more expensive in the north. I live in th east. Sucks to be a Finnish sub fiend tbh.", "2_Subreddit": "opiates"}], "dwq8kg3": [{"0_Comment Submission": "Random Baby just puked on me", "1_Text": "I feel the baby. I always puke in situations when it's not okay. Once I puked into my water bottle in a work meeting where I sat behind my boss. No one noticed it.", "2_Subreddit": "Drugs"}], "dwseizw": [{"0_Comment Submission": "I know what my problem is-- I want to use heroin forever.", "1_Text": "I feel the same way about subs. I'm never going to get clean.", "2_Subreddit": "opiates"}], "dwseuvy": [{"0_Comment Submission": "Do you prefer uppers or downers?", "1_Text": "100% downers. I enjoy speed and MDMA some times though but I'd rather just take my daily dose of buprenorphine any day.", "2_Subreddit": "Drugs"}], "dwukg93": [{"0_Comment Submission": "Suboxone to get through the night and tomorrow day. Cost $15 for one strip ($10 pharm.)What price do u get them for?", "1_Text": "Hey there fellow Finn! I know, oxy is damn expensive. 1 euro/1 mg. I just stick to subs because of it. It's very dry where I live right now though so subs are expensive too. >.< If we had h here I'd probably accidentally kill myself though.", "2_Subreddit": "opiates"}]}], "1_submissions": [{}]}]}