{"macmagnet": [{"0_comments": [{"dwn8sol": [{"0_Comment Submission": "What do people call dope where you live?", "1_Text": "I call it smack, most people I say it around think I'm talking about some sort of crack lmao", "2_Subreddit": "opiates"}], "dwpap0d": [{"0_Comment Submission": "Happy Easter Speed Balling Br/opiates!!", "1_Text": "LMFAO I actually busted out laughing at work :p", "2_Subreddit": "opiates"}], "dwpaqk3": [{"0_Comment Submission": "Happy Easter Speed Balling Br/opiates!!", "1_Text": "As soon as I saw it I hopped on eBay and ordered it no bullshit it should be here in the next couple days haha", "2_Subreddit": "opiates"}], "dwpaw66": [{"0_Comment Submission": "Happy Easter Speed Balling Br/opiates!!", "1_Text": "If you only knew how good my plug is.... Your grandmother's grandmother would feel it in her grave if you hit a bump of this shit. Bet.", "2_Subreddit": "opiates"}], "dwpb1kq": [{"0_Comment Submission": "Happy Easter Speed Balling Br/opiates!!", "1_Text": "I just picked it up 3 days ago, I like it alot but the key could be a bit better quality lol. I was trying to find something that will hold my patches and a cooling pad wild remaining inconspicuous at work :p", "2_Subreddit": "opiates"}], "dwpbb59": [{"0_Comment Submission": "Happy Easter Speed Balling Br/opiates!!", "1_Text": "Nah bro not while you're on the dirty F, be running to the shitter every 5 minutes to hit bumbs when you can just mix a drink with this shit and be cool for 5 hours. Plus if I were to mention the price I pay for a quarter it would make a lot of these fellas uncomfortable in their seats lol. This batch would have you glued to that peep hole for a minute!", "2_Subreddit": "opiates"}], "dwpp3ax": [{"0_Comment Submission": "This is Us (Dope Fiend Edition)", "1_Text": "Wow, that hit a nerve. I'm looking in a fucking mirror....", "2_Subreddit": "opiates"}], "dwpt91x": [{"0_Comment Submission": "This is Us (Dope Fiend Edition)", "1_Text": "Yeah it helps to talk about it for sure. I took 14 10/325 hydro's when I was first going through withdrawal and it was like taking Tylenol. If you're that way with that, don't ever touch Fent... I've overcame alcohol, snuff, meth, coke, tramadol, Oxy, the list goes on. Fent destroyed my life in 3 months with only a painful death to leave in it's wake...", "2_Subreddit": "opiates"}], "dwptlb8": [{"0_Comment Submission": "This is Us (Dope Fiend Edition)", "1_Text": "A spatula and an egg beater.", "2_Subreddit": "opiates"}], "dwtp3wi": [{"0_Comment Submission": "I passed my drug test for my job using “XSTREAM” synthetic urine. THANK GOD!!!", "1_Text": "I've passed 3 so far with Magnum Detox. One of which was a DOT test. Just make sure you either a. Strap it to your calf in a boot or b. Have a heat patch strapped. Saved me a 6 digit annual job!", "2_Subreddit": "opiates"}], "dwtpd37": [{"0_Comment Submission": "I passed my drug test for my job using “XSTREAM” synthetic urine. THANK GOD!!!", "1_Text": "Lmao yeah I did that for the longest time! 16 hour days in the oilfield that shit got uncomfortable real quick tho. If it's hot enough outside the boot is good but I used to have to have it on me daily. If you get a heads up you're golden. Glad to hear man, fuck those corporate fucks! :X", "2_Subreddit": "opiates"}]}], "1_submissions": [{}]}]}