{"Aureliuspipa": [{"0_comments": [{"dvdksp2": [{"0_Comment Submission": "Pip Magazine", "1_Text": "I knew we would get traction!", "2_Subreddit": "pipreddit"}], "dvfvh2r": [{"0_Comment Submission": "So, shall we start belittleling others with our grand pipness? Any suggestions? Who shall be the master pipster?", "1_Text": "How about ending all our comments with a pip so as to make the takeover more subtle and unquestioned? Just a strange and bewildering 'pip' when we're done talking about our horrid mothers or embarrassing moments would be fun. \npip", "2_Subreddit": "pipreddit"}], "dvgbreg": [{"0_Comment Submission": "So, shall we start belittleling others with our grand pipness? Any suggestions? Who shall be the master pipster?", "1_Text": "Pip pip! *standing in salute*", "2_Subreddit": "pipreddit"}], "dvnhak5": [{"0_Comment Submission": "Stanley Baratheon & The Red Woman", "1_Text": "r/DunderMifflin is leaking", "2_Subreddit": "freefolk"}], "dvthsh3": [{"0_Comment Submission": "You've created your very own religion, but how did you get so many believers?", "1_Text": "The placebo effect is gods way of telling you he's there. I can help you manipulate it in exchange for maidens and cash.", "2_Subreddit": "AskReddit"}], "dvti4ex": [{"0_Comment Submission": "Reddit, what are you sick of hearing about?", "1_Text": "As a non-american my gulty pleasure would be watching late night shows from over the pond. I don't do that anymore.", "2_Subreddit": "AskReddit"}], "dvvy6gj": [{"0_Comment Submission": "I think McKenna would approve of this website: 4,500+ curated & organized links to ideas, events, media, tools, quotes. Intended to help inform and empower people to better understand and change the world", "1_Text": "Well it's broad, I'll give you that.", "2_Subreddit": "terencemckenna"}], "dvy3rle": [{"0_Comment Submission": "AITA for not wanting drugs used in front of me?", "1_Text": "\"Yes, hi I don't know you but you should probably know that I indulge in the occasional cocaine binge, please don't tell the cops.\"", "2_Subreddit": "AmItheAsshole"}], "dw4can1": [{"0_Comment Submission": "Debating with my friends - the reason entheogens are illegal", "1_Text": "I don't think it's a conspiracy as much as genuine disinterest from the people in charge, generally they don't tend to be the experimental type and if they are they're certainly not experienced psychonauts. I think that the whole see-the-light-being-blessed-LSD-is-god-aura of the hippies scared a lot of people away. I mean, most hippies weren't well spoken like Terence and kept spouting their second hand, self righteous and self evident beliefs like peace, love and understanding as if these were new ideas which of course just made everyone think that these drugs just made them stupid and naive. The world is growing closer to psychedelics by every generation and I think that we soon will be in a place where people can enjoy it in moderation without being ostracized from public discourse. As for now we're a few years from that place in space and time.", "2_Subreddit": "terencemckenna"}], "dw5zshv": [{"0_Comment Submission": "What movie is widely hated by critics and horribly reviewed that you actually really loved and enjoyed?", "1_Text": "The Big Lebowski, probably my all time favourite movie but had horrible reviews when it first came out.", "2_Subreddit": "AskReddit"}], "dw7gjqv": [{"0_Comment Submission": "Teachers who have had students that are now famous, what were they like in school?", "1_Text": "Did he ever ask if he was the only one who cared about the god damn rules?", "2_Subreddit": "AskReddit"}], "dwatqtx": [{"0_Comment Submission": "AITA for defending myself over a joke?", "1_Text": "Wow. I do not miss being a teenager. You're not the asshole, you reacted with the minimum aggression possible to this situation. However, you are making it hard for your self by trying to persuade her to not talk herself up in front of you, that's not anything that you should try to control. It's obviously a big part of her personality so I don't see her stopping that anytime soon plus she might get passively aggressive towards you for being her anchor, which is what I think that this video represents. Many of us if not most of us experience a breaking point in friendships during our teenage years and if she makes you feel bad that's clue number one for this not working out in the long run. Appearances doesn't matter as much as you think it will growing up, being pretty has nothing on being a rad person. I think you need to learn how to say 'fuck it', practically everyone who tries manage to get in to some situations where they can train for procreation and in the sack we all look the same, the major difference being that people who aren't self conscious about themselves will have more fun. It's important to have fun and most of us are ugly.", "2_Subreddit": "AmItheAsshole"}], "dwau29f": [{"0_Comment Submission": "AITA: Joining a Christian Fellowship just to hangout and chill.", "1_Text": "Alright, but don't come back here in a month with a thread saying that you're pissed off because they're trying to persuade you into christianity.", "2_Subreddit": "AmItheAsshole"}], "dwbaxgc": [{"0_Comment Submission": "Employees of IKEA, what are some of the worst family meltdowns you have seen?", "1_Text": "That's like heroin comfort.", "2_Subreddit": "AskReddit"}], "dwbb0xc": [{"0_Comment Submission": "Employees of IKEA, what are some of the worst family meltdowns you have seen?", "1_Text": "> They left without the matress.\n\nTogether? Because that would be the real miracle.", "2_Subreddit": "AskReddit"}], "dwbb9w8": [{"0_Comment Submission": "Employees of IKEA, what are some of the worst family meltdowns you have seen?", "1_Text": "You know what they say, if you can't get it, might as well destroy something of equal value or higher! Bet they were proud.", "2_Subreddit": "AskReddit"}], "dwbtyoj": [{"0_Comment Submission": "AITA for pushing back in front of teachers in the dinner line?", "1_Text": "It sounds like someone here will be the school hero for the upcoming week. Not an asshole, even if they do have a shorter time to eat they should definitely ask, otherwise it's just rude no matter how many years you have on somebody.", "2_Subreddit": "AmItheAsshole"}], "dwbuje8": [{"0_Comment Submission": "AITA for being sad and maybe too clingy", "1_Text": "Oh to be young, all those phony social games really makes me want to go back in time. You're definitely not an asshole, it sounds like there's something true in your paranoia and that sort of frank denial from your GF is maddening and should be made illegal. Your only hope for redemption is to be as cold as her, don't be clingy and do fun stuff without her. I know that is the-game-redpill-tactics but since she entered the domain of passive aggressive social games instead of honest discourse it's only fair you respond with the same method.", "2_Subreddit": "AmItheAsshole"}], "dwd2co3": [{"0_Comment Submission": "we are all terence", "1_Text": "> if death is real", "2_Subreddit": "terencemckenna"}], "dwd37co": [{"0_Comment Submission": "AITA for not putting up with my roommates depression and mood swings?", "1_Text": "Who knows, he might have contracted depression because nobody likes him because he's an asshole.", "2_Subreddit": "AmItheAsshole"}], "dwd39uo": [{"0_Comment Submission": "AITA for not putting up with my roommates depression and mood swings?", "1_Text": "One says 'hi' if one is a person. This is known.", "2_Subreddit": "AmItheAsshole"}], "dwd3bwr": [{"0_Comment Submission": "AITA for not putting up with my roommates depression and mood swings?", "1_Text": "That's his problem if he can't be honest and upfront.", "2_Subreddit": "AmItheAsshole"}], "dwdtyav": [{"0_Comment Submission": "we are all terence", "1_Text": "Which are certainly real. If to use Terences words we are as dead as we're ever going to be right now I'd definitely be happy but no one can know because death is undeniably real and it's implications are also.", "2_Subreddit": "terencemckenna"}], "dwhched": [{"0_Comment Submission": "AITA for getting upset at my girlfriend for leaving me out in a video game and prioritizing new online friends?", "1_Text": ">  I made sure that I kept my distance with all of my friends so that she never felt threatened, and I always 100% prioritized her attention over any of my other friends.\n\nTo me this feels very unhealthy. I think you should both start encouraging each other to get out there in the world. You can start by encouraging her instead of being scared that she gets close to other people. Someone has to start. I think you're both slight assholes even if you seem very sincere about what makes you that way which in my opinion is a great starting point for both of you to learn how to let go of each other and trust fully. I'm in no way insinuating that you should break up FYI, only letting go in the sense that you can let each other have fun and experience life without one another.", "2_Subreddit": "AmItheAsshole"}], "dwx5f2h": [{"0_Comment Submission": "Wide variety", "1_Text": "That's kind of what DMT is for though, no?", "2_Subreddit": "opiates"}]}], "1_submissions": [{"7lab3g": [{"0_Title": "Whatever happened to _______?", "1_Text": "I knew we would get traction!", "2_Subreddit": "AskOuija"}], "7lac4w": [{"0_Title": "Sure Hitler was bad, but at least he _______.", "1_Text": "I knew we would get traction!", "2_Subreddit": "AskOuija"}], "7latqy": [{"0_Title": "You don't understand! He died because he _______.", "1_Text": "I knew we would get traction!", "2_Subreddit": "AskOuija"}], "7lawqo": [{"0_Title": "Bullshit! I know you ______.", "1_Text": "I knew we would get traction!", "2_Subreddit": "AskOuija"}], "7lax20": [{"0_Title": "I've never been happier than when Santa gave me ______.", "1_Text": "I knew we would get traction!", "2_Subreddit": "AskOuija"}], "7lbe9w": [{"0_Title": "Jehovah! We've talked about this you can't just ______ whenever you want!", "1_Text": "I knew we would get traction!", "2_Subreddit": "AskOuija"}], "7lblls": [{"0_Title": "No Satan, you cannot have anymore ________.", "1_Text": "I knew we would get traction!", "2_Subreddit": "AskOuija"}], "7lbobr": [{"0_Title": "Everyone can't be a ______, but I am.", "1_Text": "I knew we would get traction!", "2_Subreddit": "AskOuija"}], "7lbx3d": [{"0_Title": "Welcome to death, and to answer your first question, the _______ were right.", "1_Text": "I knew we would get traction!", "2_Subreddit": "AskOuija"}], "7lcsgj": [{"0_Title": "After searching for a while I finally find my community where I belong, it's _______.", "1_Text": "I knew we would get traction!", "2_Subreddit": "AskOuija"}], "7ld6at": [{"0_Title": "Oh hi Satan, good you're here, we've got some work to do, can you pass me the _______?", "1_Text": "I knew we would get traction!", "2_Subreddit": "AskOuija"}], "7m2vcz": [{"0_Title": "What religion should I follow to please you spirits?", "1_Text": "I knew we would get traction!", "2_Subreddit": "AskOuija"}], "7mj33f": [{"0_Title": "What's the funniest lie to tell a kid?", "1_Text": "I knew we would get traction!", "2_Subreddit": "AskReddit"}], "7nnwy0": [{"0_Title": "\"______\" - Satan 2018", "1_Text": "I knew we would get traction!", "2_Subreddit": "AskOuija"}], "7nny97": [{"0_Title": "Ain't no party like a _____party cause a _____party don't stop.", "1_Text": "I knew we would get traction!", "2_Subreddit": "AskOuija"}], "7no3v3": [{"0_Title": "_____kid likes ____music", "1_Text": "I knew we would get traction!", "2_Subreddit": "AskOuija"}], "7no559": [{"0_Title": "______ is my fuel.", "1_Text": "I knew we would get traction!", "2_Subreddit": "AskOuija"}], "7no7o2": [{"0_Title": "_____ is Art.", "1_Text": "I knew we would get traction!", "2_Subreddit": "AskOuija"}], "7nobhu": [{"0_Title": "Magic is real, all you need to do is ______.", "1_Text": "I knew we would get traction!", "2_Subreddit": "AskOuija"}], "7o6ckr": [{"0_Title": "Spirits! All you've ever done is ______!", "1_Text": "I knew we would get traction!", "2_Subreddit": "AskOuija"}], "7oepiq": [{"0_Title": "Satan! No! Don't tell the kids _______.", "1_Text": "I knew we would get traction!", "2_Subreddit": "AskOuija"}], "7q7lhp": [{"0_Title": "I know he isn't the brightest, but he is ______.", "1_Text": "I knew we would get traction!", "2_Subreddit": "AskOuija"}], "7s6q5t": [{"0_Title": "What's a good thing about conversating on the internet?", "1_Text": "I knew we would get traction!", "2_Subreddit": "AskReddit"}], "7v0b2s": [{"0_Title": "I'm peacefully protesting _____.", "1_Text": "I knew we would get traction!", "2_Subreddit": "AskOuija"}], "80gws8": [{"0_Title": "Upboat rhymes with upvote!", "1_Text": "I knew we would get traction!", "2_Subreddit": "freefolk"}]}]}]}