{"Korrain208": [{"0_comments": [{"dtmvwr5": [{"0_Comment Submission": "Message to dealers", "1_Text": "Dude....totally feel your pain!....\nId msg one of my old guys the day before, the next morning and a few hours before just hoping hed be organised by then....but nope.....still had to weigh up...\nAnd he somehow thought it was a perfectly rational idea to just start weighing in the middle of the smoking area in a bar ive been super well known at for the last 7 years o_0.\nAlmost decked him there and then.", "2_Subreddit": "Drugs"}], "dtohu5e": [{"0_Comment Submission": "Weekly Codes thread", "1_Text": "k8Ae8yAqPj", "2_Subreddit": "hyperheroes"}], "dtqtnd6": [{"0_Comment Submission": "Can someone explain why I get sick on MDMA??", "1_Text": "I cant explain why it happens but it is actually more common than you think,  at least %40 of my customers say/have said that they have the same problem majority of the time. I also tend to feel pretty nauseous myself. Buuuttttttt i have found the best thing for it and it hasnt failed me yet!.\nSounds weird but get yourself some wizzfizz lollipops haha. They have bicarbonate soda and citric acid in them so the moment you start feeling even a tiny bit sick just suck on one of them, they act almost like Alka-Seltzer. \nNow i give a couple out to my regulars every time and keep a bag on me when im out incase i see others not doing too great.", "2_Subreddit": "Drugs"}], "dtr3dtv": [{"0_Comment Submission": "Can someone explain why I get sick on MDMA??", "1_Text": "We get em from foodworks and most standard lolly shops here in melbourne...dunno where you would find them in other areas. Im sure google would help with that one though.", "2_Subreddit": "Drugs"}], "dtro5ut": [{"0_Comment Submission": "Official Free-For-All Thread week 05 -- February 05, 2018", "1_Text": "Warm......warm?! \nDude you're kidding right?!!!!.\nAustralia has no idea what warm is....\nIf the weather here isnt trying to give us hail the size of minivans or frostbite then its so damn hot that we melt into a liquidy puddle of human in the middle of the street.\nLike Australia seriously has a 5th season named fuck you.\nAnd it just randomly happens all through the year whenever it feels like it....\nWe are never safe.", "2_Subreddit": "Drugs"}], "dtt6wct": [{"0_Comment Submission": "Official Free-For-All Thread week 05 -- February 05, 2018", "1_Text": "Man ive lived in Melbourne my entire life and i can tell you with all honesty that even we dont know what the fuck Melbourne is like.\n\nIll head out in shorts and a tshirt on a 38° day and its all like \"ahhh so your trying not to melt aye?....hmmm lets see....*BAM* TORRENTIAL DOWNPOUR!!! How do ya like that!\"\nSo ill pull my hoodie outta my bag and put on to try to to freeze to death and melbourne decides \"oohhh no you dont!\" *cue golf ball sized hail*\nThen the instant i get inside it all clears away and is a beautiful warm sunny day....\n\nIt\nIs\nFucked.", "2_Subreddit": "Drugs"}], "duamtdw": [{"0_Comment Submission": "Coke users in Melbourne", "1_Text": "Duuude....what the actual fuck...i live in melbourne Australia  i have NEVER paid that much for an 8b o_0...\n\nBut yes....Australia has some of the most outrageous prices ive ever seen...unfortunately most dealers can and will charge through the arse!", "2_Subreddit": "Drugs"}], "dumfrk9": [{"0_Comment Submission": "Weekly Codes thread", "1_Text": "New codes!\n\n8Ws2R569pz\n\nf6gLJ298kc", "2_Subreddit": "hyperheroes"}], "dvb2dbo": [{"0_Comment Submission": "What is this? It's growing like crazy (Melbourne Australia)", "1_Text": "It almost looks like ginger 0_o", "2_Subreddit": "whatsthisplant"}], "dve82dr": [{"0_Comment Submission": "Scammed on Craigslist", "1_Text": "Im in melbourne as well mate, unfortunately its just better to let that one go. The cops here will not give a shit...and to be honest they will most likely decide to seacrh you instead of take you seriously.\nIt anyone says to pre pay, transfer by the 7/11 moneygram or buy steam gift cards you just have to promptly ignore them, start from the start and keep trying untill you find a decent one who will meet you face to face and cash only.", "2_Subreddit": "legaladvice"}], "dvgz0wj": [{"0_Comment Submission": "Should I be getting suspicious?", "1_Text": "Fingers crossed it is the right stuff and no didnt get ripped mate!. Not alot of dealers can be bothered crushing it up into such a fine powder  but its not inheard of!. Good luck mate!.", "2_Subreddit": "Drugs"}], "dvgz8sx": [{"0_Comment Submission": "Should I be getting suspicious?", "1_Text": "Oh awesome then!. Yeah you most likely got the right stuff then. Its probably just the mdma is surrounded by a bit of filler since a lot of people dont understand how shit a normal amount of it looks in a cap on its own lol. People tend to complain before trying it if its a larger cap with a couple rocks in it even though it could turn out to be amazingly strong!\n\nOr if they are awesome they will do what i tend to do and make up 4 caps then fill most of the leftover space with a crushed up lsd sugar cube for a light candyflip.", "2_Subreddit": "Drugs"}], "dvgzhny": [{"0_Comment Submission": "Should I be getting suspicious?", "1_Text": "Haha i have heard from a few people that it can feel like dxm, not too often though and only with a smaller amount. Dont overthink it mate! Just enjoy the ride!", "2_Subreddit": "Drugs"}], "dvh0i7j": [{"0_Comment Submission": "Should I be getting suspicious?", "1_Text": "Thats the spirit!!!", "2_Subreddit": "Drugs"}], "dw40ugc": [{"0_Comment Submission": "Dealer wants to hang out?", "1_Text": "Yeah we are people and we do often hang out with customers, but that isnt any reason to decide someone is being childish. Everyones stress and anxiety levels are different mate. ive experienced and witnessed first hand how fully debilitating it can render some people. \n\nIf you havent been in that situation beforw and dont know what to expect then its fair enough. High enough levels of stress/ anxiety can be physically painful.", "2_Subreddit": "Drugs"}], "dw416j1": [{"0_Comment Submission": "ripped off for dexys?", "1_Text": "In bulk over the net 100-200 sure but on the street in aus you are looking at around 250-400max.\nAnything over that is way too much. 400 is the most anyone should wver be paying. \nBut yeah. 100 for two bottle is a rip mate.", "2_Subreddit": "Drugs"}], "dw44n9h": [{"0_Comment Submission": "Dealer wants to hang out?", "1_Text": "Not at all. Its completely normal to have some worries about it.\nWhen you are buyng its a short amount of time just for a transaction. \nIf you are hanging out theres a whole lot of shit that could go wrong. Some people also prefer to keep their private and professional life/info from their dealer and there isnt anything wrong with that.", "2_Subreddit": "Drugs"}], "dw45hoj": [{"0_Comment Submission": "Dealer wants to hang out?", "1_Text": "Yeah look i understand where you are coming from as well mate. Its just different for everyone. I know that for a fact. Used to be shockingly anxiety ridden myself. Never thought id end up being on both sides of the trade lol. \nAnd to some degree i do agree with you.  I just reckon there's no need to start declaring childishness when you dont know the person. Hell some of my close mates are more childish than their 5yo kids haha.", "2_Subreddit": "Drugs"}], "dwctyyx": [{"0_Comment Submission": "Replacement trains from Parliament to Macleod don't start at 8:15pm, they start at 8:41pm", "1_Text": "Unfortunately if you use the ptv app and read the disruptions properly (whuh I did not a couple days ago) its not over till 29th of APRIL.\nFucking metro screws me over wayyy too often", "2_Subreddit": "melbourne"}], "dwebquh": [{"0_Comment Submission": "Replacement trains from Parliament to Macleod don't start at 8:15pm, they start at 8:41pm", "1_Text": "Agreed. Like...fully agreed. Ive been taking the 109 and 48 tram all the way to balwyn then catching a $25 uber just to avoid being a sardine haha.\n\nAlso...to everyone who reckons that its gonna be better once the south morang trains start up again...think twice...it hust means your trains are gonna be 2x as packed because everyone on the hurstbridge line is gonna go to your train stations.", "2_Subreddit": "melbourne"}], "dwnhobv": [{"0_Comment Submission": "Meth smokers, learn to blow pipes!", "1_Text": "Hahaha yep. That definitely sounds about right.\nGotta admit it is a hell of a lot of fun to walk into a shop to see someone attempting to be subtle when asking for one. But the prices are ridiculous!!!. Cheapest I have ever found in aus was $15 and it was just a shite looking straight stem with a bowel at the end.\n\nI have a mate who makes mine for me and the pieces he comes up with AR gorgeous!.\nAlso self taught. Need to give it a go myself sometime!", "2_Subreddit": "Stims"}], "dwnou84": [{"0_Comment Submission": "Melbourne is dry af", "1_Text": "Bloody hell mate!!!. $240 for a Q?...your joking right....I know prices here are high but that's just rediculous 0_o.\nAlso...is this seriously just the post for everyone in the north east haha. \nWe need to team up and figure this shot out!.", "2_Subreddit": "trees"}], "dwve7h5": [{"0_Comment Submission": "I need some help to get weed from my dealer when my parents are home.", "1_Text": "Just do what I have done in the past mate. I had to head out the front to make a sale but I don't want some of the people here knowing. \nJust grab a phone charger they haven't seen before and tell em you mate left it behind last time you hung out, so you took it with you so he could pick it up later and he's just swung by to grab it off ya before he heads off to work or some shit.\nThen just tuck it into the waistband of your pants along with your purchase and walk right back in. \nWorks every time I need to do something.", "2_Subreddit": "Drugs"}], "dwvif8z": [{"0_Comment Submission": "When your friend tells you he got percs but follows it with \"but you're not getting any\".", "1_Text": "Your friend is a dick....", "2_Subreddit": "opiates"}], "dwvl1ww": [{"0_Comment Submission": "$100 (0.4)Worth of Canadian Fentanyl Brown (they sell it as H but my urine tests say otherwise). What do y’all pay?", "1_Text": "Yep, definitely sounds like Aussie dealers to me. \nYou're usually gonna end up with absolute crap or something cut to the shithouse!.\nAnd to be honest you are even lucky to find that let alone a half reliable dealer who won't try to rip you off or roll you. \n\nI'm actually just kinda impressed that there was any form of drug in it if it ain't the right thing haha.", "2_Subreddit": "opiates"}]}], "1_submissions": [{"6xbmsb": [{"0_Title": "Code", "1_Text": "Dude....totally feel your pain!....\nId msg one of my old guys the day before, the next morning and a few hours before just hoping hed be organised by then....but nope.....still had to weigh up...\nAnd he somehow thought it was a perfectly rational idea to just start weighing in the middle of the smoking area in a bar ive been super well known at for the last 7 years o_0.\nAlmost decked him there and then.", "2_Subreddit": "AppNana"}], "6xbyp6": [{"0_Title": "l23903654", "1_Text": "Dude....totally feel your pain!....\nId msg one of my old guys the day before, the next morning and a few hours before just hoping hed be organised by then....but nope.....still had to weigh up...\nAnd he somehow thought it was a perfectly rational idea to just start weighing in the middle of the smoking area in a bar ive been super well known at for the last 7 years o_0.\nAlmost decked him there and then.", "2_Subreddit": "AppNana"}]}]}]}