{"CluckNastie9188": [{"0_comments": [{"dwv97zw": [{"0_Comment Submission": "bread and butter, yin and yang, salt and pepper,hot and cold...", "1_Text": "what is that powdered sugar .   lol", "2_Subreddit": "opiates"}], "dwva1y0": [{"0_Comment Submission": "Fuck me", "1_Text": "This may sound retarded but lopermide  which is a OTC anti dirrea med is actually converted to an opioid in the body, it doesnt cross the blood brain barried IE no high is achieved . Ah but good news friend withdrawals are mostly in the body.  They come in 2mg tablets.  I would recommend taking between 60-90mg. Not the most euphoric opiate but in a situation like sick as fuck or those it an easy choice.", "2_Subreddit": "opiates"}], "dwvdh9r": [{"0_Comment Submission": "Fuck me", "1_Text": "ehh kind of a weird feeling it certainly tolerable versus withdrawals tho do a little google research. oh btw fron what i can remember it comes on like a strange feeling next hella drowsy then sleepy time, for me the worst part of being sick is i litterally will lay there with my eyes closed for hours and cant sleep so...  ya hope his helps G.", "2_Subreddit": "opiates"}], "dww6bud": [{"0_Comment Submission": "Just copped for the first time in 7 months.", "1_Text": "Shi bro im on supervised DOC probation and my PO could give a fuck less if im using or not lol. She told me after I got out on the app to revoke for not showing up. 1 dont go awol 2. dont get any new charges. I lucked out with my PO cause im a total fuck up.", "2_Subreddit": "opiates"}], "dww76ou": [{"0_Comment Submission": "Ok experts. Which one is real and which one is fake?? One is from a sealed bottle and one was bought online that was marketed on a site as “movie props” it’s simply a sugar pill..", "1_Text": "Bro what website did you get those from I have big plans for about 100 of those.  lol", "2_Subreddit": "opiates"}], "dww7vo9": [{"0_Comment Submission": "I'll be well soon..", "1_Text": "what about \"on my way\"   .... fuck lol", "2_Subreddit": "opiates"}], "dwwbel9": [{"0_Comment Submission": "Need help! Just shot gray dope.", "1_Text": "sound like coke bro", "2_Subreddit": "opiates"}], "dwx433t": [{"0_Comment Submission": "Help", "1_Text": "uhh not sure if this was the right post was trying to cold cop", "2_Subreddit": "heroinaddiction"}]}], "1_submissions": [{"8a2i3p": [{"0_Title": "Help", "1_Text": "what is that powdered sugar .   lol", "2_Subreddit": "heroinaddiction"}]}]}]}