{"Boy_Jones_Jr": [{"0_comments": [{"dwtu8kj": [{"0_Comment Submission": "how do I fucking poop", "1_Text": "I used to have terrible problems being constipated (using a bundle a day). Now, using an equivalent amount, I've really gotten myself pretty regular through one change: water. I drink about a gallon per day. It helps that being stoned gives me dry mouth like crazy. It sorted me right out and had me pooping like a normal human again.  Drink as much water as you can choke down and you may see your bathroom situation improve too.", "2_Subreddit": "opiates"}], "dwu22k1": [{"0_Comment Submission": "how do I fucking poop", "1_Text": "Hopefully it will help OP too. Really saved my ass (see what I did there)!", "2_Subreddit": "opiates"}], "dwu25gc": [{"0_Comment Submission": "how do I fucking poop", "1_Text": "Is magnesium glycinate safe to use on a regular basis? And can it be sourced offline easily in your experience?", "2_Subreddit": "opiates"}], "dwu2f2k": [{"0_Comment Submission": "I passed my drug test for my job using “XSTREAM” synthetic urine. THANK GOD!!!", "1_Text": "Thanks a lot for that link dude. I have been looking for the best sythetic so I appreciate you sharing your findings!", "2_Subreddit": "opiates"}], "dwu2n7j": [{"0_Comment Submission": "Time to forget about the day i had, fuk the whole probation and court system ...... free my babe I miss her soo much I would trade places with u if i could i pray I could every night, I’m jus happy she went to detox a week ago so she’s not kicking in pcj rn", "1_Text": "Damn, bricks for $120 sounds great - I think these look like garden state buns and I've heard the bags can be on the small side compared to NY buns (which can for like 60-100 per), bu the thought of 50 stamps for only 120 makes me wish I was back east.", "2_Subreddit": "opiates"}], "dwu33gs": [{"0_Comment Submission": "Oh boy... I've seriously done it now...", "1_Text": "I'll say something different to you bro - don't get too down on yourself. You did some regrettable things, but I've heard way worse. I'm not minimizing the seriousness of the health aspect, please be more careful. As far as your dad and grandfather go, they probably have done and seen their fair share of shit ... just don't beat yourself up too badly is what I'm getting at.", "2_Subreddit": "opiates"}], "dwu3pfb": [{"0_Comment Submission": "Pickup story : made my d boy sus", "1_Text": "With the amount of money I spend with him,  if I ask my dboy for a selfie he better put his damn arm around me. I'm sure things'll be fine as long as you're putting dough in his pocket.", "2_Subreddit": "opiates"}], "dwu3u0b": [{"0_Comment Submission": "Is anyone else sober and live with people that get high?", "1_Text": "You live somewhere in the middle of nowhere with a high cost of living? Seems like you could probably find something cheaper if you're okay being removed from cities and such.", "2_Subreddit": "opiates"}], "dwu3x8i": [{"0_Comment Submission": "Time to forget about the day i had, fuk the whole probation and court system ...... free my babe I miss her soo much I would trade places with u if i could i pray I could every night, I’m jus happy she went to detox a week ago so she’s not kicking in pcj rn", "1_Text": "For sure dude. Nothing better than fat, cheap and good bags - that's the holy junk trinity right there!", "2_Subreddit": "opiates"}], "dwu7t0m": [{"0_Comment Submission": "Anyone else love cooking while high?", "1_Text": "I am from a family of serious amateur cooks and bakers so I just sort of picked it (and 20 pounds or so) over the years.", "2_Subreddit": "opiates"}], "dwuq2ly": [{"0_Comment Submission": "How can I find a dealer for brown now that craigslist is done for?", "1_Text": "Search this sub. Dozens of cold copping threads.", "2_Subreddit": "opiates"}], "dwv4b5b": [{"0_Comment Submission": "bread and butter, yin and yang, salt and pepper,hot and cold...", "1_Text": "Did you cop the blows out west?", "2_Subreddit": "opiates"}], "dww6vgs": [{"0_Comment Submission": "Drug kingpin", "1_Text": "Yeah but isn't it his cousin the one who gets him to the plug? It's not some GI or officer he just meets right? Just testing my recollection.", "2_Subreddit": "opiates"}], "dww70mn": [{"0_Comment Submission": "YOU GUYS WANNA KNOW HOW TO MAKE BIG BUCKS LIKE ME? I made this in just one week!!! I hope my dboy takes ones......", "1_Text": "Yes, this. My guy is used to me calling for 2 or 300 at a time so I dread those days when I have 40 bucks and I'm debating whether to even call him.", "2_Subreddit": "opiates"}], "dww9p1m": [{"0_Comment Submission": "Anyone ever think about going on a drug holiday in SE Asia?", "1_Text": "I run a business remotely so something like this would be feasible for me. Any read on what the expat communities are like in these cities? I'll tell you one thing, you got me thinking ...", "2_Subreddit": "opiates"}], "dww9vm6": [{"0_Comment Submission": "Drug kingpin", "1_Text": "Such an ill fucking movie. I love that scene where Frank shoots Tango in the head in broad daylight.", "2_Subreddit": "opiates"}], "dwweame": [{"0_Comment Submission": "Heroin movie you probably haven't watched, starring 1971 Al Pacino as a dope fiend.", "1_Text": "Someone posted this a few days ago. Seminal dope fiend flick. I lived in an apartment with a view of Needle Park for a few years.", "2_Subreddit": "opiates"}], "dwwefcj": [{"0_Comment Submission": "YOU GUYS WANNA KNOW HOW TO MAKE BIG BUCKS LIKE ME? I made this in just one week!!! I hope my dboy takes ones......", "1_Text": "Yeah you're right", "2_Subreddit": "opiates"}], "dwwek3w": [{"0_Comment Submission": "Anyone ever think about going on a drug holiday in SE Asia?", "1_Text": "Cool, appreciate the info. I think your bit at the end speaks to my greatest fear about going (save for some \"Locked Up Abroad\" scenario): never coming back. I could see myself doing it. I've lived in the three biggest cities in the US and hate the idea of dying having never lived abroad for longer than a few months.", "2_Subreddit": "opiates"}], "dwweonb": [{"0_Comment Submission": "Premade east coast stamp bags, opinions on them?", "1_Text": "Question for you dude. Can't anyone get plain bags and stamp them? I'm not arguing with your experience, I've had better luck with regular old hand stamped bags too - I'm just wondering if there's some reason that it's easier to get prestamp bags that I'm not considering.", "2_Subreddit": "opiates"}], "dwx4fy1": [{"0_Comment Submission": ":)", "1_Text": "Nice looking jab bro! Enjoy!", "2_Subreddit": "opiates"}], "dwxjsd0": [{"0_Comment Submission": "Heroin movie you probably haven't watched, starring 1971 Al Pacino as a dope fiend.", "1_Text": "It's changed so much. I mean all of the city has but I grew up there and I don't recognize it anymore.", "2_Subreddit": "opiates"}], "dwxjufm": [{"0_Comment Submission": "Premade east coast stamp bags, opinions on them?", "1_Text": "I feel you bro - just was curious on your thought process but makes sense.", "2_Subreddit": "opiates"}], "dwxjx1e": [{"0_Comment Submission": "Waiting For My Man", "1_Text": "Such an amazing scene.", "2_Subreddit": "opiates"}], "dwxkfg3": [{"0_Comment Submission": "Anyone ever think about going on a drug holiday in SE Asia?", "1_Text": "Also, great thread OP. Lots of great discussion.", "2_Subreddit": "opiates"}]}], "1_submissions": [{}]}]}