{"PhillipStein": [{"0_comments": [{"dtzw073": [{"0_Comment Submission": "MFW", "1_Text": "Don't jinx me!", "2_Subreddit": "drugmemes"}], "du49hbn": [{"0_Comment Submission": "One of my most recent psychedelic mandalas 😊 love how bright acrylic paint makes the colours 💕", "1_Text": "Beautiful", "2_Subreddit": "LSD"}], "du4a5kk": [{"0_Comment Submission": "Cross-tolerance with LSD?", "1_Text": "Yep no cross tolerance, combining them is fun but be aware of the k comedown. \n\nK goes good with most all psychedelics and stims. Just moderate your usage", "2_Subreddit": "ketamine"}], "du5bc06": [{"0_Comment Submission": "What made you start doing drugs? Were you hooked at one point? What were you doing to get them? Please share your journey/story", "1_Text": "Started with nitrous oxide getting my wisdom teeth out at 18. I known drugs were recreational but this really solidified the idea. I enjoyed the hydrocodone afterwards. Bought some kratom after that but kratom wasn't all that. At 19 I acquired LSD and damn real drugs were my new hobby. At college I started drinking alcohol because I couldn't trip every weekend. Middle of the year of college I had a dmt breakthrough and saw the hyperspace. End of my freshman year of college I started smoking weed, spring break in Colorado. Took an high dose edible and would have lost my shit had I not been accustomed to psychedelics. Many psychedelics, empathogens, and dissociatives have been consumed since. \n\nThe only class I found troublesome was stimulants, chasing godhood has its downsides.\n\nEdit: None of my friends openly did drugs until college. I know how to computer", "2_Subreddit": "askdrugs"}], "du67hx0": [{"0_Comment Submission": "Meech: \"There will be features on the album\"", "1_Text": "I'm hoping for Allan watts", "2_Subreddit": "flatbushzombies"}], "du7psy2": [{"0_Comment Submission": "Why hasn't any one ever told me?", "1_Text": "Using a free VPN could mean their sourcing out your IP to people doing shadier shit. I wouldn't recommend.", "2_Subreddit": "TOR"}], "dub9iaq": [{"0_Comment Submission": "Is there a drug like ketamine that does not cause bladder problems?", "1_Text": "Nitrous oxide I guess", "2_Subreddit": "ketamine"}], "dubqvc6": [{"0_Comment Submission": "ARCSTRUMENTALS 2 OUT NOW", "1_Text": "Maybe he's one of them weird niggas that likes weddings", "2_Subreddit": "flatbushzombies"}], "dubszvr": [{"0_Comment Submission": "[FRESH ALBUM] Erick the Architect - Arcstrumentals, Vol. 2", "1_Text": "Wow I finished this and it's good shit", "2_Subreddit": "hiphopheads"}], "duc8r6n": [{"0_Comment Submission": "Is there a drug like ketamine that does not cause bladder problems?", "1_Text": "The only dissociative that doesn't cause mild bladder damage. But they are quite different", "2_Subreddit": "ketamine"}], "dug280h": [{"0_Comment Submission": "Not my first, but definitely my favorite", "1_Text": "That is awesome", "2_Subreddit": "Zippo"}], "duhfpun": [{"0_Comment Submission": "How many of you guys are addicted to nicotine", "1_Text": "I was addicted to vaping before stims and I find that I actually vape less when spun because I'm distracted. I do vape pretty much all day sober though. I can get fixated on vaping as well while spun and have a spike in my total nicotine consumed but always in a short burst.", "2_Subreddit": "Stims"}], "duqcc01": [{"0_Comment Submission": "🤔🤔", "1_Text": "A Jedi flip is mdma shrooms and lsd. I have mixed 4 aco dmt and LSD. Keep in mind psychedelic tolerance skyrockets at the 90 minute mark. I took lsd first waited about 2 hours then dosed 4 aco dmt. I could definitely notice it kick in and it was a pleasant trip, coupled with loads of dabs.  It was a nice touch for someone who likes to experience combos, however it wasn't crazily insane. If I recall correctly I dosed 150ug LSD and 20mg 4 aco dmt.", "2_Subreddit": "askdrugs"}], "dv7y0ao": [{"0_Comment Submission": "Man from new york", "1_Text": "[this heart](https://i.imgur.com/eBqS8gf.jpg)\n\nI was not lost in the sauce at the time of writing.", "2_Subreddit": "ElectricForest"}], "dv7y48h": [{"0_Comment Submission": "Man from new york", "1_Text": "He does have a face yas. It honestly could have been a dude in our group or one of those undercovers too. I somehow attracted them like flies", "2_Subreddit": "ElectricForest"}], "dv8madf": [{"0_Comment Submission": "Man from new york", "1_Text": "Yeah hahaha I was tripping quite hard so I guess it's purple shaped. The medics did say I was one of the highest they've encountered :')", "2_Subreddit": "ElectricForest"}], "dvnc0sl": [{"0_Comment Submission": "Ground Control Comes Back For Year 2", "1_Text": "You guys are fucking dope. I always come fully stocked, but I tell everyone to follow harm reduction guidelines", "2_Subreddit": "ElectricForest"}], "dvpos5i": [{"0_Comment Submission": "A bar in D.C. made a map out of the fake ID's they've confiscated during the summer. Savage", "1_Text": "I had a really nice MN fake, it was only missing the loons. It's a teslin state I believe. Does that man's me brave?", "2_Subreddit": "funny"}], "dvvic0l": [{"0_Comment Submission": "Drugs and personality’s", "1_Text": "Ketamine but mescaline is close. I guess I'm weird", "2_Subreddit": "Drugs"}], "dw2pvz0": [{"0_Comment Submission": "New addition to site-wide rules regarding the use of Reddit to conduct transactions", "1_Text": "Fuck you guy, you've deleted a community of knowledge keeping people safer than they would be otherwise. We will move on but I will be sure to create as little revenue as possible for you.", "2_Subreddit": "announcements"}], "dw2yr9b": [{"0_Comment Submission": "First time EFer. Can’t be more psyched", "1_Text": "Moderate moderation it's a delicate thing to do.", "2_Subreddit": "ElectricForest"}], "dw9kjgk": [{"0_Comment Submission": "What’s the most embarrassing thing that has happened to you (or someone you know) while having sex?", "1_Text": "Citrate will still be a laxative at an effective dose, glycinate works best", "2_Subreddit": "sex"}], "dwdzegc": [{"0_Comment Submission": "Prince died from sky-high levels of fentanyl, report shows", "1_Text": "\"Too much\", sometimes a man needs some wonkyness", "2_Subreddit": "news"}], "dwnqiax": [{"0_Comment Submission": "Anyone have a favorite dope fiend that they admire/idolize from the past or present?", "1_Text": "Mitch hedberg, charismatic mother fucker", "2_Subreddit": "opiates"}], "dwrglug": [{"0_Comment Submission": "Electric Forest BACKSTAGE TOUR and Ticket Giveaway", "1_Text": "My friend described it as the trippiest festival around. He then said the speakers were some of the best and I decided to make EF my first ever festival last year. I am still at a loss of words over it.", "2_Subreddit": "ElectricForest"}]}], "1_submissions": [{"1vkjyw": [{"0_Title": "No mouse/keyboard working on startup", "1_Text": "Don't jinx me!", "2_Subreddit": "tails"}], "242e4v": [{"0_Title": "Tails clipboard", "1_Text": "Don't jinx me!", "2_Subreddit": "DarkNetMarketsNoobs"}], "24fe25": [{"0_Title": "What if the U.S pushed into the USSR after WWII like Patton suggested?", "1_Text": "Don't jinx me!", "2_Subreddit": "HistoricalWhatIf"}], "2755qi": [{"0_Title": "Am I shadowbanned?", "1_Text": "Don't jinx me!", "2_Subreddit": "ShadowBan"}], "3vri8w": [{"0_Title": "Tank for a kanger subox mini", "1_Text": "Don't jinx me!", "2_Subreddit": "Vaping101"}], "68crjy": [{"0_Title": "Any fellow psychonauts here?", "1_Text": "Don't jinx me!", "2_Subreddit": "infp"}], "6d1tvt": [{"0_Title": "Trying to reverse the side effects of chronic cannabis use", "1_Text": "Don't jinx me!", "2_Subreddit": "askdrugs"}], "6d51xx": [{"0_Title": "Reduce side effects of chronic cannabis use", "1_Text": "Don't jinx me!", "2_Subreddit": "AskDrugNerds"}], "6e2zsr": [{"0_Title": "Joining you guys", "1_Text": "Don't jinx me!", "2_Subreddit": "Stims"}], "7gdggh": [{"0_Title": "Father of influence", "1_Text": "Don't jinx me!", "2_Subreddit": "flatbushzombies"}], "7j827o": [{"0_Title": "[TOMT][Music] This guitar sample, Father of Influence", "1_Text": "Don't jinx me!", "2_Subreddit": "tipofmytongue"}], "821nm7": [{"0_Title": "Man from new york", "1_Text": "Don't jinx me!", "2_Subreddit": "ElectricForest"}]}]}]}