{"ImFlyingHi": [{"0_comments": [{"dph6xu2": [{"0_Comment Submission": "I boofed drugs for the first time", "1_Text": "I boofed E once. Crushed it up and put it up my bum.. very interesting roll", "2_Subreddit": "Drugs"}], "dph7w8j": [{"0_Comment Submission": "Hey /r/drugs, I tried MDMA for the first time two days ago. I am now experiencing something very odd.", "1_Text": "I was extremely strait edge, didn't drink, smoke, nothing.. I got out of a long relationship, almost got engaged. We broke up on our 2 year anniversary, and my birthday because she decided that we didn't have anything in common. Besides the amazing sex, and her being a red head (I have a huge red head thing), she was right.\n\nI fell into a huge depression.\n\nAbout a month later, I went to my cousins house where she lived with her now Husband. \n\nThey were planning on rolling that night, and decided to give me a pill. I took it and absolutely loved it. I feel like it changed my life. I got into the rave scene in Los Angeles and the Desert Party scene. I would go up to LA every weekend, and maybe come home on Monday. \n\nFast forward a few years, I lost my job, almost all of my friends all because my life revolved around partying. \n\nWhat you're experiencing is the after glow of a \"life changing\" event because you got opened up to a side that you didn't know existed. Enjoy it.. I miss it, but I don't miss that life style", "2_Subreddit": "Drugs"}], "dpwsaoz": [{"0_Comment Submission": "Truly 100% sober (\"NA clean\") vs. clean off opiates", "1_Text": "I'm on day 2 off of Oxy as of 6 AM this morning. 48 hours. \n\nI smoked a bowl when I got up and took some kratom.. but I didn't use. To me, that is a win. \n\nMy DOC was Oxy/Perc.. really any time I could get some. My connect has a chronic pain that will have a script for life basically so I took full advantage of that for the last few years. \n\nIMO, weed should not be seen as a drug.. alcohol in my mind is worse than weed. Not to mention, I live in a state where it is available for both Medical, and recreational. I would rater smoke a bowl from time to time than use.. I completely agree with OP.", "2_Subreddit": "OpiatesRecovery"}], "dpwsgpr": [{"0_Comment Submission": "Hey /r/drugs, I tried MDMA for the first time two days ago. I am now experiencing something very odd.", "1_Text": "One day at a time my friend. It gets easier.. just make sure you take some time for you for time to time", "2_Subreddit": "Drugs"}], "drj9e7q": [{"0_Comment Submission": "Should I cop?", "1_Text": "Its funny how when WD's start you start to reason with yourself.. I can just get one OC 20 and split it between the next two days. And its gone by lunch time.", "2_Subreddit": "opiates"}], "drjad3n": [{"0_Comment Submission": "can you smoke tabacco whilst on opiates?", "1_Text": "One of the main reasons why I'm still using. Not much, 25-30mg a day of OC.. but I looooove the sensation that I get when smoking. Thats what originally drew me down this path starting with Hydro's 6-7 years ago. I have kept it mostly under control, but fuck I want to quit now and I know quitting smoking/vaping would help", "2_Subreddit": "opiates"}], "drjkb94": [{"0_Comment Submission": "Question on tapering", "1_Text": "> Not a big habit\n\n\nThats why I'm trying to kill it now. I never planned on getting even this deep into it. My issue and trigger is work. I have been using before I go to work for so long that I don't remember what being sober at work is like. \n\nTo the point where I went up for a vendor cert (I'm in IT) and failed the test twice sober. Ate an OC the morning of attempt #3 and crushed the test. \n\nAlmost confirms the study high, take test high, get high scores haha", "2_Subreddit": "opiates"}], "drjl8y3": [{"0_Comment Submission": "Question on tapering", "1_Text": "Will do!\n\nThank you!", "2_Subreddit": "opiates"}], "drs1rob": [{"0_Comment Submission": "Getting sober... in California", "1_Text": "I hit day 2 on Xmas Morning. Started feeling sick as shit. Can't tell if I'm sick from WD's, or if I have the flu, or both... I did drag my ass into work today tho.. its everything I can do from calling dBoy", "2_Subreddit": "opiates"}], "dsit43x": [{"0_Comment Submission": "TIFU by hooking my neighbor up with a con and causing his wife to kick him out", "1_Text": "Thats actually a pretty damn good troll. Hat off to you.\n\nI had a guy messing with my wife online so I was able to get his address and found a link to have Mormons visit his house.. you know to ask if he had found god. \n\nAlso reminds me of the Mormon boys that lived in our apartment complex and they usually kept to themselves in regards to going door to door around the complex. \n\nOne day a group of Johova's witness were going door to door. They finally made it to the Mormon boys house and they invited the witnesses in. I wish I could be a fly on the wall for that conversation. \n\nI will have to remember this one.", "2_Subreddit": "tifu"}], "dtrtbh8": [{"0_Comment Submission": "Had a close call with the PD last night", "1_Text": "A pill bag in my wallet? Wouldn't that crush them when I sit down? \n\nI mean, it makes sense.. but even then without a script I'm screwed. What difference would a pill bag make?", "2_Subreddit": "opiates"}], "dtrxbjb": [{"0_Comment Submission": "I [20F] am attracted to chubby men... even those with bellies and I'm ashamed", "1_Text": "It's alright.. I have a MAJOR pregnancy fetish. I think Pregnant women are extremely beautiful.", "2_Subreddit": "sex"}], "dtrxeqe": [{"0_Comment Submission": "Had a close call with the PD last night", "1_Text": "No that makes perfect sense!!\n\nI usually get 20mg Oxy IR that I split in half and take 10mg each time I dose.. so it wouldn't be the end of the world if they got broken up. I guess its time to invest in some pill pouch bags. \n\ndBoy usually only has empty Rx bottles so thats what he hands them to me in", "2_Subreddit": "opiates"}], "du503ux": [{"0_Comment Submission": "the ritual of doing drugs is just as addictive as the drug itself", "1_Text": "my DOC is Oxy or Opiates in general. Not much, maybe 20mg a day... but half of the rush is getting a hold of my buddy, getting down to his house, picking up then waiting for the come up. The anticipation of the \"roll through\" text back.. ah.", "2_Subreddit": "Drugs"}], "dw5twxj": [{"0_Comment Submission": "My aunt died yesterday out of the blue. My mom and family took it hard. She had it coming unfortunately.", "1_Text": "As someone struggling with an opiate addiction, this is very powerful. No one in my family or close circle outside of my boss (ironically) knows about it.", "2_Subreddit": "AdviceAnimals"}], "dwp13cd": [{"0_Comment Submission": "Kremlin Says Donald Trump Has Invited Vladimir Putin to the White House", "1_Text": "I'm shocked he hasn't been impeached yet", "2_Subreddit": "worldnews"}], "dwr31yw": [{"0_Comment Submission": "15 floppy disks for installing Windows 95", "1_Text": "I remember my mom bringing home a copy of windows 3.11 and installing over the top of DOS. When I learned how to open and close a window I was hooked. I'm a Sr System Engineer 28 years later", "2_Subreddit": "mildlyinteresting"}], "dwrmr25": [{"0_Comment Submission": "Tuesday April 3rd Daily Check In", "1_Text": "being able to work from home today and take care of my sick daughter. Im back on day 1 after a relapse after a week, (after 2 years on)\n\nI slipped, once but I'm back on the horse. \n\nI'm thankful I was able to snuggle up on the couch with her and not be feinding for my next pill. She was the most important thing today. Not calling my boy for a cop.", "2_Subreddit": "OpiatesRecovery"}], "dwrysdn": [{"0_Comment Submission": "My local drug dealer started dressing up as a Jehovah’s Witness so he wouldn’t arouse suspicion.", "1_Text": "We had a few missionaries in our complex. They were usually cool.. never came knocking thankfully. \n\nA group of JW did however knock, we sent them on their way and they were actually invited into the mormans apartment. I'm sure they each did their spiel and went on their way", "2_Subreddit": "Jokes"}], "dwsgd3z": [{"0_Comment Submission": "Share how many days clean you are", "1_Text": "3 days!!!\n\nFirst time in a while and I don't feel like crap!", "2_Subreddit": "OpiatesRecovery"}], "dwshnh1": [{"0_Comment Submission": "Share how many days clean you are", "1_Text": "It Happens. I tried to kick for the last 6 Months.. got a week in and it's funny how it finds you again. Relapsed for a day (1 20 mg OC) and back on day 3 again. After daily use of 2 years on, I'm grateful to wake up and go to work sober for the first time in almost a year.", "2_Subreddit": "OpiatesRecovery"}], "dwxcwbh": [{"0_Comment Submission": "I have never done any opiates. I've been browsing this sub for ~2 hours now.", "1_Text": "This. I was using daily with a co-worker. I stopped (thankfully) and he's still going.. its been interesting to say the least because I can tell when he's on a sick one or not.. and when he feels like shit.. or not.", "2_Subreddit": "opiates"}], "dwxjydq": [{"0_Comment Submission": "Share how many days clean you are", "1_Text": "Thankfully no. \n\nBut it reminded me that I have to be that much more careful and just stay off of it. Its easier all around. It was so nice waking up and not having calling my buddy be the first thing on my mind.", "2_Subreddit": "OpiatesRecovery"}], "dwy8ept": [{"0_Comment Submission": "Friday April 6th Daily Check In", "1_Text": "I know absolutely what you're going through. The only person who knew I was using was my best friend (source) and my co worker who I would pickup for. No more though because when I would pickup for him, I would get a few for myself and it was an endless cycle.", "2_Subreddit": "OpiatesRecovery"}], "dwy8zmv": [{"0_Comment Submission": "if he can do it...", "1_Text": "Never skip leg day", "2_Subreddit": "funny"}]}], "1_submissions": [{"7l3tku": [{"0_Title": "Question on tapering", "1_Text": "I boofed E once. Crushed it up and put it up my bum.. very interesting roll", "2_Subreddit": "opiates"}], "7p05qb": [{"0_Title": "In Check with Reality.. or a bad trip", "1_Text": "I boofed E once. Crushed it up and put it up my bum.. very interesting roll", "2_Subreddit": "trees"}], "7r59ip": [{"0_Title": "Libido and Oxy?", "1_Text": "I boofed E once. Crushed it up and put it up my bum.. very interesting roll", "2_Subreddit": "opiates"}], "7vfbzo": [{"0_Title": "Had a close call with the PD last night", "1_Text": "I boofed E once. Crushed it up and put it up my bum.. very interesting roll", "2_Subreddit": "opiates"}]}]}]}