{"Kyoki64": [{"0_comments": [{"dugbh9r": [{"0_Comment Submission": "Should we give up half of the Earth to wildlife? Populations of all kinds of wildlife are declining at alarming speed. One radical solution is to make 50% of the planet a nature reserve by 2050.", "1_Text": "so brave", "2_Subreddit": "Futurology"}], "dui1ixm": [{"0_Comment Submission": "\"Make maps great again\"", "1_Text": "autism", "2_Subreddit": "osugame"}], "dunrw3n": [{"0_Comment Submission": "There are but three things I want from osu! now", "1_Text": "i want free pp", "2_Subreddit": "osugame"}], "dup69i2": [{"0_Comment Submission": "Back after long hiatus, need some maps", "1_Text": "message tillerino with !r in game", "2_Subreddit": "osugame"}], "dvcrbty": [{"0_Comment Submission": "Ni-Sokkususu - Blade Dance (mapped by Neoskylove) has been qualified yesterday! (TV-size, 6.11* top diff)", "1_Text": "but at least the bearizm one is pretty and satisfying to watch this one is just like every other map ive ever seen", "2_Subreddit": "osugame"}], "dvgbzh0": [{"0_Comment Submission": "March 03: Weekly achievement and help thread", "1_Text": "hi, im a shitty 5 digit and i have a question\n\nso, on bearizm's [kneesocks] i have literally never ever passed the map because on the diff spike i get incredibly lost. i can't even come close to reading it and i fail 100% of the time after hitting like the first 4 notes of it.\n\nso I went on mcosu and i played it but used the mods to flip it both vertically and horizontally and i fc'd the pattern first try; additionally, I didn't have trouble reading it on the following attempts, but if I play it without being flipped it becomes unreadable again\n\nwhy??? how do i fix this?", "2_Subreddit": "osugame"}], "dvged9u": [{"0_Comment Submission": "How should I take addy", "1_Text": "🅱00F", "2_Subreddit": "Stims"}], "dvifn9v": [{"0_Comment Submission": "idke | xi - Blue Zenith [FOUR DIMENSIONS] (Asphyxia) +HR 98.92% FC | 711pp #2 | 81.70UR", "1_Text": "add a 1x1 transparent image to the skin called 'sliderendcircle.png' you can just copy and paste this file from any other skin with invisible sliderends", "2_Subreddit": "osugame"}], "dvq7vvv": [{"0_Comment Submission": "Karthy | Various Artists - Songs Compilation [Marathon] (57.85%) FC", "1_Text": "yeah especially since it's literally impossible on maps with sliders", "2_Subreddit": "osugame"}], "dvq9kdd": [{"0_Comment Submission": "r/osugame meetup 3018", "1_Text": "Ye XD", "2_Subreddit": "osugame"}], "dvqae53": [{"0_Comment Submission": "Various Artists - Songs Compilation (mapped by Sotarks) is now ranked!", "1_Text": "pretty much all of that star rating comes from my hero im pretty sure, my hero is 4.8* by itself and the 2 songs that follow it are much easier", "2_Subreddit": "osugame"}], "dvrlrt1": [{"0_Comment Submission": "Karthy | Various Artists - Songs Compilation [Marathon] (57.85%) FC", "1_Text": "doesnt give a 50", "2_Subreddit": "osugame"}], "dvu12m2": [{"0_Comment Submission": "alumetri \\ shitmap +3mod fc shitacc¨% a whole 708 Perfomance Points", "1_Text": "but u can literally remove 6 circles from the map and reduce the star rating by 0.7* (or 1* with dt on) (or 1.1* with dthr on)\n\nedit: im sure you could easily reduce the star rating more with the same amount of circles or even less if you chose more wisely, i just made a quick edit to the map because i was curious. if anyone is wondering which circles i removed, here they are:\n\nthe circles at 59:918, 1:00:259, 1:00:600, 1:01:111 and circles (6) and (8) in the final jump section", "2_Subreddit": "osugame"}], "dwatknb": [{"0_Comment Submission": "That face when the meth hits you too hard and you're deciding between calling 911 or doing more", "1_Text": "i get this, ive started to think it's because hours after my last dose is when the vasoconstriction hits the hardest, especially at night time because the temperature starts to decrease significantly. i try to stay warm and that helps a bit", "2_Subreddit": "Stims"}], "dwatuec": [{"0_Comment Submission": "That face when the meth hits you too hard and you're deciding between calling 911 or doing more", "1_Text": "I'm not sure, I might be different because I also get many other much more worrying symptoms along with high heart rate (mainly that the skin on my hands, feet and arms goes numb). My vasoconstriction gets severe to the point where if I touch a metal handle with my hands there isn't enough blood flow to warm it back up so I have to warm it up manually, lol.\n\nI've went to the ER three times before and every single time my body temperature was pretty low, and I tended to feel a lot better after spending some time there and I'm pretty sure it's because it's crazy warm in there.\n\nThe best cure for it, though, is a benzodiazepine in my experience. Pretty much solves all my problems right away. My vasocontriction completely disappears and my heart rate goes back to normal.", "2_Subreddit": "Stims"}], "dwcvhcs": [{"0_Comment Submission": "lain | Casandra - Junpaku*study time [Semi Little Girl!] +HR (97.51%) 6xmiss 2141/2276x | 622pp | 96.36UR", "1_Text": "he could but i doubt he wants to", "2_Subreddit": "osugame"}], "dwdmlsz": [{"0_Comment Submission": "Trying to sleep and or eat", "1_Text": "idk if it was just placebo or not but around 800-1200mg L-theanine seemed to help me when I didn't have benzos", "2_Subreddit": "Stims"}], "dwdmxuz": [{"0_Comment Submission": "Using small amounts semi-regularly (meth)", "1_Text": "smoking must suck ass if you can smoke 2 points then go to bed at night what the fuck\n\neither that or you have really bunk stuff so it could have some shit in it thats worse for you or w/e", "2_Subreddit": "Stims"}], "dwfi79b": [{"0_Comment Submission": "Using small amounts semi-regularly (meth)", "1_Text": "nigga 1 point would keep me up for at least 25 hours", "2_Subreddit": "Stims"}], "dwj5gn1": [{"0_Comment Submission": "When you're on day 3", "1_Text": "too real", "2_Subreddit": "Stims"}], "dwotrjd": [{"0_Comment Submission": "Drug taking loophole", "1_Text": ">have a day off drugs Monday\n\n:mask:", "2_Subreddit": "opiates"}], "dwoyian": [{"0_Comment Submission": "Resposible amphetamine use", "1_Text": "'If I break any rule, the punishment is that I have to flush all of my amphetamine down the toilet.'\n\nthats not really how it works lol if you break any rule the punishment is that you will probably be addicted to amphetamine eventually\n\nyour rules are much stricter than a normal add prescription so i dont really see how you could question whether or not it's responsible", "2_Subreddit": "Stims"}], "dwrl56x": [{"0_Comment Submission": "MATHI CONFESSED TO CHEATING BibleThump", "1_Text": "lol what a loser", "2_Subreddit": "osugame"}], "dwt8y6d": [{"0_Comment Submission": "lain | Fujijo Seitokai Shikkou-bu - Best FriendS (GoldenWolf Edit) [Extreme] +HD,NC FC 98.55% #1 661pp", "1_Text": "at least anime ban isnt an ugly fucking mess", "2_Subreddit": "osugame"}], "dwym7ph": [{"0_Comment Submission": "Why’d you start using?", "1_Text": "i hate being bored more than almost anything and stims pretty much cure boredom", "2_Subreddit": "Stims"}]}], "1_submissions": [{"2166ea": [{"0_Title": "A small change that I think we can all agree would make League of Legends much more enjoyable", "1_Text": "so brave", "2_Subreddit": "leagueoflegends"}], "2ao1ob": [{"0_Title": "[Theorycraft] R.I.P. AP Runes?", "1_Text": "so brave", "2_Subreddit": "leagueoflegends"}], "2gt1ib": [{"0_Title": "Imathian Surprise: Why AP Kog is better late than AD Kog! (Math inside)", "1_Text": "so brave", "2_Subreddit": "leagueoflegends"}], "4t92e9": [{"0_Title": "Today, Hillary Clinton literally killed my gay, autistic, disabled cat who had social anxiety. He was 100 years old and I got him when I was just 4. His dying wish was for me to get karma. Give me karma.", "1_Text": "so brave", "2_Subreddit": "circlejerk"}], "4tqeyg": [{"0_Title": "I know I'll get karma for this, but I'm going to post it anyway. Tumblr is for SJWs and feminists are bad.", "1_Text": "so brave", "2_Subreddit": "circlejerk"}], "5lwz5a": [{"0_Title": "me irl", "1_Text": "so brave", "2_Subreddit": "me_irl"}], "5lx39o": [{"0_Title": "meirl", "1_Text": "so brave", "2_Subreddit": "meirl"}], "60o8wb": [{"0_Title": "me_irl", "1_Text": "so brave", "2_Subreddit": "osugame"}]}]}]}