{"MadAzza": [{"0_comments": [{"dwupjpt": [{"0_Comment Submission": "The Transporter Chief showing off the new craze, sweet potato beakstick (lipstick)", "1_Text": "It looks quite fetching!", "2_Subreddit": "parrots"}], "dwurw3f": [{"0_Comment Submission": "Spinderella draws a picture while spinning on her head", "1_Text": "Spinderella’s not a fella.", "2_Subreddit": "UNBGBBIIVCHIDCTIICBG"}], "dwusg17": [{"0_Comment Submission": "Beach Party Bingo", "1_Text": "Yeah, they all look so ... *young*. Like enormous, smooth babies waiting for a nappy change. I prefer the “shaved clean below and at the sides, leaving the front otherwise intact” look, but then I’m nearly hairless without shaving. \n\nAnd as long as they aren’t using actual babies, I don’t care. \n\n*Looks around* Uh ... never mind.", "2_Subreddit": "trashyboners"}], "dwvx51i": [{"0_Comment Submission": "Sitting in a line of cars, when suddenly...", "1_Text": "Didn’t the car move left because it was hit from the right rear?", "2_Subreddit": "dashcamgifs"}], "dwvxcvk": [{"0_Comment Submission": "Sitting in a line of cars, when suddenly...", "1_Text": "It’s not your fault if someone hits you and you hit another. That’s why those people who claim that a rear-ender is *always* the fault of the “behind car” are nitwits. \n\nIt’s not your fault if you’re rear-ended and pushed forward into another vehicle.", "2_Subreddit": "dashcamgifs"}], "dwvxfwc": [{"0_Comment Submission": "Sitting in a line of cars, when suddenly...", "1_Text": "The guy you responded to said that exact thing.", "2_Subreddit": "dashcamgifs"}], "dwvxxn7": [{"0_Comment Submission": "Please don’t talk to her while she works.", "1_Text": "I don’t understand why people who are supposed to be working are compelled to come by and start yammering at me when I’m helping a customer. \n\nIt’s rude to me, and it’s rude to the customer, who should be getting my full attention. Meanwhile, that twat from Women’s Shoes thinks the party she went to last night is soooo interesting that of course everyone wants to hear it. \n\nSo glad I don’t work retail anymore. The coworkers are usually worse than the customers.  \n\n/in the wrong sub", "2_Subreddit": "TalesFromRetail"}], "dwvxzyi": [{"0_Comment Submission": "Sitting in a line of cars, when suddenly...", "1_Text": "Haha, it’s ok, most of us fade out before the end of a post now and then!", "2_Subreddit": "dashcamgifs"}], "dwvy321": [{"0_Comment Submission": "Yes - Yours Is no disgrace live 1972 (Yessongs)", "1_Text": "I saw him wearing it, back in the Seventies (too old to remember which show, heh).\n\nIt was glorious.", "2_Subreddit": "ClassicRock"}], "dwvy8d1": [{"0_Comment Submission": "Cow Lick", "1_Text": "Dunno why you’re being downvoted. It’s obviously true — the hat is doing nothing to keep her hair dry!", "2_Subreddit": "happycowgifs"}], "dwvykeq": [{"0_Comment Submission": "This is going to clash with my outfit.", "1_Text": "Gee, I sure am glad that the medical decisions concerning chronic pain meds are being made by people who make more money by keeping pain medication scary and nearly impossible to get. \n\nThanks, fucktards! Thanks, fellow stupid Americans who fall for this scaremongering bullshit about “opioids,” when most of the deaths are heroin-fentanyl related! Thanks, assholes who don’t live with crippling pain telling those who do to suck it up!\n\nI hope you all end up suffering the way chronic pain patients do, and that you can’t get pain medication.", "2_Subreddit": "ChronicPain"}], "dwvyn3x": [{"0_Comment Submission": "This is going to clash with my outfit.", "1_Text": "It shouldn’t make you laugh. It should infuriate you that fear-mongering DEA whores are managing people’s medical care.", "2_Subreddit": "ChronicPain"}], "dwvys3r": [{"0_Comment Submission": "This is going to clash with my outfit.", "1_Text": "True fact. And I’m allergic to most (yes, most!) antibiotics and classes of antibiotics. So far, we’ve found four that don’t want to kill me. \n\nBetween that and the DEA criminalizing my other medication, I’m doomed. La de dah! ... sorry, bad mood.", "2_Subreddit": "ChronicPain"}], "dwvyuj2": [{"0_Comment Submission": "This is going to clash with my outfit.", "1_Text": "Thank you for speaking the unpopular truth.", "2_Subreddit": "ChronicPain"}], "dwwkgp7": [{"0_Comment Submission": "Sitting in a line of cars, when suddenly...", "1_Text": "What a mess!", "2_Subreddit": "dashcamgifs"}], "dwwp56o": [{"0_Comment Submission": "TIFU when I tried to take a quick shower", "1_Text": "Hell, *I* don’t believe him!", "2_Subreddit": "tifu"}], "dwwpd9d": [{"0_Comment Submission": "TIFU when I tried to take a quick shower", "1_Text": "That’s probably close.", "2_Subreddit": "tifu"}], "dwwph8g": [{"0_Comment Submission": "TIFU when I tried to take a quick shower", "1_Text": "And for God’s sake, clean the blood and bits of poop and anus off first!", "2_Subreddit": "tifu"}], "dwxljey": [{"0_Comment Submission": "Hotel Hallway", "1_Text": "The airline pilot who’s trying to get some sleep before her red-eye flight is not amused. \n\nI detest drunken twats like these, and anyone else who treats a hotel hallway like their own Romper Room. Shut up and walk quietly to your room/the bar/outside, idiots! People are trying to sleep, and other people’s lives depend on them being able to.", "2_Subreddit": "trashyboners"}], "dwxw4s7": [{"0_Comment Submission": "This is going to clash with my outfit.", "1_Text": "Thank you for understanding, and for not taking offense at my hastily formed thoughts. I’m glad you were able to get clean, and that you’re alive today. \n\nI don’t think addicts can just will themselves to do anything, though. You can’t will your body chemistry (or whatever) to change. For them, and whoever else wants it, by all means, Narcan that mofo! My disagreement is with the lumping in of medication with heroin, and junkies aren’t the ones doing that. This is why my medication has been nearly cut off — because the DEA want more power, and it is getting that power by making Americans think that people who take opioids (prescribed, necessary, often life-saving medication) are all worthless drug addicts who should just stop taking their medication. The people dying are heroin users who are victims of fentanyl substitution, and pain patients forced to get their medication (now with added fentanyl!) from dealers because the health care system cut them off.\n\nFurther, the U.S. is re-criminalizing its approach to drug addiction (heroin, Valium, oxycodone, whatever). This approach is bad, and it is killing people who can’t bear the pain any longer and are blowing their brains out ... because of the invented “opioid crisis.” We have a fentanyl crisis, not an “opioid crisis”!\n\nDang, I really need to take a pill ... lol. Sorry for ranting again!\nEdit for clarity, fentanyl, and to add second sentence <3", "2_Subreddit": "ChronicPain"}], "dwxwalj": [{"0_Comment Submission": "This is going to clash with my outfit.", "1_Text": "Ah, jeez, I’m sorry for your pain.\n\nI just ranted again, elsewhere in the thread. One-handed, because the pain in my bad shoulder is a bit intense today, so I’m letting it rest. :-)\n\n(I swear, I’m not always like this!)", "2_Subreddit": "ChronicPain"}], "dwy495a": [{"0_Comment Submission": "HQ Trivia knocks out over 100k players with a question about the correct spelling of the Berenstein Bears.", "1_Text": "Yes, It’s Berenstain. It’s wrong in the headline because the OP enjoys messing with people..", "2_Subreddit": "MandelaEffect"}], "dwy4mpn": [{"0_Comment Submission": "Simone Segouin in 1944 Paris", "1_Text": "Honey, these shorts are doing nothing for your hips. And that color! Ugh. ... You know, a line drawn down the back of your leg with a bit of charcoal will give the illusion of stockings, regardless of the government’s rules about rationing. And for heaven’s sake, please put on a little lipstick! You’re a sniper, not a butcher’s wife. ... oh, dear God, those shoes!", "2_Subreddit": "wwiipics"}], "dwy4vyl": [{"0_Comment Submission": "Former U.S. Sen. Daniel Akaka Dead At 93", "1_Text": "Waihe‘e was state, though, not federal. Akaka was in Washington. Sen. Daniel Inouye had much more power, being the senior senator, but Akaka comported himself very well.\n\nI had many meetings with the man, due to my job. I didn’t know him well, and won’t tell you I did, but he was always kind and courteous, and everyone knew him to be a gentleman.", "2_Subreddit": "Hawaii"}], "dwy6341": [{"0_Comment Submission": "[USA][SF] Slow down in the rain! Hydroplaning SUV right into center median.", "1_Text": "Remember this formula: 9 x SQRT {tire pressure} \n\nThis formula works for any vehicle size — I learned it in flight school. An aerobatic instructor I knew at the time (the guy I ended up marrying the first time) was an airline pilot. When you’re flying a 777 or other passenger or cargo jet, it’s really important not to hydroplane while landing.\n\nYour tires will hydroplane at about 9 x the square root of your tire pressure. Even for the math-deficient driver, it’s not hard to figure out. If your rear tires have 36 psi, you will hydroplane at 54 mph. (The square root of 36 is 6. Six times nine is 54. Ta-da!)\n\nYes, some factors will change this equation, in reality (tire tread/composition, road surface, etc.). That’s why it’s a *general* rule.\n\nIt’s not exact, but it’s close enough. If you want to be extra-careful, knock a couple of mph off. (Always err on the slower side.)\n\nIf you end up hydroplaning anyway, take your foot off the gas and keep the tires pointed in the direction of travel. Don’t do anything else until you feel solid ground. You might hit someone or something, but panicking and oversteering when you come out of it won’t help.", "2_Subreddit": "Dashcam"}]}], "1_submissions": [{"7yqz73": [{"0_Title": "We appreciate you! (From a customer)", "1_Text": "It looks quite fetching!", "2_Subreddit": "TalesFromThePizzaGuy"}], "8aeg7e": [{"0_Title": "Cat", "1_Text": "It looks quite fetching!", "2_Subreddit": "CatsStandingUp"}]}]}]}