{"justaquestion1010101": [{"0_comments": [{"dwkzyla": [{"0_Comment Submission": "Waiting is the fucking worst", "1_Text": "I have 2 guys and they don't take calls", "2_Subreddit": "opiates"}], "dwl0le9": [{"0_Comment Submission": "How many of you have an accompanying mental disorder ?", "1_Text": "Are depression and anxiety mental disorders? Then yes.", "2_Subreddit": "opiates"}], "dwl6z46": [{"0_Comment Submission": "Man I’m just having good day after good day! Love serving!", "1_Text": "Jelly man. Enjoy.", "2_Subreddit": "opiates"}], "dwl9zir": [{"0_Comment Submission": "10 minutes, papi", "1_Text": "Been waiting since 11am yesterday. Fuuuuuck", "2_Subreddit": "opiates"}], "dwla69y": [{"0_Comment Submission": "A day at a time.", "1_Text": "Im about 25 days out from jumping off my 90mg methadone too. Sucks. Still shooting dope", "2_Subreddit": "opiates"}], "dwm1pri": [{"0_Comment Submission": "Dr Phil trying to help Heroin addicts by threatening them and looking down on them pisses me off", "1_Text": "OP, why do you spell \"fuck\" without the letter \"c\"? Just curious.", "2_Subreddit": "opiates"}], "dwn4k3c": [{"0_Comment Submission": "$180 for a gram is fuckin killing me.", "1_Text": "180 a gram here in Canada too bro. And its more like .7g at best. Sucks dick", "2_Subreddit": "opiates"}], "dwnf5tb": [{"0_Comment Submission": "I sat with a loaded gun to my head today", "1_Text": "I agree that .223 isnt a surefire thing. Id go with a 7.62 if I absolutely had to. But I would point it in mouth and DOWNWARD towards your brainstem, not towards the upper back of your head.\nHonestly OP, stick around longer. You might be glad you did", "2_Subreddit": "SuicideWatch"}], "dwnffu5": [{"0_Comment Submission": "I sat with a loaded gun to my head today", "1_Text": "True, there is no magical stopping power or caliber. Bones can hit certain areas of blood supply, hit bone and shatter it causing further tissue death and damage, or bullets xan torque and fragment. Or they can go right through the person with little fragmentation. They also bounce. Depends on shot placement, caliber, cartridge, weight and grain, etc. Ive talked to army medics who say they've only seen 1 shot 1 kill a couple of times in their decades long careers... IIRC it was a contact handgun wound to the chest. Nothing is black and white in that subject", "2_Subreddit": "SuicideWatch"}], "dwtdbbi": [{"0_Comment Submission": "Did Anyone Get Their Tax Refund Money yet? I did at 4 Am. At 4:05 i called the dboy. Didnt spend a lot, trying to cut down and save $", "1_Text": "Not refund money but I will have 0.7g dope and 0.3g hard in the next few hours. Can't wait", "2_Subreddit": "opiates"}], "dwtdeqv": [{"0_Comment Submission": "Did Anyone Get Their Tax Refund Money yet? I did at 4 Am. At 4:05 i called the dboy. Didnt spend a lot, trying to cut down and save $", "1_Text": "This is great and horrible advice all at once lol", "2_Subreddit": "opiates"}], "dwwr6v4": [{"0_Comment Submission": "Did Anyone Get Their Tax Refund Money yet? I did at 4 Am. At 4:05 i called the dboy. Didnt spend a lot, trying to cut down and save $", "1_Text": "I agree, tbh I get drunk once every week or two (I shoot about a half gram or so of dope a day) to enhance my IV regimen. I've come close to ODing, however, but I'm developing a tolerance to the alcohol. The dope mostly just keeps me well... I only get high if I smoke crack too, and I only nod if I mix alcohol or benzos. Might be time for a tolerance break. IME, 2 weeks off is usually enough to destroy my tolerance completely (although it's a miserable 2 weeks)", "2_Subreddit": "opiates"}], "dwwrh24": [{"0_Comment Submission": "Today’s pick up", "1_Text": "I find this true. The best blow was usually yellow-ish, and the best crack is brown-ish. Just in my experience. And whenever I'd give away lines, rocks, or sell either of them, people would be sketched out. I don't think they're used to that wedding cake/oily soft or legit corner cookie", "2_Subreddit": "opiates"}], "dwwrmw2": [{"0_Comment Submission": "wish my dboy would see this ad 🙄", "1_Text": "honestly, I always preferred hearing \"15 minutes\" instead of \"let you know\" or \"soon\". 15 minutes at worst is like, an hour", "2_Subreddit": "opiates"}], "dwwsgcg": [{"0_Comment Submission": "Did half of each already , but .4 of hard and .3 of Canadian brown Fent. I smoke both on tin foil, weird hey?", "1_Text": "Just what I was thinking. I used to get hard that was glossy and waxy looking, so much better than the holey crackley little rocks that snap apart nowadays. I'm in Canada too!", "2_Subreddit": "opiates"}], "dwwsjmb": [{"0_Comment Submission": "Did half of each already , but .4 of hard and .3 of Canadian brown Fent. I smoke both on tin foil, weird hey?", "1_Text": "I often don't have a stem and don't bother using a can or foil pipe with cigarette ash... I smoke rocks on foil, I usually put a little indent or mold a slightly concave bend in the foil and place the rock there. Definitely wasteful, I'd say at best you get 40% as high compared to using a stem. But to be honest I only buy $20 or $40 of rock at a time so I don't go on benders anymore", "2_Subreddit": "opiates"}], "dwwsq94": [{"0_Comment Submission": "Did half of each already , but .4 of hard and .3 of Canadian brown Fent. I smoke both on tin foil, weird hey?", "1_Text": "I live in Toronto and dope costs between $15 and $40 a point. Depends on quality and on the dealer. Any time I run into fent that's advertised as dope I never buy again (it's happened twice, ever). I pay $10 per 0.1g of hard, but the dealers often eyeball it so sometimes you get a good deal and other times you get ripped off. Quality is all over the place too. I smoke my hard off foil too! Hard to find stems and can't be bothered to make a pop can pipe/foil pipe with cigarette ash half the time", "2_Subreddit": "opiates"}], "dwwss5u": [{"0_Comment Submission": "Self medication", "1_Text": "Yup. Pretty sure addiction/substance use disorder usually has a comorbid psychiatric condition (anxiety, depression, borderline, bipolar, etc.)", "2_Subreddit": "opiates"}], "dwwswkf": [{"0_Comment Submission": "Around 200 pressed busses, just woke up from a long blackout", "1_Text": "Damn, I'd kill for a single bar. Haven't had any benzos in months. :(\nEnjoy OP!", "2_Subreddit": "opiates"}], "dwwt0pn": [{"0_Comment Submission": "Not opiate related but this fking song has been stuck in my head all week.", "1_Text": "This one has been stuck in my head for weeks...\n\nhttps://www.youtube.com/watch?v=LngatAUzTNI", "2_Subreddit": "opiates"}], "dwwu61w": [{"0_Comment Submission": "Did half of each already , but .4 of hard and .3 of Canadian brown Fent. I smoke both on tin foil, weird hey?", "1_Text": "yea. the worst part is that I use a foil tooter which collects all that yummy resin from the crack. but the resin collects near the edges and I often waste it trying to unroll and smoke it off the tooter foil itself... usually catches fire... maybe i should try adding alcohol (isopropyl) and let it dry on foil", "2_Subreddit": "opiates"}], "dwwup4a": [{"0_Comment Submission": "Sonic Youth - Bull in the Heather [alt rock]", "1_Text": "same, love this track, Sonic Youth is awesome", "2_Subreddit": "WNOD"}], "dwwusj0": [{"0_Comment Submission": "Elliot Smith - Kings Crossing (very sad indie)", "1_Text": "same.\n\"open your parachute and grab your gun\nfalling down like an omen, a setting sun\"", "2_Subreddit": "WNOD"}], "dwwuvsh": [{"0_Comment Submission": "question about crack resin/residue", "1_Text": "i've been dreaming about shooting soft and I have't IVed coke in years.\ntbh we don't really have hood convenience stores around here, there aren't stems that are easy to come by. maybe i should grab a tire \npressure gauge :P", "2_Subreddit": "opiates"}], "dwwux4z": [{"0_Comment Submission": "question about crack resin/residue", "1_Text": "i think part of why i like smoking off foil is cuz i dont get paranoid. i still get a good 1st blast, nothing beats the first one.", "2_Subreddit": "opiates"}]}], "1_submissions": [{"7ljwa5": [{"0_Title": "Overdose", "1_Text": "I have 2 guys and they don't take calls", "2_Subreddit": "SuicideWatch"}], "839bg9": [{"0_Title": "This is completely hypothetical. But there's no help out there for people with this problem.", "1_Text": "I have 2 guys and they don't take calls", "2_Subreddit": "SuicideWatch"}], "83a0jx": [{"0_Title": "Methadone to heroin - am I fucked?", "1_Text": "I have 2 guys and they don't take calls", "2_Subreddit": "opiates"}], "849xs1": [{"0_Title": "30 year old addict", "1_Text": "I have 2 guys and they don't take calls", "2_Subreddit": "SuicideWatch"}], "879ab9": [{"0_Title": "Risk cotton fever... Or not?", "1_Text": "I have 2 guys and they don't take calls", "2_Subreddit": "opiates"}], "879d1c": [{"0_Title": "Risk cotton fever? (this time with a photo!)", "1_Text": "I have 2 guys and they don't take calls", "2_Subreddit": "opiates"}], "8a9l4h": [{"0_Title": "question about crack resin/residue", "1_Text": "I have 2 guys and they don't take calls", "2_Subreddit": "opiates"}]}]}]}