{"nodddingham": [{"0_comments": [{"dws7bwa": [{"0_Comment Submission": "Stoners of Reddit, what are your best nearly caught moments with the police?", "1_Text": "I used to deliver pizza too and would cruise around smoking. I swear a cop saw me hit my chillum once. I passed by him parked on my right as I hit it, he pulled out behind me and followed me for a few blocks. I stashed my shit and lit a cig, he pulled me and just gave me a ticket for my window tint which was really dark. Maybe the tint saved me, maybe he even thought he saw me but he couldn’t smell anything by the time he got me over and just thought it was the cig", "2_Subreddit": "AskReddit"}], "dws7dtk": [{"0_Comment Submission": "Stoners of Reddit, what are your best nearly caught moments with the police?", "1_Text": "Yeah, these days I NEVER ride with anything unless I have to.", "2_Subreddit": "AskReddit"}], "dwv3za0": [{"0_Comment Submission": "Musicians who went to very prestigious conservatories/universities for music (Juilliard, Curtis, New England, Berklee), where are you now? Did you end up landing a music job?", "1_Text": "No problem. Also, that’s not to say that you shouldn’t go to college at all, I do believe there is value in it, whether you use the degree or not. But I would suggest getting a more ‘safe’ degree, like business or something. I’ve never wished my degree was in engineering, but I’ve always thought a business degree would have given me some insight in how to do the business side of my freelance stuff better. \n\nAnd of course, if you were to go to one of those schools for music, you would come out a fuckin sick dirty shredder. All the people I know who have gone to those schools (I don’t know how many of them are full time musicians) are all at least incredible players. It’s just, the thing about music is, if you practice as much as those guys did you can be just as good. \n\nWe recently had a touring engineer come thru the venue I work at who was fresh out of Berklee for sound engineering and that kid had no idea what he was doing. He was the monitor engineer for a fairly popular band which I will not name. Not really sure how he even got the gig to begin with. Maybe he knew the technical concepts, but when it came to running a show, he flat out sucked. The best way to learn it is to do it. It seemed like my 6 or so years of personal education and real world experience absolutely crushed his 4 years from school. He reminded me of myself after like my first or second year of starting to learn.", "2_Subreddit": "AskReddit"}], "dwv59ry": [{"0_Comment Submission": "What is the first video game that you played?", "1_Text": "Probably like Pong or something", "2_Subreddit": "AskReddit"}], "dwv5iej": [{"0_Comment Submission": "Are there any circumstances in which if an official doesn't turn up for 15 minutes you are actually legally allowed to leave?", "1_Text": "Yeah, *legally* you’re allowed to leave pretty much any situation you’ll ever be in, aside for like incarceration.", "2_Subreddit": "AskReddit"}], "dwv9e0e": [{"0_Comment Submission": "What kind of pillow would a crack addict invent?", "1_Text": "Pillow full of crack", "2_Subreddit": "AskReddit"}], "dwva2nm": [{"0_Comment Submission": "How long do suboxone with drawls last?", "1_Text": "Acute withdrawals probably last roughly 4-8 days, but the specific feelings you mentioned may last months, depending on your body and how long you were addicted", "2_Subreddit": "OpiatesRecovery"}], "dwvhicz": [{"0_Comment Submission": "What is a common misconception about your occupation or area of expertise?", "1_Text": "I’m not a DJ and I don’t take requests. I am a sound guy and there is clearly a band playing.", "2_Subreddit": "AskReddit"}], "dwvlqvn": [{"0_Comment Submission": "What was cool when you were young but isn’t cool now?", "1_Text": "Airwalks\nJNCOs\nChain wallets\nShorts with knee-socks\nSpiky hair\nPogs\nGak\nYak-baks\nStretch Armstrong\nNerf (still cool?)\nScoubidou (Gimp)\nTamagotchis\nBeanie babies\nBlow-up plastic furniture\nWindows 3.5\nCordless phones\nCDs\nThe president\nAnd so much more...", "2_Subreddit": "AskReddit"}], "dwvme09": [{"0_Comment Submission": "What actor would you have liked to see play a part that went to another?", "1_Text": "Like an actor in a movie about a guy who is auditioning to be an actor in a play about a guy who is an actor in a movie?", "2_Subreddit": "AskReddit"}], "dwvmnsq": [{"0_Comment Submission": "How do you eat pussy?", "1_Text": "https://m.youtube.com/watch?v=znRn8NW3k-w", "2_Subreddit": "AskReddit"}], "dwvo5yx": [{"0_Comment Submission": "What actor would you have liked to see play a part that went to another?", "1_Text": "Well the main character would be the actor playing the actor playing an actor. So that would be Nick Cage\n\nThe casting director could be Jack Nicholson", "2_Subreddit": "AskReddit"}], "dwvoqgm": [{"0_Comment Submission": "What will someone never understand unless they're exactly like you?", "1_Text": "Sigh, how could I even expect you to understand?", "2_Subreddit": "AskReddit"}], "dwwhwps": [{"0_Comment Submission": "Please state what you do for a job. Do you honestly like your job?", "1_Text": "Audio engineer\nYes", "2_Subreddit": "AskReddit"}], "dwwhz8k": [{"0_Comment Submission": "Please state what you do for a job. Do you honestly like your job?", "1_Text": "I’m the guy that mixes all the instruments together and makes music sound goooood, both live at concerts and in the studio", "2_Subreddit": "AskReddit"}], "dwwi37z": [{"0_Comment Submission": "Please state what you do for a job. Do you honestly like your job?", "1_Text": "There are a couple bands I work with regularly but probably no one that you’ve heard of. I have on occasion had the opportunity to meet and mix several ‘underground famous’ people.", "2_Subreddit": "AskReddit"}], "dwwi5ei": [{"0_Comment Submission": "Please state what you do for a job. Do you honestly like your job?", "1_Text": "US", "2_Subreddit": "AskReddit"}], "dwwih2n": [{"0_Comment Submission": "Redditors who are/were addicts, how would you describe your addiction to non-affected?", "1_Text": "Once it sets in, it can accelerate quickly. It took me like 10 years before I was addicted to heroin, it was between 1-4 times a year for like 8 years but somewhere in that 8th year I slipped and eventually it got to a point where I felt like I had to use in order to function and very soon after that I had to use daily or I’d be sick. It became medicine, I knew I had to and wanted to quit but because of the obligations of life I couldn’t afford to quit and be sick for however many days. I’m in the process of getting clean now and it’s going very well, no suboxone in 11 days, no dope in like over a month.", "2_Subreddit": "AskReddit"}], "dwwj293": [{"0_Comment Submission": "Redditors who are/were addicts, how would you describe your addiction to non-affected?", "1_Text": "Well, at first you’re a little underwhelmed, it’s like “*this* is what all the hype is about?” It’s not as good as you expect but also I never shot it. On the other hand, once you’re hooked, and you’ve been sick for a day and then you take a big hit, it’s like gods pussy. Feels like warm, cozy, comfy contentment, feels like love.", "2_Subreddit": "AskReddit"}], "dwwj4tf": [{"0_Comment Submission": "Redditors who are/were addicts, how would you describe your addiction to non-affected?", "1_Text": "When you’re real high you ‘nod’ out and kinda are half-awake half-dreaming, I always loved a good nod.", "2_Subreddit": "AskReddit"}], "dwwjk5h": [{"0_Comment Submission": "Redditors who are/were addicts, how would you describe your addiction to non-affected?", "1_Text": "The first time I did it I was actually living with a guy who was addicted to it. I don’t know how I didn’t get hooked back then because he would give it to me whenever I wanted it, I did it a good number of times over like the first 6 months but had no problem stopping. After that he quit and therefor so did I, so for a long time I would just get pills from time to time or dope if I came across it (I work in the music biz and drugs are plentiful, I’m surprised it wasn’t coke for me cuz that shit seems to be everywhere) A few years later he got hooked again and I would get it from him every once in a while, and a few years after that is when I slipped and started getting it from him or his dboy all the time.", "2_Subreddit": "AskReddit"}], "dwwjz0j": [{"0_Comment Submission": "Redditors who are/were addicts, how would you describe your addiction to non-affected?", "1_Text": "Yeah, I mean I don’t see dope *that* often in my work, and that guy who I got it from is still a good friend of mine and is still using. There’s a possibility that I’ll relapse, but such is true for any addict. And in my mind I imagine that I probably will use it again one day anyway, but I know that day cannot be for a very very long time from now, and I’ll know that if that day comes that it will have to be the last day again for another very long time.", "2_Subreddit": "AskReddit"}], "dwwk9ba": [{"0_Comment Submission": "Redditors who are/were addicts, how would you describe your addiction to non-affected?", "1_Text": "I’ve done a lot of drugs in my life but dope was the only one that got me. (And weed but that doesn’t count, and cigarettes but that’s another story) I’ve seen how the dope takes over, but I’ve also lived most of my life as just a very casual user, ideally I’d like to go back to that. I’m hoping that now I won’t let that fact allow me to get cocky again, and if I approach it with more respect than I did to begin with maybe I can keep under control again one day. But we’ll see.", "2_Subreddit": "AskReddit"}], "dwwktig": [{"0_Comment Submission": "Redditors who are/were addicts, how would you describe your addiction to non-affected?", "1_Text": "Pretty good comparison, yeah", "2_Subreddit": "AskReddit"}], "dwyrr0y": [{"0_Comment Submission": "What concert did you go to that the opening band blew away the headliner?", "1_Text": "I’m a professional sound guy and I see this happen all the time", "2_Subreddit": "AskReddit"}]}], "1_submissions": [{"86zaxs": [{"0_Title": "Opie addict, first time kratom user", "1_Text": "I used to deliver pizza too and would cruise around smoking. I swear a cop saw me hit my chillum once. I passed by him parked on my right as I hit it, he pulled out behind me and followed me for a few blocks. I stashed my shit and lit a cig, he pulled me and just gave me a ticket for my window tint which was really dark. Maybe the tint saved me, maybe he even thought he saw me but he couldn’t smell anything by the time he got me over and just thought it was the cig", "2_Subreddit": "HerbalRVA"}], "887w0n": [{"0_Title": "If you had it, would you know what to do with it?", "1_Text": "I used to deliver pizza too and would cruise around smoking. I swear a cop saw me hit my chillum once. I passed by him parked on my right as I hit it, he pulled out behind me and followed me for a few blocks. I stashed my shit and lit a cig, he pulled me and just gave me a ticket for my window tint which was really dark. Maybe the tint saved me, maybe he even thought he saw me but he couldn’t smell anything by the time he got me over and just thought it was the cig", "2_Subreddit": "AskReddit"}]}]}]}