{"percbuster": [{"0_comments": [{"dtsr311": [{"0_Comment Submission": "I just found out that I am going to be a father. Its a total surprise, and I am super nervous. Tips please?", "1_Text": "Then what is it?  Please enlighten me.", "2_Subreddit": "OpiatesRecovery"}], "dtv2ezk": [{"0_Comment Submission": "FUCK HEROIN.", "1_Text": "Right, Heroin is such an asshole.  I can't believe he's so popular and has a ton of friends.", "2_Subreddit": "OpiatesRecovery"}], "dwli2n4": [{"0_Comment Submission": "Dr Phil trying to help Heroin addicts by threatening them and looking down on them pisses me off", "1_Text": "Dr Phil is a piece of shit.  Not sure if your idea would work though.  I have a well paying job, good family and friends, and I still slipped into dope.  By definition I 'made it', but still fell.  Im not sure what the answer is, but the story book definition of junky isn't always the case.  Many of us put suits on everyday and are very productive members of society.", "2_Subreddit": "opiates"}], "dwlip2p": [{"0_Comment Submission": "Hiccups (shitpost)", "1_Text": "Yes.  Especially when i tried to have a cigarette.  Every time I tried to take a drag I would hiccup with smoke in my lungs.  My wife knew it too so it fucking gave me away all the time lol.", "2_Subreddit": "opiates"}], "dwlur1w": [{"0_Comment Submission": "Something just felt off for weeks.", "1_Text": "Doesn't sound too bad.  Be thankful you dodged a bullet by catching it soon.", "2_Subreddit": "opiates"}], "dwmr8cj": [{"0_Comment Submission": "1 Month and 12 days check in. Intense Dreams", "1_Text": "Smoking some weed before bed supresses dreams for me.  Not sure if that's an option.. if you get drug tested or something at your job.", "2_Subreddit": "OpiatesRecovery"}], "dwni3cz": [{"0_Comment Submission": "My pet dog Jeff is a boofing machine and stopped breathing", "1_Text": "Call 911 or whatever emergency services is in your country.  Even if you are successful he can still fall out again after the narcan wears off.", "2_Subreddit": "opiates"}], "dwni83h": [{"0_Comment Submission": "SWIM loves Oxymorphone. When is it gonna end? (There, I fixed it).", "1_Text": "Not too long ago people would freak out if someone said SWIM or my pet dog on here like it's a drugs.com forum or something lol.. how times change", "2_Subreddit": "opiates"}], "dwoj0cr": [{"0_Comment Submission": "For those who took Subs when quitting H, how long did you wait before taking them and what was your experience? Did they help significantly?", "1_Text": "I used 8mg Subutex pills.  I waited 16 hours to dose.  I was so scared of precipitated wds and I know 16 hours is cutting it close.  I did used the Cows chart.  I ended up crushing up the pill and taking it intranasally.  I had a pretty big habit, and 4 mg stabilized me very well.  I did a quick taper.. 4mg day 1, 8mg day 2, 4mg day 3, 2 mg day 4, 1mg day 5, and then a very very small amount the next 3 days.  Jumped off and was fine.  \n\nConsidering I was using about 4g of Heroin a day it was very painless.", "2_Subreddit": "OpiatesRecovery"}], "dwpb57y": [{"0_Comment Submission": "so i actually died", "1_Text": "There's nothing greater than being alive.  Why do people want to throw that opportunity away so willingly?", "2_Subreddit": "opiates"}], "dwpbl2q": [{"0_Comment Submission": "This is my last day.....", "1_Text": "I CTd off 4g of H a day.  Ask my wife about the time I had a really bad flu.  Hiding that shit was a bitch.  I dream about being able to come clean about my whole ordeal without consenquences.  But alas, its a long lonely road for me.  \n\nCongrats on wanting to get clean.  Having the right mindset is Paramount.  Try to keep the positive attitude through withdrawals.. but your WD kit should keep the worst away.", "2_Subreddit": "opiates"}], "dwpcmsb": [{"0_Comment Submission": "I just want to party.", "1_Text": "Dance party in the living room!!", "2_Subreddit": "OpiatesRecovery"}], "dwpdaed": [{"0_Comment Submission": "I'd rather have another brain surgery than go through opiate withdrawal again.", "1_Text": "I would rather have brain surgery than go through withdrawals again as well lol", "2_Subreddit": "OpiatesRecovery"}], "dwpdm5m": [{"0_Comment Submission": "I’m worried about my sister. What’s the general addiction timeline look like from beginning to end?", "1_Text": "Sounds crazy but start snooping through her stuff.  I'll probably get blasted for saying this, but it's a tried and true method.  Don't get caught.", "2_Subreddit": "opiates"}], "dwpdp31": [{"0_Comment Submission": "why do you people pat each other on the back for getting clean but at the same time post pictures of syringes full of heroin & ready to shoot up?", "1_Text": "I lol'd at broke junkies in withdrawal.  Ridiculous.", "2_Subreddit": "opiates"}], "dwq4js2": [{"0_Comment Submission": "I still roll blunts for my wife...", "1_Text": "Triggers me to want to do dope.  I hid my use this whole time, no point in telling her now that I'm not using.  She really sucks at rolling, doesn't have the finger dexterity maybe.  She sucks at video games too. \n\nThanks for all the suggestions but it's something I have to live with.  Happy wife happy life right.  I was rolling one up last night then posted this.  Was just venting really.  No one close to me knows about my addiction but I've been clean for a long while now from a 4g a day habit.  Longest I've ever been since I started doing dope.  Feels good to have an outlet even if it's to internet strangers.  Getting clean and staying clean is the hardest thing I've ever done.  This path I took is a lonely one but knowing there are others out there like me brings me some comfort.  You guys are the best thank you!", "2_Subreddit": "OpiatesRecovery"}], "dwq7j3l": [{"0_Comment Submission": "Should I tell someone?", "1_Text": "Tell your dog instead", "2_Subreddit": "opiates"}], "dwqfhyq": [{"0_Comment Submission": "I still roll blunts for my wife...", "1_Text": "Haha good idea but I like staying useful... Gives me security =)", "2_Subreddit": "OpiatesRecovery"}], "dwqupfi": [{"0_Comment Submission": "I still roll blunts for my wife...", "1_Text": "11 years now.  The early years were rough for me too but now we are perfect.  Well besides the whole me hiding a huge addiction thing.", "2_Subreddit": "OpiatesRecovery"}], "dwrhuud": [{"0_Comment Submission": "I still roll blunts for my wife...", "1_Text": "Don't give me too much credit.  I've tried many times and failed but this is by far my longest run so far clean.  I feel good this time too, different than any other time I've gotten clean. \n\nAll good advice you have.  I appreciate you not coming off preachy, I can tell you have a deeper understanding of this than most.  \n\nSo I might as well tell you some of my backstory.  Like most I started this addiction with painkillers.  10/325 Norco to be specific.  I had what felt like an endless supply of these things from an employee of mine who got prescribed a ton but didn't take them.  Over the course of a year I started taking more and more until I was popping/snorting 10-15 of them a day.  That endless supply I thought I had wasn't enough as my tolerance built up.  I realized I had a problem and told my wife.  She was very supportive and took care of me while I detoxed.  Of course after getting clean I thought I could handle it and started taking them again.  Of course I got back into trouble with them.  I couldn't imagine going back to my wife and saying I fucked up again.  I had this bright idea of using heroin to wean off Percocet!!! Lol yes in hindsight what a fucking moron I was right.  Of course the heroin use spiraled into a 4g a day habit intranasally and I was super fucked.  I knew I had to get off but it was always ok as soon as (insert important event) is over I'll get clean.  Well, there's always something going on with a wife 2 kids and a large family so I kept putting it off.  Finally in January I had some time off and got the 'flu'.  Jumped cold turkey off 4gs a day.  Wow that was painful.  After a few weeks I couldn't take it and caved.  After expressing to my dgirl I wanted to get clean again she got me some 8mg subutex and I did a quick taper to get off.  That was much more pleasant than cold turkey I must say.  I've been clean since.  No more Subutex either.\n\nPoint being my wife was supportive when I told her I had a pill problem so she probably would be the same telling her about my heroin habit.  It's so shameful though.  I know I won't be taking this secret to the grave and it's just a matter of time before she learns the truth.  I really want to get more clean time under my belt so this is a distant memory when I tell her.  We shall see where this path leads tho, I am known for making spontaneous decisions so I'll leave it at that.", "2_Subreddit": "OpiatesRecovery"}], "dwrkxf1": [{"0_Comment Submission": "Today’s pickup (;", "1_Text": "I was getting bricks (5 of those buns) for $175 but I was buying 10 at a time.", "2_Subreddit": "opiates"}], "dwrlk1k": [{"0_Comment Submission": "Flying to Pakistan shitpost", "1_Text": "Dude don't get caught you don't want to be in a Pakistani jail holy shit", "2_Subreddit": "opiates"}], "dwrwjdf": [{"0_Comment Submission": "Today’s pickup (;", "1_Text": "shit man.. bitch was trying to sell em to me for $250 and I wouldnt do it.  was my one and only plug and she was reliable as fuck and delivered to me too so fuck it.", "2_Subreddit": "opiates"}], "dwswwc9": [{"0_Comment Submission": "opiates n kpop", "1_Text": "Absolutely not", "2_Subreddit": "opiates"}], "dwtijec": [{"0_Comment Submission": "Kinda Planning a Relapse.. But Im on Subs. Practical Advice Please", "1_Text": "I have no experience with this but I HEARD you should still take a very small does of sub if you do anything so you don't have to worry about the precipitated withdrawl when going back to subs.  Don't quote me on this though.  Hopefully someone with more experience will comment.", "2_Subreddit": "opiates"}]}], "1_submissions": [{"6rpm68": [{"0_Title": "Fortnite", "1_Text": "Then what is it?  Please enlighten me.", "2_Subreddit": "opiates"}], "6rq1o5": [{"0_Title": "Why the fuck am I watching 'Frasier'???", "1_Text": "Then what is it?  Please enlighten me.", "2_Subreddit": "opiates"}], "6umema": [{"0_Title": "Need help with a short and sweet methadone taper off heroin/hydro", "1_Text": "Then what is it?  Please enlighten me.", "2_Subreddit": "OpiatesRecovery"}], "6x0bdn": [{"0_Title": "Recovery Journal - Using methadone quick taper to get off heroin", "1_Text": "Then what is it?  Please enlighten me.", "2_Subreddit": "OpiatesRecovery"}], "6yikx7": [{"0_Title": "Successfully used Methadone to taper of H", "1_Text": "Then what is it?  Please enlighten me.", "2_Subreddit": "OpiatesRecovery"}], "6yvhaf": [{"0_Title": "Fuck.", "1_Text": "Then what is it?  Please enlighten me.", "2_Subreddit": "opiates"}], "6yxoy2": [{"0_Title": "If a junkie died and you ate them.. would you get high?", "1_Text": "Then what is it?  Please enlighten me.", "2_Subreddit": "opiates"}], "6z9lvw": [{"0_Title": "Junkie cousin just inherited $3 million USD from his father's passing", "1_Text": "Then what is it?  Please enlighten me.", "2_Subreddit": "opiates"}], "6zrrbz": [{"0_Title": "Boofing fun", "1_Text": "Then what is it?  Please enlighten me.", "2_Subreddit": "opiates"}], "704ldt": [{"0_Title": "Got my hydros today...", "1_Text": "Then what is it?  Please enlighten me.", "2_Subreddit": "opiates"}], "7sshij": [{"0_Title": "Back at it again Day 4 shitpost", "1_Text": "Then what is it?  Please enlighten me.", "2_Subreddit": "OpiatesRecovery"}], "7t4vhj": [{"0_Title": "Day 6", "1_Text": "Then what is it?  Please enlighten me.", "2_Subreddit": "OpiatesRecovery"}], "7t897y": [{"0_Title": "Owe the dgirl $$$", "1_Text": "Then what is it?  Please enlighten me.", "2_Subreddit": "OpiatesRecovery"}], "7tdg3u": [{"0_Title": "Day 7", "1_Text": "Then what is it?  Please enlighten me.", "2_Subreddit": "OpiatesRecovery"}], "7tksy2": [{"0_Title": "Day 8", "1_Text": "Then what is it?  Please enlighten me.", "2_Subreddit": "OpiatesRecovery"}], "7tseoz": [{"0_Title": "Day 9 feeling good", "1_Text": "Then what is it?  Please enlighten me.", "2_Subreddit": "OpiatesRecovery"}], "7txg7c": [{"0_Title": "Just in time", "1_Text": "Then what is it?  Please enlighten me.", "2_Subreddit": "OpiatesRecovery"}], "7ty2i7": [{"0_Title": "Oh shit.", "1_Text": "Then what is it?  Please enlighten me.", "2_Subreddit": "opiates"}], "7u0ydt": [{"0_Title": "Dreams", "1_Text": "Then what is it?  Please enlighten me.", "2_Subreddit": "OpiatesRecovery"}], "7u5fs7": [{"0_Title": "Day 10 - Let the cravings begin!!", "1_Text": "Then what is it?  Please enlighten me.", "2_Subreddit": "OpiatesRecovery"}], "7uixf8": [{"0_Title": "11 days", "1_Text": "Then what is it?  Please enlighten me.", "2_Subreddit": "OpiatesRecovery"}], "7usp97": [{"0_Title": "Dealing with dick heads during recovery", "1_Text": "Then what is it?  Please enlighten me.", "2_Subreddit": "OpiatesRecovery"}], "7v0l3o": [{"0_Title": "2 weeks", "1_Text": "Then what is it?  Please enlighten me.", "2_Subreddit": "OpiatesRecovery"}], "7vsxe2": [{"0_Title": "Dopeless", "1_Text": "Then what is it?  Please enlighten me.", "2_Subreddit": "OpiatesRecovery"}], "8974xh": [{"0_Title": "I still roll blunts for my wife...", "1_Text": "Then what is it?  Please enlighten me.", "2_Subreddit": "OpiatesRecovery"}]}]}]}