{"BentTriangle": [{"0_comments": [{"dtgaq6w": [{"0_Comment Submission": "Caught my 16 year old daughter with pot in her bedroom, not sure how to handle this", "1_Text": "Great response, couldn't have said it better myself :)", "2_Subreddit": "Drugs"}], "dtl5vb8": [{"0_Comment Submission": "What are you jamming on this beautiful day?", "1_Text": "Definitely one of my favorite songs ever made. Happy to see another Peep fan on this sub. It's sad to see that people now listen to his music only after his death.", "2_Subreddit": "opiates"}], "dtl67c6": [{"0_Comment Submission": "What are you jamming on this beautiful day?", "1_Text": "I agree fully, hopefully people see the true meaning of his lyrics and comprehend his unbelievable motivation to spread love while also dealing with addiction and depression. Some people see his music as glorifying drug addiction and/or depression, but he was just talking about his life. Star Shopping is a great example of the love that he wanted to spread in the world.", "2_Subreddit": "opiates"}], "dtl6nfw": [{"0_Comment Submission": "What are you jamming on this beautiful day?", "1_Text": "Exactly my man. Great guy all around. I hope people can also see that he's a great example of Law of Attraction. He always told himself that he was going to be famous and that's what happened. Speaking things into existence is definitely a strong concept that people should understand; especially for this sub. If you constantly tell yourself you can get clean then you will, it's all about your mindset and motivation to chase your goals.", "2_Subreddit": "opiates"}], "dtqyyic": [{"0_Comment Submission": "Long time lurker here, hope I'm welcome? Have a few questions (I don't take opiates.)", "1_Text": "Shit how much (weight wise) was a 300-400 a day habit in your area?\nCongrats on being clean after a decade of use, big achievement", "2_Subreddit": "opiates"}], "dtrscih": [{"0_Comment Submission": "TIL 1 in every 14 adult men in the United States don’t watch nationally televised sports whatsoever.", "1_Text": "We would get along very well, everything you listed off was in exact accordance to my likings lol.", "2_Subreddit": "todayilearned"}], "dtszij3": [{"0_Comment Submission": "What movie was so disturbing it left you feeling shook?", "1_Text": "Train spotting, I'm surprised no one has said that movie yet.\nFantastic movie if anyone has the time to watch it:)", "2_Subreddit": "AskReddit"}], "dunxa4u": [{"0_Comment Submission": "Throw myself into this raging waterfall", "1_Text": "No he did not. This is from a youtube channel called Adrenaline Addiction, he does jumps like this very frequently.", "2_Subreddit": "holdmyredbull"}], "dunxvqd": [{"0_Comment Submission": "Got clonazapam and Xanax fist time", "1_Text": "Recreational use can quickly turn into an addictive routine. I'm speaking from experience, I used to consider myself as a person with a \"non-addictive personality\" but that can quickly change if you begin a routine of taking any substance. Your brain with undoubtably become dependent if you take any substance on a regular basis. \nBut regardless, as long as you space out the days you choose to take substances, you will be good. My personal opinion would be to take 2 mg of either xanax or kpins over the course of 1-2 hours...not all at once.\nGood luck, be safe, and have a good time my friend", "2_Subreddit": "benzodiazepines"}], "dup31xl": [{"0_Comment Submission": "To the guy I almost hit near the Evans and Downing Safeway", "1_Text": "The roads were so terrible tonight. I got in a damn fender bender. Ruined my night:/", "2_Subreddit": "Denver"}], "duxvpiw": [{"0_Comment Submission": "Looking to buy Xanax in bulk", "1_Text": "Just go online and look for yourself, every vendor is different", "2_Subreddit": "darknet"}], "dv72yp0": [{"0_Comment Submission": "Need Advice... please", "1_Text": "Thanks so much for the reply man, reading that gave me a lot of reassurance. I couldn't see myself spending my life with anyone else so I figure you're right that I should be totally transparent with her especially sense I would want the same if she were in my shoes. Oh and I'm very familiar with wd's, so I'll know what to expect. I just usually sustain my supply to prevent that from happening and I'm fortunate enough to have a good job that gives me the necessary funds. Ironically enough she called me shortly after I made this post telling me that she wants to know every aspect of me....soooo if that's not a sign I don't know what is. It's going to be a pain in the ass but you're right, I'm ahead right now and it's all worth it for her and myself in the end.", "2_Subreddit": "OpiatesRecovery"}], "dv7qvkw": [{"0_Comment Submission": "Need Advice... please", "1_Text": "It helps a lot knowing that people are/have been in the same situation as me. I'm sure it's going to be a matter of disbelief and disappointment when I tell her everything. But it's for the same reasons as you said, because getting through withdrawals alone is going to be so difficult. And trying to hide that I'm going through wd's on top of that is nearly impossible. So for the sake of getting clean, I have to tell her. Though if I can ask, how did your girlfriend react when you told her? How did you tell her? And did she stay with you?\nI'm looking forward to living a sober life again. I don't like the thought of depending on my dealers for a positive health status, it's depressing when I think of my life in that way. Plus of course all the money that I've spent which could have gone towards much more productive/useful things.", "2_Subreddit": "OpiatesRecovery"}], "dvvgutq": [{"0_Comment Submission": "To all WPD subscribers.", "1_Text": "This sub helps me recognize how fortunate we are to have the lives we are living. Sadly bad things happen in the world everyday. And being aware of those things helps appreciate life on a much stronger and deeper level.", "2_Subreddit": "watchpeopledie"}], "dwecdyi": [{"0_Comment Submission": "Refill Day", "1_Text": "Correct! Alprazolam .5mg on the right and ambien (Zolpidem) 12.5mg ER on the left:):):)", "2_Subreddit": "DrugStashes"}], "dwndmw9": [{"0_Comment Submission": "Refill Day", "1_Text": "Haha if you get prescribed ambien then why don't you take it?", "2_Subreddit": "DrugStashes"}], "dwoxz3u": [{"0_Comment Submission": "Stomach aches with ops", "1_Text": "This happens to a large majority of people when taking opiates. I've heard benadryl helps. Luckily I don't experience this problem", "2_Subreddit": "opiates"}], "dwoyrlh": [{"0_Comment Submission": "Prices in your state", "1_Text": "I'm jealous that you have both tar and ecp available to you. Ecp is nowhere to be found where I live. And yeah $1/mg is often what I hear, though I would never buy a pill at that price...unless it's oxymorphone:):):)", "2_Subreddit": "opiates"}], "dwoz2z0": [{"0_Comment Submission": "Prices in your state", "1_Text": "I assumed we could since I've seen many OP's refer to their state but nothing more. But I've wondered for a while why the east coast has a plethora of ecp and little tar while it's the opposite on the west side of the U.S", "2_Subreddit": "opiates"}], "dwozwae": [{"0_Comment Submission": "Prices in your state", "1_Text": "$30/g!?!?! How's the quality?", "2_Subreddit": "opiates"}], "dwp0ah2": [{"0_Comment Submission": "Prices in your state", "1_Text": "By \"general area\" do you mean East Coast/West Coast/Midwest? Or do you mean the name of the country we reside in? I apologize, I thought just mentioning the state fell into the criteria of \"general area\"", "2_Subreddit": "opiates"}], "dwp11bh": [{"0_Comment Submission": "Prices in your state", "1_Text": "Sounds good, I'll keep that in mind from now on", "2_Subreddit": "opiates"}], "dwp1xhp": [{"0_Comment Submission": "Prices in your state", "1_Text": "That's definitely the most expensive I've heard. Is it BTH or ECP?", "2_Subreddit": "opiates"}], "dwr2bd3": [{"0_Comment Submission": "Prices in your state", "1_Text": "Do you ever get fentanyl? If I had a connect for gent at that price I feel like I would go with fent occasionally. I just did the math and 100mg of fent is equivalent to 10,000mg of morphine. And $60 for 10,000mg of morphine is quite the deal.", "2_Subreddit": "opiates"}], "dwsztg9": [{"0_Comment Submission": "What's the most fucked up dream you've ever dreamt?", "1_Text": "I've had a reoccurring dream where I couldn't stop clenching my jaw/biting down. My teeth would begin to crack and crumble out of my mouth and I would wake up thinking that it was all real.", "2_Subreddit": "AskReddit"}]}], "1_submissions": [{"73xwjm": [{"0_Title": "Who else loves smelling like weed?", "1_Text": "Great response, couldn't have said it better myself :)", "2_Subreddit": "Drugs"}], "75srw3": [{"0_Title": "What's your favorite thing to do while on opiates?", "1_Text": "Great response, couldn't have said it better myself :)", "2_Subreddit": "opiates"}], "821318": [{"0_Title": "Need Advice... please", "1_Text": "Great response, couldn't have said it better myself :)", "2_Subreddit": "OpiatesRecovery"}], "87beyw": [{"0_Title": "Pupper gets his mind blown", "1_Text": "Great response, couldn't have said it better myself :)", "2_Subreddit": "youseeingthisshit"}], "87o085": [{"0_Title": "Refill Day", "1_Text": "Great response, couldn't have said it better myself :)", "2_Subreddit": "DrugStashes"}], "894p6w": [{"0_Title": "Prices in your state", "1_Text": "Great response, couldn't have said it better myself :)", "2_Subreddit": "opiates"}]}]}]}