{"Nit400": [{"0_comments": [{"d4815pz": [{"0_Comment Submission": "Figured this was a good little pick me up! Anyone feel like chatting? I just took 5 of these bad boys and am looking to party!!", "1_Text": "Mouth Watering. I haven't been able to find the big greens in forever and I'm in the heart of the biggest city in the Midwest. Enjoy", "2_Subreddit": "opiates"}], "d493xwu": [{"0_Comment Submission": "Figured this was a good little pick me up! Anyone feel like chatting? I just took 5 of these bad boys and am looking to party!!", "1_Text": "Yep Chicago is correct. I have no plugs and cash  to burn lol. It's hard cause I'm in this game by myself because I keep my usage from my group.of close friends.", "2_Subreddit": "opiates"}], "d4n3e3s": [{"0_Comment Submission": "Dickhead pharmacist.", "1_Text": "I also do the exact same thing. I get 7 strips each week 8mg and initially only get 4 and leave the other 3 at the pharmacy because they are so expensive even with a coupon. Luckily I haven't had an issue with this at all because it's a mom and pop pharmacy located in the same building as my sub doc and the pharmacy owner treats the patients very well. Sucks that one pharmacist is a dick, hope it works out.", "2_Subreddit": "opiates"}], "d4no99k": [{"0_Comment Submission": "I love the green bars they are the best. :)", "1_Text": "There are green 3mg xanax they just aren't in a bar form and they are extended release. They are green circles,  86 imprint on one side, R imprint on the other. And they are also quite wonderful I must say.", "2_Subreddit": "opiates"}], "d4tbu0z": [{"0_Comment Submission": "Getting mixed opinions on the new formula Opana. What's the verdict? (Low tolerance, nasal)", "1_Text": "Never taken Opana, so serious question. Why is taking it orally a huge waste? Thanks!", "2_Subreddit": "opiates"}], "d4ud5l7": [{"0_Comment Submission": "Fucking ridiculous", "1_Text": "What are the new CDC  guidelines? I almost feel like.it's getting to the point that even if you bring in an opiate script from the doctor the pharmacies won't even fill it anymore or say they don't have that in stock. It's getting insane and the powers that be ( docs, cdc, pharmacists) don't realize how much of the heroin epidemic they are causing. Why not let people fill regulated safe opiate scripts as opposed to people dropping dead by buying bad dope on the streets? What can be done in the U.S.?", "2_Subreddit": "opiates"}], "d4uvc54": [{"0_Comment Submission": "The rarity of Opana", "1_Text": "I can't find them anywhere either and I live in the biggest city in the Midwest. It is my ultimate goal and basically the only thing I think will get me going. I'm sick of the percs and apap. I even have trouble finding oxy. I guess just brutal.connects I  have considering where im located. I feel your pain OP.", "2_Subreddit": "opiates"}], "d4uvmwt": [{"0_Comment Submission": "Last refill until pain management referral", "1_Text": "Ahhh the A333.   Have had and still do many a nights with them. Enjoy and GL!", "2_Subreddit": "opiates"}], "d4vkw8h": [{"0_Comment Submission": "Some bomb Mexican/Cali tar and a shitload of subs.", "1_Text": "Subutex doesn't block opiates like suboxone does?  Wtf... can anyone else confirm this because that would be awesome. Does it also help when your sick like suboxone does? If you have been taking suboxone for like 4 months do you think you can seamlessly change to subutex without getting sick or anything? Thanks!", "2_Subreddit": "opiates"}], "d4vn12m": [{"0_Comment Submission": "Some bomb Mexican/Cali tar and a shitload of subs.", "1_Text": "Yea that's what I thought as well since they both have bupe.  Only difference is subutex doesn't have nalaxone I believe.", "2_Subreddit": "opiates"}], "d50klug": [{"0_Comment Submission": "To drug addicts of reddit: Do you really think we believe those needles are for your diabetic grandmother/dog?", "1_Text": "To the Pharmacist:  Why do you and your co workers make it impossible to fill an opiate script? Why must you become a detective and have people with legit scripts run through hoop after hoop just to get it filled? Don't you realize you are only making the heroin epidemic worse because you make people resort to playing Russian roulette when buying H on the streets? Give people pills that they know what they are.", "2_Subreddit": "opiates"}], "d5g7t83": [{"0_Comment Submission": "Question about Sub WD and how to combat it", "1_Text": "Thanks for the reply. I'm a little confused though. So you are saying it was the easiest taper when you switched to H for 10 days after using  Bupe for years and then after the 10 days went back to a quick Bupe taper and then you were all done and fine after that?  \n\nThat is kind of the plan I envisioned in my head although I probably wouldn't use H for those 10 days but instead pills. Thanks!", "2_Subreddit": "opiates"}], "d5luxu1": [{"0_Comment Submission": "Kratom vs pharmaceutical Opiates", "1_Text": "I was going to ask. Have people had positive experiences with Kratom for opiate withdrawal? How about Bupe withdrawal? If people had to pick the best thing during Bupe withdrawal what would it be? (Other than a very slow taper of course).", "2_Subreddit": "opiates"}], "d6a15ge": [{"0_Comment Submission": "Happy Monday! (Pill Porn)", "1_Text": "Legit scripts or DNM? Always love your top quality pill porn.", "2_Subreddit": "opiates"}], "d6pqp4m": [{"0_Comment Submission": "So whats the deal is Kratom Good or Not? *Questions* Kratom Newbie", "1_Text": "I have plenty of subs always around me. However, I am trying more and more to get off the Bupe train. I have been using dope lately, and I want to get some Kratom to help with the W/D.\n\nMy Questions are: Will the Kratom still be effective even though I have used Subs in the past?\n\nWhat are the major differences between Subs and Kratom (I assume the first major difference is the Bupe in Subs doesn't allow you to get high, is Kratom the same). Thanks!", "2_Subreddit": "opiates"}], "d6ygdu6": [{"0_Comment Submission": "Kratom advice", "1_Text": "I have a couple questions...\n1) When is usually the best time to take Kratom to enhance your H high (is this a good idea or should you always take Kratom as a stand alone)\n\n2) If you start taking Kratom semi regularly to cope with H W/D will you then start to have Kratom W/D after a while?\n\n3) Can you take a Sub after you have taken Kratom and not get PWD like you would if you take a Sub to soon after a dose of H?\n\nIf you or someone could answer these questions you would be my hero. Thank you so much in advance.", "2_Subreddit": "opiates"}], "d6z4s7y": [{"0_Comment Submission": "3 Questions Regarding Kratom, Please help if you can you fine people. Thank you", "1_Text": "Thank you for the feedback. Appreciate it!", "2_Subreddit": "opiates"}], "d6zi6gw": [{"0_Comment Submission": "3 Questions Regarding Kratom, Please help if you can you fine people. Thank you", "1_Text": "Thank you very much for your insight and feedback. I appreciate it.", "2_Subreddit": "opiates"}], "d6zi6vc": [{"0_Comment Submission": "3 Questions Regarding Kratom, Please help if you can you fine people. Thank you", "1_Text": "Thank you!", "2_Subreddit": "opiates"}], "d6zicbr": [{"0_Comment Submission": "And the award to the best non-opiod to have in withdrawal is... Gabapentin", "1_Text": "How does Gabapentin compare to Kratom in terms of helping with Opiate W/D? Thanks!", "2_Subreddit": "opiates"}], "d6ziy2k": [{"0_Comment Submission": "Kratom ( Woah )", "1_Text": "Question for you, you mentioned you had a high opiate tolerance so I figured you probably used your DOC at some point before taking the Kratom. How long after using your DOC (if you dont mind sharing it) did you take the Kratom? Like, what was the time from last using your DOC to taking the Kratom?\n\nReason I'm asking is because I just had some nice Kratom arrive  and I am deciding when to take it. I have been using H the past couple of days.\n\nThanks!", "2_Subreddit": "opiates"}], "d77r0te": [{"0_Comment Submission": "Question RE: Suboxone & Methadone", "1_Text": "Please please wait until you are in pretty good withdrawal to take the subs again. I'm not sure if 5 Berries will put you in w/d the next day, since not sure what your tolerance is like. But the last thing you ever want to do is take a sub to early after using again. PWD is the worst thing ever and there is no getting out of it. You just have to ride it out. So make sure you wait to take that Sub until you feel really into your W/D (assuming you go into it because you have an opi dependence/tolerance). Good luck, you will be fine, just don't ever going into PWD. Hell on earth.", "2_Subreddit": "opiates"}], "dvypgjl": [{"0_Comment Submission": "I need help getting clean in SoFlo", "1_Text": "How long were you taking subs and how many mgs per day? That is awesome to hear that as subs are really hard to jump off of", "2_Subreddit": "opiates"}], "dwedrve": [{"0_Comment Submission": "LOVE opiates but roommate is going crazy.", "1_Text": "Pretty awesome that you get to rip lines of Roxy all day and do your own schedule. I love that shit. Just curious how did you make enough money to be retired at 30? Not hating at all, just envious. I’m 31, love my opiates,  but still have to go to my job every day that I fucking hate. I guess bills and that thing I have of $1900 a month in rent gives me no choice.", "2_Subreddit": "opiates"}], "dwnfnob": [{"0_Comment Submission": "Policy Change regarding human consumption", "1_Text": "Is it hard to access dread or is it something anyone could do? Just wondering if maybe a how to guide should be made to access it if dread is confusing?", "2_Subreddit": "opiates"}]}], "1_submissions": [{"4ntfhl": [{"0_Title": "Trying to fill legit script", "1_Text": "Mouth Watering. I haven't been able to find the big greens in forever and I'm in the heart of the biggest city in the Midwest. Enjoy", "2_Subreddit": "opiates"}], "4tb1xj": [{"0_Title": "Question about Sub WD and how to combat it", "1_Text": "Mouth Watering. I haven't been able to find the big greens in forever and I'm in the heart of the biggest city in the Midwest. Enjoy", "2_Subreddit": "opiates"}], "4zuucz": [{"0_Title": "3 Questions Regarding Kratom, Please help if you can you fine people. Thank you", "1_Text": "Mouth Watering. I haven't been able to find the big greens in forever and I'm in the heart of the biggest city in the Midwest. Enjoy", "2_Subreddit": "opiates"}], "50aq8l": [{"0_Title": "What is the best medicine for early H W/D. Help Appreciated", "1_Text": "Mouth Watering. I haven't been able to find the big greens in forever and I'm in the heart of the biggest city in the Midwest. Enjoy", "2_Subreddit": "opiates"}]}]}]}