{"DveousDNM": [{"0_comments": [{"duhwhvy": [{"0_Comment Submission": ".5ml syringe??", "1_Text": "I'm new to this, would 3 bags be okay for .5ml", "2_Subreddit": "opiates"}], "duhwmqu": [{"0_Comment Submission": ".5ml syringe??", "1_Text": "Yeah they're definitely not full points. Thank you!", "2_Subreddit": "opiates"}], "dvj3ft3": [{"0_Comment Submission": "Sunday Morning with OxyContin 80s and Xans 2mg. How bout u guys?", "1_Text": "Too much money spent out of savings, but I’m getting a g of some nice chunk & on 4mg kpins. Always some bud as well. A good Sunday", "2_Subreddit": "opiates"}], "dvs04xt": [{"0_Comment Submission": "Hope everyone is doing well & those sober hanging in there", "1_Text": "Yeah it would take a large toll on them financially", "2_Subreddit": "opiates"}], "dw53a0g": [{"0_Comment Submission": "Hope everyone is doing well & those sober hanging in there", "1_Text": "I hope in 4 years (21 right now) I’m blasting by in my new Beamer! Been sober for a little over a week now guys. Shits going great, keeping myself busy working with my hands in my free time. Kratom is what I’ve been using to stay away from H. A busy mind & body really helps slay your demons", "2_Subreddit": "opiates"}], "dw54957": [{"0_Comment Submission": "Today's pick up(:", "1_Text": "Be lucky you can find tar! I was stuck with $150 grams that were probably cut with flour or corn starch or some shit. Sometimes it was good, sometimes near the end of a batch a gram wouldn’t even get you to nod. Glad I’m done for now", "2_Subreddit": "opiates"}], "dw59a7u": [{"0_Comment Submission": "I found the love of my life at the methadone clinic", "1_Text": "Yup. Been there. Current girlfriend has had issues with coke in the past, I have issues with heroin. We fit better surprisingly & keep each other in check wayyy better. I’m not much for stims & she’s not much for downers. It seems easier to lean on her for support than other exes who would nudge me into spending my money on something we could share. Or maybe we just genuinely care about each other’s well being. Either way", "2_Subreddit": "opiates"}], "dw59jw6": [{"0_Comment Submission": "I'm such a hard stick that my doctor's office finally resorted to getting me in my foot for an IV.", "1_Text": "Sticking my foot there would always result in hurting too much, slipping & going straight through a vein. It’d just bulge & look freaky like it was going to pop before I even injected. Took a bit of practice on my arms before I was ever able to get the feet right. Not proud moments by any means", "2_Subreddit": "opiates"}], "dw59xzy": [{"0_Comment Submission": "Today's pickup. Payday tomorrow, this will hold me over until then", "1_Text": "Consider yourself lucky! When I work out (clean right now) & see my veins bulge, I’m just like damn! Those suckers are hungry for needles. Also watching the blood rush into a syringe was a rush in itself", "2_Subreddit": "opiates"}], "dw5a4w1": [{"0_Comment Submission": "200mg morphine plug. (HATE the process but the high is worth 👍🏻)", "1_Text": "I ALWAYS felt uncomfortable until the high hit me. God, thinking about plugging almost makes me glad I started using actual needles when I was on h", "2_Subreddit": "opiates"}], "dw5aa1u": [{"0_Comment Submission": "anyone dudes here used to lift or still manage to work out?", "1_Text": "Over a week clean & working out every morning before I shower is what keeps up the motivation. When I was using I was depressed & couldn’t give less of a shit what my body looked like. It was full of bruises anyway from needles so why work out?\n\nEdit: I bruise easily, literally have tried maybe 20 different tips on not bruising (apply pressure after injection for 5 mins, ice, better needle practice, new needles every time, etc). I’m sure I’m deficient in some vitamin or something that makes this happen.", "2_Subreddit": "opiates"}], "dw5amqm": [{"0_Comment Submission": "Do you ever reuse your own needles?", "1_Text": "Ugh, hate when you can feel the difference in needle sharpness. Like one needle will take a little push to pop in a vein & others will slideeee right in", "2_Subreddit": "opiates"}], "dw5ar5k": [{"0_Comment Submission": "That Moist Dark Brown Mmmmmm.. .1 just IVd feel blissful. Moist.", "1_Text": "I used to get these bags. Old dboy would sell actually 100mg but they’d be cut to shit. Oh the days where cut go shit h would have me nodding for days. Almost wish I never learned how good some h could be.", "2_Subreddit": "opiates"}], "dw5auf4": [{"0_Comment Submission": "Have a happy snow day ❄️❄️", "1_Text": "Ugh, moving to DC in 9 days. When I was there $180 ounces of top shelf were prevalent. In my current state, an oz is $300 & not even comparable. Loved having my bud delivered faster than a pizza & 100% legal. Can’t wait to live that life all day every day", "2_Subreddit": "opiates"}], "dw5aykz": [{"0_Comment Submission": "Only “drugs” I do now :) clean life", "1_Text": "My first shot of h was with a 23 gauge I think, could’ve been 21. Talk about bruised arms & sore veins the next day. Fuckers told me bigger needles were better for your veins. They must’ve never used insulin syringes", "2_Subreddit": "opiates"}], "dw6ej5s": [{"0_Comment Submission": "Adonis looking deadly.", "1_Text": "Looks like my ice cream that’s been in there for a few months...", "2_Subreddit": "microgrowery"}], "dw7ua9t": [{"0_Comment Submission": "Just relapsed on meth... Again :/", "1_Text": "Be honest as tell her “you took some adderall without thinking” a lot better than dropping the meth bomb. Plus you can almost be the hero that told her the truth & didn’t get caught", "2_Subreddit": "Stims"}], "dwfpk8h": [{"0_Comment Submission": "Sex on LSD. Give me a better mix. I’ll wait.", "1_Text": "Exactly! My ex wanted to so badly one time, while I’m painting like I’m 7 again lol. I was thinking about a futurama episode the whole experience & didn’t enjoy it. Other drugs that sex is way better on", "2_Subreddit": "LSD"}], "dwk5k4f": [{"0_Comment Submission": "Dboy idiocy", "1_Text": "I used to middle haha. Until my dboy realized he knew who I was middling for. Sad times, was getting a bag or two for free every pickup. He was a true dboy though. In jail now days with a 12million dollar bond. Yeah, I didn’t believe it either", "2_Subreddit": "opiates"}], "dwk8f09": [{"0_Comment Submission": "Dboy idiocy", "1_Text": "Haha hence why I fell into addiction. Two weeks clean, haven’t used daily since those free bags maybe 6 months ago. I went from free bags to $180 grams :(", "2_Subreddit": "opiates"}], "dwkad24": [{"0_Comment Submission": "Just a lines worth of some H", "1_Text": "Yup! I went from once a week to every other day for a month. Don’t be me. I never got fully hooked, only felt light withdrawals. But if I had done it longer I wouldn’t still be who I am. I’d be selling my car & everything else to maintain a habit. I’m good at keeping it to once a month or every other week now", "2_Subreddit": "opiates"}], "dwkaoxt": [{"0_Comment Submission": "Small pickup that will hopefully last more than a day!", "1_Text": "Ugh I never can. I’ll buy a bun, think wow this will last me days. Will literally put every bag into my veins before 3am", "2_Subreddit": "opiates"}], "dwkczfs": [{"0_Comment Submission": "Just failed a roxy 30 now all I have are these sweet sweet perkys and hydros", "1_Text": "I wish I could still pop pills. Don’t turn to h, stick with what you like right now. My tolerance has been so high the past year that I wouldn’t even think to buy pills other than a paperweight", "2_Subreddit": "opiates"}], "dwlywwz": [{"0_Comment Submission": "I relapsed on meth but it was probably the best thing I could have done", "1_Text": "I would’ve loved meth if I could’ve actually fallen asleep when I needed too. I’d fiend too much & just end up having to sit on my couch for 12 hours waiting for sleep", "2_Subreddit": "Drugs"}], "dwqe4yl": [{"0_Comment Submission": "An unpopular opinion: Weed is not that great and healthy", "1_Text": "I have. No negative effects the day after when smoking occasionally. I will say that it did take 3-6 months for my memory to fully improve.", "2_Subreddit": "Drugs"}]}], "1_submissions": [{"50rgo4": [{"0_Title": "Serious question. House pets & tripping.", "1_Text": "I'm new to this, would 3 bags be okay for .5ml", "2_Subreddit": "LSD"}], "519lp8": [{"0_Title": "First few trips intensity?", "1_Text": "I'm new to this, would 3 bags be okay for .5ml", "2_Subreddit": "DMT"}], "600x0j": [{"0_Title": "Ayahuasca is basically DMTea", "1_Text": "I'm new to this, would 3 bags be okay for .5ml", "2_Subreddit": "DMT"}], "6nedxz": [{"0_Title": "LSD while running away from your problems", "1_Text": "I'm new to this, would 3 bags be okay for .5ml", "2_Subreddit": "LSD"}], "72ipi0": [{"0_Title": "How many points does it take you to get high?", "1_Text": "I'm new to this, would 3 bags be okay for .5ml", "2_Subreddit": "opiates"}], "746pup": [{"0_Title": "A break or quitting? I'm at the one week clean mark", "1_Text": "I'm new to this, would 3 bags be okay for .5ml", "2_Subreddit": "opiates"}], "7yo05o": [{"0_Title": ".5ml syringe??", "1_Text": "I'm new to this, would 3 bags be okay for .5ml", "2_Subreddit": "opiates"}], "84s6i7": [{"0_Title": "Hope everyone is doing well & those sober hanging in there", "1_Text": "I'm new to this, would 3 bags be okay for .5ml", "2_Subreddit": "opiates"}]}]}]}