{"ALWAYSandFOREVER2018": [{"0_comments": [{"dwc76tm": [{"0_Comment Submission": "Old timers", "1_Text": "Amen. Lol", "2_Subreddit": "opiates"}], "dwc82f7": [{"0_Comment Submission": "Kratom for withdrawal", "1_Text": "Very true.", "2_Subreddit": "opiates"}], "dwegh8a": [{"0_Comment Submission": "RIP OldRapGroup", "1_Text": ".", "2_Subreddit": "opiates"}], "dweh05r": [{"0_Comment Submission": "A speck of heroin", "1_Text": "Oh for Jesus sake...I can't even.", "2_Subreddit": "opiates"}], "dweh22o": [{"0_Comment Submission": "question about pawn shops.", "1_Text": "Well...what is the item?", "2_Subreddit": "opiates"}], "dwehcor": [{"0_Comment Submission": "Can anyone explain to me what “scripts” are?", "1_Text": "\"Probably won't buy it then.\" ??? Lord help us. \"Script\" (as asked in your intro) refers to prescription, and as far as \"blank scripts\" go... Stay away friend! Stay far far away! One love. Xoxo", "2_Subreddit": "opiates"}], "dwh58gp": [{"0_Comment Submission": "The worst withdrawal symptom", "1_Text": "Ditto. All wd's are miserable but I am glad you are getting SOME sleep. I hope you find some peace. Best of luck. One love friend. Xoxo", "2_Subreddit": "opiates"}], "dwq3t7f": [{"0_Comment Submission": "Late night methadone clinic advice?", "1_Text": "Why?", "2_Subreddit": "opiates"}], "dwqmqmc": [{"0_Comment Submission": "Why shouldn't I develop a heroin habit?", "1_Text": "You know you're going to have days where you either can't find any dope or you can't fund your habit...right? You'll have the same problems copping dope as pills and it will cost you just as much in the end.  You're going to be in the same predicament, in severe pain and then add on heroin wd's. Jesus lord, I wish you'd reconsider. Best of luck. One love. Xoxo", "2_Subreddit": "opiates"}], "dwqn0lj": [{"0_Comment Submission": "Why shouldn't I develop a heroin habit?", "1_Text": "Did you not just say that, \"I bet you rode the tard cart\" ? Oh my friend, that's not any better than name calling.", "2_Subreddit": "opiates"}], "dwqncmu": [{"0_Comment Submission": "Opinions about NA/AA", "1_Text": "Just to clarify, a \"higher power\" doesn't mean God. It can be anything. Your \"higher power\" can be the addicts in the group. It's anything that helps you, anything that is bigger than you that you can look up to or turn to when in need. It could be nature, people, a sponsor, the NA group, God, etc etc. It can literally be whatever you want it to be; anything that brings you peace, guidance or help can be a higher power.\n\nAnd when it says \"God\" in the literature, it's suggested you just replace that word with whatever your higher power is to you.", "2_Subreddit": "opiates"}], "dwqnmv3": [{"0_Comment Submission": "Opinions about NA/AA", "1_Text": "I am more than willing to share some of my personal experience. I have been clean and sober from any and all drugs for over 5 years. NA/AA are a huge part of my life. They were essential to my survival the first 2 years of my sobriety.", "2_Subreddit": "opiates"}], "dwqnr1t": [{"0_Comment Submission": "Late night methadone clinic advice?", "1_Text": "Oh man, that sucks. I hope you find a way.  Best of luck friend. One love. Xoxo", "2_Subreddit": "opiates"}], "dwqnty3": [{"0_Comment Submission": "Found this in my children (17 yo) room.. help identify", "1_Text": "Looks like an imprint of a cherry. It looks like a breath mint. Lick it and see.?.", "2_Subreddit": "opiates"}], "dwqo5tj": [{"0_Comment Submission": "Opinions about NA/AA", "1_Text": "I've been in NA and recovery for years and years. There are even specific groups whose members all don't believe in God. I know hundreds of atheist and agnostics in fact, who are a huge part of NA. Most importantly, everyone is accepted at NA. No one is judged for their beliefs. \"The ONLY requirement for membership is a desire to stop using.\"", "2_Subreddit": "opiates"}], "dwqo9yc": [{"0_Comment Submission": "Opinions about NA/AA", "1_Text": "I hope this is coming off like I care and not as a know it all. Lol. I am very passionate about recovery. If you want to talk further about NA or need any help understanding the different groups, facets, or more info, please message me.", "2_Subreddit": "opiates"}], "dwqofsy": [{"0_Comment Submission": "Opinions about NA/AA", "1_Text": "I'd hate to think you give up on NA and recovery because of the \"God\" reference. It is so so SO much more than that.  It is NOT a religious place. If you've had one bad experience with one group, go to a different group or meeting. They're all a little different but the goal is the same...sobriety. \n\nPlease let me know if you felt judged or you were specifically alienated because of the higher power issue and you not believing in God. I would be happy to investigate and report the group at the area or world level. Groups/meetings that shun people or make them feel they don't belong need to be shut down asap. That gives NA a bad rep and steers people away when it has the exact opposite intention.", "2_Subreddit": "opiates"}], "dwtfrio": [{"0_Comment Submission": "A SFW Boof Time!", "1_Text": "Was it you that just posted a day ago about quitting again and putting your health first?", "2_Subreddit": "opiates"}], "dwurohr": [{"0_Comment Submission": "How many of you succeeded at staying clean after being forced into a rehab?", "1_Text": "Which time? Lol. I've been court ordered to treatment more than once, I've been forced by family into treatment more than once, and  I went voluntarily several times. In my opinion, treatment will finally work when you're ready. No body can tell you when that is; even the threat of prison looming over my head, being on probation, losing family, none of these things were enough to stop me from using. One day, it finally hit me. I was ready to quit. I was tired of the life. My final jail term and then last inpatient rehab was in 2013. After dozens of tries and forced trips, I was finally ready. Been clean & sober since 2013 but it took years of trying to get clean for it to actually stick. Best of luck. One love. Xoxo", "2_Subreddit": "opiates"}], "dwuu4iu": [{"0_Comment Submission": "Opinions about NA/AA", "1_Text": "Sorry, I had to log off. I have plenty to say on that. I will repeat, \" The ONLY requirement for membership is a DESIRE to stop using.\" You don't have to be clean to be in NA. Anyone that tells you different is ignorant and flat out wrong. If you're on methadone maintenance and truly trying to work that program and eventually taper yourself off, then they should have nothing but love and support for you. \nThe argument can be made that yes technically you aren't \"clean\" because you have opiates in your system. However, no one should be judging you for that or telling you that you don't belong. \nAs long as you are working the program, not abusing the methadone, and have a desire to be clean then you are absolutely welcome at ALL meetings. Some old timers and even young people that get on their high horse because they have a little sobriety under their belts may be judging or have an opinion on whether you are clean. Quite frankly, it's none of their business. Find the people that understand, be honest and work your own program. Please never give up on NA/AA. It really can be a wonderful tool. It saved my life the firat 2 years of my sobriety.", "2_Subreddit": "opiates"}], "dwuufa7": [{"0_Comment Submission": "Opinions about NA/AA", "1_Text": "Are you basing this off of one bad experience? One group or one specific meeting? I can tell you for absolute certainty, that not all of us in NA share that view, belief or opinion.", "2_Subreddit": "opiates"}], "dwuv78p": [{"0_Comment Submission": "Opinions about NA/AA", "1_Text": "See comment above. I absolutely admit that SOME people in SOME groups/meetings can judge or say one isn't clean because of methadone maintenance or sub maintenance. However, it's like anything else, we have to take personal responsibility and that includes in our recovery. We have to find what works for us. If you don't like one meeting, go to a different one. If you feel judged, take a look at yourself and see what you can do on your side of things. Sometimes all it takes is explaining your story and a sincere desire to be clean. I can tell you with absolute certainty, that not ALL meetings and groups feel negative toward methadone maintenance. Not ALL of us have the same opinions. Find where you fit in and work your own program. Most importantly, no matter what, never give up.", "2_Subreddit": "opiates"}], "dwwbghr": [{"0_Comment Submission": "Opinions about NA/AA", "1_Text": "I totally understand and respect that. The first 2 years of my sobriety NA was essential to me because I had no one else. I had no where else to turn. I had lost everything and burned every possible bridge. It was a place to go (meetings) sometimes a few a day, there were people that I could relate to and most importantly it was a place I was accepted. I needed to be around people that were going through what I was, I needed to feel like I belonged somewhere because I literally had nothing else. When I finally got sober, I was so broken and so ashamed that NA was the ONLY place I was fully accepted. People understood me. People wanted to talk to me. I could share my story and people understood. It also helped with my severe anxiety. I tried to stay busy by going to meetings and getting involved with groups and functions and service work. It gave me a purpose. \n\nThe longer I've been clean and sober though, I find I don't need it as much as I did in the beginning. I am still connected to NA but 5 years into sobriety and a shit ton of hard work, its not ALL I have anymore. Anyway, I've rambled enough. I'm sorry. Message me anytime with questions, if you want to hear more of my story, or just to say hey. Best of luck friend. One love. Xoxo", "2_Subreddit": "opiates"}], "dwwws46": [{"0_Comment Submission": "How do you know when it's kicking in", "1_Text": "\"One is too many and a thousand is never enough\"  for sure.", "2_Subreddit": "opiates"}], "dwwx26c": [{"0_Comment Submission": "Opinions about NA/AA", "1_Text": "Well thank you for your kind words. My username is not a reference to anything. I used to sign all letters, emails, etc. with \"Love, always & forever\".", "2_Subreddit": "opiates"}]}], "1_submissions": [{"7q0r7z": [{"0_Title": "Sober but still crave", "1_Text": "Amen. Lol", "2_Subreddit": "opiates"}], "7wodd8": [{"0_Title": "Torn", "1_Text": "Amen. Lol", "2_Subreddit": "opiates"}]}]}]}