{"momdoggity": [{"0_comments": [{"dwv0lx9": [{"0_Comment Submission": "This shit just isn't fun anymore.", "1_Text": "I can literally go to sleep within the hour & sleep for a few hours in the morning. It may have something to do with another med I have to take though. And crazy, it is!", "2_Subreddit": "Drugs"}], "dwv0zis": [{"0_Comment Submission": "This shit just isn't fun anymore.", "1_Text": "60 had me gritting my teeth & my jaws would be so sore the next day. I stuck to my 30s usually. The non-Adderall stims made me have so much anxiety, it was horrible. Adderall is great. And I've used (never recreational for any of this) modafinil. It is great, but since it's only FDA approved for narcolepsy, it's hard to get bc it's EXTREMELY expensive. It is a great drug though, if you can get it. I just happen to have a form of narcolepsy, so I could get it. Maybe if more ppl took (needed) it, the pricing would go down? Idk. And it's not a Schedule II, so another bonus.", "2_Subreddit": "Drugs"}], "dwv15xh": [{"0_Comment Submission": "This shit just isn't fun anymore.", "1_Text": "I can take it, fall asleep & still have completely unproductive days. I hate ADHD most of the time.", "2_Subreddit": "Drugs"}], "dwv1mq8": [{"0_Comment Submission": "This shit just isn't fun anymore.", "1_Text": "I think they're very popular among us which most ppl wouldn't think, and most drug addicts have one or more of our issues. (Don't shoot me for saying that, but I find many of my friends who are addicts, definitely had telling signs just as I had in school. I got lucky to get pharma drugs - lucky being used for lack of a better word right now!)", "2_Subreddit": "Drugs"}], "dwv1oat": [{"0_Comment Submission": "This shit just isn't fun anymore.", "1_Text": "Your username 😂👍", "2_Subreddit": "Drugs"}], "dwv1smq": [{"0_Comment Submission": "This shit just isn't fun anymore.", "1_Text": "Huh?", "2_Subreddit": "Drugs"}], "dwv1w3k": [{"0_Comment Submission": "This shit just isn't fun anymore.", "1_Text": "I agree 100%. Some of these high achievers around here, they're serious coke heads. I've watched them.", "2_Subreddit": "Drugs"}], "dwv3lex": [{"0_Comment Submission": "This shit just isn't fun anymore.", "1_Text": "Maybe I shouldn't have used the word addict, maybe periodic abuser? I feel you completely. Are you a 5 on the Enneagram scale by chance? Odd question, but it really interests me.\n\nhttps://www.yourenneagramcoach.com/p/dont-know-your-type", "2_Subreddit": "Drugs"}], "dwv43sm": [{"0_Comment Submission": "And they say they are hard to get .. 🧐", "1_Text": "Yeah, but I'm just talking about a new deal for the Medicaid prescribers. They're going to have to be 'educated' on what they can & can't do. I don't have Medicaid, I just pay attention to what my State is doing when it comes to health & healthcare.\n\nhttps://www.aafp.org/news/government-medicine/20180315missouriopioids.html", "2_Subreddit": "opiates"}], "dwv4fo1": [{"0_Comment Submission": "And they say they are hard to get .. 🧐", "1_Text": "I am blaming the govt more now.\n\nhttps://www.aafp.org/news/government-medicine/20180315missouriopioids.html", "2_Subreddit": "opiates"}], "dwv4q8g": [{"0_Comment Submission": "And they say they are hard to get .. 🧐", "1_Text": "Here's the info I was wanting to give you last night: https://www.aafp.org/news/government-medicine/20180315missouriopioids.html", "2_Subreddit": "opiates"}], "dwv4tje": [{"0_Comment Submission": "And they say they are hard to get .. 🧐", "1_Text": "Just some interesting info to add: https://www.aafp.org/news/government-medicine/20180315missouriopioids.html", "2_Subreddit": "opiates"}], "dwv58eb": [{"0_Comment Submission": "And they say they are hard to get .. 🧐", "1_Text": "Not saying you don't have pain, but if ppl don't need them, I really wish they'd stop abusing them. You (assuming here) are hurting us who need them. OP has need, just curious, do you too? I'm not trying to be ignorant.", "2_Subreddit": "opiates"}], "dwv5f6i": [{"0_Comment Submission": "And they say they are hard to get .. 🧐", "1_Text": "I have TOS. It made the symptoms go away like magic. I'm having to use gabapentin right now, and it's keeping me from going nuts, but the numbness/tingling is still there. With Lyrica, never.", "2_Subreddit": "opiates"}], "dwv5qjy": [{"0_Comment Submission": "And they say they are hard to get .. 🧐", "1_Text": "Two cans of Sundrop (or highly caffeinated soda), 800 ibuprofen & room-darkening curtains... that's the best I've been able to come up with on the migraine bs. They're so so so awful. Makes life basically unbearable, especially if every day. I'm hoping you're able to get out to get some help. I take a brand of (topamax) that seems to help, called Trokendi XR now. Good luck honey.", "2_Subreddit": "opiates"}], "dwv6r40": [{"0_Comment Submission": "This shit just isn't fun anymore.", "1_Text": "That's not necessarily true. Sometimes I like to be off in the clouds when everybody else is being even slightly relevant, eg. family. Plus it's been proven somewhere (lol really), that ADHD ppl can be some of the smartest, most intelligent, intellectual & creative people in society - geniuses here & there. Don't ask me to cite that proof. Citations have always been a downfall of mine.", "2_Subreddit": "Drugs"}], "dwv6vix": [{"0_Comment Submission": "And they say they are hard to get .. 🧐", "1_Text": "Clonazepam or diazepam can always be a positive thing as well. How could I forget those gems? lol", "2_Subreddit": "opiates"}], "dwv7e0e": [{"0_Comment Submission": "This shit just isn't fun anymore.", "1_Text": "Well yeah, they're the same class of drug. You never know what you get on the street though, so maybe pharma is not as strong? Is that your point? That the pharma versions aren't nearly as strong as illicit stims? Meth is meth, from what science says. I'm not certain about crack or coke, never done any of them. I've had plenty of junkies want my Adderall or Ritalin though, so I assume there's some value close enough for them to want to use them. And no, I would not give/sell my medicine, bc I cannot & don't want to do without it. And it's illegal too lol, but anyway!", "2_Subreddit": "Drugs"}], "dwv851d": [{"0_Comment Submission": "This shit just isn't fun anymore.", "1_Text": "No drugs necessary lol", "2_Subreddit": "Drugs"}], "dwv8n6v": [{"0_Comment Submission": "Shout out to the junkies.", "1_Text": "Hardy-har-har.", "2_Subreddit": "Drugs"}], "dwv900c": [{"0_Comment Submission": "This shit just isn't fun anymore.", "1_Text": "Thank you, makes great sense! Very, very, very excellent write-up.", "2_Subreddit": "Drugs"}], "dwvak0t": [{"0_Comment Submission": "And they say they are hard to get .. 🧐", "1_Text": "I do not but anything on the street. I'm definitely not trying to make you feel bad, hence the parts in my comment about not making assumptions. OP called me out on a comment yesterday bc my words come out offensive at times. Sorry about that...I do not blame you at all, IF YOU IN FACT NEED THEM. I blame shit like this: https://www.aafp.org/news/government-medicine/20180315missouriopioids.html\n\nI'm sorry you have so much suffering, it really sucks & those in power need to go thru the pain all of us combined, then get tortured by not getting any relief. It has taken me some seriously careful planning & manipulation (not of doctors, but of the way I go about slowly navigating the system). I will not quit trying to get ppl who don't need pain meds/opiates/benzos, to fucking stoppit. If I offend someone along the way, I'm sorry. I do not mean to offend you, I'm actually on your side. If they were to cut me off completely tomorrow, I'd lose my shit. I had my doctor move my opiate to one that's a Schedule III vs II. He was fine with it, even though he knew exactly what I was doing. He had started acting stupid at giving me diazepam with 7.5/325 hydrocodone, even though I had been on it years without bad effects, the govt was scaring him about his license (not just him obviously, he just took it really seriously really quickly). Anyway, the Schedule III Rx actually works very well, but really makes my stomach upset, but add in food & Nexium, and it works. You can figure out which one I'm talking about bc I'm not going to mention it here as then ppl will possibly flock to it making the govt notice it & step up it's classification as well. So, I hope you feel better...I wish you luck & wish you find relief. I also wish we didn't have to resort to spending insane amounts of money just to live a semi-pain free life. I'm lucky, for now. So, I'm definitely not trying to act better than you. I'm just trying to get ppl who unnecessarily abuse medication meant for us who need it. ☮️", "2_Subreddit": "opiates"}], "dwvdmft": [{"0_Comment Submission": "User base growth", "1_Text": "I was wondering if that would be ok to use. I had Spectrum streaming, but they couldn't seem to get my locale correct so I was getting Minnesota weather in Missouri lol but they used the Roku devices. I wasn't sure if I could use it for YouTube TV too. I'm going to check it out. Thanks!", "2_Subreddit": "youtubetv"}], "dwvneci": [{"0_Comment Submission": "User base growth", "1_Text": "Thanks! 👍", "2_Subreddit": "youtubetv"}], "dwwn8pi": [{"0_Comment Submission": "A girl I matched with says shes seen me before but wasn't sure where from. We try to figure it out.", "1_Text": "He must care enough, that he posted it here - I think it counts as an engagement announcement.", "2_Subreddit": "Tinder"}]}], "1_submissions": [{}]}]}