{"A9KS49MA36VV7": [{"0_comments": [{"dw834bj": [{"0_Comment Submission": "My new silicone pipe. Cam hold about 2.5 grams of oil came with a dab tool and on the other side it has a bowl for smoking", "1_Text": "Sure let me just find it real quick", "2_Subreddit": "trees"}], "dw838wf": [{"0_Comment Submission": "My new silicone pipe. Cam hold about 2.5 grams of oil came with a dab tool and on the other side it has a bowl for smoking", "1_Text": "https://www.amazon.com/gp/aw/s/ref=is_s_ss_i_1_13?k=silicone+smoking+spoon&sprefix=silicone+smok&crid=2POBHZE67D3A2", "2_Subreddit": "trees"}], "dw86fym": [{"0_Comment Submission": "My new silicone pipe. Cam hold about 2.5 grams of oil came with a dab tool and on the other side it has a bowl for smoking", "1_Text": "Ya its cheap and works just as well as. i just saw the same thing I have but blue for 20$ plus there'll be shipping. Mine works just as well. I also bought a silicon dab rig like they have for 50$. Mine cost 20 and its exactly the same thing", "2_Subreddit": "trees"}], "dw8auhz": [{"0_Comment Submission": "Finding a dealer as a female in an illegal state, having trouble :(", "1_Text": "I got a great tip for you. I'm assuming you had the \"bad egg\" type of people in your school right? The ones that everyone knew were bad or criminals and all that shit. You know the kind im talking about. Go on facebook and hit them up. Actually how I found my first dealer. I was 13 and I remembered this guy named Joey who was a \"bad boy\" and he had just graduated. I shot him message and he became my dealer for like 3 years. Good guy in my opinion. Never did me wrong. One time his guy gave me a dime bag thst had no joke 70 seeds in it. He got my money back lol. Point is hit up some old class mates or people you went to school with thst you know are into that kind of thing", "2_Subreddit": "saplings"}], "dw8nsy9": [{"0_Comment Submission": "Finding a dealer as a female in an illegal state, having trouble :(", "1_Text": "No no no I meant like message them as you would message any random person that you want to be friend. I probably should've been more specific. That's my bad I'm high af rn. I mean like message them saying like \"hey its been a while\" chat them and actually be nice to them be there friend you know. Then bring up smoking and casually be like \"ya I smoke weed from time to time hbu?\" And if they say yes be like \"oh man we should smoke together and chill some time you. Do you know where to get it?\" Its my bad for not explaining better. What I meant was we all have clicks in school. There's the preps and jocks and ECT. Well honestly if you have no ideal where to find weed at all in my opinion your best bet is to try to be friend the group of kids that people normally see as \"the bad ones\" or \"bad eggs\" cause normally they'll know where to get it. But ya no I don't think you should just randomly message old class mates asking for weed. I git horrible adhd and I'm high af and looking over what I said before I get what you mean and i didnt really explain it very well.", "2_Subreddit": "saplings"}], "dw8pv0h": [{"0_Comment Submission": "Finding a dealer as a female in an illegal state, having trouble :(", "1_Text": "Thanks lol its no problem. I didn't want to misdirect people. I know how it can feel just having people constantly asking for drugs when you only just started talking to them", "2_Subreddit": "saplings"}], "dwakbfa": [{"0_Comment Submission": "How to remove oxycodone from percocet?", "1_Text": "Ok well I can live with that but my main question still remains. Is there a way to get it into powder form? Even a little apap is ok I just can't find anything beyond cwe and I want powder oxycodone instead of water with oxycodone in it you feel me.", "2_Subreddit": "opiates"}], "dwal5r7": [{"0_Comment Submission": "How to remove oxycodone from percocet?", "1_Text": "No morphine is my less favorite opiate. Couldn't tell you why but morphine hardly does anything to me", "2_Subreddit": "opiates"}], "dwar7oa": [{"0_Comment Submission": "How to remove oxycodone from percocet?", "1_Text": "So just boof the cwe? Hm didn't think about that. Kinda forgot you can do that. I wouldn't have to drink it then. Thanks ima just do that", "2_Subreddit": "opiates"}], "dwg30hq": [{"0_Comment Submission": "So many percs", "1_Text": "I have had people I posted a pic of my percs and someone percs are for baby amature. And other called me immature cause i say percs and others have called me an idiot for saying percs instead of perks and one called me immature for saying percs instead of Percocet and called me a kid. Alot of people in this sub Reddit are dicks and snobs so ya i said all that cause i just want the cool fun people on this subreddit you feel me bro", "2_Subreddit": "opiates"}], "dwg35x7": [{"0_Comment Submission": "So many percs", "1_Text": "Nah I dont bang H but if I have had a needle I might have. I just doubt my ability to hit a vein. I hit shaky hands", "2_Subreddit": "opiates"}], "dwg3kzl": [{"0_Comment Submission": "So many percs", "1_Text": "Normally when people say oxy they mean oxycotin. I mean I guess I get oxy could mean Percs cause it has oxycodone in it but c'mon I only know 1 person who says oxy when talking about Percocet and she ain't no seasoned opiat user. Like its pretty common sense i meant oxycotin", "2_Subreddit": "opiates"}], "dwg3zhy": [{"0_Comment Submission": "So many percs", "1_Text": "I only had them a few times my best bros gf had them cause her grandma died from cancer so she raided her medicine cabinet it was like 4 years back and I got them for super cheap cause I had been his nigga for years and he she just let him have some but he dumbed her like 2 weeks later", "2_Subreddit": "opiates"}], "dwg4bpb": [{"0_Comment Submission": "So many percs", "1_Text": "Was Rambling about fucks and cunts this sub Reddit is full of them. Drug snobs and rude dicks always commenting on my shit. I just want to spread vibes and interact with the community. Share pics and story's and experiences.", "2_Subreddit": "opiates"}], "dwg4ds9": [{"0_Comment Submission": "So many percs", "1_Text": "There isn't. oxy means oxycotin. Like OC's bro not Percocet", "2_Subreddit": "opiates"}], "dwg4jx7": [{"0_Comment Submission": "So many percs", "1_Text": "Oh then I guess the bottle was a misprint or something. Idk what to tell. The bottle said 90 mgs unless this dumb 15 year old girl could print a realistic looking label", "2_Subreddit": "opiates"}], "dwg4mw4": [{"0_Comment Submission": "So many percs", "1_Text": "I truly don't know what ti tell you. The bottle said 90mg on it", "2_Subreddit": "opiates"}], "dwg4ucv": [{"0_Comment Submission": "So many percs", "1_Text": "My bad bro ya your 100% right. I must've just been remembering wrong and they where 80s I looked it up and you where right lol my bad", "2_Subreddit": "opiates"}], "dwg4ys2": [{"0_Comment Submission": "So many percs", "1_Text": "My bad i looked it up and your right there is no oxy 90 just 80 and then 160. They must've been 80s and remembered wrong. I was wrong bro lol", "2_Subreddit": "opiates"}], "dwg5v6f": [{"0_Comment Submission": "So many percs", "1_Text": "Ya I realize that now your totally right. I feel dumb now. I forgot oxy 90s don't exist then defended they did and remembered they don't and I did oxy 80s not 90s and now this lol percs got me stupid", "2_Subreddit": "opiates"}], "dwg5weh": [{"0_Comment Submission": "Just sharing how happy I am about my bud", "1_Text": "Lol I'm super happy bro. I got a big smile on my face", "2_Subreddit": "trees"}], "dwg6mre": [{"0_Comment Submission": "So many percs", "1_Text": "Bet lol its all good in this too", "2_Subreddit": "opiates"}], "dwg6s0h": [{"0_Comment Submission": "So many percs", "1_Text": "Ya bro lol don't worry i know my shit been pill poppin for years and ya dude opiates are my fucking shit", "2_Subreddit": "opiates"}], "dwgdmjb": [{"0_Comment Submission": "So many percs", "1_Text": "Really? Well you learn something new every day. I fr didn't know that. Guess i was wrong", "2_Subreddit": "opiates"}], "dwgkqem": [{"0_Comment Submission": "Fresh pressed then quick freezed hash on a boil of 2 different strains 1 being sativa 1 being indica. Looks beautiful", "1_Text": "Lol that guy basically died. He dabbed the hash and got knocked out. Took me 2 minutes yelling snd shaking to wake him up lol", "2_Subreddit": "trees"}]}], "1_submissions": [{"82ajyn": [{"0_Title": "Just me and my bro with 24 swishers acid wraps and hemp wraps with cbd in them a couple grams of fire oil with 2 grams of cbd crystal extract and 4 ounces of bud. Plus munchies", "1_Text": "Sure let me just find it real quick", "2_Subreddit": "saplings"}], "82at6n": [{"0_Title": "My shirt is 100% accurate", "1_Text": "Sure let me just find it real quick", "2_Subreddit": "u_A9KS49MA36VV7"}], "84y3kw": [{"0_Title": "To true lol", "1_Text": "Sure let me just find it real quick", "2_Subreddit": "weed"}], "85lach": [{"0_Title": "Anyone else enjoying some cbd?", "1_Text": "Sure let me just find it real quick", "2_Subreddit": "weed"}], "860g11": [{"0_Title": "Rick and morty laser engraved stash box with matching weed jar and grinder. I fucking love it", "1_Text": "Sure let me just find it real quick", "2_Subreddit": "weed"}], "860wyo": [{"0_Title": "Wanted to share my weed accessories and some positive vibes. Stay stoned", "1_Text": "Sure let me just find it real quick", "2_Subreddit": "trees"}], "860z9y": [{"0_Title": "I already shared this once but I think this sub Reddit is way better to share it on", "1_Text": "Sure let me just find it real quick", "2_Subreddit": "rickandmorty"}], "861au8": [{"0_Title": "I just love me some Percocet. Truly a beautiful sight", "1_Text": "Sure let me just find it real quick", "2_Subreddit": "drugsarebeautiful"}], "861h8a": [{"0_Title": "I need some advice about opioid tolerance", "1_Text": "Sure let me just find it real quick", "2_Subreddit": "opiates"}], "865tcq": [{"0_Title": "How many drugs have you done?", "1_Text": "Sure let me just find it real quick", "2_Subreddit": "Drugs"}], "8663i1": [{"0_Title": "Get your shit together", "1_Text": "Sure let me just find it real quick", "2_Subreddit": "rickandmorty"}], "867ps3": [{"0_Title": "What drugs are you on right now and why?", "1_Text": "Sure let me just find it real quick", "2_Subreddit": "Drugs"}], "868i4y": [{"0_Title": "Too big of a hit", "1_Text": "Sure let me just find it real quick", "2_Subreddit": "trees"}], "868na8": [{"0_Title": "Something I wrote", "1_Text": "Sure let me just find it real quick", "2_Subreddit": "depression"}], "86v7db": [{"0_Title": "My new silicone pipe. Cam hold about 2.5 grams of oil came with a dab tool and on the other side it has a bowl for smoking", "1_Text": "Sure let me just find it real quick", "2_Subreddit": "trees"}], "876blb": [{"0_Title": "How to remove oxycodone from percocet?", "1_Text": "Sure let me just find it real quick", "2_Subreddit": "opiates"}], "87wb93": [{"0_Title": "So many percs", "1_Text": "Sure let me just find it real quick", "2_Subreddit": "opiates"}], "87wvje": [{"0_Title": "Just sharing how happy I am about my bud", "1_Text": "Sure let me just find it real quick", "2_Subreddit": "trees"}], "87y3pv": [{"0_Title": "A couple beautiful nugs for a illegal state", "1_Text": "Sure let me just find it real quick", "2_Subreddit": "trees"}], "87y3zz": [{"0_Title": "The blunt from the previous pic I uploaded. Comment whst your smoking rn", "1_Text": "Sure let me just find it real quick", "2_Subreddit": "trees"}], "87yap8": [{"0_Title": "Fresh pressed then quick freezed hash on a boil of 2 different strains 1 being sativa 1 being indica. Looks beautiful", "1_Text": "Sure let me just find it real quick", "2_Subreddit": "trees"}], "89cemi": [{"0_Title": "19-M-U.S. just looking for new friends. I just want more friends in my life and to have new people to talk to. I hope to make real friends. If you wanna talk just hmu", "1_Text": "Sure let me just find it real quick", "2_Subreddit": "MakeNewFriendsHere"}], "8ak1cl": [{"0_Title": "I'm new to town and don't know anyone", "1_Text": "Sure let me just find it real quick", "2_Subreddit": "Warrensburg"}]}]}]}