{"MyLittlePwny616": [{"0_comments": [{"dwth0l6": [{"0_Comment Submission": "Anyone ever heard of these or taking them ? Just wondering how they make you feel.", "1_Text": "Toradol is hard on the kidneys and liver, so be cautious. My local hospital won't let patients have it longer than 3 days because of it", "2_Subreddit": "opiates"}], "dwth2ig": [{"0_Comment Submission": "Anyone ever heard of these or taking them ? Just wondering how they make you feel.", "1_Text": "It's very hard on the kidneys and liver. My hospital is super conservative with it as well", "2_Subreddit": "opiates"}], "dwtkr9p": [{"0_Comment Submission": "Bernese method", "1_Text": "Not in my experience. I normally only take 2mg or so a day and there's no way that's going to keep my receptors saturated enough to let me take a 48 hour dope break. I might be able to do 24 hours, but I personally wouldn't push it past there. I've had PWD so many times and I know what hell it is. Never again", "2_Subreddit": "opiates"}], "dwtn3mp": [{"0_Comment Submission": "Bernese method", "1_Text": "Negligible. I might even be taking less than 2mg a day while using. I am on subutex an I just chip a chunk off of a pill every 6 hours or so. I have a very fast metabolism and taking small doses of bupe via IV tends to have a shorter half life for me.", "2_Subreddit": "opiates"}], "dwu17lw": [{"0_Comment Submission": "Did Anyone Get Their Tax Refund Money yet? I did at 4 Am. At 4:05 i called the dboy. Didnt spend a lot, trying to cut down and save $", "1_Text": "Speedball for first shot then binge out on cocaine for a few hours and then when the cocaine is gone you eradicate the comedown with more boy. Only good way to enjoy cocaine is if you have dope for the come down", "2_Subreddit": "opiates"}], "dwutinq": [{"0_Comment Submission": "today would’ve been your 23rd birthday. i miss you everyday darlin’ 💔", "1_Text": "Is this like a really old picture, because I don't see anyway you guys are older than 15 in this picture?", "2_Subreddit": "opiates"}], "dwuuq0x": [{"0_Comment Submission": "The come up", "1_Text": "Mmmm I love peanut butter fudge. For real bro, get some fent test strips. Not saying it's for sure fent, but the odds today are slanted towards the side of having no heroin, or very little heroin in it, especially with the way it looks. Can never be too safe when trying to avoid hotspots", "2_Subreddit": "opiates"}], "dwuxqek": [{"0_Comment Submission": "The come up", "1_Text": "I'm pretty sure he doesn't know what dick riding is...I'm almost positive \"dick riding\" is fluffing op, patting op on the back, treating him like he is the man, and any other way to possibly make him feel bigger and better than he is. He can be positive that he has straight dope, but I can almost guarantee you it's at least got fentalogue in it. The way I see it, if it gets you fuckin high without killing you, and it's got legs that hold you being well for 5+ hours, who the fuck cares if it's dope or fentalogue? It all does the same thing, so it's the definition of a moot point lol. This is so fucking stupid, as OP is too proud to test his shit or admit that maybe he can't identify opioids based on high alone so it doesn't matter. We all think what we think and he is stuck with his thoughts. It's a stalemate and we will never get an answer. Even tho that shit has fent in it for sure....", "2_Subreddit": "opiates"}], "dwuyaam": [{"0_Comment Submission": "My dboy who sold me these bricks invited me into his trap house to party. I politely declined", "1_Text": "What's that stamp", "2_Subreddit": "opiates"}], "dwuyfw5": [{"0_Comment Submission": "JJ saves in miraculous ways", "1_Text": "We just got hit with 2 inches yesterday", "2_Subreddit": "opiates"}], "dwuzk1d": [{"0_Comment Submission": "The come up", "1_Text": "That's what it boils down to. The hotspots associated with erosion are far safer for a seasoned user than a fentanyl or fentalogue hotspot.", "2_Subreddit": "opiates"}], "dwv3aqw": [{"0_Comment Submission": "Been craving IV cocaine something fierce.", "1_Text": "For sure. For me 3 hour coke binge = 50 new needle marks. It's terrible", "2_Subreddit": "opiates"}], "dwv3ghq": [{"0_Comment Submission": "Been craving IV cocaine something fierce.", "1_Text": "I've done this one time. It took such a small amount to get extremely fucking ripped, and luckily I did not miss any of it", "2_Subreddit": "opiates"}], "dwv57jw": [{"0_Comment Submission": "today would’ve been your 23rd birthday. i miss you everyday darlin’ 💔", "1_Text": "Yeah that's what I figured. Sad situation. My best friend died of a methadone overdose 6 months after high school graduation. He was inexperienced and used to the short acting opioids like Vicodin and Percocet so every 20-30 minutes he allegedly took more until they all started taking effect gradually and then his mom found him thanksgiving morning 2004. This game will chew you up and spit you out real quick.", "2_Subreddit": "opiates"}], "dwv7hc3": [{"0_Comment Submission": "today would’ve been your 23rd birthday. i miss you everyday darlin’ 💔", "1_Text": "It sucks, but anyone who is familiar with opiates probably knows at least one person who who has died too young. I've lost a few friends due to heroin overdoses as well. It's almost like overdose deaths don't surprise me anymore. It's such a regular thing lately that you get almost numbed to the pain.", "2_Subreddit": "opiates"}], "dwvlnkk": [{"0_Comment Submission": "Been craving IV cocaine something fierce.", "1_Text": "Haha plus cocaine being a vasoconstrictor also making your veins smaller and harder to hit", "2_Subreddit": "opiates"}], "dwwx0gj": [{"0_Comment Submission": "today would’ve been your 23rd birthday. i miss you everyday darlin’ 💔", "1_Text": "Yeah my state recently allowed Narcan to be purchased via a standing order without a prescription. Luckily if you have Medicaid, they cover the costs completely. $136.99 without insurance and that's fucking insane. The government needs to allow generics to be manufactured and sold", "2_Subreddit": "opiates"}], "dwwy4b3": [{"0_Comment Submission": "Update; My dboy accepted the ones.", "1_Text": "I can get basically 2 coils for my tank for the price of 1 pack of newports. I've found vaping to be cheaper than smoking after startup costs", "2_Subreddit": "opiates"}], "dwwz2k2": [{"0_Comment Submission": "Got my hands on these. I have NO idea how to use them, have only done oral and intranasal oxy. Would be so grateful if someone gave me a step by step. How do I get a needle?", "1_Text": "You should find someone willing to buy these and spend the money on better opioids if you aren't into IV drug use.", "2_Subreddit": "opiates"}], "dwwzgg5": [{"0_Comment Submission": "Update; My dboy accepted the ones.", "1_Text": "Yeah I have smoked like 1 or 2 cigarettes since starting vaping over a year ago and they both made me sick to my stomach from the taste", "2_Subreddit": "opiates"}], "dwx0h1p": [{"0_Comment Submission": "Update; My dboy accepted the ones.", "1_Text": "Haha I know the cycle. Cigarettes are harder to quit than anything else I've ever used. Not to mention after I did a big shot of dope, smoking a cigarette would have me nodding so hard lol.", "2_Subreddit": "opiates"}], "dwx0tmk": [{"0_Comment Submission": "Got my hands on these. I have NO idea how to use them, have only done oral and intranasal oxy. Would be so grateful if someone gave me a step by step. How do I get a needle?", "1_Text": "Damn that sucks. I mean you can always take that liquid orally, or shoot it up the asshole if you're into butt stuff. Personally I would IV or IM it but in the interest of harm reduction I can't suggest you do it. I would never recommend IV use to a non-IDU, that would be extremely irresponsible", "2_Subreddit": "opiates"}], "dwx1nco": [{"0_Comment Submission": "going to end up homeless soon..any tips?", "1_Text": "On eBay you can buy an unlocked iPhone 4s for $35 usd. It might not hurt to look on eBay in your country and see if you out can find an unlocked iPhone 4 or 4s for cheap and you can use prepaid SIM cards in them if need be. There has to be some options in your area for homelessness, I would contact your local dept of human services and look into homeless shelters or whatever", "2_Subreddit": "opiates"}], "dwx1uyj": [{"0_Comment Submission": "going to end up homeless soon..any tips?", "1_Text": "Homelessness isn't the worst thing in the world. I've been homeless in 95° F heat and I've been homeless in temperatures under 10° F. It's bad but it doesn't warrant suicide. You never know what tomorrow or next weeek has in store for you. You need to just try to ride it out and grind through it, it will make you a stronger and more independent in the end.", "2_Subreddit": "opiates"}], "dwx405v": [{"0_Comment Submission": "going to end up homeless soon..any tips?", "1_Text": "Well there's a start. Being homeless I learned you don't need the best of everything. You just need the basic essentials to get you started. You can upgrade your belongings as needed, but you need to have some way to contact people and a way for people to contact you. If you put your mind to it, this won't be a permanent thing. You can work your way out of this as long as you work for it.", "2_Subreddit": "opiates"}]}], "1_submissions": [{"5uzgal": [{"0_Title": "Going nuts", "1_Text": "Toradol is hard on the kidneys and liver, so be cautious. My local hospital won't let patients have it longer than 3 days because of it", "2_Subreddit": "opiates"}], "5vujf7": [{"0_Title": "Finally an end to my drought?", "1_Text": "Toradol is hard on the kidneys and liver, so be cautious. My local hospital won't let patients have it longer than 3 days because of it", "2_Subreddit": "opiates"}], "5wdodm": [{"0_Title": "Anyone else hiding their use from significant other?", "1_Text": "Toradol is hard on the kidneys and liver, so be cautious. My local hospital won't let patients have it longer than 3 days because of it", "2_Subreddit": "opiates"}], "5ybp4x": [{"0_Title": "Almost said no.", "1_Text": "Toradol is hard on the kidneys and liver, so be cautious. My local hospital won't let patients have it longer than 3 days because of it", "2_Subreddit": "opiates"}], "5yidg5": [{"0_Title": "Just keep fuckin going once I get started.", "1_Text": "Toradol is hard on the kidneys and liver, so be cautious. My local hospital won't let patients have it longer than 3 days because of it", "2_Subreddit": "opiates"}], "5yznqn": [{"0_Title": "Precipitated withdrawals 2 times in 4 days lol.", "1_Text": "Toradol is hard on the kidneys and liver, so be cautious. My local hospital won't let patients have it longer than 3 days because of it", "2_Subreddit": "opiates"}], "5zrz2b": [{"0_Title": "Oh yeah! Putting on a magic show tonight.", "1_Text": "Toradol is hard on the kidneys and liver, so be cautious. My local hospital won't let patients have it longer than 3 days because of it", "2_Subreddit": "opiates"}], "80qthp": [{"0_Title": "Any scientists out there?", "1_Text": "Toradol is hard on the kidneys and liver, so be cautious. My local hospital won't let patients have it longer than 3 days because of it", "2_Subreddit": "opiates"}], "8962f3": [{"0_Title": "So apparently all emergency departments don't treat addicts like garbage.", "1_Text": "Toradol is hard on the kidneys and liver, so be cautious. My local hospital won't let patients have it longer than 3 days because of it", "2_Subreddit": "opiates"}]}]}]}