{"Jerry1680": [{"0_comments": [{"dwqjg6v": [{"0_Comment Submission": "Tuesday April 3rd Daily Check In", "1_Text": "Same man. Thanks for that. That really put a smile on my face.", "2_Subreddit": "OpiatesRecovery"}], "dwqpqnk": [{"0_Comment Submission": "Codiene Linctus", "1_Text": "Age means everything when we are talking about an undeveloped brain. The last thing you want is your brain to be developing with those chemicals.", "2_Subreddit": "opiates"}], "dwqzrv3": [{"0_Comment Submission": "New to oxy, need some advice", "1_Text": "What's your tolerance like usually?", "2_Subreddit": "opiates"}], "dwr2avw": [{"0_Comment Submission": "Flying to Pakistan shitpost", "1_Text": "Perfect plan. Valerian is great to use because it's smelly as hell. I've done the same thing with all sorts of substances. Never flew into Pakistan but the customs in central and South America is a joke.", "2_Subreddit": "opiates"}], "dwr2jpp": [{"0_Comment Submission": "New to oxy, need some advice", "1_Text": "Swallowing is your best bet. Snorting provides a bit more \"rush\" but much less bioavailability and the rush is short lived. I'd take 3 if you want a proper high. 2 is a safe start if youre concerned. I'd say with the experience though, 3 should be fine though it could bring a bit of nausea.", "2_Subreddit": "opiates"}], "dwr61si": [{"0_Comment Submission": "Can only get magic mushrooms.", "1_Text": "Depends man. It's not talked about as much but shrooms are much like weed in that the strain and how they are grown affects potency greatly. I've taken an 8th and had a mild experience, I've taken an 8th and the world was breathing with me.\n\nI'd never want to be on shrooms around my family but it's up to you. I'd wait til they go to bed. I also wouldn't do it if you're fiending for a hit. That sounds like hell.\n\nNeedless to say, that one gram may do nothing and it may be a nice trip. All depends.", "2_Subreddit": "opiates"}], "dwr6ai6": [{"0_Comment Submission": "Flying to Pakistan shitpost", "1_Text": "It really won't matter. You'd have to do some crazy sketchy shit to have them go through your stuff and dump your vitamin bottles. \n\nI generally always put the stuff on the bottom and fill it to the brim with valerian caps. Sometimes it requires a second bottle. Like I said though, it really won't matter.", "2_Subreddit": "opiates"}], "dwrxgxy": [{"0_Comment Submission": "What Dead tune do you think doesn't get enough love?", "1_Text": "Liberty also Lazy River Road. Liberty is just a great American tune with a fun chord progression.\n\nLazy River Road, however, is a god damn masterpiece. The lyrics are absolutely phenomenal and the chord progression is quintessential Garcia. I think it is liked but never really blew up as it's a later tune.\n\nThe last hunter/Garcia masterpiece.", "2_Subreddit": "gratefuldead"}], "dwrxxz4": [{"0_Comment Submission": "Just made the decision to add NJ to my summer! Hanging out in Camden for night 1, got tickets for night 2, then truckin' out to Cincinnati! Stoked!", "1_Text": "Lol I read that title like nooooo dude no!\n\nFirst show I saw there was in 2008 (think it was still tweeter center) ratdog opened for allman brothers. Went with 5 of my college buds (still go to shows with them) and the father of two of the guys (twins).\n\nI was 21 and freshly getting into the world of the dead and psychedelics. Had an insane trip on mushrooms but only a mild lsd one. Well my buddies dad was like the veteran and found us some amazing blotter (it was a Jerry Garcia tarot card).\n\nSplit a 10er with two of my friends and achieved god damn lift off. Holy hell I remember so much crazy shit from that show (but not much of the show except when allman brothers busted out dazed and confused and the whole place became electric). I remember thinking my feet were bleeding the whole show, j remember going to the bathroom and seeing allman brothers on a tv in the lobby playing midnight rider and thinking wow that's a funny coincidence then it all the sudden hitting me that I was at the show that was happening at! Lmao.\n\nAnyway, after the show, my friends dad (also spun, not recommended) said he knew the way out. This was pre all of us having gps in our pocket. So we follow him right into the fucking ghetto of Camden. I remember still tripping face smoking a blunt looking out the window like dude... this is bad. I'll never forget stopping at a red lifht and some dude smashing a 40 on the ground right by our car. \n\nWe bolted. That's when I learned there are some red lifhts you don't stop at.\n\nFun times", "2_Subreddit": "gratefuldead"}], "dws1bce": [{"0_Comment Submission": "I can only afford to go on one trip this summer to see the Dead. City/venue with the highest upvote wins", "1_Text": "Boulder is the best choice. Last stop on the tour, two nights, and you could not ask for a better location for a show. Boulder is beautiful and dead to the core. Everyone in the town is in dead gear. The whole place turns dead that weekend. No brainer for me.", "2_Subreddit": "gratefuldead"}], "dwta45u": [{"0_Comment Submission": "me irl", "1_Text": "Profits get a few people nice things. Don't act like any considerable percentage of the population benefits when corporate profits increase. We are long past that lie. If people think that working the majority of your life to maybe have 1-2 weeks of free time a year is \"good living\" then they are doing better than me. \n\nNow don't get me wrong, work is life but it's a broken system in the USA. Very few people actually see increased profits for increased work. It's nice when the amount of work you put out is directly related to the amount that comes in (not necessarily money). So someone may work their ass off 50 hours a week and still barely scrape by but someone else may sit at a desk doing hardly anything and make a ton of money. How is that remotely fair? Because one person is more educated? One person had better connections? It just doesn't make sense to me. I'll never understand why the janitor (who works their ass off) just simply doesn't deserve a quality of life that the person cruising Reddit at their cubicle deserves. \n\nThe illusion is still that we reward hard work. We don't. If we truly did, then as long as you were putting in a fair share of the work, whether it be cleaning or developing new medicines, you deserve to have a decent living.", "2_Subreddit": "meirl"}], "dwtxlth": [{"0_Comment Submission": "Mark Hamill Says Leia Should Not Be Recast in Star Wars Episode IX", "1_Text": "Really? I'm surprised by the love of rogue 1. It felt like your run of the mill action movie but Star Wars. I definitely enjoyed it but didn't think it was anything special. Except Vader destroying at the end. That gave me wood.", "2_Subreddit": "movies"}], "dwty4vv": [{"0_Comment Submission": "Mark Hamill Says Leia Should Not Be Recast in Star Wars Episode IX", "1_Text": "Well said. I loved TLJ. I still don't understand why people think it was so out of character for Luke to behave like he did. I mean the guy is mid sixties, saw some shit go down with his family, saw some more shit go down at the Jedi academy. I think it's totally fair for him to distance himself from the conflict.\n\nCan you imagine being the same gung-ho person you were at 19? Age and experience changes people. I would have been more surprised to see Luke just raging into this battle. I loved how his character came full circle. \n\nI've seen people say that it's like \"desecrated\" the hero of their childhood. He was my hero too and he still is. I loved how Luke was written. Not saying the movie was perfect but I just rewatched it with my wife and enjoyed it a second time.", "2_Subreddit": "movies"}], "dwu353y": [{"0_Comment Submission": "Mark Hamill Says Leia Should Not Be Recast in Star Wars Episode IX", "1_Text": "I've never thought of it as \"unleashing\" Kylo Ren. That's def an interesting perspective I missed and adds a new layer to the story. Thanks for sharing.\n\nI guess my immediate reaction is to feel that Kylo Ren wasn't failed totally by Luke but that Ben Solo would have become Kylo Ren regardless of what happened at the Jedi academy. (Even though Luke thinks he failed him and has in some respects).\n\nIs that true? I don't know but I appreciate you sharing how you interpreted it!", "2_Subreddit": "movies"}], "dwu3c9c": [{"0_Comment Submission": "Mark Hamill Says Leia Should Not Be Recast in Star Wars Episode IX", "1_Text": "Ah ok. I guess I never really watched clone wars and rebels so there is probably a lot of lore I couldn't appreciate.", "2_Subreddit": "movies"}], "dwu571v": [{"0_Comment Submission": "The poorer, the fatter: Obesity is not randomly distributed across the U.S. It is linked to demographics, community characteristics, income inequality, and race, 500-city analysis shows.", "1_Text": "Well if we utilized our land in a more sustainable manner, we'd likely have the same results. It's actually not that hard to replicate natures design and create abundance for all. I'm thinking of things like permaculture.\n\nAll systems in earth have the capability to produce abundance from waste. Like a forest. The dead leaves, the fecal matter, etc. all play a part in the nutrient cycle and eventual production crop. All that functions within the system gets what it needs from the system and provides back to the system what it needs.\n\nIt's a beautiful, synergetic process that humans can be a part of. We need to end the way we farm and look towards system restorations.\n\nWe've broken down our systems to provide maximum output and essentially value the derivatives of the system higher than the system itself actually functioning which is by definition unsustainable. \n\nAnd the best part is, we have so much technology that can expedite and strengthen this process. The path to the future requires a marrying of technology and an understanding of the earths natural systems (which provide abundance).\n\nIt's not a matter of if the current agricultural and resource-use systems will fail but when.", "2_Subreddit": "science"}], "dwvkbua": [{"0_Comment Submission": "Thursday April 5th Daily Check In", "1_Text": "Without love day to day insanitys king.", "2_Subreddit": "OpiatesRecovery"}], "dwwxzyo": [{"0_Comment Submission": "Friday April 6th Daily Check In", "1_Text": "I'm 2 days and struggling. Habit isn't huge but the anxiety is killing me. A .25 piece of sub allowed me some sleep last night and I h e one more .25 piece. Physically I don't feel great but last time I withdrew (after a year) I felt significantly worse. \n\nIt's so hard for me to say no when it's 15 minutes away. I just need some encouragement.\n\nNo one knows I live this life except one friend who unfortunately has a bad chipping habit so I try to avoid talking to him. I simply have to get through this alone or at least without the support of loved ones.\n\nI could really use support.", "2_Subreddit": "OpiatesRecovery"}], "dwx1xq3": [{"0_Comment Submission": "Friday April 6th Daily Check In", "1_Text": "I just can't disappoint them like that. My wife basically said she'd leave me if she ever found out I was doing something like dope and trust me I hate that she thinks like that but this girl is the world to me. I did myself a solid and took my last .25piece of sub and felt better.", "2_Subreddit": "OpiatesRecovery"}], "dwx9ah6": [{"0_Comment Submission": "Heroin is ruining my life.", "1_Text": "Your withdrawals shouldn't honestly be too bad. $1000 in a month is like $30 a day so like maybe a quarter g? \n\nI was using about that much for two months and am on day 2. I used .25 sub twice and it held me strong for 12 hours each time then I'll eat some kratom to finish 3-4. \n\nTrust when I say, I went through bad withdrawals once after a year of .5g a day use and this time is nothing compared to that. \n\nJust buck up and do it cause tapering will not work.", "2_Subreddit": "OpiatesRecovery"}], "dwxb2ij": [{"0_Comment Submission": "Heroin is ruining my life.", "1_Text": "I'm simply speaking from experience. This is what I can say.\n\nI've had the same thought. I'll just do it when I get really sick. Well does that mean 8hrs in when my anxiety is through the roof and minutes take hours or is it at hour 16 when I Gag every time I cough?\n\nEven if you manage t (not doubting you can) what happens when the withdrawal gets rough? It will at some point. What's your plan then? All the best. I know you got this I just don't want you to trap yourself further.", "2_Subreddit": "OpiatesRecovery"}], "dwxci93": [{"0_Comment Submission": "Our feelings on Mickey, the Mickster, the Hartbreaker, the man with the Dream Beam in his Bloodstream...", "1_Text": "Mickey brought world rhythms to the dead, He (mostly) wrote fire on the mountain, and quite frankly it ain't a drums segment without him.\n\nI'm a huge fan of all mickeys projects. Yes, they occasionally sound like a popcorn maker but Jerry occasionally sounded like an amateur. It happens. Mickey is dead to the core", "2_Subreddit": "gratefuldead"}], "dwxdb7x": [{"0_Comment Submission": "Heroin is ruining my life.", "1_Text": "Absolutely I appreciate yours as I'm on day 2 and it just helps to talk. Lope and kratom will help. Honestly I just forced myself to go for a walk today. Really short one but just programming my mind to focus on the mission ag hand (get dressed, go walk) made me feel a lot better. Sitting at home does not help. Jesus Christ the hours of 7-12 took fucking forever cause I did jack shit. \n\nI wish you all the best and remind yourself hay eventually you will go through withdrawal and it's up to you to determine when and how bad it is. \n\nLots of love.", "2_Subreddit": "OpiatesRecovery"}], "dwxfbz0": [{"0_Comment Submission": "Is New Zealands opiate problem becoming more and more complicated?", "1_Text": "I have no idea! Next question please.", "2_Subreddit": "opiates"}], "dwxij8i": [{"0_Comment Submission": "Ramen", "1_Text": "Best ramen in the USA is Terakawa in Philadelphia. I know that helps zero but I really love that place.\n\nAside from that, Rocky Mountain ramen out arapahoe by 287 has some pretty tasty (although not super authentic) ramen. \n\nDomo in Denver is pretty damn good.\n\nI have yet to find a ramen place in boulder that hits the spot.", "2_Subreddit": "boulder"}]}], "1_submissions": [{"760y6d": [{"0_Title": "My biggest trigger... not what you'd maybe think.", "1_Text": "Same man. Thanks for that. That really put a smile on my face.", "2_Subreddit": "opiates"}], "76hy67": [{"0_Title": "I can't sleep and it's seriously putting me at my wits end", "1_Text": "Same man. Thanks for that. That really put a smile on my face.", "2_Subreddit": "OpiatesRecovery"}], "782nqk": [{"0_Title": "Wel boys and girls, I'm 15 days clean and in Costa Rica", "1_Text": "Same man. Thanks for that. That really put a smile on my face.", "2_Subreddit": "OpiatesRecovery"}], "7bdfoj": [{"0_Title": "30 days clean today!", "1_Text": "Same man. Thanks for that. That really put a smile on my face.", "2_Subreddit": "OpiatesRecovery"}], "7i7bh5": [{"0_Title": "I've been a bit absent as I've been really busy but I'm still in Costa Rica and 60(!) days clean.", "1_Text": "Same man. Thanks for that. That really put a smile on my face.", "2_Subreddit": "OpiatesRecovery"}], "7s72sc": [{"0_Title": "Well I knew this day would come...", "1_Text": "Same man. Thanks for that. That really put a smile on my face.", "2_Subreddit": "OpiatesRecovery"}], "7uv5dr": [{"0_Title": "Quite the thrift store haul today...", "1_Text": "Same man. Thanks for that. That really put a smile on my face.", "2_Subreddit": "gratefuldead"}], "85jv02": [{"0_Title": "Need some help", "1_Text": "Same man. Thanks for that. That really put a smile on my face.", "2_Subreddit": "OpiatesRecovery"}], "86lhib": [{"0_Title": "What a weird feeling...", "1_Text": "Same man. Thanks for that. That really put a smile on my face.", "2_Subreddit": "OpiatesRecovery"}]}]}]}