{"KetracelBlue": [{"0_comments": [{"dvp577k": [{"0_Comment Submission": "Serious Heroin Questions/Want Advice!", "1_Text": "You might just be disappointed the first time you rail heroin anyway. That was my experience. I will do it here and there, but it definitely failed to unseat Roxy as the love of my life.", "2_Subreddit": "opiates"}], "dvs96g5": [{"0_Comment Submission": "Hmmmmmm", "1_Text": "My poor family is so uneducated about drugs that they think I'm just a sickly person for some reason. I don't know if it feels worse having them worrying about something like that or having them know I do it to myself.", "2_Subreddit": "opiates"}], "dvs9jdg": [{"0_Comment Submission": "If you were to become a rapper....", "1_Text": "I don't know what my name would be, but my career would probably end like Lil Peep's.", "2_Subreddit": "opiates"}], "dvs9uwn": [{"0_Comment Submission": "How many different types of drugs have you done...", "1_Text": "I mostly just went from weed to ecstasy and molly, and then a disgusting and long obsession with DXM before I found my heaven/hell in opiates. Some experiments with coke in there too but I always preferred just railing X instead.", "2_Subreddit": "opiates"}], "dvsabpd": [{"0_Comment Submission": "Curious about everyone’s morning routine.....", "1_Text": "Rail 2 roxy, eat 1 more and then generally consume nothing but cigarettes and caffeine until weakness forces me to eat small amounts during the day.", "2_Subreddit": "opiates"}], "dvsbaj5": [{"0_Comment Submission": "I just always wanna be high", "1_Text": "Yezzir, I had a love of dissociation that led me to drink fucking Robitussin and Delsym for about 2 1/2 years as my \"main drug\". Now I literally get nauseous even driving by the stores I used to always buy it from, and couldn't imagine ever consuming DXM again even for a cough.", "2_Subreddit": "Drugs"}], "dvsc314": [{"0_Comment Submission": "Will I get withdrawals from a week of oxycodone use?", "1_Text": "I wouldn't be surprised at experiencing some depression and/or anxiety, but not physical withdrawal.", "2_Subreddit": "opiates"}], "dvscdv4": [{"0_Comment Submission": "Sniffing Oxy with dry nose?", "1_Text": "Ha, Afrin is the only thing that makes it possible for me to snort anything at all most of the time. I know its constriction of the blood vessels can't help absorption of the next drug though.", "2_Subreddit": "opiates"}], "dvuryk6": [{"0_Comment Submission": "Sniffing Oxy with dry nose?", "1_Text": "Oh yeah I've gotten to that point with it too. Now I try to cycle in tolerance breaks for it like the rest of my drugs lol", "2_Subreddit": "opiates"}], "dwg1woc": [{"0_Comment Submission": "I'm an opiate newb, I don't wanna OD, can I get some advice?", "1_Text": "Yes the xanax will drown the opiate euphoria and yes both of those pills would very very likely constitute an overdose for you.", "2_Subreddit": "opiates"}], "dwhdlac": [{"0_Comment Submission": "Questions about Quetiapine/Seroquel", "1_Text": "Seroquel gives me very severe attacks of RLS.", "2_Subreddit": "Drugs"}]}], "1_submissions": [{}]}]}