{"lostinOz_": [{"0_comments": [{"dwg7vec": [{"0_Comment Submission": "If you could have coffee with your 14 year old self, what would he/she be most surprised to hear about you?", "1_Text": "Meetings aren’t for everyone. I take your advice to heart but I will likely not attend meetings. I am a high functioning person with a lot of will power. There are other addicts who didn’t used NA and have still made it. I believe I am part of that group based on my history and what I know about myself. Thanks though, I appreciate the genuine advice. \n\nAnd I’m not dissing meetings/NA - they are absolutely key for some people.", "2_Subreddit": "AskReddit"}], "dwg81ff": [{"0_Comment Submission": "If you could have coffee with your 14 year old self, what would he/she be most surprised to hear about you?", "1_Text": "Damn really? I thought that was just an opiate problem (not so much getting it up but finishing)... I thought coke made sex better most of the times? \n\n(Goes to show I’m clearly a downers person, I’ve done coke obv but don’t know much about the specifics with coke addiction).", "2_Subreddit": "AskReddit"}], "dwg9ttd": [{"0_Comment Submission": "I want to stop doing heroin. Recommendations for the best way to handle withdrawal?", "1_Text": "Theoretically. But idk why one would...", "2_Subreddit": "Drugs"}], "dwgafzk": [{"0_Comment Submission": "If you could have coffee with your 14 year old self, what would he/she be most surprised to hear about you?", "1_Text": "I am aware of everything you’re saying. Please respect my choice to not attend meetings and stop pushing them on me. You don’t know me. At all. Nor do you know what my use history is like. Plain and simple. So don’t say \n\n>you will relapse\n\n\nKeep that to yourself. It’s beyond rude and not at all helpful. Plus, again, you don’t know me! You don’t know which category I fit in when it comes to recovering addicts. So you don’t know if I will relapse. You don’t know that at all. \n\nI kindly thanked you for the advice, but don’t tell me I WILL relapse if I don’t listen to your all knowing advice. Goodbye.", "2_Subreddit": "AskReddit"}], "dwgb0d6": [{"0_Comment Submission": "If you could have coffee with your 14 year old self, what would he/she be most surprised to hear about you?", "1_Text": "You have a preconceived notion of who I am and how I have used heroin. And I can tell from that, that I am not what you think. So stop making assumptions. \n\nTelling someone in recovery that they WILL relapse honestly blows my mind and is so fucked up. Especially when you don’t even know the person, at all. I hope someday you stop thinking you know everything about people you’ve never met.", "2_Subreddit": "AskReddit"}], "dwgs8k2": [{"0_Comment Submission": "If you could have coffee with your 14 year old self, what would he/she be most surprised to hear about you?", "1_Text": "I used on my own. No one even knows. I’m surrounded by good people :) but thanks for the concern - it would be a genuine problem to hang around other users.", "2_Subreddit": "AskReddit"}], "dwgsdis": [{"0_Comment Submission": "If you could have coffee with your 14 year old self, what would he/she be most surprised to hear about you?", "1_Text": "Never have shot up. Don’t plan on it & Ive never been around another person who uses so that bad influence / peer pressure isn’t there to sway me either. I just snorted it. Still can OD that way but it’s way less common. Thanks for the concern though :)", "2_Subreddit": "AskReddit"}], "dwgssq1": [{"0_Comment Submission": "If you could have coffee with your 14 year old self, what would he/she be most surprised to hear about you?", "1_Text": "I come from a wonderful middle class family. Great parents, great childhood. Was a bit rebellious as a teen but nothing crazy just drinking and smoking pot. Then in college started dabbling with pills (30s) but didn’t get carried away. It wasn’t until after college, when I was bored by life and my job at the time that I started doing pills a lot. Basically half the week used then half the week didn’t. I have never been a daily user. \n\nEventually that got too expensive so I decided to try heroin. I was so addicted to opiates that I couldnt give them up,  I was determined to find another way to feel that opiate bliss. I snorted it just like I would the oxys and what do ya know it’s basically the same thing for a fraction of the cost.  So after that I could never justify the cost of pills. \n\nSince then, when using, I have only ever snorted it (never have shot it and don’t want to). I do this on my own, I’m not surrounded by friends who use or anything. Also never daily. Same pattern of binge for a few days, then a few days off. That in of itself takes willpower. \n\nI am not a stereotypical junkie. I am a software engineer (now I love my job so that helps!) with a wonderful family & good friends, and I know I can give this shit up again. I’m not even tempted right now. Just like full steam ahead on being a better person. That was a bit long but hope that answers your question.", "2_Subreddit": "AskReddit"}], "dwgt7gs": [{"0_Comment Submission": "If you could have coffee with your 14 year old self, what would he/she be most surprised to hear about you?", "1_Text": "The thought that helped me last time was my mom. Literally no one knows about my heroin use so imagining my mom finding out either from me overdosing or dying, or even just finding out without any big incident, is a huge motivator to not touch that shit. I love her too much to break her heart like that.", "2_Subreddit": "AskReddit"}], "dwgu6ew": [{"0_Comment Submission": "If you could have coffee with your 14 year old self, what would he/she be most surprised to hear about you?", "1_Text": "Yeah and trust me- there are plenty more just like me. I’ve learned that through interactions on the opiates sub. Opiates don’t discriminate, they can grab a hold of all kinds of people. \n\nBut, the fact that I don’t come from a background of neglect/abuse or a drug riddled family does give me a better chance of getting out and staying out. I wish it was the same for so many others.", "2_Subreddit": "AskReddit"}], "dwgzvlg": [{"0_Comment Submission": "If you could have coffee with your 14 year old self, what would he/she be most surprised to hear about you?", "1_Text": "I’ve already answered this. I wish people wouldn’t get so hung up on the semantics, it’s dumb and I don’t think it contributes much. \n\nIf you know anything about addiction you’d know relapse is extremely common. So I relapsed. I had success for a year and a half. And then I fucked up. \n\nAbstaining (there is that better for you nitpickers??) from heroin for a year and a half is no easy feat. My point is simply if I did it once, I can do it again. And I can do it better this time.", "2_Subreddit": "AskReddit"}], "dwgzygs": [{"0_Comment Submission": "If you could have coffee with your 14 year old self, what would he/she be most surprised to hear about you?", "1_Text": "That’s a tough one too.. alcohol wds can kill you, opiates wds can’t. Hope you’re doing okay now my friend! Best wishes to you.", "2_Subreddit": "AskReddit"}], "dwhgjyv": [{"0_Comment Submission": "If you could have coffee with your 14 year old self, what would he/she be most surprised to hear about you?", "1_Text": "Awesome work, congratulations!", "2_Subreddit": "AskReddit"}], "dwjeciw": [{"0_Comment Submission": "If you could have coffee with your 14 year old self, what would he/she be most surprised to hear about you?", "1_Text": "The slow progression from pills to heroin is not unique at all, it’s extremely common! Once you realize you can get the same feeling for a fraction of the cost... it gets hard to justify spending so much on pills (they’re quite pricey).\n\nYes, complete secret aside from one friend who knows because she was up to no good as well. We live across the country from each other now though, so we can’t influence each other negatively. She’s currently sober and we cheer each other on. \n\nTakes a TON of willpower to not grab more after a binge. But I hate withdrawals. I was terrified of using daily and then one day not being able to get anything and being in so much pain / vomiting / all the other awful things that come with it. Because I’d only use a few days at a time, my dope sickness wasn’t nearly as bad as what others experience. The only time it made me so sick that I was vomiting was when my “heroin” was really fentanyl.... I believe that if I had shot up I would have died from that batch. Just sniffing small bumps made me puke at first, and then the wds did as well (yes I continued using the bag even tho I knew it was fent - addiction makes you stupid). That batch is what caused me to stop for a year and a half though .. it was a wake up call. \n\nMy wds were still tough though- whole body hurts and feels weighed down, insomnia, restless leg syndrome (THE WORST), zero motivation, depression, anxiety, etc. When I was on pills I don’t think the wds were as bad because I couldn’t do as much due to cost. So I just kinda coped with the mild wds that I got. But once I switched to heroin I was able to do more and they got bad enough that I wouldn’t really be able to function without the help of Kratom. Kratom is a legal plant that clears up opiate wds but has a ceiling affect so you can’t get high on it. I also have been prescribed to Xanax for a long time and that helped quite a bit too.\n\nMy motivation hasn’t gone away, still full steam ahead on improving myself! And even when my motivation dims and cravings creep in.. I’m gonna stay strong! I can do it. Thanks for the encouragement :)", "2_Subreddit": "AskReddit"}], "dwjmi69": [{"0_Comment Submission": "Everybody has their time. Mine is now.", "1_Text": "Well written. I’m on Day 5 myself, had a similar revelation recently. I’ve got a fire in me right now.. I have motivation. I want heroin out of my life. I’m kicking it to the curb for the second time. Trying with all my might to make it the last time. \n\nI can do it. You can do it. Good luck to you!", "2_Subreddit": "opiates"}], "dwmn24u": [{"0_Comment Submission": "Any of y’all ever heard of this gift card instead of money thing....?", "1_Text": "I knew I wasn’t paranoid lol thanks for reaffirming. Can you explain the scam though? Only thing I could think was they’d ask for a pic of the back before we meet and that would enable them to use the gift card?", "2_Subreddit": "opiates"}], "dwmnmtb": [{"0_Comment Submission": "Any of y’all ever heard of this gift card instead of money thing....?", "1_Text": "I’m a benzo addict so I won’t be straightedge lol. The only thing I’m trying to abstain from is opiates right now. I don’t think weeds bad, it’s always helped me when quitting heroin in the past. \n\nBut ya, def sounds like a scam. Just told them to fuck off. Thanks for the reply tho, have a good one!", "2_Subreddit": "opiates"}], "dwmp80b": [{"0_Comment Submission": "Any of y’all ever heard of this gift card instead of money thing....?", "1_Text": "Gotcha. Ya it was too weird I knew something was def up. Thanks for the explanation!", "2_Subreddit": "opiates"}], "dwmph5k": [{"0_Comment Submission": "Any of y’all ever heard of this gift card instead of money thing....?", "1_Text": "Heyyy it’s not like I thought it was legit - I clearly state that it doesn’t make any sense! I just wanted to make sure I wasn’t being a paranoid freak since I hadn’t ever been asked that before and it happened twice in a row.", "2_Subreddit": "opiates"}], "dwmr1n8": [{"0_Comment Submission": "Any of y’all ever heard of this gift card instead of money thing....?", "1_Text": "Oh ya I’d never do that. That’s letting your money walk... digitally.. but same thing basically.", "2_Subreddit": "opiates"}], "dwo3zsv": [{"0_Comment Submission": "Any of y’all ever heard of this gift card instead of money thing....?", "1_Text": "Lol that’s what I kept thinking to myself. Like idk what exactly you’re trying to pull but you’re trying to pull something......", "2_Subreddit": "opiates"}], "dwo43m9": [{"0_Comment Submission": "Any of y’all ever heard of this gift card instead of money thing....?", "1_Text": "Yeah def this weird scam that one of the other commenters explained. Sucks that it was someone you actually know though! Definitely felt way too sketchy I was like no actual drug dealers I’ve ever known have wanted a gift card over cash.. but I had to check that I wasn’t just out of the loop or something lol.", "2_Subreddit": "opiates"}], "dwo4vd2": [{"0_Comment Submission": "I overdosed and nearly died last night", "1_Text": "Good luck to you! Whenever cravings kick in or motivation falters, imagine your brother holding you while you’re turning blue and imagine how he felt in that moment. I quit 7 days ago (for the second time), so I’m walking the same path. Get a plan going, it’s too hard to just wing it. Depending on your usage, it may make sense to do rehab or at least meetings. Feel free to PM me anytime. \n\nAlso r/opiatesrecovery is a great place with a lot of helpful and encouraging people. They also have a discord server which you can access by going to OpiatesRecoveryChat.com. There is also [In The Rooms](http://www.intherooms.com) which is another online recovery community. You can do this, it won’t be easy but you can do it!", "2_Subreddit": "Drugs"}], "dwoh5bw": [{"0_Comment Submission": "Nerds of reddit, what was the nerdiest moment of your life?", "1_Text": "The first time I went on the Harry Potter ride at Universal (the Hogwarts one) I was so happy I started crying. Sat there choking back tears the whole time because I didn’t want to look like too much of a freak when it ended. \n\nSame thing happened the first time I went on the Gringotts ride (another Harry Potter ride for those who don’t know). I’ve always wished I could live in Harry Potter’s world so I guess feeling like I was really there got me a lil emotional lol. Nerd tears!!\n\nEdit: I am a female. Can I pull that card here and blame it on all my feeeelings??? Lol", "2_Subreddit": "AskReddit"}], "dwxsop2": [{"0_Comment Submission": "Nice shoes", "1_Text": "I second this. We need more information!", "2_Subreddit": "WhyWereTheyFilming"}]}], "1_submissions": [{"36b9kh": [{"0_Title": "I wanna hear your most embarrassing / embarrassingly funny drug stories. You know, when you get a little (a lot) too fucked up and weirdass shit ensues", "1_Text": "Meetings aren’t for everyone. I take your advice to heart but I will likely not attend meetings. I am a high functioning person with a lot of will power. There are other addicts who didn’t used NA and have still made it. I believe I am part of that group based on my history and what I know about myself. Thanks though, I appreciate the genuine advice. \n\nAnd I’m not dissing meetings/NA - they are absolutely key for some people.", "2_Subreddit": "Drugs"}], "37e0uw": [{"0_Title": "Tips for mitigating damage to nose...", "1_Text": "Meetings aren’t for everyone. I take your advice to heart but I will likely not attend meetings. I am a high functioning person with a lot of will power. There are other addicts who didn’t used NA and have still made it. I believe I am part of that group based on my history and what I know about myself. Thanks though, I appreciate the genuine advice. \n\nAnd I’m not dissing meetings/NA - they are absolutely key for some people.", "2_Subreddit": "Drugs"}], "3nafql": [{"0_Title": "New formula OxyContin ER... any way to blow these?", "1_Text": "Meetings aren’t for everyone. I take your advice to heart but I will likely not attend meetings. I am a high functioning person with a lot of will power. There are other addicts who didn’t used NA and have still made it. I believe I am part of that group based on my history and what I know about myself. Thanks though, I appreciate the genuine advice. \n\nAnd I’m not dissing meetings/NA - they are absolutely key for some people.", "2_Subreddit": "opiates"}], "3s5qsk": [{"0_Title": "Trapped In a Psycho's Body", "1_Text": "Meetings aren’t for everyone. I take your advice to heart but I will likely not attend meetings. I am a high functioning person with a lot of will power. There are other addicts who didn’t used NA and have still made it. I believe I am part of that group based on my history and what I know about myself. Thanks though, I appreciate the genuine advice. \n\nAnd I’m not dissing meetings/NA - they are absolutely key for some people.", "2_Subreddit": "Drugs"}], "445sva": [{"0_Title": "I need morbos mask", "1_Text": "Meetings aren’t for everyone. I take your advice to heart but I will likely not attend meetings. I am a high functioning person with a lot of will power. There are other addicts who didn’t used NA and have still made it. I believe I am part of that group based on my history and what I know about myself. Thanks though, I appreciate the genuine advice. \n\nAnd I’m not dissing meetings/NA - they are absolutely key for some people.", "2_Subreddit": "opiates"}], "46eo3n": [{"0_Title": "Stuck in the worst cycle, trying to muster strength to throw away (holy shit) last bag.. let me explain", "1_Text": "Meetings aren’t for everyone. I take your advice to heart but I will likely not attend meetings. I am a high functioning person with a lot of will power. There are other addicts who didn’t used NA and have still made it. I believe I am part of that group based on my history and what I know about myself. Thanks though, I appreciate the genuine advice. \n\nAnd I’m not dissing meetings/NA - they are absolutely key for some people.", "2_Subreddit": "OpiatesRecovery"}], "5rpesd": [{"0_Title": "Hydro 325/10 Question", "1_Text": "Meetings aren’t for everyone. I take your advice to heart but I will likely not attend meetings. I am a high functioning person with a lot of will power. There are other addicts who didn’t used NA and have still made it. I believe I am part of that group based on my history and what I know about myself. Thanks though, I appreciate the genuine advice. \n\nAnd I’m not dissing meetings/NA - they are absolutely key for some people.", "2_Subreddit": "opiates"}], "683ayd": [{"0_Title": "One year heroin free - cool but I still suck", "1_Text": "Meetings aren’t for everyone. I take your advice to heart but I will likely not attend meetings. I am a high functioning person with a lot of will power. There are other addicts who didn’t used NA and have still made it. I believe I am part of that group based on my history and what I know about myself. Thanks though, I appreciate the genuine advice. \n\nAnd I’m not dissing meetings/NA - they are absolutely key for some people.", "2_Subreddit": "OpiatesRecovery"}], "6c3taz": [{"0_Title": "Exercise! I finally did it. Struggling people like me, give it a shot.", "1_Text": "Meetings aren’t for everyone. I take your advice to heart but I will likely not attend meetings. I am a high functioning person with a lot of will power. There are other addicts who didn’t used NA and have still made it. I believe I am part of that group based on my history and what I know about myself. Thanks though, I appreciate the genuine advice. \n\nAnd I’m not dissing meetings/NA - they are absolutely key for some people.", "2_Subreddit": "OpiatesRecovery"}], "6er887": [{"0_Title": "Ohio AG sueing 5 big pharma companies over misleading the public on the addiction potential relating to their opioids.", "1_Text": "Meetings aren’t for everyone. I take your advice to heart but I will likely not attend meetings. I am a high functioning person with a lot of will power. There are other addicts who didn’t used NA and have still made it. I believe I am part of that group based on my history and what I know about myself. Thanks though, I appreciate the genuine advice. \n\nAnd I’m not dissing meetings/NA - they are absolutely key for some people.", "2_Subreddit": "opiates"}], "6jnjxa": [{"0_Title": "Weaaaak xans / maybe mixed with something else? Looking for some opinions.", "1_Text": "Meetings aren’t for everyone. I take your advice to heart but I will likely not attend meetings. I am a high functioning person with a lot of will power. There are other addicts who didn’t used NA and have still made it. I believe I am part of that group based on my history and what I know about myself. Thanks though, I appreciate the genuine advice. \n\nAnd I’m not dissing meetings/NA - they are absolutely key for some people.", "2_Subreddit": "benzodiazepines"}], "71pe07": [{"0_Title": "Finally scratching that itch again...", "1_Text": "Meetings aren’t for everyone. I take your advice to heart but I will likely not attend meetings. I am a high functioning person with a lot of will power. There are other addicts who didn’t used NA and have still made it. I believe I am part of that group based on my history and what I know about myself. Thanks though, I appreciate the genuine advice. \n\nAnd I’m not dissing meetings/NA - they are absolutely key for some people.", "2_Subreddit": "opiates"}], "72n8iw": [{"0_Title": "That anticipation tho....", "1_Text": "Meetings aren’t for everyone. I take your advice to heart but I will likely not attend meetings. I am a high functioning person with a lot of will power. There are other addicts who didn’t used NA and have still made it. I believe I am part of that group based on my history and what I know about myself. Thanks though, I appreciate the genuine advice. \n\nAnd I’m not dissing meetings/NA - they are absolutely key for some people.", "2_Subreddit": "opiates"}], "74onsc": [{"0_Title": "Story - judgey bitch hate ranted at me just now for being a junkie", "1_Text": "Meetings aren’t for everyone. I take your advice to heart but I will likely not attend meetings. I am a high functioning person with a lot of will power. There are other addicts who didn’t used NA and have still made it. I believe I am part of that group based on my history and what I know about myself. Thanks though, I appreciate the genuine advice. \n\nAnd I’m not dissing meetings/NA - they are absolutely key for some people.", "2_Subreddit": "opiates"}], "75r5ju": [{"0_Title": "Morphine questions, any help appreciated", "1_Text": "Meetings aren’t for everyone. I take your advice to heart but I will likely not attend meetings. I am a high functioning person with a lot of will power. There are other addicts who didn’t used NA and have still made it. I believe I am part of that group based on my history and what I know about myself. Thanks though, I appreciate the genuine advice. \n\nAnd I’m not dissing meetings/NA - they are absolutely key for some people.", "2_Subreddit": "opiates"}], "7d985l": [{"0_Title": "Finally seeing the downsides...", "1_Text": "Meetings aren’t for everyone. I take your advice to heart but I will likely not attend meetings. I am a high functioning person with a lot of will power. There are other addicts who didn’t used NA and have still made it. I believe I am part of that group based on my history and what I know about myself. Thanks though, I appreciate the genuine advice. \n\nAnd I’m not dissing meetings/NA - they are absolutely key for some people.", "2_Subreddit": "quittingkratom"}], "7l8avx": [{"0_Title": "So close [shitpost]", "1_Text": "Meetings aren’t for everyone. I take your advice to heart but I will likely not attend meetings. I am a high functioning person with a lot of will power. There are other addicts who didn’t used NA and have still made it. I believe I am part of that group based on my history and what I know about myself. Thanks though, I appreciate the genuine advice. \n\nAnd I’m not dissing meetings/NA - they are absolutely key for some people.", "2_Subreddit": "opiates"}], "7wj9v0": [{"0_Title": "Calls MLMs illegal before admitting he works for one", "1_Text": "Meetings aren’t for everyone. I take your advice to heart but I will likely not attend meetings. I am a high functioning person with a lot of will power. There are other addicts who didn’t used NA and have still made it. I believe I am part of that group based on my history and what I know about myself. Thanks though, I appreciate the genuine advice. \n\nAnd I’m not dissing meetings/NA - they are absolutely key for some people.", "2_Subreddit": "antiMLM"}], "7x21au": [{"0_Title": "Really relating to Dewey right about now...", "1_Text": "Meetings aren’t for everyone. I take your advice to heart but I will likely not attend meetings. I am a high functioning person with a lot of will power. There are other addicts who didn’t used NA and have still made it. I believe I am part of that group based on my history and what I know about myself. Thanks though, I appreciate the genuine advice. \n\nAnd I’m not dissing meetings/NA - they are absolutely key for some people.", "2_Subreddit": "opiates"}], "7x6hru": [{"0_Title": "Cat dabs", "1_Text": "Meetings aren’t for everyone. I take your advice to heart but I will likely not attend meetings. I am a high functioning person with a lot of will power. There are other addicts who didn’t used NA and have still made it. I believe I am part of that group based on my history and what I know about myself. Thanks though, I appreciate the genuine advice. \n\nAnd I’m not dissing meetings/NA - they are absolutely key for some people.", "2_Subreddit": "AnimalsBeingBros"}], "7xitb8": [{"0_Title": "Karmas a brick", "1_Text": "Meetings aren’t for everyone. I take your advice to heart but I will likely not attend meetings. I am a high functioning person with a lot of will power. There are other addicts who didn’t used NA and have still made it. I believe I am part of that group based on my history and what I know about myself. Thanks though, I appreciate the genuine advice. \n\nAnd I’m not dissing meetings/NA - they are absolutely key for some people.", "2_Subreddit": "instantkarma"}], "87ammm": [{"0_Title": "Back again", "1_Text": "Meetings aren’t for everyone. I take your advice to heart but I will likely not attend meetings. I am a high functioning person with a lot of will power. There are other addicts who didn’t used NA and have still made it. I believe I am part of that group based on my history and what I know about myself. Thanks though, I appreciate the genuine advice. \n\nAnd I’m not dissing meetings/NA - they are absolutely key for some people.", "2_Subreddit": "OpiatesRecovery"}], "88r8as": [{"0_Title": "Any of y’all ever heard of this gift card instead of money thing....?", "1_Text": "Meetings aren’t for everyone. I take your advice to heart but I will likely not attend meetings. I am a high functioning person with a lot of will power. There are other addicts who didn’t used NA and have still made it. I believe I am part of that group based on my history and what I know about myself. Thanks though, I appreciate the genuine advice. \n\nAnd I’m not dissing meetings/NA - they are absolutely key for some people.", "2_Subreddit": "opiates"}]}]}]}