{"glogli77": [{"0_comments": [{"dbj46jy": [{"0_Comment Submission": "I didn't even have to use my AK", "1_Text": "Probably my favorite ice cube song. I listen to a lot of jam bands and have always fantasized about one of the bands I love covering this song. Got stopped at a red light, not a jacker in sight I gotta say today was a good day hah", "2_Subreddit": "opiates"}], "dr0ofs1": [{"0_Comment Submission": "Just made some junkie's day", "1_Text": "thats true, it definitely could've been a lot worse if tehy turned it in to the cops. i learned my lesson and won't be keeping dope in my wallet anymore", "2_Subreddit": "opiates"}], "dr0oh4s": [{"0_Comment Submission": "Just made some junkie's day", "1_Text": "haha yeah my mom also sent me the giftcard for Applebees and there's a reason its been in my wallet for almost a month untouched", "2_Subreddit": "opiates"}], "dr0oikc": [{"0_Comment Submission": "Just made some junkie's day", "1_Text": "a half g, only $50 but still a bummer. it was the Applebees giftcard that really hurt", "2_Subreddit": "opiates"}], "dr64z6x": [{"0_Comment Submission": "Does anyone remember this documentary?", "1_Text": "I’m honestly surprised that homeless addicts don’t just disappear in Russia. Maybe they find their bodies when the snow melts and say they must’ve died from the elements", "2_Subreddit": "opiates"}], "dr71pk8": [{"0_Comment Submission": "Does anyone remember this documentary?", "1_Text": "Whoa man it seems like I struck a nerve and I did not mean to. My post was completely serious, I wasn’t joking or making light of the situation. Nor did I ever say it was inhumane. I know there’s no maintenance there which is why I’m surprised they even have these centers instead of making addicts just disappear. Hope that clears it up, did not mean any offense", "2_Subreddit": "opiates"}], "drb43v5": [{"0_Comment Submission": "trapping out the bando", "1_Text": "Haligh haligh is my fav tune but lifted is my fav album", "2_Subreddit": "opiates"}], "drb4qgk": [{"0_Comment Submission": "trapping out the bando", "1_Text": "Really? And fevers and mirrors is your favorite? I think they’re pretty comparable in style. Teenage me had some mind blowing sexual firsts to lifted so it will always have a special place in my heart\n\nAlso I fucking love I’m wide awake it’s morning, I don’t care what anyone says", "2_Subreddit": "opiates"}], "drb7vmg": [{"0_Comment Submission": "trapping out the bando", "1_Text": "I think the lonesome crowded west is the most under appreciated album of our time", "2_Subreddit": "opiates"}], "dri0rdp": [{"0_Comment Submission": "Love my dboy", "1_Text": "Yeah they’re awesome except for the holiday hours. Like when they turn off the phone cause it’s mothers day or fucking Arbor Day. Here in my town the their quality isn’t the best but it’s 100% consistent. It’s like you’ve been getting the same stuff from the same batch for a year", "2_Subreddit": "opiates"}], "drlyu3i": [{"0_Comment Submission": "Down, down, down", "1_Text": "Split open and melt?", "2_Subreddit": "opiates"}], "drq8wrd": [{"0_Comment Submission": "I lost one of the only people I ever loved to dope and I can't stop.", "1_Text": "Try to cherish their memory and the memories you created together. I lost a good friend 8 months ago and i still keep the del taco receipt from our last night together in my wallet. I look at it constantly and remember all the wild and crazy times and I know he’s lookihg down smiling along with your friend", "2_Subreddit": "opiates"}], "ds8e1oc": [{"0_Comment Submission": "Does this snow have an adverse effect on cold copping", "1_Text": "Whoa I got Santa Muerte when I was up there back in the first week of October and it was really good. Do they usually stay around this long?", "2_Subreddit": "opiates"}], "ds8e78t": [{"0_Comment Submission": "Does this snow have an adverse effect on cold copping", "1_Text": "Ha yeah I went to K&A for my first time like 4 months ago and as I was walking up to the spot it got raided literally while I was on the corner and within 10 mins of the cops leaving it was back up and running. Most people didn’t even leave they just walked up to the corner then went back down the street once the cops left shit was crazy", "2_Subreddit": "opiates"}], "ds8kop1": [{"0_Comment Submission": "Got an unexpected refund from my insurance, so I guess you could say I'm having a pretty good night 😜", "1_Text": "I bet the inside of that dollar is pretty gnarly. I’m guessing it sticks shut all on its own too", "2_Subreddit": "opiates"}], "dt91vib": [{"0_Comment Submission": "I've finally got it! (damn I'm smart)", "1_Text": "If you’re dope usuage is anything like mine, the strain I have put on my kidneys trying to take a bunch of opiates pisses would definitely have my kidneys rejected. Those poor bastards I can’t believe they’re stil soldiering through", "2_Subreddit": "opiates"}], "dt92bq7": [{"0_Comment Submission": "When mfs try to flex with pressies I be likeeeeee", "1_Text": "You guys don’t fuck with pressies? I prefer them they’re cheaper and stronger especially the hulks those are usually 3-4 mg and only $5. \n\nSide note I just got in to clonazolam. Have any one tried it? I think it blows alp out of the water and it’s so much cheaper. And it’s legal", "2_Subreddit": "opiates"}], "dt92kpk": [{"0_Comment Submission": "I live in a small rural town no connects. I daily see this 20 some year old long hair hippie guy I think lives at the nearby hotel...today I saw him with his dealer (assuming)....should I pop Le question?", "1_Text": "Ask his favorite phish show and he will instantly be your best friend", "2_Subreddit": "opiates"}], "dt92rwx": [{"0_Comment Submission": "When mfs try to flex with pressies I be likeeeeee", "1_Text": "Yeah I’m in the us and so it the company I get it from. They’re awesome I get my shit in 2-3 days since order. \nLet me put it this way. A 50mg/5ml cost $57 with shipping and I dose .5 mg a time so you can see how much I have and for how little it costs\n\nPM me", "2_Subreddit": "opiates"}], "dt95wcf": [{"0_Comment Submission": "When mfs try to flex with pressies I be likeeeeee", "1_Text": "My bad you wanna take it down? I figured I was ok since it’s not illegal but indef don’t wanna cause any problems or.bring any heat", "2_Subreddit": "opiates"}], "dtdaam1": [{"0_Comment Submission": "Etizolam and opiates", "1_Text": "I got a 50mg/5ml PG solution of clonazolam and dear god that shit is crazy strong. I literally don’t remember the past 6 days I was only take maybe .5mg. In fact I apparently went and bought and 80 bag and lost it. I have no recollection but that’s what happened according to my texts from last night. Clam is no joke and so cheap. I love it", "2_Subreddit": "opiates"}], "dteb90o": [{"0_Comment Submission": "Anyone else or am I the only fan here?", "1_Text": "Blank face LP is my jam", "2_Subreddit": "opiates"}], "dtebmq6": [{"0_Comment Submission": "What songs do you listen to on opiates ?", "1_Text": "Phish (the oxy/dope years) that deep dark funk goes with dope like a fine wine goes with imported cheese. The Hampton 97 box set is a staple in my car", "2_Subreddit": "opiates"}], "dtgbjcr": [{"0_Comment Submission": "Anyone else or am I the only fan here?", "1_Text": "three different pagers blowin up cause I’m cracking, tryin to turn a dollar to a million hoe what’s happenin", "2_Subreddit": "opiates"}], "dwvur47": [{"0_Comment Submission": "Opiophile", "1_Text": "oh man i must've read the \" what's the funniest thing you did while noodded out\" thread 100 times. the one where the dude was in teh kitchen holding the coke can and nodding out kep dropping it as he slouched over got me everytime. but yeah opiophile was the shit. the how to score in the tenderloin threads were eye opening. i believe the main guy jdub15 or something posts in here sometimes. dude is an OG", "2_Subreddit": "opiates"}]}], "1_submissions": [{"3m9eve": [{"0_Title": "Funny/scary close calls?", "1_Text": "Probably my favorite ice cube song. I listen to a lot of jam bands and have always fantasized about one of the bands I love covering this song. Got stopped at a red light, not a jacker in sight I gotta say today was a good day hah", "2_Subreddit": "opiates"}], "7ipwtj": [{"0_Title": "Just made some junkie's day", "1_Text": "Probably my favorite ice cube song. I listen to a lot of jam bands and have always fantasized about one of the bands I love covering this song. Got stopped at a red light, not a jacker in sight I gotta say today was a good day hah", "2_Subreddit": "opiates"}]}]}]}