{"DickCheeseKillah": [{"0_comments": [{"dw0thge": [{"0_Comment Submission": "Almost a year ago, we adopted Norman. He was in the last cage in the back of the shelter, terrified in the corner, all alone. He would stay scared for months after we got him. Here he is now, cuddled up on my lap. What a long way he's come!", "1_Text": "Russian blues are like that. They are very scared and terrified of everything esp if they were feral. Once they trust you tho you become their everything . They usually only trust 1 person also. Mine hides whenever someone comes into my house then will only appear with guests have left.", "2_Subreddit": "cats"}], "dw1c792": [{"0_Comment Submission": "First attempt at copping off Instagram", "1_Text": "You’re the one trying to buy pain pills off Instagram , your both kinda ass clownish.", "2_Subreddit": "opiates"}], "dw1ca0o": [{"0_Comment Submission": "Friend just finished 20 year federal trafficking sentence, gave me this when I saw him today.", "1_Text": "Damn that’s fuckin crazy. I can’t imagine doing hard time like that and trapping the day I get out. Fuckin nuts. He must really not give a fuck.", "2_Subreddit": "opiates"}], "dw1ccjq": [{"0_Comment Submission": "Anyone else despise \"nodding out\" on opiates? Or just me?", "1_Text": "Prob my fav thing in the world.", "2_Subreddit": "opiates"}], "dw1cl0k": [{"0_Comment Submission": "Any tips for cold coping pills?", "1_Text": "It’s really hard to cold cop pain pills. I only know one place in the country it’s possible and it’s not a Midwest city. It’s mostly either dope or crack cold copping but maybe you could try and ask a dope dealer.", "2_Subreddit": "opiates"}], "dw1cqpd": [{"0_Comment Submission": "RMD with live resin/ sugar/ sauce?", "1_Text": "You’re gonna need to hit up the black market for that fire live resin in Boston.", "2_Subreddit": "bostontrees"}], "dw1ed2s": [{"0_Comment Submission": "Obsessing about my friend's overdose and how it could have been prevented.", "1_Text": "You can’t blame yourself. If he reacted that badly to it and went back for more , kid had a death wish it sounds like. You don’t even get High from\nFent like that , just drops you. Makes no sense .", "2_Subreddit": "opiates"}], "dw27jc4": [{"0_Comment Submission": "/r/DarkNetMarkets banned", "1_Text": "Reddit is dead y’all . Move along.", "2_Subreddit": "DarkNetMarketsNoobs"}], "dw3lncj": [{"0_Comment Submission": "Hood Stories Pat 1", "1_Text": "Oo white boy with hood smarts , watch out folks !!!", "2_Subreddit": "Drugs"}], "dw41gcj": [{"0_Comment Submission": "I found the love of my life at the methadone clinic", "1_Text": "Sounds like a keeper !!!! No teeth AND you know she’s a heroin addict. That’s a girl you take to meet mama.", "2_Subreddit": "opiates"}], "dw45a6m": [{"0_Comment Submission": "Hood Stories Pat 1", "1_Text": "Dude you’re pretty much black at this point. Has your dick grown cuz you’re so hood and shiesty now ?", "2_Subreddit": "Drugs"}], "dw45eun": [{"0_Comment Submission": "How hard will it be to get real pills in 5 years?", "1_Text": "5x harder then it is now by my calculations.", "2_Subreddit": "opiates"}], "dw45gkf": [{"0_Comment Submission": "Let my work colleague hold onto half my stash...", "1_Text": "That’s your fault for giving your stash away.", "2_Subreddit": "opiates"}], "dw4rozx": [{"0_Comment Submission": "Hood Stories Pat 1", "1_Text": "Honestly shocking after hearing how you dealt with those “cats “ outside the bodega, I would think it would be dragging on the ground.", "2_Subreddit": "Drugs"}], "dw559y7": [{"0_Comment Submission": "Hood Stories Pat 1", "1_Text": "Lol dude I was just giving you a hard time. I thought your Reddit post was great actually, a little short but good. For hardcore street thug you’re quite sensitive.", "2_Subreddit": "Drugs"}], "dw8lxga": [{"0_Comment Submission": "Opioid lives matter. Junkies unite!", "1_Text": "Ways to not be called a  junkie . #1 don’t be a heroin addict. Lol dude it comes with the territory you wanna shoot dope you get called a junkie . You cant have your cake and eat it to.", "2_Subreddit": "opiates"}], "dw8yl3s": [{"0_Comment Submission": "This is one of the community cats we call Joker .... he was playing with a leaf so i gave him a mouse cat toy. He loves it.", "1_Text": "What do you mean by territorial mating battles ?", "2_Subreddit": "cats"}], "dwe6tw2": [{"0_Comment Submission": "My girlfriend wasn't too enthusiastic about her new neighbors after her visit!", "1_Text": "Dude your girls smoking !", "2_Subreddit": "trashy"}], "dwe76bx": [{"0_Comment Submission": "I call it “Theft”", "1_Text": "Hahahahahahahahahahah I love this meme fuckin stealing this. I do this all the time at Walmart fuck those bitches .", "2_Subreddit": "trashy"}], "dwe7c95": [{"0_Comment Submission": "I call it “Theft”", "1_Text": "There’s ways to trick it. Go when busy . The ones at Walmart are hella easy to mess with . Sometimes I just put some of my stuff down on that side already lol. I only do it at Walmart tho call me trashy if you want IDGAF.", "2_Subreddit": "trashy"}], "dweouhc": [{"0_Comment Submission": "*Pays extra to get custom shoes* \"booty hunter\"", "1_Text": "It’s actually a symbol for hip hop group “pro era “. They rep the number 47.", "2_Subreddit": "trashy"}], "dwi6it3": [{"0_Comment Submission": "When your plug don’t even know he da plug", "1_Text": "No fuckin way . She knew and was just cool wit it ? I dunno how I would feel about that . Crazy", "2_Subreddit": "opiates"}], "dwiavxh": [{"0_Comment Submission": "My collection of dead lighters.", "1_Text": "What type of sicko are you ?! How they hell did you manage this ?", "2_Subreddit": "trees"}], "dwiqf9k": [{"0_Comment Submission": "Robbed my connect", "1_Text": "That’s some Boston white boy shit", "2_Subreddit": "opiates"}], "dwwlqwh": [{"0_Comment Submission": "$80oz in Portland, Oregon", "1_Text": "Who cares if the weed sucks. Oregon’s outdoors are so boofy . IDGAF if it’s free I wouldn’t take that shit. Taste like cardboard with no smell. That’s why it’s 80$. Growers can’t give away their weed in Oregon, Cali this year so much mids outdoors flooding the market. Maybe I’m just a weed snob but when I smoke it’s def not shitty cheap Oregon outdoor weed no matter the price.", "2_Subreddit": "trees"}]}], "1_submissions": [{}]}]}