{"cryptoid999": [{"0_comments": [{"dhn5uvr": [{"0_Comment Submission": "Christian militias kill up to 30 civilians as hundreds seek refuge inside mosque", "1_Text": "This makes me want to punch christians. Grow up, no religion is correct", "2_Subreddit": "news"}], "dhva341": [{"0_Comment Submission": "1970: We will have flying cars in the future!!! 2017: There are a billion genders.", "1_Text": "How is that not better than flying cars?", "2_Subreddit": "Showerthoughts"}], "dilrnrx": [{"0_Comment Submission": "What do a lot of parents do that screws up their kid?", "1_Text": "Telling child to do thing immediately after child says I am doing said thing", "2_Subreddit": "AskReddit"}], "dj09r91": [{"0_Comment Submission": "[Serious] OK redittors: What absolutely, 100%, undenyingly happened to you, but if you told anyone, it would get posted on r/quityourbullshit?", "1_Text": "Being followed by the police for a reason I am u aware of, and when confronted, being kind. I would describe in detail, but, um, don't want to. But after I became aware of this, I really stopped caring for cops, big and small *cough cough*. Kinda ridiculous, I suffer from a form of schizophrenia, and try not to be a target. Is that police harassment? I honestly don't know", "2_Subreddit": "AskReddit"}], "dljnklv": [{"0_Comment Submission": "Photos of Jupiter in 1879 and 2016", "1_Text": "You've changed Jupiter, you're not the same planet you used to be", "2_Subreddit": "space"}], "dlyznjc": [{"0_Comment Submission": "Trying to steal food from a dog, WCGW?", "1_Text": "bamboozle successful", "2_Subreddit": "Whatcouldgowrong"}], "dn2l6ot": [{"0_Comment Submission": "Paranomalies case #b35", "1_Text": "This is cool, keep going!", "2_Subreddit": "nosleep"}], "dp4ik39": [{"0_Comment Submission": "Thank the gods for frozen pizza", "1_Text": "GODS I WAS CHEESY THEN", "2_Subreddit": "freefolk"}], "dsj5p86": [{"0_Comment Submission": "When someone tries to return a book at the library.", "1_Text": "Just put this up in the library I work at. This is a common conversation with the students here returning from field studies", "2_Subreddit": "BikiniBottomTwitter"}], "dsoendf": [{"0_Comment Submission": "What is something that shouldn’t be romanticized but is?", "1_Text": "Opioid use", "2_Subreddit": "AskReddit"}], "duvmyny": [{"0_Comment Submission": "President Trump: I would have run into school during shooting ‘even if I didn’t have a weapon’", "1_Text": "Imagine him running at you, dear god", "2_Subreddit": "nottheonion"}], "dv8weoh": [{"0_Comment Submission": "What's the longest amount of time you have spent in residential treatment?", "1_Text": "I did 11 months at an inpatient place in AZ, it was not quite inpatient tho as we lived in seperate houses and you could eventually have a car, phone, etc. The therapy there was pretty bad tho, and not many people seem to have done well afterwords, myself included", "2_Subreddit": "opiates"}], "dw0j44d": [{"0_Comment Submission": "Men of Reddit, what's your sad story that you don't want to tell anyone about it?", "1_Text": "I just relapsed on opiates after a devastating break up. I don’t want to be using, but I don’t have anyone I can reach out to without being belittled or judged, and I am financially incapable of affording rehab again. If I tell my friends, I will probably be shunned due to my risky lifestyle, which I entirely understand, as the pain of losing a friend to addiction is awful. But I’m stuck, and don’t wanna be this way, but I also can’t take the emotional pain I’m in", "2_Subreddit": "AskReddit"}], "dw2rtr6": [{"0_Comment Submission": "First time doing fentanil. Any advice?", "1_Text": "If this is real, which I doubt, this person is probably dead. That makes me sad. I hope someone learns the values of education and harm reduction from this post", "2_Subreddit": "opiates"}], "dw48292": [{"0_Comment Submission": "People who are/were diagnosed with a terminal ilness, what made you think “something is not right with me”?", "1_Text": "When I was 8 years old, I woke up one day and my legs didnt work. Being 8, I thought it was super cool for whatever reason, so I crawled downstairs and into the kitchen. My mom saw me and I said \"check it out, my legs dont work.\" Well after another couple minutes I was fine, up and walking around. Though my mom was worried, she sent me to school. I collapsed during class, walking to my desk, so the school contacted my mom. She came and picked me up, took me to my pediatrician. He examined me briefly then told my mom to IMMEDIATELY drive me about an hour to a world-class hospital, Dartmouth-Hitchcock Medical Center in NH. I was admitted. That night, I stopped breathing on my own and was put on a ventilator. I also became 100% paralyzed about an hour after arrival, full body paralysis. Turns out I had a rare disease, Guillian-Barre Syndrome. Because I was so young and had some other minor health issues, it was acute onset, rendering me paralyzed. It took months of rehabilitation once my nerves started regrowing, but now I am 26 and not paralyzed in any way, full mobility, no lasting motor skill damage. I owe my life to that doctor. I would have died at home had it not been for him. Straight up hero.", "2_Subreddit": "AskReddit"}], "dw48p95": [{"0_Comment Submission": "Reddit, what are your single, standout, best TV Episodes of all time?", "1_Text": "fargo season 2", "2_Subreddit": "AskReddit"}], "dw4f5ix": [{"0_Comment Submission": "What is the worst text that you accidentally sent to the wrong person?", "1_Text": "its either weed or lean.", "2_Subreddit": "AskReddit"}], "dw4nx32": [{"0_Comment Submission": "Jet skiing in a tight canal", "1_Text": "You are a bold one", "2_Subreddit": "SweatyPalms"}], "dw4z6d5": [{"0_Comment Submission": "Long time lurker, first post", "1_Text": "The only reason I tried it was cus I read someone’s report about trying it claiming it to be comparable to dilly. I was skeptical, but junkie brain took over. It was ok, but nothing too crazy. In the future, that’s what I’ll do to decrease risk. I just thought I’d share, I swear I’m not always quite this dumb", "2_Subreddit": "opiates"}], "dw67nbr": [{"0_Comment Submission": "Soulja Boy isn’t even a soldier, Dr. Dre isn’t even a doctor, what are other examples?", "1_Text": "snoop is likely not a doggo", "2_Subreddit": "AskReddit"}], "dw82c3u": [{"0_Comment Submission": "DAE feel like we are using opiates because we have been blocked off from our real purpose in life?", "1_Text": "I’m basically in the same spot man. Lost just about everything now that my partner left me, I feel like I’m just wondering through life, and I drain the people who do still put up with me. It’s hard to resist just doing a hot shot some days and saying goodbye to this life", "2_Subreddit": "opiates"}], "dwkdvno": [{"0_Comment Submission": "What was the dumbest thing a teacher has ever said to you?", "1_Text": "Literature is not art.", "2_Subreddit": "AskReddit"}], "dwr5nkb": [{"0_Comment Submission": "Reddit, what made you \"nope the fuck\" out of your date?", "1_Text": "so thats wrong. some things cannot be absorbed through the mucus membrane in the nose due to their chemical nature. Sure, you can snort any powder in existence. but to get high, it has to be absorb-able.", "2_Subreddit": "AskReddit"}], "dwtvhyq": [{"0_Comment Submission": "I'm Eric Hafner, I'm running for U.S. Congress in Portland, Oregon (OR-3). I want to legalize all drugs, including opiates, but offer ibogaine therapy too, and free drugs for addicts via prescription.", "1_Text": "It’s so awesome to hear this from a political candidate in the US given our political climate. I wish I lived in Oregon", "2_Subreddit": "opiates"}], "dwxbegd": [{"0_Comment Submission": "D&D players of Reddit, what is the most creative character you've seen someone play as?", "1_Text": "Im currently playing Monster of the Week as a midwestern bumble butt named Billy Bob Swanson.", "2_Subreddit": "AskReddit"}]}], "1_submissions": [{"86ghw4": [{"0_Title": "Long time lurker, first post", "1_Text": "This makes me want to punch christians. Grow up, no religion is correct", "2_Subreddit": "opiates"}], "86yigk": [{"0_Title": "(Homemade) HONEY BBQ pork ribs baked 5 hours", "1_Text": "This makes me want to punch christians. Grow up, no religion is correct", "2_Subreddit": "food"}], "8ab650": [{"0_Title": "[REQ] ($140) - (#Prescott, AZ, USA), (May 3rd, 2018), (Paypal)", "1_Text": "This makes me want to punch christians. Grow up, no religion is correct", "2_Subreddit": "borrow"}]}]}]}