{"garbagehuman90": [{"0_comments": [{"dkiw7e5": [{"0_Comment Submission": "He has guns for the zombie appocolipse.", "1_Text": "We need a translator over here!", "2_Subreddit": "trashy"}], "dkiwsu1": [{"0_Comment Submission": "Seemingly normal Facebook friend really aired the dirty laundry tonight", "1_Text": "Sounds like the guy she left is pretty pissed. I think revenge posting on fb or posting someone's drama on their page is about the trashiest revenge there is. But it sure is fun to watch happen!", "2_Subreddit": "trashy"}], "dkuja0t": [{"0_Comment Submission": "Selfie ft. track marks, saw this unsurprisingly on Facebook since that's where it looks like trash collects", "1_Text": "That looks more like she donated plasma or something. There is tape residue on her arm it looks like. Junkies don't put bandages on after they shoot up. \n\nEdit: nope. Upon closer inspection those are probably tracks around the hole. The hole still looks like a plasma line or something though. Insulin needles don't leave holes like that. Most junkies use pretty small needles.", "2_Subreddit": "trashy"}], "dkujis0": [{"0_Comment Submission": "All of her posts are like ten pictures of her with her tongue out", "1_Text": "She looks like she trades sex for meth.", "2_Subreddit": "trashy"}], "dkv0788": [{"0_Comment Submission": "23/F I just want people to be honest with me", "1_Text": "Your eyes are really far apart.", "2_Subreddit": "amiugly"}], "dkv0csx": [{"0_Comment Submission": "[17M] Opinions?", "1_Text": "You are a decent looking guy but that acne is bad. You need to get that cleared up. If you can do that, you will have a shot!", "2_Subreddit": "amiugly"}], "dkv0ffv": [{"0_Comment Submission": "[F/20] thoughts? what vibes do you get from me?", "1_Text": "You give off a real attention seeking vibe in all of these photos. You look like you believe you're cute and want to be validated.", "2_Subreddit": "amiugly"}], "dkv0isn": [{"0_Comment Submission": "M/21 feel ugly, what do you think? (be honest please)", "1_Text": "It's not good dude...", "2_Subreddit": "amiugly"}], "dkv0r2m": [{"0_Comment Submission": "[23M] Why am I so ugly?", "1_Text": "You have a very punchable face. It's just one of those faces you see and want to punch for not real reason. My main suggestion would be to try not to look so punchable.", "2_Subreddit": "amiugly"}], "dkv4150": [{"0_Comment Submission": "M/21 feel ugly, what do you think? (be honest please)", "1_Text": "Well this isn't a great pic for rating. But, based on what I see in this pic your about a 2-3/10. I'm a solid 2 myself so I know how it is man. Sorry.", "2_Subreddit": "amiugly"}], "dkv65q8": [{"0_Comment Submission": "M/21 feel ugly, what do you think? (be honest please)", "1_Text": "I know man, trust me. Honestly my best advice would be to work out and try to figure out what things make you look better and do them. Things like hair or teeth are fixable. So Focus on the fixable stuff. There are some guys who go as far as getting surgery but honestly I think that's a slippery slope and I wouldn't recommend really. Focus on school and making lots of money. If you have money it can be almost as good as being handsome.", "2_Subreddit": "amiugly"}], "dllzo6i": [{"0_Comment Submission": "[F/20] thoughts? what vibes do you get from me?", "1_Text": "Well, you're posting on a sub specifically to be rated on your looks so that in it's self says validate me.... just saying. But you asked and that was my honest opinion. Not everyone is going to sugar coat things for you and tell you what you want to hear. Why would you want that anyways? If that's what you are looking for I would suggest just posting a selfie on Instagram.", "2_Subreddit": "amiugly"}], "dpswkt6": [{"0_Comment Submission": "Anyone figure out how to be financially stable whilst using?", "1_Text": "I would say sticking to a budget is key. Once you've spent all you've allowed yourself for opiates that's all you get until the next paycheck. Being willing to be uncomfortable and go without if necessary is probably the only way to save and use opiates.", "2_Subreddit": "opiates"}], "dpswrpv": [{"0_Comment Submission": "Anyone else see Googles homepage today and immediately look closer to try and identify the “pills”? (Shitpost)", "1_Text": "It's oxy and a script!! 😂", "2_Subreddit": "opiates"}], "dpsx1eg": [{"0_Comment Submission": "Anyone know why this happened immediately following my normal shot of bth?", "1_Text": "Sounds like an allergic reaction to something it was cut with. You may need to take some antihistamines. Keep some in your home just in case and if you ever do another shot and you begin to feel like your throat is swelling you should probably call 911, you may need a shot with the good ol epi pen.", "2_Subreddit": "opiates"}], "dpt2zon": [{"0_Comment Submission": "Anyone know why this happened immediately following my normal shot of bth?", "1_Text": "That's good advice! Also, I know a lot of people are apprehensive to tell the ER that they use opiates but in this case it's pretty necessary I would think. If you seek medical attention it's pretty important that you are honest with them on what you were doing when this reaction started. This sounds like a more severe allergic reaction and it could totally be life threatening so it warrants telling them the 100% truth.", "2_Subreddit": "opiates"}], "dptsqrd": [{"0_Comment Submission": "[M18] Hey reddit, a couple of months ago I made a post here and was given a few suggestions, I took some on board and I'd like to see what you guys think now...", "1_Text": "So much better! Well done OP.", "2_Subreddit": "amiugly"}], "dwhdyvb": [{"0_Comment Submission": "Lost My Job!", "1_Text": "It sucks but if they have a no tolerance drug policy you probably signed paperwork agreeing to those terms. Its shitty that they weren't more understanding and didn't even try to talk to you or help you. they were probably just trying to follow company policy though. I've had bosses act friendly and laid back and then become cold if I got in trouble and they had to write me up or something. I think they do that so everything is \"by the book\" and they can't be sued or something later. I wouldn't worry too much about legal issues. If they were going to call the cops they would have done it right then probably and they didn't have any real proof that you had drugs or were doing drugs because you didn't empty your pockets. You probably made the right choice by just says bye and getting out of the situation. They may have called the cops otherwise.", "2_Subreddit": "opiates"}], "dwhed7o": [{"0_Comment Submission": "Forced detox/switch to subs", "1_Text": "Wait. There is no reason to risk it if you aren't feeling to bad yet.", "2_Subreddit": "opiates"}], "dwhevzg": [{"0_Comment Submission": "How Fentanyl Created Murderers of Drug Dealers", "1_Text": "I think this article was made to inform people who know nothing about fentanyl or heroin. I feel like pretty much everything in the article is well known information in the drug community.", "2_Subreddit": "opiates"}], "dwhngsb": [{"0_Comment Submission": "Lost My Job!", "1_Text": "Well you quit the job so I am thinking other than your final check you probably won't hear much from them. If you still works there I would expect that stuff but not now. They are honestly probably already busy looking for the next employee. HR will do all the termination stuff and deactivate any logins or codes you have and that'll be that, most likely.", "2_Subreddit": "opiates"}], "dwhnmaf": [{"0_Comment Submission": "How Fentanyl Created Murderers of Drug Dealers", "1_Text": "Yeah, I would agree with that. This doesn't even scratch the surface really.", "2_Subreddit": "opiates"}], "dwlbwth": [{"0_Comment Submission": "Hiccups (shitpost)", "1_Text": "I used to get them so bad! I am on methadone now and I hardly ever get them anymore.", "2_Subreddit": "opiates"}], "dwle1d4": [{"0_Comment Submission": "Hiccups (shitpost)", "1_Text": "It's been really great for me. I haven't had any major issues from it and the switch from H to methadone was pretty easy on me. My clinic is great about helping you get to the right dose for you. I am currently going down on my dose weekly to get off completely. I stabilized at like 60 or 65mgs (can't remember) and was on that for a couple of years. I am down to 34mg now and it's going ok. I had tried rehab and NA and everything else. Methadone was a last resort for me but it turned out to be the right choice. I got my life back on track because of it. I honestly think I would be dead if it weren't for the clinic. I don't recommend it to people who have only been in opiate addiction a short time or as a first resort though.", "2_Subreddit": "opiates"}], "dwllwkg": [{"0_Comment Submission": "Hiccups (shitpost)", "1_Text": "Thank you! It is for sure a big ol' process to taper. Once you get down to the 30mg area it gets harder to adjust to the change each time but it's still not super bad.", "2_Subreddit": "opiates"}]}], "1_submissions": [{"87tfr2": [{"0_Title": "Something odd happened when I went down on my methadone this week.", "1_Text": "We need a translator over here!", "2_Subreddit": "opiates"}]}]}]}