{"Joelock215": [{"0_comments": [{"dwnvrvv": [{"0_Comment Submission": "How to tell my dealer I'm pregnant?", "1_Text": "Suck it!", "2_Subreddit": "opiates"}], "dwnvs3m": [{"0_Comment Submission": "How to tell my dealer I'm pregnant?", "1_Text": "Copy and paste", "2_Subreddit": "opiates"}], "dwnvts9": [{"0_Comment Submission": "How to tell my dealer I'm pregnant?", "1_Text": "When a woman gives birth to a baby who requires detox, social workers may confiscate the child to protect its interests. However, some women are also arrested for child neglect, and may serve time in addition to losing custody. In states with the harshest laws, women who experience drug-related miscarriages could even be charged with homicide.\n\nBecause we already know that prosecution doesn't stop drug use, these legal measures can only be understood to put the child's interests and society's interests ahead of the mother's. Prosecution and prohibition methods are not successful as measured throughout history and up through the War on Drugs of the present day.", "2_Subreddit": "opiates"}], "dwnvup1": [{"0_Comment Submission": "How to tell my dealer I'm pregnant?", "1_Text": "Anything to say now???? Wtf! Where’s all the dumb ass replies at???", "2_Subreddit": "opiates"}], "dwnvvdc": [{"0_Comment Submission": "How to tell my dealer I'm pregnant?", "1_Text": "🙌🏼 thank Jesus", "2_Subreddit": "opiates"}], "dwnvybz": [{"0_Comment Submission": "How to tell my dealer I'm pregnant?", "1_Text": "Where’s your comments now??!!! Lmao thank god I shut you up with facts!!! I know a female that was booked after she had her child... why would I lie about that!?!?!? It’s not worth lying about and getting into it with apparently a slow person that locks windows on the short bus going to school... hopefully you can man up and apologize since your incorrect", "2_Subreddit": "opiates"}], "dwnw337": [{"0_Comment Submission": "How to tell my dealer I'm pregnant?", "1_Text": "Omfg so you can still get booked though right? And charged right??? Exactly you see the here jury’s that the person was wrong the whole time and tried to be slick with this comment to make you believe they were arguing the fact NO LEGAL ACTION COULD BE TAKEN WHATSOEVER BUT INFACT IT CAN!!! I rest my case your honor! Fucktard! Lmao\n\nYou argued forever saying nothing can be done but it can so your wrong! It’s ok let it sink in a minute", "2_Subreddit": "opiates"}], "dwnw3oi": [{"0_Comment Submission": "How to tell my dealer I'm pregnant?", "1_Text": "And it would be child services charging not the police", "2_Subreddit": "opiates"}], "dwnw4s1": [{"0_Comment Submission": "How to tell my dealer I'm pregnant?", "1_Text": "Like it says some have been not all! So I’ve personally witnessed this and yet you argue about it? Why???", "2_Subreddit": "opiates"}], "dwnw73q": [{"0_Comment Submission": "How to tell my dealer I'm pregnant?", "1_Text": "Good night! I can sleep sound knowing you have learned something other then humility apparently hahahaha", "2_Subreddit": "opiates"}], "dwnw7iu": [{"0_Comment Submission": "How to tell my dealer I'm pregnant?", "1_Text": "lol", "2_Subreddit": "opiates"}], "dwnw8o6": [{"0_Comment Submission": "How to tell my dealer I'm pregnant?", "1_Text": "Stop it apparently you’re not you just fucked up once", "2_Subreddit": "opiates"}], "dwnwa75": [{"0_Comment Submission": "How to tell my dealer I'm pregnant?", "1_Text": "Hahahaha lmfao Ctfu you’re good you’re really good with this debating shit! You in law school? You should be!!! lol 😂", "2_Subreddit": "opiates"}], "dwnwcg9": [{"0_Comment Submission": "How to tell my dealer I'm pregnant?", "1_Text": "Youwheres my apologies for calling me slow an shit!??? lol \n\nApologies for saying you licked school bus windows but did you wear a helmet? Be honest!😆✊🏾🤘🏼🤫🤤😵🤣😴 gnight", "2_Subreddit": "opiates"}], "dwnwd73": [{"0_Comment Submission": "How to tell my dealer I'm pregnant?", "1_Text": "Still get booked though lol", "2_Subreddit": "opiates"}], "dwo2wka": [{"0_Comment Submission": "What to do with er oxy", "1_Text": "I chew into small pieces and let dissolve in my mouth for a minute then swallow!\n\nImo/ime it takes about 15-20 minutes to start to feel it, then by the one hour mark I completely feel the effects of it! Usually am able to get 60’s, take 1-1/2 bite into little pieces and to me I enjoyed OP’s more the ir’s...  they worked good and lasted double almost triple at times as long as immediate release...\n\nNever had the patience to let dissolve in soda,juice, alcohol, or whatever other crazy bullshit people do to get the “IR EFFECTS”", "2_Subreddit": "opiates"}], "dwo3jed": [{"0_Comment Submission": "Best shit for the newbie?", "1_Text": "This is a very difficult question! There’s much more information needed to even try to accurately answer this or come close too!", "2_Subreddit": "opiates"}], "dwo3urz": [{"0_Comment Submission": "Best shit for the newbie?", "1_Text": "How’s it smoking opium??? I was under the impression you can’t get better affect/high!?!?", "2_Subreddit": "opiates"}], "dwo3vmm": [{"0_Comment Submission": "How to tell my dealer I'm pregnant?", "1_Text": "It’s not called cps it’s called dhs where I’m from", "2_Subreddit": "opiates"}], "dwo3wh4": [{"0_Comment Submission": "How to tell my dealer I'm pregnant?", "1_Text": "No it’s not lies at all they can be charged so please go pound sand! Thanks", "2_Subreddit": "opiates"}], "dwo3xjk": [{"0_Comment Submission": "How to tell my dealer I'm pregnant?", "1_Text": "My father has been a cop for 38 years and I know someone that was booked and charged for this so idk how it’s lies?? Please shut it!", "2_Subreddit": "opiates"}], "dwo3xt7": [{"0_Comment Submission": "How to tell my dealer I'm pregnant?", "1_Text": "lol", "2_Subreddit": "opiates"}], "dwo65oe": [{"0_Comment Submission": "New connect has no idea how much to put in a bag!", "1_Text": "Or they want you to be a steady client? A lot of the times when I meet new plugs they throw something extra to me to try and keep Clientele imo/ime. There was only one connect I’ve ever met that would never throw something small or extra to me ever! Like if I’m broke I can usually get something on the eye from a few different connects since they know I’ll come to them again or at least think so but this one dude would never! Usually each new person I’d ask or they’d throw an extra 2-4 bags just so I could “give” to other “users/friends” when I’d say hey do you have an extra one or two cause my boys looking for a new connect?!?! And they’d say ow yeah no problem lmk what you an them think of my product? And the dude that never gave anything extra or for free always had the weakest shit except the one time he re-upped and had me one crazy! A bun lasted me like 7-8 days cause literally a 1/4 of  a 5$ bag would have me so ON! And last a few hours like 4-6 hours... I d tell him his shit wasn’t good but when he had this one batch I told him keep copping from same plug, or have his plug cut it the same amount or as close as possible?!?!?! \n\nGuess what it never happened!!! And especially sucks cause he is 3 blocks from my house so it would be so convenient all the time but his product 99 outta 100 it’s garbage, it’s my last resort for if I cannot take a 15-20 minute ride down the way and 15-20 minutes ride back home", "2_Subreddit": "opiates"}], "dwobmgz": [{"0_Comment Submission": "New connect has no idea how much to put in a bag!", "1_Text": "Looks like quality stuff though? It’s not good?", "2_Subreddit": "opiates"}], "dwogn8y": [{"0_Comment Submission": "New connect has no idea how much to put in a bag!", "1_Text": "Gotchu", "2_Subreddit": "opiates"}]}], "1_submissions": [{"7vklwr": [{"0_Title": "As the stamp says, there isn’t better stamps around in the last few days!!! And the quality changes with each bag which blows...", "1_Text": "Suck it!", "2_Subreddit": "opiates"}], "7von2r": [{"0_Title": "Nothing drives better then a BMW! Last 2-3 days I’ve gone to cop and it wasn’t out. Finally out first thing in the morning while omw to work. Can’t ask for a better morning, and has anyone ever had this stamp and/or which ones do you like the best/miss the most?!?! Have a good day everyone!!!", "1_Text": "Suck it!", "2_Subreddit": "opiates"}], "7wvf53": [{"0_Title": "What heroin addicts are capable of?!?!? (WTF!)", "1_Text": "Suck it!", "2_Subreddit": "opiates"}], "7wvhn5": [{"0_Title": "To all Drug users... Who else here doses while on here? For instance I put my dump my dope onto my phone/iPad, make my lines and snort them all while on the toilet usually, commenting, posting, messaging, scrolling on here... I do it all the time... Usually on toilet since only privacy at my house😎", "1_Text": "Suck it!", "2_Subreddit": "opiates"}], "7x98t0": [{"0_Title": "First dose of the day! How/where do you normally do it?", "1_Text": "Suck it!", "2_Subreddit": "opiates"}]}]}]}