{"AGirlHasNoThrowaway": [{"0_comments": [{"dwhwxz1": [{"0_Comment Submission": "Guest Dosing...", "1_Text": "You’re right about the amount of time it takes during emergencies. In December I got stuck in Colorado for three extra days, due to flight cancellations. One of the nurses at my clinic set up guest dosing for me for the next day, even though the next day was a Saturday. She just had the doctor sign off on it as soon as he came in. She is a wonderful nurse though, not everyone would put in that much time to help a patient, or even give a shit whether or not you get dosed. \n\nPoint number two you made is beneficial. Always call the clinic you’re dosing at and make sure that they have everything they need. I have seen SO many people come to guest dose and get turned away because the paperwork was not done correctly.", "2_Subreddit": "Methadone"}], "dwhx6o3": [{"0_Comment Submission": "Guest Dosing...", "1_Text": "Absolutely, 100% agree. I have gotten up to 14 days of travel take homes four times in the last 1.25 years, and it was always, always easier and quicker than requesting guest dosing. You do have to be in compliance and have been in compliance for a while for this to be an option though.", "2_Subreddit": "Methadone"}], "dwlkgyv": [{"0_Comment Submission": "The cravings are so bad during WD and I can’t get any dope or subs for a few days... I’m basically begging for advice", "1_Text": "They won’t and they can’t. You need special training / certification to prescribe buprenorphine. You would have to go to a methadone / suboxone clinic, which it sounds like you already are.", "2_Subreddit": "opiates"}], "dwlkqjs": [{"0_Comment Submission": "We need to break through OP's!!!!", "1_Text": "Yeah I used to grind them down as finely as possible, put them in a spoon, and set them on top of the coils on my electric stovetop on very low heat. Eventually it started to turn a golden brown color and you could slowly, slowly add water, let it cook , add water, and when it’s a brown color suck it up into the rig. It worked, but I always felt like it was a waste. Doing this to a 50 mg might only yield 35-40 mgs of actual oxy. This was back in 2010.", "2_Subreddit": "opiates"}], "dwllmqw": [{"0_Comment Submission": "Used subs for the first time recreationally, need advice please...", "1_Text": "It sounds like there are a couple of things going on here. First of all, having taken as much as you did, the buprenorphine may still be bound to your receptor sites. I wouldn’t expect it to stay there too much longer since you didn’t use it long term, but it is definitely possible for it to take another couple of days to completely clear out. Second of all, buprenorphine is a very strong drug and may have therefore temporarily increased your tolerance to opioids. I do not believe that cross tolerance develops between bupe and oxy, but I’m also not 100% sure. Either way after using buprenorphine recreationally, as strong as it is, it does make sense that a few days later you wouldn’t feel much from the oxy. If you wait a few more days, things will likely go back to normal. \n\nAlso, by parachuting did you mean that you basically swallowed the suboxone? Because that doesn’t work at all. Buprenorphine is not orally bioavailable. Or did you mean that you put it up your butt? \n\nThis is all pretty basic bupe knowledge and should have been available to you on any bupe forum.", "2_Subreddit": "opiates"}], "dwlvtkb": [{"0_Comment Submission": "We need to break through OP's!!!!", "1_Text": "It was definitely around in 2010, I remember the house I was in when I was doing this and I lived there before I turned 21, so mid to late 2010 or early 2011 at the latest. \n\nEdit: just googled. An article printed on May 16th 2011 said that by the end of 2010 most if not all pharmacies were dispensing OPs. They were approved and released in August 2010.", "2_Subreddit": "opiates"}], "dwmr6a2": [{"0_Comment Submission": "Used subs for the first time recreationally, need advice please...", "1_Text": "Tell me about it. I don’t have my degree yet but I’m a pharmacy student and everything that was said was just....no. That’s not how any of this works. \n\n1. There is no evidence that short term recreational use of buprenorphine alters the receptor sites once the drug has fully cleared your system. Think about the implications of that, were it true. Would it be wise to release a drug to the public that can permanently alter ones brain chemistry in a few days? Especially one with abuse potential? \n\n2. Neither buprenorphine nor naloxone are really orally bioavailable, meaning that swallowing it would not affect you much at all. Naloxone is actually less orally bioavailable than buprenorphine is. \n\n3. Swallowing naloxone will not affect you at all, let alone coat your stomach. Your body will process it out without any pharmaceutical effects, and it will not alter your ability to “break down” oxycodone in the future.", "2_Subreddit": "opiates"}], "dwmsq61": [{"0_Comment Submission": "Used subs for the first time recreationally, need advice please...", "1_Text": "Hmm, I have never heard parachuting used in that sense before, but slang terms definitely vary from place to place. I have heard it used in the context of crushing pills, wrapping them in tp (hence, parachute) , and swallowing. I have also heard it in the context of shoving stuff up your popper :-). \n\nIf you do ever decide to do subs in the future, the best way to do it is to let them dissolve UNDER your tongue (sublingually) instead of on top. Certain drugs are absorbed more readily through the tissue under your tongue, and bupe is one of them. Letting it dissolve on top of your tongue may mean swallowing more of the drug than you absorb. And yes it tastes awful. I have always said suboxone tastes like tangerines that have rotted in the asshole of Satan. \n\nI don’t personally believe that you need to do a full induction in order to experience the recreational effects of buprenorphine, but I do think that it is a unique drug that can be easily misunderstood. Unlike other opioids, less can be more with buprenorphine. When you take lower doses, you may actually experience more euphoria due to the production, absorption, an concentration of norbuprenorphine by your body. It also has a ceiling effect. There are only so many opioid receptors available in your brain. And buprenorphine has an extremely high binding affinity, meaning that it really sticks to those receptors. Once they are full, any additional buprenorphine will not bind. That is why buprenorphine is not considered a drug that leads to overdose, and why people may be telling you that taking 32 mgs was wasteful. \n\nI think waiting another few days or until next week to take any more oxy is wise. I also think that you need to take some of the comments people leave you with a grain of salt, because I have seen a lot of misinformation spread. Taking the amount of bupe that you did will not permanently alter your brain chemistry, like someone else said. There is no evidence of that , that I have ever seen. Swallowing naloxone also won’t alter your ability to absorb oxycodone in the future. It is actually even less orally bioavailable than buprenorphine. Hope this helps!", "2_Subreddit": "opiates"}], "dwmsw6w": [{"0_Comment Submission": "We need to break through OP's!!!!", "1_Text": "Oh yeah, I’m sure it took some pharmacies longer than others to make the switch. That would account for the OCs still being somewhat readily available up until 2012.", "2_Subreddit": "opiates"}], "dwmwsmz": [{"0_Comment Submission": "Mmmmm 😈💦", "1_Text": "Tie the ballon first while it’s still whole then cut the top off.", "2_Subreddit": "opiates"}], "dwmww19": [{"0_Comment Submission": "Any of y’all ever heard of this gift card instead of money thing....?", "1_Text": "Sounds like a scam. They’re gonna ask you for the code on the back of the gift card and steal the money.", "2_Subreddit": "opiates"}], "dwmxsnt": [{"0_Comment Submission": "Mmmmm 😈💦", "1_Text": "I think it’s a safety measure in case they end up having to swallow them.", "2_Subreddit": "opiates"}], "dwn5yql": [{"0_Comment Submission": "Missed a shot about 4 days ago the pain has gone away but it doesnt look much better should i go to the ER or is the pain going away a good sign?", "1_Text": "Do you have insurance? If not urgent care may be cheaper.", "2_Subreddit": "opiates"}], "dwn7408": [{"0_Comment Submission": "Opiophile", "1_Text": "Yep, I used to spend a lot of time lurking there. Then one day it was gone.", "2_Subreddit": "opiates"}], "dwn7gm6": [{"0_Comment Submission": "Do you have to piss dirty for opiates to get a sub script?", "1_Text": "I think it depends. When I got back on subutex in March of last year I neither pissed dirty nor provided any medical records that I had been on it in the past. I simply told them about my 5 year IV heroin habit, my three years on methadone, and told them I had been taking street subs. \n\nIt’s reasonable to not test positive if you’re in withdrawal. Just tell them you’re in WD and it’s been 5 days since your last use. They will probably use the clinical opioid withdrawal scale to gauge your withdrawals.", "2_Subreddit": "opiates"}], "dwn7mt5": [{"0_Comment Submission": "What's your favorite movie about heroin?", "1_Text": "Love that movie. One of my favorites. Still did heroin though.", "2_Subreddit": "opiates"}], "dwn8ubc": [{"0_Comment Submission": "Opiate induced Bad Moods", "1_Text": "I was on methadone for three years before this, never had any problem with it but I couldn’t do the clinic again. I’m thinking tapering might be my best bet. I just recently had a baby too, so I’m not sure if the changes in hormones that come with that could be affecting my mood as well. I don’t usually have any anger issues at all, it has just been lately after taking the subutex and years ago after using heroin. \n\nEdit: last I used was almost five years ago, I’ve been on opiate replacement therapy ever since. So it might be time to just taper. I haven’t yet honestly because I’ve been afraid of suffering terrible PAWS again. Coming off of methadone was terrible. That’s why I switched to subutex.", "2_Subreddit": "opiates"}], "dwneit5": [{"0_Comment Submission": "Opiate induced Bad Moods", "1_Text": "Do I even want to know what he said? Haha", "2_Subreddit": "opiates"}], "dwneq43": [{"0_Comment Submission": "Opiate induced Bad Moods", "1_Text": "Hmmm...", "2_Subreddit": "opiates"}], "dwo8bm7": [{"0_Comment Submission": "Opiate induced Bad Moods", "1_Text": "Haha, but then got scared and deleted it? \nETA, some people will find any excuse to write uncalled for comments it seems, even when you’re just trying to ask a real question.", "2_Subreddit": "opiates"}], "dwo8f79": [{"0_Comment Submission": "Opiate induced Bad Moods", "1_Text": "Yeah it doesn’t work that way for me either! And I know it’s from the drugs, because it always used to happen about 30 minutes after using and I would stay that way until the high faded. And the more dope I did, the worse it was. It sucks when you want to be happy, but you’re in a bad mood! I literally have nothing to be unhappy about.", "2_Subreddit": "opiates"}], "dwrv78y": [{"0_Comment Submission": "Reasons why the problem is getting worse", "1_Text": "Great read, thanks for posting! I feel like the stereotypes behind methadone and suboxone/zubsolv/subutex treatment are hindering recovery. AA and NA preach that sobriety and ORT are mutually exclusive, which is a harmful mentality. We are clean, we are sober, we are moving on with our lives.", "2_Subreddit": "Methadone"}], "dwrvc6u": [{"0_Comment Submission": "Posted awhile back from here. Still laughing.... lol", "1_Text": "The Hannah’s are the worst. I have had this happen multiple times. After a while she will say “girl, we have looked everywhere. It must have flown out the window or something. I’ll help you look more, but it’s just not here. I gotta use the bathroom”", "2_Subreddit": "opiates"}], "dwtmr1o": [{"0_Comment Submission": "And they say they are hard to get .. 🧐", "1_Text": "I’m a pharmacy student. The degree I’m working towards and most other pharmacists have is an 8 year doctorate (pharmD). I don’t know anybody who would be willing to risk their license for this. Plus, there are so many checks and balances in place at the pharmacies. I could see this maybe happening at a Mom and pop place or possibly a hospital, but definitely not most retail pharmacies. And you would be surprised how many people count their pills. I would say it is the vast majority. During my internship, we had several people come back to say we shorted them a pill or two. It was believable if it was an antibiotic or any other non controlled prescription. You’re right that if it’s a controlled substance script they may not be believed. Where I worked, three separate people counted out the controlled prescriptions. It is hard to believe that three people would get it wrong. \n\nThere are cameras everywhere though, and many regulations as to how much of what can be ordered when and at one time. The DEA is on top of it. It’s not impossible though, it has happened.", "2_Subreddit": "opiates"}], "dwvhilm": [{"0_Comment Submission": "And they say they are hard to get .. 🧐", "1_Text": "Because I’ve been interested in pharmacology / pharmacy for a long time. I am fascinated by the effect different chemicals have on our brains. The money helps too, there are some great paying pharmacy jobs out there. I’d like to work in a compounding pharmacy or hospital as opposed to retail. I did an internship at a big chain retail pharmacy and it was a nightmare dealing with all of those customers. I never knew how badly people tend to treat their pharmacists. \n\nUnfortunately the pharmacy school in my area  requires a very minimum of 3 years undergraduate study before you can even apply, and it’s a 4 year program after your graduate. \n\nWhy did you want to do it?", "2_Subreddit": "opiates"}]}], "1_submissions": [{"84qjz7": [{"0_Title": "How does your clinic monitor for alcohol?// charging extra for take homes", "1_Text": "You’re right about the amount of time it takes during emergencies. In December I got stuck in Colorado for three extra days, due to flight cancellations. One of the nurses at my clinic set up guest dosing for me for the next day, even though the next day was a Saturday. She just had the doctor sign off on it as soon as he came in. She is a wonderful nurse though, not everyone would put in that much time to help a patient, or even give a shit whether or not you get dosed. \n\nPoint number two you made is beneficial. Always call the clinic you’re dosing at and make sure that they have everything they need. I have seen SO many people come to guest dose and get turned away because the paperwork was not done correctly.", "2_Subreddit": "Methadone"}], "85er2s": [{"0_Title": "Question for someone who knows more than me (about snorting subutex pills)", "1_Text": "You’re right about the amount of time it takes during emergencies. In December I got stuck in Colorado for three extra days, due to flight cancellations. One of the nurses at my clinic set up guest dosing for me for the next day, even though the next day was a Saturday. She just had the doctor sign off on it as soon as he came in. She is a wonderful nurse though, not everyone would put in that much time to help a patient, or even give a shit whether or not you get dosed. \n\nPoint number two you made is beneficial. Always call the clinic you’re dosing at and make sure that they have everything they need. I have seen SO many people come to guest dose and get turned away because the paperwork was not done correctly.", "2_Subreddit": "opiates"}], "88tq70": [{"0_Title": "Opiate induced Bad Moods", "1_Text": "You’re right about the amount of time it takes during emergencies. In December I got stuck in Colorado for three extra days, due to flight cancellations. One of the nurses at my clinic set up guest dosing for me for the next day, even though the next day was a Saturday. She just had the doctor sign off on it as soon as he came in. She is a wonderful nurse though, not everyone would put in that much time to help a patient, or even give a shit whether or not you get dosed. \n\nPoint number two you made is beneficial. Always call the clinic you’re dosing at and make sure that they have everything they need. I have seen SO many people come to guest dose and get turned away because the paperwork was not done correctly.", "2_Subreddit": "opiates"}]}]}]}