{"magyarszereto": [{"0_comments": [{"dvdj4zx": [{"0_Comment Submission": "This hotel mini-fridge automatically charges you for lifting an item out of place. This is only indicated on the small warning label.", "1_Text": "Use a straw to defeat the system!", "2_Subreddit": "assholedesign"}], "dve8czv": [{"0_Comment Submission": "What BIG THING is on the verge of happening?", "1_Text": "Here under these truck's wheels you'd be hard pressed.", "2_Subreddit": "AskReddit"}], "dvfminn": [{"0_Comment Submission": "What BIG THING is on the verge of happening?", "1_Text": "We could just eat meth and save money.", "2_Subreddit": "AskReddit"}], "dvfw0pw": [{"0_Comment Submission": "What moment created the divide between your “B.C.” and “A.D.” parts in your life?", "1_Text": "Probably acquiring a liking to heroin, or getting back on it after spending almost two years in a juvenile delinquent center. I had to move country to get away, and I've been without it for four months, but damn, what I wouldn't do for a g of powder...", "2_Subreddit": "AskReddit"}], "dvhz2ts": [{"0_Comment Submission": "Vice President Joe Biden was spotted in DC taking his granddaughter to the movies. Someone took this photo of him stopping to speak with a homeless man outside of the movie theater on his way out.", "1_Text": "Shut up, Withnail, of course he's the fucking farmer!", "2_Subreddit": "pics"}], "dvkxqnz": [{"0_Comment Submission": "Tinder", "1_Text": "Isis ones are like triple A blockbusters. Whatever happened to honest, grainy beheading videos?", "2_Subreddit": "cringepics"}], "dvmnxya": [{"0_Comment Submission": "Sooo.. One of my backup dealers tried to kill me today.", "1_Text": "I used to live in Spain, and I've been sold dirt twice and brown sugar once. The dirt was sold to me by a guy who had been selling really good stuff to me for about a year, and who even used to chuck an extra baggie my way every once in a while.\n\nWhen I read your post I felt a terrible sensation in the pit of my stomach, just like when I opened those half g bags, my foils prepared with great ecxpectation, and saw fucking dirt with pebbles. A few months later he called me to say sorry, and proceded to speak to me for about an hour about his economical problems, etc. People had been saying that he'd begun ripping people off since he started using too much. I gave him a chance cause he had been a good dealer before that incident. More dirt.\n\nI can understand if you get ripped off while cold-copping, I always expect the worst, but this? That's the worst kind of betrayal.\n\nAnd now I live in a faraway icy place where you can only get super expensive buprenorphine and even then I know no one.\n\nSorry for the rant.", "2_Subreddit": "opiates"}], "dvmx68w": [{"0_Comment Submission": "Yummy Turkish #3", "1_Text": "Are these services reliable and do you know if they ship to Europe? Would it be against the rules for me to ask for the name of the vendor? I assume it's someone on darknet.\n\nSorry if the questions annoy you, I'm just thinking that this might be better than flying all the way back home...", "2_Subreddit": "opiates"}], "dvn8d80": [{"0_Comment Submission": "Has anyone heard of this H preparation?", "1_Text": "Thanks mate, funnily enough I saw your answer to my question while looking at your profile (I saw a recent post on some turkish #3 that made my mouth water, saw your submission and checked to see if you had written anything else on darknet products).\n\nI'm stuck in the arse end of the world, and I've half a mind to try and return to Spain for a while and go on a binge, but seeing your post on that turkish and afghan stuff for less than £50 has allowed me to dream again, so thanks for indirectly giving me hope, I guess!\n\nIf you don't mind me asking, do you know if darknet deliveries are reasonably safe?", "2_Subreddit": "opiates"}], "dvndqkz": [{"0_Comment Submission": "Sooo.. One of my backup dealers tried to kill me today.", "1_Text": "I was in Helsinki for an appointment not long ago, but I didn't even know where to start. In Spain I'd just head over to the marginalised gypsy slums (no prejudice, it's just how it works there) and cop, but here I don't know the areas, but I do know that asking random junkies is a good way to get swindled.\n\nSo no, no reindeerspotting for me, just a beer from time to time and some crappy finnish weed.\n\nBut hey, at least their language is fun to learn!", "2_Subreddit": "opiates"}], "dvne6sw": [{"0_Comment Submission": "Sooo.. One of my backup dealers tried to kill me today.", "1_Text": "Yeah, I'm skewing towards DNMs, but I still know so little that it seems really sketchy, especially in this country.\n\nAnd the betrayal... I would eventually be able get over my best friend stabbing me in the gut, my parents kicking me around as a baby, the government trying to fuck me over, even getting stopped and robbed of my gear by the police, but when you expectantly open a half g baggie, and it's fucking dirt... I wanted to die, but eventually just found a new connect.", "2_Subreddit": "opiates"}], "dvneyaz": [{"0_Comment Submission": "Has anyone heard of this H preparation?", "1_Text": "That sounds quite bad, honestly.\n\nI'm glad fentanyl still doesn't seem to have reached Spain, because it makes me feel quite sketchy. I also don't like the sound of h/diphenhydramine. Do you know if fent laced heroin is safer when smoked?", "2_Subreddit": "opiates"}], "dvng94j": [{"0_Comment Submission": "Has anyone heard of this H preparation?", "1_Text": "Thanks! For starters, do you think they would ship to Finland? How long do deliveries usually take? I don't think I can ask much more without breaking the rules. Hmmmm.\n\nI'm seeing I'm going to have to get a cheap laptop or something, because I don't know if it's safe/possible to do all the bitcoin/dnm shenanigans on a phone.", "2_Subreddit": "opiates"}], "dvnm7vz": [{"0_Comment Submission": "Has anyone heard of this H preparation?", "1_Text": "Fuck, that's dodgy! Thanks for the info, and stay safe!!", "2_Subreddit": "opiates"}], "dvomdw4": [{"0_Comment Submission": "What do the US, Somalia, Swiss, and Turkey have in common? Anthem of the world by subject. [1280 × 737]", "1_Text": "I think it has to do more with the fact that our old anthem used to be a bit too jingoistic and fascist-sounding, which is the last thing spain needs.\n\nAnd we actually do have a [real anthem](https://m.youtube.com/watch?v=vFYgsaf-xYc), with lyrics.", "2_Subreddit": "MapPorn"}], "dvoml28": [{"0_Comment Submission": "What do the US, Somalia, Swiss, and Turkey have in common? Anthem of the world by subject. [1280 × 737]", "1_Text": "Que pena haberme perdido el espectaculo. Gora Euskal Herria askatuta!", "2_Subreddit": "MapPorn"}], "dvrpfig": [{"0_Comment Submission": "We are chemical weapons attack survivors. Now, we are trying to hold corporations accountable for their role in the attack. Ask us anything.", "1_Text": "Yep, you got rid of Saddam in a really efficient and helpful way, just look at the happy democratic utopia that is Iraq after all the help given by the US. Maybe if you just keep dropping high-ordnance democracy and shooting Intercontinental Ballistic Freedoms at Iraq and Syria (including attacks against one of the few factions efficiently fighting ISIS), things will get much better.", "2_Subreddit": "IAmA"}], "dvrsnxd": [{"0_Comment Submission": "LPT: If you want to learn a new language, figure out the 100 most frequently used words and start with them. Those words make up about 50% of everyday speech, and should be a very solid basis.", "1_Text": "Missä olen nyt? Miksi jouduin tähän? Tarvitsen apua, luulen olevani muussa ulottuvuudessa. Oletteko te kaikki bottia?", "2_Subreddit": "LifeProTips"}], "dvy30hq": [{"0_Comment Submission": "She's literally hurting her own children", "1_Text": "Esto es muy, muy bad, no podemos permitir que this problem se quede sin solución, porque if not vamos a tener muchos, muchos problemas.\n\nEl primer paso es pedirle perdón a tu grandmother, que has done many good cosas por ti, Jimmy. Secondly, you debes decirme what exactly has hecho con tu examen. You don't want que me enfade, no?", "2_Subreddit": "insanepeoplefacebook"}], "dwcxnd5": [{"0_Comment Submission": "Chasing the dragon Technique", "1_Text": "Okay so I've only done this with #3, but generally we made two ridges in the foil along the length of it so you have a central \"valley\" running down the length of foil, between those two ridges, as wide as a finger or a bit more, depending on the amount.\n\nThen place powder spread out along the top part of the \"valley\", and carefully liquefy it with heat and smoke using each hit to take the blob of gear from one end of the sheet to the other. You've just got to try not to burn it, but sometimes it's hard if it's shit stuff.\n\nThis method mainly is what I have learned and experienced in Spain. It is very effective for our local smokable preparation of heroin base and base cocaine, as its trail runs quite clear. For stuff like tar I suppose the method changes, in pictures it seems to burn a lot and leave a wide trail. I have seen media and read of people just smoking in any direction on the foil.\n\nI suppose I recommend this method if you know your gear is not cut to shit, as in this way you can always pick up any h you left behind on the foil and join it back to the main droplet of stuff everytime you run it past.\n\nBut yeah, I think in any case the direction doesn't really matter, if you're smoking in good conditions.\n\nEnjoy, the best way to find your own personal form of beetle chasing is practising a lot, when you find your innate talent it is a gift to the soul. Or at least fucking rewarding.", "2_Subreddit": "opiates"}], "dwmcv7l": [{"0_Comment Submission": "Mmmmm 😈💦", "1_Text": "We are all G's on this blessed day.", "2_Subreddit": "opiates"}], "dwmdgbm": [{"0_Comment Submission": "$180 for a gram is fuckin killing me.", "1_Text": "Well they're right next to Afghanistan, just one border to cross. It's frustrating cause I've been spending some time in Finland and from what I hear it's +/- 200€ a g in here, but apparently it's quite rare and people use recreational buprenorphine which doesn't sound too fun to me.\n\nAdd that to the fact I've been waiting for a very important letter (first time in the onion patch) for about a week... shit, I can't wait for monday, but I'll probably just be stuck to the window all morning for nothing. I hate countries without a decent opiate scene, and I miss home country, that place of relative cheapness, purity and availability...", "2_Subreddit": "opiates"}], "dwo28l2": [{"0_Comment Submission": "$180 for a gram is fuckin killing me.", "1_Text": "Haha, well spotted, but I'm actually Spanish, I just love Hungarian as a language, it is very interesting.\n\nI don't know how it is in the land of the Magyars, but in the south of Spain it's between 80-100€ for a g, usually 80, and as far as I have tried it's quite good, as it's one of the gateways into western Europe so we have very nice #3 but no #4, although I don't mind because smoking it is nice and from what I used to see at energy control, it's relatively pure, plus I don't hear anything about fent in Spain.\n\nP.S. fuck easter, now I have to wait yet another day for the bloody mail, and even then I'm not sure. If this goes on soon I will start chasing some cocoa powder and telling myself it's smack (/endminirant).", "2_Subreddit": "opiates"}], "dwq0fa8": [{"0_Comment Submission": "Mmmmm 😈💦", "1_Text": "Oh, don't worry, there aren't any christian undertones in my comment, I'm about as godless as they come.", "2_Subreddit": "opiates"}], "dwq0m9q": [{"0_Comment Submission": "$180 for a gram is fuckin killing me.", "1_Text": "Well I greatly enjoy studying languages and their mechanisms, especially syntax, and I had studied Hungarian for a few months, but now I can't speak much cause I moved to Finland and therefore mostly use Finnish. I guess my name should be Suomen Rakastaja now.\n\nAlso, cool name, just noticed it. I used to be a shaman to the White Fairy too, I remember a long cosmic summer of living outside the gates of reality. Damn I miss dxm.", "2_Subreddit": "opiates"}]}], "1_submissions": [{"525vcl": [{"0_Title": "Heroin is amazing.", "1_Text": "Use a straw to defeat the system!", "2_Subreddit": "Drugs"}], "561fi9": [{"0_Title": "New to veganism, i have a Question", "1_Text": "Use a straw to defeat the system!", "2_Subreddit": "vegan"}], "58nlwi": [{"0_Title": "I think heroin is overrated, quite pleasant, and not as bad as most people believe.", "1_Text": "Use a straw to defeat the system!", "2_Subreddit": "unpopularopinion"}], "59qax9": [{"0_Title": "ASA - Nää sanat ei tehny tätä laulua (These words didn't make this song) [Hip Hop]", "1_Text": "Use a straw to defeat the system!", "2_Subreddit": "Music"}], "59ygvk": [{"0_Title": "TIFU by ending up in the hospital because of a bad exam.", "1_Text": "Use a straw to defeat the system!", "2_Subreddit": "tifu"}], "5lcajs": [{"0_Title": "Preparation of New Year's Fireworks in Iraq", "1_Text": "Use a straw to defeat the system!", "2_Subreddit": "ImGoingToHellForThis"}], "5pz3sn": [{"0_Title": "[Long] Deathly taste from hash pipe", "1_Text": "Use a straw to defeat the system!", "2_Subreddit": "Drugs"}], "5pzept": [{"0_Title": "Deathly taste from hash pipe", "1_Text": "Use a straw to defeat the system!", "2_Subreddit": "Drugs"}], "6qj8fh": [{"0_Title": "Me_ira", "1_Text": "Use a straw to defeat the system!", "2_Subreddit": "me_ira"}], "6ry6fc": [{"0_Title": "Unsatisfactory heroin hits when smoking.", "1_Text": "Use a straw to defeat the system!", "2_Subreddit": "opiates"}], "6uhi2j": [{"0_Title": "me_ira", "1_Text": "Use a straw to defeat the system!", "2_Subreddit": "me_ira"}], "7r5uv7": [{"0_Title": "An open question to the community.", "1_Text": "Use a straw to defeat the system!", "2_Subreddit": "poop"}], "844vxv": [{"0_Title": "Has anyone heard of this H preparation?", "1_Text": "Use a straw to defeat the system!", "2_Subreddit": "opiates"}]}]}]}