{"Captain_Oreos": [{"0_comments": [{"dv9db0l": [{"0_Comment Submission": "If you were rich, what extremely petty thing would you do just to piss off people?", "1_Text": "Were you a messy child? Your username makes me think so.", "2_Subreddit": "AskReddit"}], "dv9efro": [{"0_Comment Submission": "Guys, what social expectations of men do you wish did not exist?", "1_Text": "Fuck, as someone with ADHD I wish I could say I had nothing on my mind. Instead I always have to say some dumb shit like, \"I was thinking about how you could automate shopping carts in parking lots so you don't have to take them to the cart return.\"", "2_Subreddit": "AskReddit"}], "dviqjhq": [{"0_Comment Submission": "Jackass bros", "1_Text": "It's fairly well regulated, and they put some type of bitterant in the nitrous oxide they sell for automotive uses.", "2_Subreddit": "HumansBeingBros"}], "dvjzhik": [{"0_Comment Submission": "Story of my first shot, for those interested (took out specific locations)", "1_Text": "You're obviously a good writer. This piece might be especially good though because it's about an event important event that happened in your life. You did a great job of establishing place and setting without overtly stating details. To me that is what made your story stand out from others.", "2_Subreddit": "opiates"}], "dvk1dxy": [{"0_Comment Submission": "Will Kratom get me high?", "1_Text": "No it's definitely not all like that. I would try to get some Ultra kratom or whatever they call the more refined stuff. You can take a smaller dose and it's much more bearable.", "2_Subreddit": "opiates"}], "dvk291r": [{"0_Comment Submission": "HiRoller26’s Pharmacy", "1_Text": "Do you know if those Apo 80's are snortable? I know they're supposed to be the same formulation as the original of 80's, but are they?", "2_Subreddit": "opiates"}], "dvk4o78": [{"0_Comment Submission": "Story of my first shot, for those interested (took out specific locations)", "1_Text": "I'm glad to hear that you're going to write a book, this small piece of writing painted as vivid a picture as any book in my head. If your book can convey that picture as well as this short story I would love to read it, and I think others would too.", "2_Subreddit": "opiates"}], "dvk60hx": [{"0_Comment Submission": "60-year-old American bowling machine", "1_Text": "This guy is fucking with you, the newest iterations are the GSX on Brunswick's side and I don't know if AMF has anything similar. The passenger in the gif is an AMF 8270, At the time Brunswick would have been making their A2 pinsetter. Many bowling alleys today still use these old machines because they are fully mechanical and if cared for never break.", "2_Subreddit": "mechanical_gifs"}], "dvkex72": [{"0_Comment Submission": "Will Kratom get me high?", "1_Text": "I saw a guy recommend Herbal RVA or Mystic Islands as good online sources a few days ago. Good luck, hopefully it helps you out.", "2_Subreddit": "opiates"}], "dvlg1ki": [{"0_Comment Submission": "Med school student started my day off right", "1_Text": "All keyboards should have an led on the caps like key, just like laptops.", "2_Subreddit": "Justrolledintotheshop"}], "dvv40dq": [{"0_Comment Submission": "Forced mandatory 1 week off work and drug test. [advice]", "1_Text": "They might just want to see if your new drugs show up and not know about your addiction.", "2_Subreddit": "opiates"}], "dvv6k11": [{"0_Comment Submission": "Forced mandatory 1 week off work and drug test. [advice]", "1_Text": "Yeah, sorry you have to go through that. Whatever you choose to do it'll be rough.", "2_Subreddit": "opiates"}], "dvvz97g": [{"0_Comment Submission": "Point-Of-View Shot of American Soldiers Getting Ambushed By Islamic State Soldiers In Mali", "1_Text": "Thanks for mirroring that.", "2_Subreddit": "watchpeopledie"}], "dvxi442": [{"0_Comment Submission": "This took a lot of effort", "1_Text": "Now I'm lazy and schizophrenic. Fuck", "2_Subreddit": "AdviceAnimals"}], "dvxlhvu": [{"0_Comment Submission": "Pure Vietnamese #4 and China White Came Today !", "1_Text": "Personally I'd say skip the VPN and just use tails.", "2_Subreddit": "opiates"}], "dvz4r9a": [{"0_Comment Submission": "What was your first \"I'm an adult now.\" purchase?", "1_Text": "Can I ask what you decided to get as a cocaine mirror? I personally prefer to use the back of any golden Samsung device.", "2_Subreddit": "AskReddit"}], "dw11szc": [{"0_Comment Submission": "Almost got busted today", "1_Text": "Sounds like soda ought to hook you up.", "2_Subreddit": "opiates"}], "dw8kpyp": [{"0_Comment Submission": "Finally broke down one of those Fake M's", "1_Text": "That is not a good idea. Each pill likely has a consistent amount of fent, if it has any, but there might be a spot that holds all of it. If you mix all the pills together it is way more likely that you'll get a hot-spot with the potential to be lethal. If you want to mix the powder from one pill around go ahead but don't fuck with mixing all of them. I would also wipe the table after snorting each pill but I might be paranoid.", "2_Subreddit": "opiates"}], "dwgo191": [{"0_Comment Submission": "Has anyone bought from sites like theses? Seems too good to be true...", "1_Text": "No, dnm prices are usually a little higher than street prices. With the new rule changes on reddit please don't discuss them here any further, we don't want this sub to get banned. If you search for alts to r/dnm online they aren't hard to find though.", "2_Subreddit": "opiates"}], "dwklpbp": [{"0_Comment Submission": "What's your top 3 subs after OP's?", "1_Text": "Yeah, they're fucking huge.", "2_Subreddit": "opiates"}], "dwm3vj2": [{"0_Comment Submission": "Paediatricians, what’s the strangest behaviour you’ve seen in a kid?", "1_Text": "That's basically the plot of Westworld.", "2_Subreddit": "AskReddit"}], "dwo1kvd": [{"0_Comment Submission": "Hey does anyone out there know exactly how ECP is made?", "1_Text": "That was a really cool read. Thanks", "2_Subreddit": "opiates"}], "dwow00r": [{"0_Comment Submission": "Steam no longer shows you as in game to others if you are playing an unreleased game!", "1_Text": "They obviously don't want people to know they're testing Half Life 3.", "2_Subreddit": "Steam"}], "dwoxe7q": [{"0_Comment Submission": "Tennis", "1_Text": "Why would they not restring the racquets? It would look so much better than adding a blur after.", "2_Subreddit": "pawg"}], "dwoxtlr": [{"0_Comment Submission": "Nerds of reddit, what was the nerdiest moment of your life?", "1_Text": "Generally people only argue that for pistols though.", "2_Subreddit": "AskReddit"}]}], "1_submissions": [{}]}]}