{"713slowsmack": [{"0_comments": [{"du0y3kp": [{"0_Comment Submission": "Just got robbed", "1_Text": "Is get a homeboy to meet up with those guys then come out of the blue and jam a pistol down his throat. Maybe put one in his leg just on the principle. Funky ass dudes.", "2_Subreddit": "opiates"}], "du2megs": [{"0_Comment Submission": "Saw this and was immediately skeptical, what does everyone think. Not opiate related but I don’t fuck with r/stims", "1_Text": "Pics or it didn't happen!!! Lmaooo", "2_Subreddit": "opiates"}], "du689yq": [{"0_Comment Submission": "Worthless", "1_Text": "For a second I thought this was my girl posting this. She felt the same exact way and I was doing the exact same things. But in my case, I hated it... with a passion. I hated it because I truly love her. We've been together over 3 years and I tried and tried to break the chain. I can only speak for myself, but I have always loved her and she's the reason I'm still alive", "2_Subreddit": "opiates"}], "du7jhri": [{"0_Comment Submission": "Worthless", "1_Text": "Exactly.", "2_Subreddit": "opiates"}], "duolnhq": [{"0_Comment Submission": "What's the longest jail/prison stint any of you guys have done during to your DOC", "1_Text": "Did 2 years day for day, stayed out for 6 months went back for another year and got out on parole. First charge was manufacture/delivery of a controlled substance second was just possession of a controlled substance.", "2_Subreddit": "opiates"}], "dv1uidm": [{"0_Comment Submission": "LE on Craigslist", "1_Text": "Same ad down here on my area too.", "2_Subreddit": "opiates"}], "dvfb45k": [{"0_Comment Submission": "Fuck me do people hate drugs", "1_Text": "Please explain that to my opiate receptors. You arrogant fuck.", "2_Subreddit": "Drugs"}], "dvg44uo": [{"0_Comment Submission": "Need some words of wisdom from the experts.", "1_Text": "What I wouldn't give to be in your shoes.", "2_Subreddit": "opiates"}], "dvjl05h": [{"0_Comment Submission": "What would you do differently about your drug use?", "1_Text": "I would have never started IV opiates/heroin. :(", "2_Subreddit": "Drugs"}], "dvjnmok": [{"0_Comment Submission": "What would you do differently about your drug use?", "1_Text": "I'm just over 2 months clean. But I can never take back the pain I've caused to my family and my woman, the insane amount of money I've spent on it over the years,the years I've done in prison and the mental anguish that I've caused myself and still do. \n\nI wish I could take back the pain and get the years I've lost to the system back. Not to mention having 3 felonies in a conservative state sucks. Very difficult to find housing and work.", "2_Subreddit": "Drugs"}], "dvjzwim": [{"0_Comment Submission": "What would you do differently about your drug use?", "1_Text": "I'm so sorry to hear that, man. I've lost close to 2 dozen people, a few I grew up with to it. This fent shit is getting out of hand.  It's truly a gamble with your life. I never want to touch it again. Thanks for the support, brother.", "2_Subreddit": "Drugs"}], "dvl82z8": [{"0_Comment Submission": "Should I forgive her?", "1_Text": "She's making an effort. It's hard to love us, I don't know how my girl is still with me after 3 years of putting up with me.", "2_Subreddit": "opiates"}], "dvmywm3": [{"0_Comment Submission": "Real or fake?", "1_Text": "I said exactly this out loud when I first saw the picture, lol.", "2_Subreddit": "opiates"}], "dvmzu8m": [{"0_Comment Submission": "Lyrica is a helluva drug", "1_Text": "Lyrica would give me terrible random tremors the next morning. I had em so bad one time I ended up dropping and breaking a really nice bong. It sucked", "2_Subreddit": "opiates"}], "dvqani4": [{"0_Comment Submission": "Average prices in your area?", "1_Text": "Third coast 100 for 1g of true fire #4. 50 for 1g of okay tar.", "2_Subreddit": "opiates"}], "dw4r2fo": [{"0_Comment Submission": "DJ screw is perfect music for the opiate high", "1_Text": "Love it. Anything Scarface is my jam. North side born and raised.", "2_Subreddit": "opiates"}], "dw4u66x": [{"0_Comment Submission": "Question on price of heroin", "1_Text": "No no no no fuck no no no. That's asinine.", "2_Subreddit": "opiates"}], "dw4uaw6": [{"0_Comment Submission": "Grabbed some more plus rigs. Why are rigs so hard to get?", "1_Text": "They can be a pain here in Texas. Most Walmarts in the hood will sell them here, though.", "2_Subreddit": "opiates"}], "dwc42pa": [{"0_Comment Submission": "The best tar I have ever had in my life...by far!", "1_Text": "That's why I like where I'm at. Got a bunch of cats from New Orleans so we get that fire ass #4 with no or very very little fent and got the essays with the gunpowder and tar.", "2_Subreddit": "opiates"}], "dwgsmbq": [{"0_Comment Submission": "I bought more heroin...", "1_Text": "Went on a ten year ride with that shit. Stop while you're ahead. If not... Good luck and stay alive.", "2_Subreddit": "Drugs"}], "dwlwv2y": [{"0_Comment Submission": "Epidemic...I feel like our government (US) couldn't of made the epidemic much worse if they tried", "1_Text": "Jesus you're a miserable fuck. You should paint the wall with your brain.", "2_Subreddit": "opiates"}], "dwpz96u": [{"0_Comment Submission": "Intensive Out-patient Program isn't going great...but I guess I have this massive speedball to make me feel better. Happy nods guys <3", "1_Text": "I love speedballs, so much.", "2_Subreddit": "opiates"}], "dwq2dr3": [{"0_Comment Submission": "Intensive Out-patient Program isn't going great...but I guess I have this massive speedball to make me feel better. Happy nods guys <3", "1_Text": "They just compliment each other so well. So much so that you can't hardly distinguish the difference between the two. It feels like a whole different drug.", "2_Subreddit": "opiates"}], "dwqz6s9": [{"0_Comment Submission": "Intensive Out-patient Program isn't going great...but I guess I have this massive speedball to make me feel better. Happy nods guys <3", "1_Text": "Yeah, it's terrible. I agree, I thought heroin was great but then I found the speedball lol", "2_Subreddit": "opiates"}], "dwuayvh": [{"0_Comment Submission": "I know what my problem is-- I want to use heroin forever.", "1_Text": "As someone who has done heroin for going on 10 years now, there was a time early on in my addiction that I felt the same way.\nBut as I progressed, I've developed a hate for it. The insane amount of money I spent on I, the criminal charges I've caught due to it, the 3 years I spent in prison as a result of those charges, the jobs and opportunities I lost and missed out on, the 24 friends that have died due to it, the lying, stealing, stress and pain that I've caused my family and girl (who by the grace of God is still by my side.), The years I'm sure are knocked off my life from the effects of the shit, loosing everything and being homeless multiple times and so much more. I haven't even started on waking up broke and in withdrawal day in and day out plus all the mental and emotional anguish the whole lifestyle brings\n\nThere will come a time you'll change your mind. Right now it's just an easy escape, but soon it won't be so easy. Good luck and be safe, my friend.", "2_Subreddit": "Drugs"}]}], "1_submissions": [{"7w5tuq": [{"0_Title": "The nodz are real.", "1_Text": "Is get a homeboy to meet up with those guys then come out of the blue and jam a pistol down his throat. Maybe put one in his leg just on the principle. Funky ass dudes.", "2_Subreddit": "opiates"}]}]}]}