{"KitticusCatticus": [{"0_comments": [{"dwoa9o7": [{"0_Comment Submission": "If Reddit opened an amusement park", "1_Text": "Universal studios and Busch gardens.", "2_Subreddit": "interestingasfuck"}], "dwphuky": [{"0_Comment Submission": "A fiber-optic image conduit on a page", "1_Text": "I noticed reddits screwed up past 2 days as well. For me, there are hardly any vote numbers showing up and I can only see half the number on the ones that do have anything showing up. Also, have seen a few posts that said it had 1 or 2 comments and there were none.", "2_Subreddit": "interestingasfuck"}], "dwpi504": [{"0_Comment Submission": "Reddit is broken, don't panic!", "1_Text": "Yeah I still see no numbers next to anyone's votes except for every 5th one or so, and it runs off page so even then, can't read the numbers. Also, I notice when I \"X\" out of a tab it won't take me back to the last tab, it'll go all the way back to the front page if that's where I started for example. Very annoying.", "2_Subreddit": "AskReddit"}], "dwpikxc": [{"0_Comment Submission": "General Discussion Thread", "1_Text": "Oh great, something that requires people making circles and having friends.\n\nGuess I'm out.", "2_Subreddit": "CircleofTrust"}], "dwpj7zt": [{"0_Comment Submission": "What's going on with all these subreddits shutting down?", "1_Text": "Glad I'm not the only one that saw that. Oh well. Now reddits all screwed up anyway.", "2_Subreddit": "OutOfTheLoop"}], "dwpjghb": [{"0_Comment Submission": "My chemistry textbook finally getting to the important stuff..", "1_Text": "Right, that totally makes sense and I'd imagine be easier for kids to really absorb the information they're learning. But I just wonder why it was something awful our government did. I mean, everyone should know about ALL the drugs and BS they put soldiers through in the wars. But I just feel it's odd that there's something almost anti-establishment-esque in there. Good for them for spreading the message.", "2_Subreddit": "drugscirclejerk"}], "dwpmepg": [{"0_Comment Submission": "F*ck everythiiiing", "1_Text": "No, it doesn't mean it's done, and you both know that there would need to be some kind of talk at least before an entire family breaks up. If you're worried he might take his chance and start detaching, I would be stern but very friendly with him and say look... I know we've been fighting a lot, and we both need to step back and look at the painting before we put one more brush stroke in. Get a look at the big picture, not who's turn it is to do X thing. And say that we are taking a break from each other to just worry about normal stuff and not each other's happiness, when either I or yourself feels ready to have a chat about the behavior going on, we will live our lives separately for at least a week, maybe more since I'm getting comfortable here at Mom's. (I'm about to do the same in a week actually, but I'm going to my parents house to care for them after dad's surgery next week) but me and my guy have been arguing a lot and I know this break will be good for us. And it should help either way. Honestly it will help no matter what the outcome. Whether you decide to become a stronger team or go your separate ways. Of course we all want it to work out, so try everything you can first. And saving your sanity by avoiding him and his arguments for even a week will do wonders. I hope you two will make it, and I think you will. This is literally the hardest time for a couple. But in the end, it helps you realize if this is \"the one\" or not. Big hugs, sis. You got this. All you need to do for now is love on that new baby.", "2_Subreddit": "breakingmom"}], "dwpmjnk": [{"0_Comment Submission": "My chemistry textbook finally getting to the important stuff..", "1_Text": "Oh no, I totally get that. It definitely helped me in school. I just thought the government had more control over being outted for the messed up things they did in the war. The context is what gets me.", "2_Subreddit": "drugscirclejerk"}], "dwq10wx": [{"0_Comment Submission": "My chemistry textbook finally getting to the important stuff..", "1_Text": "I'm well aware they don't make the exams ding dong, the government clearly likes to keep a good reputation and have been known to take control of something to save their name. Not unheard of.", "2_Subreddit": "drugscirclejerk"}], "dwq14eb": [{"0_Comment Submission": "Saudi crown prince says Israelis, Palestinians both have 'right to have their own land'", "1_Text": "This is confusing. I thought this guy just arrested half of his council back in fall so they didn't arrest him first for crimes he committed... Am I wrong? Or was that story blown out of proportion?", "2_Subreddit": "news"}], "dwq3hy2": [{"0_Comment Submission": "The way the tile installer continued around the corner. A lot of times they don't do this.", "1_Text": "As a contractors wife, even I can tell this isn't all that satisfying. Maybe to the average Joe. But this should be done. Also, it's SUPER hard to cut tile y'all. You want it done right, call me.", "2_Subreddit": "oddlysatisfying"}], "dwq3kuz": [{"0_Comment Submission": "Discipline 101", "1_Text": "I believe more specifically it went, \"You'll get knocked back to next Tuesday.\"", "2_Subreddit": "Unexpected"}], "dwq3r3h": [{"0_Comment Submission": "Waffle House waitress gets $16K scholarship after act of kindness goes viral", "1_Text": "Hey! I did nice things as a waitress and when I worked at waffle house too!! Best tip I've ever gotten was 40$. I had a dream the hulk gave me a hundy. But he told me to fish it out of a pitcher of water...I wasn't displeased.", "2_Subreddit": "videos"}], "dwq4q25": [{"0_Comment Submission": "I run a facebook meme page and this one guy has been commenting on all my posts and responding to himself in 4-5 message threads. Just now they finally got the courage to PM me.", "1_Text": "*facepalm*\n\nDid you forget the post you commented on? Read it again and come back to us, on planet Earth, my friend.", "2_Subreddit": "insanepeoplefacebook"}], "dwqll82": [{"0_Comment Submission": "I run a facebook meme page and this one guy has been commenting on all my posts and responding to himself in 4-5 message threads. Just now they finally got the courage to PM me.", "1_Text": "No one is saying they don't get your joke hunny, they were literally quoting the crazy person from the post to pass jokes at ya. You just missed it I think. The other person was quoting the crazy guy, not talking to you directly per-se. Your joke was funny, people get it. Although honestly I would assume you would be saying that to the crazy guy on the left. Lol", "2_Subreddit": "insanepeoplefacebook"}], "dwqpvww": [{"0_Comment Submission": "I run a facebook meme page and this one guy has been commenting on all my posts and responding to himself in 4-5 message threads. Just now they finally got the courage to PM me.", "1_Text": "Nah man some people just down-vote for the lolz. I get it a lot too for comments that I have no idea why someone would down-vote. Some people go by the \"contribution\" rule, but most just down-vote cause they're miserable. Lol I got it. And I didn't down-vote. It contributed to the humor.", "2_Subreddit": "insanepeoplefacebook"}], "dwror30": [{"0_Comment Submission": "This is Ben. He has a beard. And he is human sized. We get fun looks in traffic.", "1_Text": "That doggo is your doppelganger.\n\nDoppo doggo.", "2_Subreddit": "aww"}], "dwrp11d": [{"0_Comment Submission": "We need more people like Kristen", "1_Text": "MA FWEND! FANK YEW. I RILLY LYK DA COVFEFE SMELL I PROMISS I NO BITE ER BODDER. I ONLY BASK NEAR DA HEATS, ET FEELS GUD ON MUH BEWWY. FANKS.\n\n-MARVIN DA LEEZARD", "2_Subreddit": "WhitePeopleTwitter"}], "dwrp7i4": [{"0_Comment Submission": "We need more people like Kristen", "1_Text": "I worked at PetSmart. I'm certified in pet care (whatever that's worth) and I can tell you from experience, lizards have the LEAST likelihood of having salmonella. It's not like they rub the food with him. \n\nSome people just are no fun and think we don't understand why people COULD be upset. They just don't realize we don't give a shit. Use some sanitizer. It's not common.\n\nEdit:pressed send too early.", "2_Subreddit": "WhitePeopleTwitter"}], "dwsbjow": [{"0_Comment Submission": "OP posts a picture and compliments himself on his own work", "1_Text": "We are all OP on this blessed day.", "2_Subreddit": "quityourbullshit"}], "dwu4426": [{"0_Comment Submission": "Zach Braff shared this faceswap of himself and Dax Shepard on Twitter", "1_Text": "Cloning is real. I'm convinced.", "2_Subreddit": "funny"}], "dwuh0wp": [{"0_Comment Submission": "think of the art!", "1_Text": "You seem like an asshole", "2_Subreddit": "WhitePeopleTwitter"}], "dwuhl9b": [{"0_Comment Submission": "think of the art!", "1_Text": "Obvious troll is obvious.", "2_Subreddit": "WhitePeopleTwitter"}], "dww96rd": [{"0_Comment Submission": "YouTube star Logan Paul kicked out of Yosemite", "1_Text": "I think he's referring to the movie \"drop dead Fred\" I loved that movie too. It's pretty unheard of though so it's not uncommon if you haven't heard of it. Good movie from the 90's.", "2_Subreddit": "news"}], "dwwcs85": [{"0_Comment Submission": "YouTube star Logan Paul kicked out of Yosemite", "1_Text": "Whoops, replied to the wrong person. I have failed you, Reddit. My deepest apologies.", "2_Subreddit": "news"}]}], "1_submissions": [{"7y6wgb": [{"0_Title": "My red-eared escaped her nightly porch walk last night.. This is her:", "1_Text": "Universal studios and Busch gardens.", "2_Subreddit": "Pets"}], "81ehh9": [{"0_Title": "Self-written warrant recall?", "1_Text": "Universal studios and Busch gardens.", "2_Subreddit": "u_KitticusCatticus"}], "82f5kr": [{"0_Title": "Landlord has mental instability. What can i do?", "1_Text": "Universal studios and Busch gardens.", "2_Subreddit": "legaladvice"}], "8369ya": [{"0_Title": "How to do warrant recall?", "1_Text": "Universal studios and Busch gardens.", "2_Subreddit": "u_KitticusCatticus"}], "83nu3j": [{"0_Title": "Financial help, health compromised with dental issues. Will document journey vlog style for helpers.", "1_Text": "Universal studios and Busch gardens.", "2_Subreddit": "Assistance"}], "86nrfd": [{"0_Title": "Update on mental landlord. Mother has \"taken over\"", "1_Text": "Universal studios and Busch gardens.", "2_Subreddit": "legaladvice"}]}]}]}