{"cashewcut": [{"0_comments": [{"dt4jmrg": [{"0_Comment Submission": "Just copped some decent H and decent bud time to enter tamriel (skyrim)", "1_Text": "I miss that weed.. when you get it fresh, the high is awesome.", "2_Subreddit": "opiates"}], "dt8hlhc": [{"0_Comment Submission": "The most disgraceful \"weed\" I've ever seen", "1_Text": "I once got a chicken bone in some dirt weed in Africa.. at least it got me high, referred to the dude as chicken-foot from then onwards.", "2_Subreddit": "Drugs"}], "dtboid9": [{"0_Comment Submission": "The blackout rollercoaster that was my 21st birthday. Aka The Night my body went to a party, and left my brain at the Greyhound station downtown.", "1_Text": "I swear the bots are becoming sentient... I've seen half a dozen similar posters in the past few weeks.", "2_Subreddit": "Drugs"}], "dtc4r9g": [{"0_Comment Submission": "Did I take a Quualude or something similar to it?", "1_Text": "That's a very SA thing to say... it's rare as shit outside of SA, trust me I've spent 20 years in sketchy circles around Europe/US including corrupt pharmacists and never seen it. It is literally everywhere in SA though.. only other country that you can get it easily is India.", "2_Subreddit": "Drugs"}], "dtc52yf": [{"0_Comment Submission": "do you feel less intelligent since using drugs? has your life gone downhill?", "1_Text": "That paragraph about LSD articulates exactly what I've seen over the years! the conspiracy bit made me giggle, those damn chemtrails and cloudy pineal glands due to tap water..", "2_Subreddit": "Drugs"}], "duzqhhd": [{"0_Comment Submission": "So how the fuck did we figure out what drugs are?", "1_Text": "good bot", "2_Subreddit": "Drugs"}], "dw3u7rk": [{"0_Comment Submission": "Surviving The Purge", "1_Text": "fuck all activity and minimum reported posts.. those sourcing reports probably gave them a nice trail", "2_Subreddit": "FFUKMarket"}], "dw9nfy1": [{"0_Comment Submission": "We're building our own platform watch this space.", "1_Text": "cashewcut nut roasted.", "2_Subreddit": "Starsintheireyes"}], "dw9ol3c": [{"0_Comment Submission": "Anyone else have to actually do work now?", "1_Text": "I just stare vacantly thinking of times gone..", "2_Subreddit": "Starsintheireyes"}], "dwp46wp": [{"0_Comment Submission": "Adventure Time in Russia on Fenazepam", "1_Text": "photos!", "2_Subreddit": "Drugs"}], "dwrctzb": [{"0_Comment Submission": "/r/DNMUK got banned :(", "1_Text": "Community is still strong and [reviewing trees at dnstars!](https://dnstars.vip/t/weed-grapestomper/361/25) \n\nSad it had to come to this but we are still kicking...", "2_Subreddit": "uktrees"}], "dws6qxe": [{"0_Comment Submission": "Found in /trashy. While y'all striking out on Whisper this chick letting the drugs find her.", "1_Text": "And this is why you should Google and not rely on Friends episodes for your vocab:\n\nFrom Wikipedia\nmoot point (plural moot points)\n\nAn issue that is subject to, or open for, discussion or debate, to which no satisfactory answer is found; originally, one to be definitively determined by an assembly of the people. \nAn issue regarded as potentially debatable, but no longer practically applicable. Although the idea may still be worth debating and exploring academically, and such discussion may be useful for addressing similar issues in the future, the idea has been rendered irrelevant for the present issue.\n\n\"Until we rebuild downtown, whether we build more parking spaces is a moot point.\"\n\nmute point is also an acceptable usage.", "2_Subreddit": "opiates"}], "dws6v9n": [{"0_Comment Submission": "Adventure Time in Russia on Fenazepam", "1_Text": "Sweet, I've got some photos of a flat I trashed and partially set on fire when I blacked out on Phenazepam that was fake diazepam.. maybe we can trade photos haha", "2_Subreddit": "Drugs"}], "dwtmrfp": [{"0_Comment Submission": "Found in /trashy. While y'all striking out on Whisper this chick letting the drugs find her.", "1_Text": "victory is sweet.", "2_Subreddit": "opiates"}]}], "1_submissions": [{}]}]}