{"gigalongdong": [{"0_comments": [{"dweu5sn": [{"0_Comment Submission": "TIL of the Vandals, a large East Germanic tribe originating from Poland and who, fleeing from the Huns, gradually migrated to Roman territories during the fifth century. They conquered Spain and most of Northern Africa and eventually sacked and looted Rome. The word \"vandalism\" is named after them.", "1_Text": "I've spent entirely too much of my life playing the Total War: Rome, Rome 2, and Barbarian Invasion games. It's glorious.", "2_Subreddit": "todayilearned"}], "dwfcj1j": [{"0_Comment Submission": "What was your \"I shouldn't have said that\" moment when talking to a customer?", "1_Text": "I work construction. But I'm not going sit on Reddit and \"brag\" about how many hours I'm on the job. \n\nLol, benefits. That's hilarious!", "2_Subreddit": "AskReddit"}], "dwfp4f7": [{"0_Comment Submission": "What's the worst Disney movie?", "1_Text": "Well said!", "2_Subreddit": "AskReddit"}], "dwicizu": [{"0_Comment Submission": "Men of Reddit, when was the last time you cried and what were your reasons behind the tears?", "1_Text": "I finally broke down and accepted that I completely ruined me and my fiancee's life because I started using heroin again back in September after 8 months of sobriety. My fiancee also got addicted a month after I started using and our lives slowly fell apart due to our addictions/financial ruin. \n\nMy break down happened on March 2nd of this year. I absolutely lost my mind. So we asked for help from our respective families March 3rd. She went to rehab on the 5th. I detoxed on my own (insurance not covering rehab) and started attending NA meetings again. \n\nWe're 25 days sober today! If you're an addict just know that there is hope. I'm not out of the woods myself, but everything is getting better every single day!", "2_Subreddit": "AskReddit"}], "dwk73ke": [{"0_Comment Submission": "( 21F) I get high and occasionally drunk by myself, is this unhealthy behaviour?", "1_Text": "Take it from me; don't start fucking around with opiates. That shit nearly killed me multiple times. But pot and booze are allllll gooooood maaaannn.", "2_Subreddit": "drunk"}], "dwk7m49": [{"0_Comment Submission": "( 21F) I get high and occasionally drunk by myself, is this unhealthy behaviour?", "1_Text": "That's good! I wish I could enjoy the ganj like I used to, but it makes me super anxious nowadays. Rum and beer two or three times a week and I'm fine and dandy.", "2_Subreddit": "drunk"}], "dwkbi34": [{"0_Comment Submission": "Cheers you beautiful bastards!", "1_Text": "The best cheap(ish) rum out there. $29 a half gallon and 92 proof!", "2_Subreddit": "drunk"}], "dwkbk53": [{"0_Comment Submission": "Cheers you beautiful bastards!", "1_Text": "Yep! I intend on spending my afternoon tomorrow (safely) shooting guns and then get hammered. Cheers!", "2_Subreddit": "drunk"}], "dwkbvgj": [{"0_Comment Submission": "Please don’t take broadband away from poor people, Democrats tell FCC chair", "1_Text": "Fuck Ajit Pai. Corporate bitch boy numero uno. Rot in hell you pathetic excuse of a human being. \n\nI know this doesn't extend much in the way of intelligent conversation. And for that I'm sorry. But I hate that man and I need to vent my frustration.", "2_Subreddit": "technology"}], "dwkcc90": [{"0_Comment Submission": "A landscape architect/redditor did an AMA 6 months ago. I asked for advice on what to do with my backyard. Here is the result!", "1_Text": "Hell of a good job mate! Especially for y'alls first go around with carpentry. For real; the deck looks very nice.", "2_Subreddit": "DIY"}], "dwmwp7w": [{"0_Comment Submission": "What does a $500,000 home look like in your city?", "1_Text": "Triad area of NC represent!", "2_Subreddit": "AskReddit"}], "dwq53bc": [{"0_Comment Submission": "Once homeless friends on Reddit: What is the most helpful (and reasonable) thing a kind stranger could do for you that would help you out?", "1_Text": "Geez I'm reading through these right now and I'm just now realizing how close I was to homelessness. I have a good job and make decent money, but I was spending 80% of my income on heroin. Fuck me, I'm so glad my parents let me back to their house so I could detox and continue to work. Fuck heroin.", "2_Subreddit": "AskReddit"}], "dwq5mhq": [{"0_Comment Submission": "30 days off of heroin", "1_Text": "Thank you very much! I've got some pretty gnarly back pain from playing youth football myself. I just got so tired of being sick every couple days. Again thank you so much!!!", "2_Subreddit": "opiates"}], "dwqa3ck": [{"0_Comment Submission": "30 days off of heroin", "1_Text": "I did something that I don't really recommend: I took cimetidine and a ton of immodium. It took away the worst of the WD's but obviously it made me super constipated. Take a gram of cimetidine (tagamet) an hour before taking 60-80mg of immodium. Immodium is cardiotoxic at high doses so it's not something that should be taken for \"maintenance\"; just long enough to get through the worst of WD's. Good luck!!!", "2_Subreddit": "opiates"}], "dwqexp3": [{"0_Comment Submission": "30 days off of heroin", "1_Text": "Cimetidine is an acid reducer and it  helps immodium cross the blood brain barrier.", "2_Subreddit": "opiates"}], "dwqf0t5": [{"0_Comment Submission": "30 days off of heroin", "1_Text": "They weren't great but still a hell of a lot better than the worst I've experienced.", "2_Subreddit": "opiates"}], "dwr1id0": [{"0_Comment Submission": "30 days off of heroin", "1_Text": "Yeah for real!", "2_Subreddit": "opiates"}], "dwrlu09": [{"0_Comment Submission": "30 days off of heroin", "1_Text": "Greatly appreciated mate!", "2_Subreddit": "opiates"}], "dwrlzsl": [{"0_Comment Submission": "30 days off of heroin", "1_Text": "Yeah my cravings are starting to dissipate, finally! Stopping using any amount of dope is difficult. Good on you for stopping, even if it is a tolerance break!", "2_Subreddit": "opiates"}], "dwrmrt8": [{"0_Comment Submission": "30 days off of heroin", "1_Text": "I'm not trying to sound like a prude or anything like that; but my use got to the point that I had to stop or lose everything I have. I felt like absolute hell for about 6 days and it sucked so much. \n\nBut I'm so, so glad I stopped. I thought I was happy and content with my life. Since I've sobered up I've realized otherwise. It's been a really good wake up call. Thank you for the support!", "2_Subreddit": "opiates"}], "dwrnonh": [{"0_Comment Submission": "Me when drunk on reddit", "1_Text": "Fuckin' right?!", "2_Subreddit": "drunk"}], "dwtitpk": [{"0_Comment Submission": "30 days off of heroin", "1_Text": "Greatly appreciated!", "2_Subreddit": "opiates"}], "dwuhwry": [{"0_Comment Submission": "Before and after: 1 year off heroin", "1_Text": "Good on you man! I'm 32 days off of a hellish IV heroin addiction myself and I feel like a human again. I've got a long way to go, but it's a start!", "2_Subreddit": "pics"}], "dwuub9a": [{"0_Comment Submission": "30 days off of heroin", "1_Text": "Thank you much!", "2_Subreddit": "opiates"}], "dwxrjib": [{"0_Comment Submission": "Dedicating this 40oz to the last day of my 20s.", "1_Text": "Cheers!", "2_Subreddit": "drunk"}]}], "1_submissions": [{"88fdzw": [{"0_Title": "Cheers you beautiful bastards!", "1_Text": "I've spent entirely too much of my life playing the Total War: Rome, Rome 2, and Barbarian Invasion games. It's glorious.", "2_Subreddit": "drunk"}], "89d7m2": [{"0_Title": "30 days off of heroin", "1_Text": "I've spent entirely too much of my life playing the Total War: Rome, Rome 2, and Barbarian Invasion games. It's glorious.", "2_Subreddit": "opiates"}]}]}]}