{"fromthegroundup89": [{"0_comments": [{"ctmdxvr": [{"0_Comment Submission": "Goddammit! Anybody have any tips for getting a broken off needle out of scar tissue?", "1_Text": "Well if it was me I would treat it like a splinter. Sterilize a sharp object (xacto knife, razor blade) make a small incision and remove with tweezers, treat as any other cut when finished. Or maybe a really strong magnet, I've done that with metal shavings from a grinder before. Another option is go to the doctor (probably the smartest idea), because I am definitely not a medical professional, so take it with a grain of salt. If you do not remove it it will become infected .", "2_Subreddit": "opiates"}], "ctoktya": [{"0_Comment Submission": "Goddammit! Anybody have any tips for getting a broken off needle out of scar tissue?", "1_Text": "Good point, overlooked that", "2_Subreddit": "opiates"}], "ctolh5c": [{"0_Comment Submission": "I saw her face and now I'm a believer . Anyone dating a single mum?", "1_Text": "Wow man.... you just do you, good luck", "2_Subreddit": "opiates"}], "d50izpr": [{"0_Comment Submission": "Too scared to cold cop...", "1_Text": "The homeless every time. If it's a big city go downtown and ask the younger homeless crowd. In my big Mid western city next to the mountains a lot of guys act as \"runners\" to bring the Dboys aka Hondos (most open air Dboys here are Honduran) business and get a g for every 4-5 customers", "2_Subreddit": "opiates"}], "d50j7pu": [{"0_Comment Submission": "Stocked up for a two day binge", "1_Text": "I wish we got Codiene OTC in the states. Tbh having something that would help with withdrawals that wouldn't fuck up your heart would save so many peoples asses. Even a bad dope habit enough codiene would at least take the edge off......", "2_Subreddit": "opiates"}], "d57800j": [{"0_Comment Submission": "9 months clean. Found this little fucker under my couch looking for a lighter. Nice try addiction gods.", "1_Text": "Depends on the hospital or clinic and their rules. In Kentucky the hospitals near me flushed them down a toliet with a camera recording it and two people as witnesses. Has that law changed? Probably but that was 09.", "2_Subreddit": "opiates"}], "d579rjg": [{"0_Comment Submission": "9 months clean. Found this little fucker under my couch looking for a lighter. Nice try addiction gods.", "1_Text": "Yeah if you are drawing from rivers or surface water. In some parts of KY the water table is 200ft deep, that's a helluva filter. Now Nashville yeah mix that shit with coffee grounds and go to the dump with it, they pull right off the river.", "2_Subreddit": "opiates"}], "dvwzgz9": [{"0_Comment Submission": "Suicidal Thoughts during Suboxone Withdrawal", "1_Text": "Jumped off at a .5. I moved from Denver to KY and it's extremely hard to get into a program here though I guess I'm going to have to jump through their hoops. It's the combination of no opiates plus my life recently collapsing in on itself. I'll make it I guess I'm just at a point where I would cut off my left hand with a butter knife to feel sane again. Thanks for your comment (and everyone else), it means the world.", "2_Subreddit": "opiates"}], "dvwzlvh": [{"0_Comment Submission": "Suicidal Thoughts during Suboxone Withdrawal", "1_Text": "Thank you. The weird part is I've withdrawn from tar, oxy, opana( the worst tar not far after) and this hasnt happened until I decided to jump off subs, though the physical symptoms are much milder, the mental part is 2x as bad for some reason.", "2_Subreddit": "opiates"}], "dvzejq1": [{"0_Comment Submission": "Moved across country.", "1_Text": "Never went to the exchange but cold copping in that state was easy. Every homeless guy there is into black and there are a few open air markets if you know where to look.", "2_Subreddit": "opiates"}], "dvzemtk": [{"0_Comment Submission": "When you push down on the plunger.", "1_Text": "That's what meth did to me. BAM WIDE AWAKE!", "2_Subreddit": "opiates"}], "dw0t4hs": [{"0_Comment Submission": "An outsider curious about heroin users’ first time using the substance", "1_Text": "Moved across the country to CO, only had access to pills before I moved. Got there and couldn't find any pills that weren't ridiculously priced. Ended up meeting a homeless guy working maintenance for a hotel and he hooked me up and taught me the dope game out there. Snorted it when is was gun powder, smoked it when it was tar, eventually I got offered a syringe and went from there I had IV'd coke once before that and a Dilaudid 8mg. Eventually bought their plugs number when they were hard up for cash and got $40 grams delivered at that point I was banging. Went from a gram lasting me a week IV to half gram shots a year later. I miss my Hondo friends can't find shit where I grew up.", "2_Subreddit": "opiates"}], "dw4tp1v": [{"0_Comment Submission": "Another 🐼 pick-up. I figure I outta get as many as I can before they disappear again.", "1_Text": "Omg I dream about these!! Never come across them IRL, one can dream though. Happy nods!", "2_Subreddit": "opiates"}], "dw6qmje": [{"0_Comment Submission": "Did anyone else start because they were suicidal?", "1_Text": "At 13 I came home from school one day completely intent on shooting myself. Went into my parents room picked up my dad's p89 Ruger, racked one back stuck it to my head and CLICK. At the time I didn't know how to work the safety features on that gun, but I just thought I was a failure. Went to put the gun back and lying right there is a bottle of the old Watson Blue bellies 10/500 Hydrocodone and Tylenol. I ate 10 thinking if dad takes them to feel good so will I. It was like I had finally found peace. My thoughts stopped racing, I felt calm and happy to be alive. If it weren't for drugs I would have killed myself at that point and in the future.", "2_Subreddit": "opiates"}], "dwamqhf": [{"0_Comment Submission": "Guess this is what I’m doin now since I have zero plugs at the moment! Arggghhhh", "1_Text": "Drank 8 beers the other night damn near killed me. Can't imagine doing this.", "2_Subreddit": "opiates"}], "dwbv6jr": [{"0_Comment Submission": "E795 10MG PANDA", "1_Text": "I would cut off my pinky finger with a butter knife for ONE of those right now. Every time I ask for them people act like I'm fucking crazy. \" Better than PERK 30s man you frontin ain't no such thing.\" Had a guy call and said he found some $30 a piece get there and they were OP 10s I almost laid him out.", "2_Subreddit": "opiates"}], "dwbvtid": [{"0_Comment Submission": "Buying sharps?", "1_Text": "The best luck I had was saying they were for an animal and the vet sent you here because they are cheaper for humans. Act dumb give them a range of gauges.", "2_Subreddit": "opiates"}], "dwfl07w": [{"0_Comment Submission": "Anyone else getting jammed in Hope county!!?", "1_Text": "Was in Withdrawals so I went and bought it to pass the time. Great idea! Hours have flow by!!!", "2_Subreddit": "opiates"}], "dwly5ws": [{"0_Comment Submission": "I can't begin to express how grateful I am for our guardian angel, Tracey. Thank you so much.", "1_Text": "Very helpful and she takes donations too!! This is why I'm apart of this community, it saves lives (and veins).", "2_Subreddit": "opiates"}], "dwm0g23": [{"0_Comment Submission": "What's the appeal of opiates?", "1_Text": "You feel like you're in a garden of Eden with the sun shining down warming your face. You look up and see the fluffy white clouds parting. It's God coming down in the form of the Walmart smiley face, he cradles your face kisses you on the forehead and tells you everything is going to be OK. Bathing you in a warm glow that starts from the inside and radiates out. Or something like that....", "2_Subreddit": "opiates"}], "dwr8oaf": [{"0_Comment Submission": "I know what my problem is-- I want to use heroin forever.", "1_Text": "So true, I hate when my family talks with me about Suboxone and treatment. I can't stand to tell them I don't want to quit I want to be high forever. I want to feel normal forever.", "2_Subreddit": "opiates"}], "dwr8tgb": [{"0_Comment Submission": "Can only get magic mushrooms.", "1_Text": "Your pupils will be the size of dinner plates, it will be obvious you are tripping.", "2_Subreddit": "opiates"}], "dwttg3l": [{"0_Comment Submission": "Would you have switched to heroin if oxys were still everywhere?", "1_Text": "No I probably wouldn't have moves to heroin. It became to where it's all I could find and since it was tar it wasn't long before I was shooting \"to save money\" and \"conserve\" that lasted about 3 months until I hit a stint of overtime for 3 months got up to a half a gram a day nothing big but still using as an active maintenance man.", "2_Subreddit": "opiates"}], "dwvnjfd": [{"0_Comment Submission": "Found out I may possibly only have a few years to live", "1_Text": "Be safe, Erowid is your friend. Check out r/darknetmarketnoobs too", "2_Subreddit": "opiates"}], "dwvqdkr": [{"0_Comment Submission": "People with Chronic Pain Will Protest the CDC’s Crackdown on Opioids", "1_Text": "Check out Mary's Medicinals if you are in a weed legal state or Mary's Nutritional if you aren't. They make a CBD muscle freeze that's the shit!!!", "2_Subreddit": "opiates"}]}], "1_submissions": [{"31a879": [{"0_Title": "Throwing up on Opiates", "1_Text": "Well if it was me I would treat it like a splinter. Sterilize a sharp object (xacto knife, razor blade) make a small incision and remove with tweezers, treat as any other cut when finished. Or maybe a really strong magnet, I've done that with metal shavings from a grinder before. Another option is go to the doctor (probably the smartest idea), because I am definitely not a medical professional, so take it with a grain of salt. If you do not remove it it will become infected .", "2_Subreddit": "opiates"}], "36ffya": [{"0_Title": "Selling Everything and Moving Out West", "1_Text": "Well if it was me I would treat it like a splinter. Sterilize a sharp object (xacto knife, razor blade) make a small incision and remove with tweezers, treat as any other cut when finished. Or maybe a really strong magnet, I've done that with metal shavings from a grinder before. Another option is go to the doctor (probably the smartest idea), because I am definitely not a medical professional, so take it with a grain of salt. If you do not remove it it will become infected .", "2_Subreddit": "opiates"}], "85d1n5": [{"0_Title": "Suicidal Thoughts during Suboxone Withdrawal", "1_Text": "Well if it was me I would treat it like a splinter. Sterilize a sharp object (xacto knife, razor blade) make a small incision and remove with tweezers, treat as any other cut when finished. Or maybe a really strong magnet, I've done that with metal shavings from a grinder before. Another option is go to the doctor (probably the smartest idea), because I am definitely not a medical professional, so take it with a grain of salt. If you do not remove it it will become infected .", "2_Subreddit": "opiates"}]}]}]}