{"ATownN_Down": [{"0_comments": [{"dw94dq9": [{"0_Comment Submission": "Question/Poll", "1_Text": "Some people just can’t have an emotional attachment to animals. I know you say he loves it and plays with it but does he really have an emotional bond with it. \n\nSome look at pets as just that. A pet. Others like myself that have an emotional bond with pets view them as a family member. \n\nThere’s no amount of money that would part me from my Great Dane or my cat.", "2_Subreddit": "opiates"}], "dw9g0ss": [{"0_Comment Submission": "Syringes savannah/Brunswick ya", "1_Text": "There was actually a post about this yesterday. Same area. \n\nIt’s up to the pharmacist discretion in GA. You just have to keep trying till you find someone that doesn’t ask questions. I’ve had the best luck at Walmart. Some suggest Walgreens. \n\nGood luck and be safe my friend", "2_Subreddit": "opiates"}], "dw9ga2s": [{"0_Comment Submission": "Syringes savannah/Brunswick ya", "1_Text": "I’m on mobile and don’t know how to copy pasta the link. Look through my comments. It was actually posted 2 days ago.", "2_Subreddit": "opiates"}], "dw9hg8i": [{"0_Comment Submission": "Syringes savannah/Brunswick ya", "1_Text": "You could always order some if that is an option. Or make the haul to Atlanta.", "2_Subreddit": "opiates"}], "dwau4ay": [{"0_Comment Submission": "Just so we’re all on the same page(shitty people/shit post)", "1_Text": "Well you were stirring up shit on one of his post. Not saying he should have sent you that but what did you expect. Just ignore it brother.", "2_Subreddit": "opiates"}], "dwbsx2x": [{"0_Comment Submission": "I fucked up. Twice.", "1_Text": "If you have decided to keep the baby I would suggest going to treatment. Get professional help. Because now you are responsible for two lives and one of them is depending on you. \n\nGood luck and stay safe my friend.", "2_Subreddit": "opiates"}], "dwbtae5": [{"0_Comment Submission": "I fucked up. Twice.", "1_Text": "Going to treatment doesn’t necessarily mean inpatient but why not outpatient or counseling. There’s no shame in that and there’s a lot of people that don’t want to use again that end up using again. We are addicts. Addicts relapse. Whatever you end up doing please be safe. For yourself as well.", "2_Subreddit": "opiates"}], "dwcthw9": [{"0_Comment Submission": "Damn, lost my spot...", "1_Text": "I couldn’t imagine living in a small town where everyone knows everyone. \n\nHe probably heard your lighter. Get one of those electrical clicky lighters. So they don’t recognize the sound as easily. If that makes sense.", "2_Subreddit": "opiates"}], "dwctxbp": [{"0_Comment Submission": "Psychedelics during active addiction?", "1_Text": "The last time I took shrooms I was in a bad state of mind. Anxiety and depression. It was the worst trip I’ve ever had. I’ve never had a bad trip with shrooms until then and it was miserable. State of mind for sure makes a difference. \n\nBenzos would probably help though. I know some say to take bad trips as a learning experience and get something beneficial out of it but fuck all that noise.", "2_Subreddit": "opiates"}], "dwcva4m": [{"0_Comment Submission": "How how how..", "1_Text": "Your plug won’t give you a 12 hour front?", "2_Subreddit": "opiates"}], "dwestyk": [{"0_Comment Submission": "Roxies AND chasing/smoking ECP? worth it or a total waist?", "1_Text": "I agree that it’s not a waste. When I was in active addiction I would snort all day just to maintain and at night I would make a paste with my ecp and spread it on a piece of foil and then let it dry. Then smoke. It would always bring me to a nod. It became ritual.", "2_Subreddit": "opiates"}], "dweu161": [{"0_Comment Submission": "Refill day! 🌪", "1_Text": "Glad you posted this. I know there’s some legitimate fear going around with LE sourcing through chat/pm which is completely justifiable but there are also friendly members of this sub that just like to chat in private sometimes. Instead of everyone jumping to conclusions we should all just be extra careful.", "2_Subreddit": "opiates"}], "dwh7qbe": [{"0_Comment Submission": "How Fentanyl Created Murderers of Drug Dealers", "1_Text": "It was just a poorly written article if that is what it’s intended to be..\n\nIt ended before it even started", "2_Subreddit": "opiates"}], "dwo2ytt": [{"0_Comment Submission": "Rest easy, u/OldRapGroup", "1_Text": ".", "2_Subreddit": "opiates"}], "dwq1wej": [{"0_Comment Submission": "Just saying people who shoot why post a pic of a needle or you shooting up no one what's to see that come on now", "1_Text": "You are worrying about this way too much. I don’t shoot and seeing it doesn’t bother me at all. Scroll past or unsubscribe.", "2_Subreddit": "opiates"}], "dwq4o6x": [{"0_Comment Submission": "Advice I guess?", "1_Text": "Sorry you are going through this. I’m guessing you don’t have access to benzos to get you over this hump. \n\nThe only other thing that helped me with the depression while sick was to exercise. I know it’s easier said than done but even quick walks around the neighborhood helps big time. Or a quick jog. Jumping jacks. Anything active. \n\nGood luck brother.", "2_Subreddit": "opiates"}], "dwqoupj": [{"0_Comment Submission": "Advice I guess?", "1_Text": "The first couple days I don’t lol. But the depression usually doesn’t come on until a couple days later. But you are right. It’s so hard to do shit. But exercise always helps.", "2_Subreddit": "opiates"}], "dwtdq8v": [{"0_Comment Submission": "And they say they are hard to get .. 🧐", "1_Text": "You suck so bad =P", "2_Subreddit": "opiates"}], "dwtlw3l": [{"0_Comment Submission": "today would’ve been your 23rd birthday. i miss you everyday darlin’ 💔", "1_Text": ".", "2_Subreddit": "opiates"}], "dwugo0u": [{"0_Comment Submission": "My dboy who sold me these bricks invited me into his trap house to party. I politely declined", "1_Text": "Does he know you plug your dope? That would be a bit awkward to do in the trap house lol. Be safe!", "2_Subreddit": "opiates"}], "dwvl6mw": [{"0_Comment Submission": "if only it was true...", "1_Text": "He’s being sarcastic. Because the anti gun activist say if you make guns illegal then it’ll stop the shootings. \n\nBecause people don’t die since heroin is illegal\n^ sarcasm ^", "2_Subreddit": "opiates"}], "dwwmk3w": [{"0_Comment Submission": "Do you acquire your suboxone from your family doctor, clinic or psychiatrist?", "1_Text": "I’ve seen 3 different sub docs and all 3 were psychiatrist/addiction specialist. They were all regular psychs but were licensed to prescribe subs so addiction specialist was just part of their job. They weren’t just sub docs.", "2_Subreddit": "opiates"}], "dwwmsz4": [{"0_Comment Submission": "Appearing in court tomorrow for sentencing on first and only possession charge...", "1_Text": "This is such a bad idea. I know you feel strongly about the subject with your current situation but please remember a lot of these judges and prosecutors are on a complete power trip. \n\nSomeone telling them that what they are doing is wrong will only make it worse for you. \n\nGood luck! I hope all goes well for you!", "2_Subreddit": "opiates"}], "dwwz5k1": [{"0_Comment Submission": "Why do you go on one last binge before rehab?", "1_Text": "It’s your one last hoorah! It’s like having a going away party. Have tons of fun getting high because in theory it’ll be the last time. Not sure how else to explain it.", "2_Subreddit": "opiates"}], "dwx1a36": [{"0_Comment Submission": "Why do you go on one last binge before rehab?", "1_Text": "This ^", "2_Subreddit": "opiates"}]}], "1_submissions": [{"7dcl82": [{"0_Title": "Which One of You Hit My Local Pharmacy Last Night? =P", "1_Text": "Some people just can’t have an emotional attachment to animals. I know you say he loves it and plays with it but does he really have an emotional bond with it. \n\nSome look at pets as just that. A pet. Others like myself that have an emotional bond with pets view them as a family member. \n\nThere’s no amount of money that would part me from my Great Dane or my cat.", "2_Subreddit": "opiates"}], "7ez8lu": [{"0_Title": "Happy Thanksgiving r/opiates !!", "1_Text": "Some people just can’t have an emotional attachment to animals. I know you say he loves it and plays with it but does he really have an emotional bond with it. \n\nSome look at pets as just that. A pet. Others like myself that have an emotional bond with pets view them as a family member. \n\nThere’s no amount of money that would part me from my Great Dane or my cat.", "2_Subreddit": "opiates"}], "85czaa": [{"0_Title": "Friends Vs Junkie Friends", "1_Text": "Some people just can’t have an emotional attachment to animals. I know you say he loves it and plays with it but does he really have an emotional bond with it. \n\nSome look at pets as just that. A pet. Others like myself that have an emotional bond with pets view them as a family member. \n\nThere’s no amount of money that would part me from my Great Dane or my cat.", "2_Subreddit": "opiates"}]}]}]}