{"Chrizzle8": [{"0_comments": [{"dsu0l6i": [{"0_Comment Submission": "[TOMT] [MOVIE] A group of young boys in middle/high school build a boat together.", "1_Text": "Is the Rookie of the Year? I know they all build a boat together but the main plot isn't really mentioned...", "2_Subreddit": "tipofmytongue"}], "dswdjxl": [{"0_Comment Submission": "I [23F] feel like I may end up hurting my friend [22M] because I wouldn't be able to give him what he wants.", "1_Text": "Your roommate is right. There's no way he would be able to handle a FWB relationship, but would pretend it's okay just to be with you. I recommend cutting off contact for the sake of both of you. Plus, him trying to take you away from your friends every time he sees you drunk? That's a pretty creepy way of trying to have you slip up. This guys doesn't sound like like the nice guy you think he is, he sounds like an opportunist that's waiting for a lapse of judgement on your end.", "2_Subreddit": "relationships"}], "dsyn66h": [{"0_Comment Submission": "Douglas Shamlin Jr 17x17x17 in 1:05:43", "1_Text": "That seriously has to be the most satisfying thing to complete. Props to him!", "2_Subreddit": "Cubers"}], "dt4quhx": [{"0_Comment Submission": "[TOMT] Fairytale-like story where a ferryman must take people across a river, always trying to find someone to take his place and tries to trick people into doing so.", "1_Text": "Is it Shelley Duvall's Faerie Tale Theatre? I don't remember all the stories, and if it's not, you should definitely check it out. I'm probably going to download it now just for the nostalgia.", "2_Subreddit": "tipofmytongue"}], "dt4vizk": [{"0_Comment Submission": "[TOMT] Fairytale-like story where a ferryman must take people across a river, always trying to find someone to take his place and tries to trick people into doing so.", "1_Text": "Of course! And I'll definitely check this out, seems like something I'll enjoy", "2_Subreddit": "tipofmytongue"}], "dte66rs": [{"0_Comment Submission": "I really need advice", "1_Text": "I don't post in here much - but I felt the need to after reading this. My question is: your going to go cold turkey the day you start school? That's going to be complete hell. I'd give myself AT LEAST two weeks of clean time before going back to school. And I really don't feel like you are giving the drug the \"respect\" it deserves. If your thought process is \"I'm gonna go on a month long heroin binge and then quit\", you might want to rethink your plan. \n\nI mean, hey, this plan might work for you, but in my experience, heroin tends to make it's own plan. Alot can happen during a month of doing dope. \n\nHonestly, good luck but I recommend getting the WD's out of the way now and be simi-mentally prepared for your semester.", "2_Subreddit": "opiates"}], "dti1n8m": [{"0_Comment Submission": "Grandma shared this recently.", "1_Text": "Those eyes SCREAM fetal alcohol syndrome.", "2_Subreddit": "trashy"}], "dtlxm2u": [{"0_Comment Submission": "Loperamide dosage for 500mg oxycodone withdrawl?", "1_Text": "Honestly, I'd go with 40mg of lope to start. They have a really high tolerance, but I wouldn't go over that (see all the posts about dangers of lope on this sub). That might get some of the RL and shits taken care of.", "2_Subreddit": "opiates"}], "dtly1cx": [{"0_Comment Submission": "ECP fent question", "1_Text": "Definitely Russian roulette. You can get a bun with some weak ones and rail a few with an okay high, then BAM, nodding off one. I'm not sure where you are, but I'm around Philly and it's literally hit or miss with the same batch, with the same stamps.", "2_Subreddit": "opiates"}], "dudm885": [{"0_Comment Submission": "Why do so many people smoke ECP?", "1_Text": "Honestly, it's the needle aspect of it. I've had an addiction for almost 10 years and am waaaaay too scared to shoot - I only snort. I've been clean for a little bit and only had access to ecp and pills, so I might be a minority. But shooting as always scared the fuck outta me, I hear there's no turning back after.", "2_Subreddit": "opiates"}], "duedaho": [{"0_Comment Submission": "[TOMT] [Audio Effect] Like a tape stopping, symbolizes \"wait what?\"", "1_Text": "You sure you don't mean a record scratch?", "2_Subreddit": "tipofmytongue"}], "duedjzt": [{"0_Comment Submission": "[TOMT] [Audio Effect] Like a tape stopping, symbolizes \"wait what?\"", "1_Text": "No problem! I think you have to reply with \"solved\" to close the thread though.", "2_Subreddit": "tipofmytongue"}], "duezcak": [{"0_Comment Submission": "Make sure to bundle up and wear sleeves, now go out there and find your nod! (Getting real tired of sniffing only but I know I can't IV and still have a decently normal life, so up the nose the ecp goes", "1_Text": "Are they Superman and white power jawns?", "2_Subreddit": "opiates"}], "duqp7y5": [{"0_Comment Submission": "Ramen noodle tracksuit...kinda trashy, kinda awesome?", "1_Text": "Awful taste but great execution. Great sub if I may say so", "2_Subreddit": "trashy"}], "duvu6e3": [{"0_Comment Submission": "Marijuana and what to do?", "1_Text": "Agreed. Edibles are hit or miss for me. That being said - I heard someone say, think Indica as \"in da couch\" and sedative and sativa it more of an uppity high. Not sure if it's the same with edibles though.", "2_Subreddit": "opiates"}], "dv1vi5y": [{"0_Comment Submission": "clear-net scammers? You tell me", "1_Text": "Head over to darknetmarketnoobs, they have step by step instructions and people to help you out. \n\nAs for the African clearnet orders? I've never heard of someone getting something from there. Maybe the Nigerian prince decided to switch up his email business because of everyone getting the 1,000,000 he's always handing out?", "2_Subreddit": "opiates"}], "dv6i4wr": [{"0_Comment Submission": "Girlfriend got pulled over and they found 39 klonopin, some dabs, and half a xanax bar. Will she go to jail?", "1_Text": "They could be sending the pills to a lab for testing and add charges once the results come back. If it's not something they have a mobile test for, that's happened to me. I'm in PA though, so it could be different.", "2_Subreddit": "opiates"}], "dv92z6s": [{"0_Comment Submission": "Heroin on a plane", "1_Text": "Put it in some vitamin gelcaps, mark them slightly. Mix in with the rest of the bottle and check it. Shouldn't be a problem", "2_Subreddit": "opiates"}], "dvf9mgq": [{"0_Comment Submission": "When did you realize you might be starting to get addicted?", "1_Text": "Don't. Stop now. Seriously. Leave before you become a regular. You end up bartering, debating morals, and end up doing things you promised you wouldn't. Take it from me, you won't know until it's too late.", "2_Subreddit": "opiates"}], "dvf9pmc": [{"0_Comment Submission": "When did you realize you might be starting to get addicted?", "1_Text": "I started with 5s, then 10s, then 30s, then I was told a 30 = a bag of dope. They weren't wrong, but I haven't been right since.", "2_Subreddit": "opiates"}], "dvf9tf1": [{"0_Comment Submission": "Enjoying the withdrawals....?", "1_Text": "No. Fuck no. No no no. 😚", "2_Subreddit": "opiates"}], "dw8xlfu": [{"0_Comment Submission": "A quick thank you to the following reddit fam members -", "1_Text": "This is such an awesome post. I usually lurk, randomly posting, but I saw your post the other day and was hoping to see an update. I'm glad everything went well and this made my night!", "2_Subreddit": "opiates"}], "dwdqxr6": [{"0_Comment Submission": "Traveling to Mexico questions", "1_Text": "Agree with this. Just get the M-S pill planner and throw some Advil and other stuff in with the 30s, they aren't going to check all the different pills. Or just throw them loosely into your bathroom bag or shave kit.", "2_Subreddit": "opiates"}], "dwgruxr": [{"0_Comment Submission": "The time I stayed with my dboy for a couple weeks....", "1_Text": "Dude, you suck as a person. You didn't ha e to read anything, you didn't have to judge her, and I'm pretty sure no one gives a fuck about your opinion. Take your wannabe mafia screen name elsewhere.\n\nThis is the reason all the other subs getting shutdown sucks - seems like a bunch of douchebags migrated here because incels got deleted.\n\nThanks for the story opidab, it gave me something to read even though it wasn't an Oscar nominated screenplay 🤣", "2_Subreddit": "opiates"}], "dwi28sq": [{"0_Comment Submission": "The time I stayed with my dboy for a couple weeks....", "1_Text": "Of course! I mean, he even said he was \"gonna go off on someone just because his sub got deleted\". What a huffy little person. I'm glad you took that with class, yous a graceful Dame :-)", "2_Subreddit": "opiates"}]}], "1_submissions": [{"4hbte6": [{"0_Title": "Egg, Genoa, onion, bacon, Jack, hot peppers and some other stuff. 4am drunk food.", "1_Text": "Is the Rookie of the Year? I know they all build a boat together but the main plot isn't really mentioned...", "2_Subreddit": "eatsandwiches"}], "7brkqf": [{"0_Title": "Ribs and Rings - TGI- Fridays don't get it", "1_Text": "Is the Rookie of the Year? I know they all build a boat together but the main plot isn't really mentioned...", "2_Subreddit": "WeWantPlates"}]}]}]}