{"_quote": [{"0_comments": [{"dcf7tol": [{"0_Comment Submission": "Daily Discussion Thread 01/14/17", "1_Text": "I always find it hilarious when people come to my apartment and complain about my controllers, all 6 of which I've personally selected and modded. My friend once complained that a controller I used in tournaments for at least 3 months \"missed techs\". LOL", "2_Subreddit": "SSBM"}], "dcf8gi6": [{"0_Comment Submission": "Daily Discussion Thread 01/14/17", "1_Text": "Do you wavedash with tap jump? I don't think I know of any player who does. You should really focus on getting the dexterity to press jump as fast as you can after your shine, I believe the fastest you can cancel it is 3 or 4 frames. The window to jump out of shine is large, so make sure you're not wasting precious hitstun by sitting in your shine too long. The way I got good was doing a shine->short hop over and over until it was easy.", "2_Subreddit": "SSBM"}], "dcfrmjc": [{"0_Comment Submission": "Daily Discussion Thread 01/14/17", "1_Text": "what character do you play? I personally had some extreme frustration issues when I was playing samus and doctor mario. I had to relearn the entire game when I switched to fox, which was part of what removed the emotional aspect of the game for me. I lost constantly in the beginning, so I was just like, fuck it, who cares anymore. I just learned from the ground up.\n\nNot saying that you should switch to fox necessarily, but I do see a great opportunity here if you decide to completely learn to use x or y for jump. All you have to do is go into it with the expectation that you will lose every single game, and then bam, no more frustration. Hope to hear back from you.", "2_Subreddit": "SSBM"}], "dcfuy0y": [{"0_Comment Submission": "How important is it to have only 1 main when starting", "1_Text": "When I switched around characters a lot as a beginner, doing that definitely kept me a beginner for way longer than was possibly necessary. It kept me from getting to the next level. When I first started maining fox I began to improve rapidly. whenever I switched off of him I actually got worse and fell back into old habits rapidly. After a year of maining fox my skills are a bit more set in stone, but if I switch to falcon or falco, my improvement is completely halted until I switch back to fox. Overall, being a solo a solo fox main has been a huge buff to my skills at every point of my development.", "2_Subreddit": "SSBM"}], "dcfwd7e": [{"0_Comment Submission": "Daily Discussion Thread 01/14/17", "1_Text": "I guess I forgot the most important thing, which is stick to only one character. I had a lot of trouble improving until I only played fox and didn't switch at all, even for one game. Dedicating myself to only fox was the one thing that allowed me to break through to the next level. When you are losing badly and it seems like everything you're doing has stopped working, that is the key point that you want to stick it out with your character. It will force you to create new strategies that counter the things that countered the things you were doing originally. Hope that makes sense.", "2_Subreddit": "SSBM"}], "dcg2urr": [{"0_Comment Submission": "Daily Discussion Thread 01/14/17", "1_Text": "I'm not saying that you do, it's just something that I found was useful for me. It's possible that playing some fox will help your falcon, but I have gotten my best improvement results playing one character for a few hours straight and not switching. It helps me get into a groove and play the best I possibly can. Just a suggestion for something you could try.", "2_Subreddit": "SSBM"}], "dcg5gu7": [{"0_Comment Submission": "Daily Discussion Thread 01/14/17", "1_Text": "I usually go red marth for more damage on my tippers.", "2_Subreddit": "SSBM"}], "dcg6bqm": [{"0_Comment Submission": "I'm still salty", "1_Text": "I know what you're going through man. You could do what I do, just take painkillers and jerk off until you're not interested in women at all! Mgtow4lyfe.", "2_Subreddit": "asktrp"}], "dcg6miy": [{"0_Comment Submission": "I'm still salty", "1_Text": "It's just a joke.", "2_Subreddit": "asktrp"}], "dcgcwdc": [{"0_Comment Submission": "Hax$ has been using the SmashBox and is planning on coming back full time!", "1_Text": "Yeah, people seem to have this fantasy about fgc people playing melee because of the smash box... It's fucking stupid and a non-argument.", "2_Subreddit": "SSBM"}], "dcgd22h": [{"0_Comment Submission": "Hax$ has been using the SmashBox and is planning on coming back full time!", "1_Text": "This is not necessarily true. I would love to see hax come back, playing on an *analog* fightstick that actually matches the original control scheme of melee. We don't have to settle for the smashbox just because an analog versiom hasn't been invented yet.", "2_Subreddit": "SSBM"}], "dcgdddu": [{"0_Comment Submission": "Hax$ has been using the SmashBox and is planning on coming back full time!", "1_Text": "I am completely against this. If there is anyone who will break the game with the smashbox's controls, it will be hax. melee is designed to be controlled by an analog stick, not 8 buttons. I'm not entirely on board with changing our button layout at all because it would be akin to swapping the a and b button on a GC controller or something like that. But that issue pales in comparison to swapping the stick with fucking buttons, which is inexcusable.", "2_Subreddit": "SSBM"}], "dcgdfz6": [{"0_Comment Submission": "Hax$ has been using the SmashBox and is planning on coming back full time!", "1_Text": "Just putting it out there that I'm one person who is still completely not okay with the smashbox despite being a huge hax fan.", "2_Subreddit": "SSBM"}], "dcgnrp7": [{"0_Comment Submission": "Hax$ has been using the SmashBox and is planning on coming back full time!", "1_Text": "It's not as much about the advantage, it's more about how it changes the game. Tapping three buttons to do a pivot up tilt physically has nothing to do with what's required to do the same thing on a control stick. Gravy sucked in his streamed matches and yet I could still tell instantly that he was using a different controller from the abnormal way his character moved. It's a huge difference regardless of whether or not it will bring about game breaking techniques. I happen to think it will, and that's my own speculation.", "2_Subreddit": "SSBM"}], "dcgp1mp": [{"0_Comment Submission": "Hax$ has been using the SmashBox and is planning on coming back full time!", "1_Text": "Give me a break, everything you need for melee costs like a hundred bucks, whereas the smashbox costs 200. Not to mention if you're going to start off with emulation, all you need is a controller and adaptor, only 40 bucks total. And you seriously think that people are more weirded out by a gc controller than a fight stick? Just no.", "2_Subreddit": "SSBM"}], "dcgxchb": [{"0_Comment Submission": "Daily Discussion Thread 01/15/17", "1_Text": "Frozen stadium is still really fun to play on in friendlies or a money match. Whether or not it's allowed in tournament depends on who's running it. So as long as regular stadium is an official legal counterpick stage, people should know how to play on PS and I respect their decision.", "2_Subreddit": "SSBM"}], "dch252z": [{"0_Comment Submission": "Daily Discussion Thread 01/15/17", "1_Text": "Try to find creative ways that you can trick your opponent into thinking that you're going for a raw grab or aerial approach, and do a running shine or shine grab instead. It will work once you can get them to shield when you're running at them.", "2_Subreddit": "SSBM"}], "dchxlft": [{"0_Comment Submission": "Hax$ has been using the SmashBox and is planning on coming back full time!", "1_Text": "Gamecube controllers are way more mainstream than fight sticks, it's not even a question.", "2_Subreddit": "SSBM"}], "dtbu87a": [{"0_Comment Submission": "This does seem a bit hypocritical", "1_Text": "Maybe because showing that amount of skin is appropriate at the beach but not in other situations? \n\nYou think that wearing a bikini at the pool makes it okay to wear one in the library? Don’t be willfully ignorant.", "2_Subreddit": "AdviceAnimals"}], "dvq1jip": [{"0_Comment Submission": "Dealer made me weigh the money", "1_Text": "Ding ding ding! How this really went down was the dealer handed him a bag, and OP made him take it out of the bag and weigh it in front of him. He was likely rude about it without realizing. So the dealer, to get him back, made OP weigh out all his bills.", "2_Subreddit": "Drugs"}], "dw5xgvc": [{"0_Comment Submission": "22 Year Old Male, Low SMV", "1_Text": "Nigga why u so worried", "2_Subreddit": "asktrp"}], "dwp2brb": [{"0_Comment Submission": "Will TRP be able to explain this situation with a girl I'm living with?", "1_Text": "Stop hanging out with this girl! This situation is not a good deal for you!", "2_Subreddit": "asktrp"}], "dww62ew": [{"0_Comment Submission": "Been craving IV cocaine something fierce.", "1_Text": "I used to IV my feet with morphine. Still gotta be really careful who sees me with my socks off.", "2_Subreddit": "opiates"}], "dww6cac": [{"0_Comment Submission": "I quit my job teaching yesterday. Without leadership or integrity, mediocrity rises to the top.", "1_Text": "Nice. There's a high school teacher who just started coming to my therapy group, quitting a pretty crazy cocaine habit apparently. No wonder he got addicted to drugs in the first place.", "2_Subreddit": "TheRedPill"}], "dww6j70": [{"0_Comment Submission": "Been craving IV cocaine something fierce.", "1_Text": "I just looked at my feet and man there's still dark spots fucking everywhere. Totally permanent even though the scars are like 6 months old. Living the kratom life now. I hope they come out with brand new skin you can put on your feet haha.", "2_Subreddit": "opiates"}]}], "1_submissions": [{"5cxyga": [{"0_Title": "[DDT] MagicScrumpy's YLink combo video titled \"600 Hours\" may actually be a TAS. Read this thread and decide for yourself!", "1_Text": "I always find it hilarious when people come to my apartment and complain about my controllers, all 6 of which I've personally selected and modded. My friend once complained that a controller I used in tournaments for at least 3 months \"missed techs\". LOL", "2_Subreddit": "SSBM"}], "5ja94h": [{"0_Title": "PSA: Cut the damn springs in your controller!", "1_Text": "I always find it hilarious when people come to my apartment and complain about my controllers, all 6 of which I've personally selected and modded. My friend once complained that a controller I used in tournaments for at least 3 months \"missed techs\". LOL", "2_Subreddit": "SSBM"}], "7vbq3x": [{"0_Title": "Would-be grammar nazi gets burned", "1_Text": "I always find it hilarious when people come to my apartment and complain about my controllers, all 6 of which I've personally selected and modded. My friend once complained that a controller I used in tournaments for at least 3 months \"missed techs\". LOL", "2_Subreddit": "MurderedByWords"}]}]}]}