{"GwarTickets": [{"0_comments": [{"duavx31": [{"0_Comment Submission": "Pain clinic accidently sent two scrips instead of one. Should I pick up the second at pharmacy?", "1_Text": "They will find out and cut you off with a swiftness that will make your head spin.", "2_Subreddit": "opiates"}], "ducte8l": [{"0_Comment Submission": "10 vials is Fentanyl Citrate straight outta the hospital.", "1_Text": "Can I have a picture with your face, drivers license, and todays newspaper and the fent taped to your chest? \n\nJust kidding lol be careful with the fent and always remove exif data before posting pics. I assume you probably did but it couldn't hurt to mention it! Operational security is Paramount", "2_Subreddit": "opiates"}], "dugobd2": [{"0_Comment Submission": "Anyone ever take LSD and then a few hours later opiates?", "1_Text": "Its great eases the muscular-skelto tension some impure LSD can cause. If you are at peace with your addiction go for it, if not dose a long acting opiate before you take the LSD and some while coming down. \n\nThe last thing you want is to fall into a hole of despair and loathing because your high on Cid and putting a needle in your veins. But that was just my experience and it didn't last very long and soon I was back to happily tripping and swooning from sweet opiates :)", "2_Subreddit": "opiates"}], "dupp2g4": [{"0_Comment Submission": "LET’S PLAY A GAME: in ONE or TWO single sentences (even one word answers will suffice); describe your addiction.", "1_Text": "For sale: baby shoes, never worn.", "2_Subreddit": "opiates"}], "duq8e11": [{"0_Comment Submission": "has anyone else become a recluse since getting hooked?", "1_Text": "When I was in the throws of active addiction I didn't talk to anyone but my dboy or pharmacist. If someone showed up knocking of the door or tried to call they got no answer. When sick I was too anxious to be around people when high too caught up in the nod and would probably annoy people anyway. Its a lonely existence and my mental state, and I'm being one hundred percent serious, was eerily similar to that of Gollum/Smèagol.", "2_Subreddit": "opiates"}], "duq8kvy": [{"0_Comment Submission": "has anyone else become a recluse since getting hooked?", "1_Text": "Samwise Gamgee describes the two personalities as \"slinker\" and \"stinker\", to gollum and Smèagol respectively. When I read the book for the first time I saw the similarities and immediately called a sub doc and started working on getting clean. Lord of the Rings legit helped me save my own life. \n\nYou ever need someone to talk or even rant to shoot me a message and I'd be happy to be a friendly ear!", "2_Subreddit": "opiates"}], "duq8oi1": [{"0_Comment Submission": "M30 for guy who just sent me the guide. What you think? I’m 95% on the real side", "1_Text": "Look legit to me but of course I can't be certain without doing them or testing them. Order some fent test strips if you can! Be safe.", "2_Subreddit": "opiates"}], "dus3v00": [{"0_Comment Submission": "Be careful with your dregs", "1_Text": "All things are connected, they all fall under the same banner and their host is the same. The Crimson King and his servants pose under many guises!", "2_Subreddit": "opiates"}], "dus3w5z": [{"0_Comment Submission": "Be careful with your dregs", "1_Text": "So there is no capitalism is your country? Or is it truly socialist?", "2_Subreddit": "opiates"}], "dut7vq4": [{"0_Comment Submission": "Speaking of guns, who likes to get faded and shoot at bottles and targets? Me and my old roomate a few years ago before I came to Asia, back in the OC days", "1_Text": "I love shooting and archery. Any kind of marksmanship really. I toon a whitetail this year with a homemade Osage orange bow, eating some of it now!", "2_Subreddit": "opiates"}], "duzitt2": [{"0_Comment Submission": "Accidentally took 5 meth bombs thinking it was ecstasy last night, haven’t slept yet and I haven’t eaten for 18 hours. About to pop 3 tramadols , smoke sum weed , force sum food down my throat and go to sleep 👌🏾", "1_Text": "Tramadol and meth is a recipe for a seizure be careful!", "2_Subreddit": "opiates"}], "dv6ppze": [{"0_Comment Submission": "Accidentally took 5 meth bombs thinking it was ecstasy last night, haven’t slept yet and I haven’t eaten for 18 hours. About to pop 3 tramadols , smoke sum weed , force sum food down my throat and go to sleep 👌🏾", "1_Text": "Yet meth also lowers seizure threshold and is serotonegenic in some ways didn't want him/her to start crappie floppin' lol", "2_Subreddit": "opiates"}], "dv78ypl": [{"0_Comment Submission": "I rubbed a chemical burn into my whole face and part of my hands...", "1_Text": "Sounds like they didn't do a very good crystalization and left a bunch of HCL in the final product and it didn't get a chance to evaporate. Maybe lye or any number of caustic solvents, regents, or catalysts. Meth is pretty caustic as it is. You should get a neti pot and clean them sinuses out before and after every time you use.", "2_Subreddit": "opiates"}], "dva26r9": [{"0_Comment Submission": "If there were to be a zombie apocalypse, being a junkie, what’d be the first thing you’d do? Interested in y’all responses 😀", "1_Text": "Better come packing because true predators stake out watering holes and look for weak prey. There won't just be zombies to worry about but rape gangs and bandits who may have got there first and fortified it or will lay in wait for anyone trying to get in and will waylay you. Same for any other scenario when the world ends. People are the true danger and fear.", "2_Subreddit": "opiates"}], "dva6xge": [{"0_Comment Submission": "Plug came thru early today! Gram and a half happy nods guys ^_^", "1_Text": "Favorite game ever", "2_Subreddit": "opiates"}], "dvj9tjs": [{"0_Comment Submission": "Is my 16 year old daughter using opiates?", "1_Text": "I'd say not yet. I started out this way, browsing erowid and smoking pot looking at junkies like I'd never be one and hating opiates for taking people close to me, but deep deep down inside there was a kernel of an interest so strong I ended up becoming an addict", "2_Subreddit": "opiates"}], "dvjr88s": [{"0_Comment Submission": "I nodded so hard that I randomly told my boyfriend that I’m actually a lesbian", "1_Text": "It is kinda sad. I feel bad for both of them because I've been on both sides of the dynamic in a relationship. It hurts so bad when someone you love isn't ready to be clean but it is what it is. I wish y'all the best of luck and safety!", "2_Subreddit": "opiates"}], "dvjrgdo": [{"0_Comment Submission": "Accidentally took 5 meth bombs thinking it was ecstasy last night, haven’t slept yet and I haven’t eaten for 18 hours. About to pop 3 tramadols , smoke sum weed , force sum food down my throat and go to sleep 👌🏾", "1_Text": "That is always an option. Nothing like a grand mahl if you wanna bust quick", "2_Subreddit": "opiates"}], "dvn6nye": [{"0_Comment Submission": "What’s the most fucked thing you’ve seen someone to do to get high?", "1_Text": "Once saw a crossdresser that my friends and I call \"Cousin It\" have a train run on him for 40 bucks. Well i didnt see it so much as hear it, as i was in an adjacent room. 4 Mexican tweakers at 10 bucks a pop. As they left one of them handed him 4 bills which he stuck in his pocket. He came into the room I was in, and handed the money to me as I was supposed to go cop for the both of us. \n\nIt was four 1 dollar bills.", "2_Subreddit": "opiates"}], "dwnh506": [{"0_Comment Submission": "Would you continue eating meat if you had to kill the animal yourself every time? Why or why not?", "1_Text": "Yes. I learned of the horrors of factory farming at an early age and as meat eater I was faced with an ethical dilemma. Fortunately I also grew up hunting so I came to the conclusion that if I wanted meat I had to harden my heart enough to kill another lifeform so that I may live. When I kill an elk or deer, or a coney I always make sure the kill is clean and quick, and I pray over the animals body and thank it for giving its life so that I may live. The meat is good, free from antibiotics and added hormones and most important of all; it lived freely and was never caged. \n\nThe Universe is a hard place and we must do hard things to live. I love meat and the way it makes me feel, but dislike killing without need. I can live with it. Also I only bowhunt, guns are too easy (if I was starving I'd bust out the 30-30 for sure lol)", "2_Subreddit": "AskReddit"}], "dwpbi2f": [{"0_Comment Submission": "Ultra Low Dose Buprenorphine", "1_Text": "Man I'm barbecued on edibles and did the same thing. Got stuck in a loop my heart started beating fast and I was tripping.", "2_Subreddit": "opiates"}], "dwpcjc0": [{"0_Comment Submission": "Just out of curiosity", "1_Text": "I know two Vietnamese people that do dope. I live in southern USA.", "2_Subreddit": "opiates"}], "dws1wgg": [{"0_Comment Submission": "Last bag today, deleting all numbers", "1_Text": "What kind of junkie doesn't know their dealers number by heart? Maybe I'm just old school but I remember my first true dealers phone number and it been 10 years out of service lol", "2_Subreddit": "opiates"}], "dwudhmt": [{"0_Comment Submission": "What's a reference that any fan will immediately recognize, but others won't?", "1_Text": "See the turtle, ain't he keen? All things serve the fucking beam. Also 19.", "2_Subreddit": "AskReddit"}], "dwxcyjn": [{"0_Comment Submission": "LSD and Fentanyl", "1_Text": "Yea it doesn't really make sense. I was fucked as a child and I probably did heroin because of that. Can't really equate the two.", "2_Subreddit": "Drugs"}]}], "1_submissions": [{"7cqqb0": [{"0_Title": "SSDD: or a junkies lament", "1_Text": "They will find out and cut you off with a swiftness that will make your head spin.", "2_Subreddit": "opiates"}]}]}]}