{"EroticMarmalade": [{"0_comments": [{"dwhezsb": [{"0_Comment Submission": "‘You’re a mother’: Laura Ingraham savaged for taunting Parkland activist over college rejections", "1_Text": "Its exposure like this that angers people who read that ink which will help ingluence the companies to act.", "2_Subreddit": "politics"}], "dwhfs6h": [{"0_Comment Submission": "“Are we to believe that Cambridge Analytica is a far more advanced and sophisticated propaganda arm than Correct the Record?” asks Top Mind, apparently born within the last 24 hours.", "1_Text": "On a somewhat related not I just found 2 autographed glossy photos of buzz in my dad's old safe. Pretty cool.", "2_Subreddit": "TopMindsOfReddit"}], "dwiet28": [{"0_Comment Submission": "Mueller pushed for Gates' help on collusion", "1_Text": "No that's the daily double", "2_Subreddit": "politics"}], "dwinnqi": [{"0_Comment Submission": "Joe Biden: Most 'damaging' part of Trump's presidency was naming Neil Gorsuch to Supreme Court", "1_Text": "Real 4D interdimensional clam digger head to head", "2_Subreddit": "politics"}], "dwintl0": [{"0_Comment Submission": "Joe Biden: Most 'damaging' part of Trump's presidency was naming Neil Gorsuch to Supreme Court", "1_Text": "Which would be cool if we had campaign finance reform like a lot of better nations.", "2_Subreddit": "politics"}], "dwj46to": [{"0_Comment Submission": "Andrew McCabe: legal fund for battle with Trump reaches $300,000 in hours", "1_Text": "Damn Donald FBI gonna be bringing them all white vans through", "2_Subreddit": "politics"}], "dwj550e": [{"0_Comment Submission": "KiA Still defending Milo even after scamming them. \"Fake News!\" ensues.", "1_Text": "Ya but he was gay and fucked black guys so he could say hateful things about any demographic with a bit of a shield and at Breitbart thats much more important than actually knowing your job.", "2_Subreddit": "TopMindsOfReddit"}], "dwj574v": [{"0_Comment Submission": "Alex Jones’ son is introduced to the fanbase for another generation of the gravy train, by challenging David Hogg to a debate. In the comment section, we learn how to “cloak” words like Obama and Clinton. Cuz apparently the men in dark suits use Google and have no idea where the cultists are.", "1_Text": "What's a hook worm?", "2_Subreddit": "TopMindsOfReddit"}], "dwjgf40": [{"0_Comment Submission": "Texas woman sentenced to 5 years in prison for voting while on probation", "1_Text": "I think this pigment we shouldnt create false equivelancies.", "2_Subreddit": "politics"}], "dwl1hll": [{"0_Comment Submission": "NRA Board Member Ted Nugent Calls Parkland Student Activists Liars: 'They Have No Soul'", "1_Text": "Cuz singing seems to help a troubled soul", "2_Subreddit": "politics"}], "dwlovp6": [{"0_Comment Submission": "Top Mind explains how access to certain items could cause greater death tolls, but refuses to accept that access to certain guns leads to greater death tolls", "1_Text": "Arson means he'd know the most effective method to light a fire in a building designed to withstabd them with fire alarms, quicker response from first responders due to no need to assess the threat in the same manner as a shooter. The building would also be filled with fire extinguisher and trained in evacuation procedures.\n\nBomb making is not something you just learn from 10 minutes on the internet and is much more difficult. FBI tracks the purchase of most materials that can be used to make major bombs. The columbine shooters bombs failed with their attempt to detonate their bombs. It take much more preparation and the rudimentary bombs used by the recent bomber in Texas killed far fewer people.\n\nBut the supposition you seem to be making is that because people will still be able to kill people eliminating a tool designed specifically to kill people more easily won't make a difference and the obvious logical flaws in that argument should be self evident.", "2_Subreddit": "TopMindsOfReddit"}], "dwlu5f3": [{"0_Comment Submission": "Watch: In Unison, Sinclair’s Local Stations Denounce ‘One-Sided News Stories’", "1_Text": "Reagan was the top before boomers started noticing the decline in America. So of course they think he was good rather than the start of the problems that supply side economics amd corporatism have wrought upon us.", "2_Subreddit": "politics"}], "dwmu2zc": [{"0_Comment Submission": "The geniuses at T_D freak out over a video showing the same message being parroted by local news organizations, not realizing it comes from pro-Trump company Sinclair", "1_Text": "R/asktrumpsupporters has some people engaging, theyre constantly getting decimated with facts though. I can't understand how some people can still support Trump while claiming to want to think critically.", "2_Subreddit": "TopMindsOfReddit"}], "dwmuej8": [{"0_Comment Submission": "The geniuses at T_D freak out over a video showing the same message being parroted by local news organizations, not realizing it comes from pro-Trump company Sinclair", "1_Text": "To be fair I made this account because I was banned from TMOR here for saying that I thought the Quran's language lent itself to radicalization more easily than the bible. I said that because the Quran addresses adherents like o believers do this when speaking about violence where as the bible (outside of the commandments in levitcal law) was mostly set stories like Joshua's genocide of Caanan.\n\nSo basically because I thought the Quran had its own unique set of problems that reformers needed to address I was banned.", "2_Subreddit": "TopMindsOfReddit"}], "dwmujom": [{"0_Comment Submission": "The geniuses at T_D freak out over a video showing the same message being parroted by local news organizations, not realizing it comes from pro-Trump company Sinclair", "1_Text": "It really wouldnt hurt to just explain something since you wanted to mention it in the first place, if you're not going to go into detail nobody really has any reason to believe you.", "2_Subreddit": "TopMindsOfReddit"}], "dwmvrvn": [{"0_Comment Submission": "Top Mind explains how access to certain items could cause greater death tolls, but refuses to accept that access to certain guns leads to greater death tolls", "1_Text": "I pointed out how simply saying that Cruz could have killed more people via arson or bombs didn't account for the measures already in place to stifle those opportunities. It also doesnt account for how much more work and technical skill would need to be had to successfully accomplish his goal of killing via those methods.\n\nIt is much simpler and therefore much more accessible for more individuals to simply use a firearm if their goal is to easily kill people. This is why legislation regulating fire arms will help decrease overall deaths. \n\nLike I said it is logically flawed for you to assume that banning or regulating a device designed to make killing easy won't have an effect on the over all amount of people killed. \n\nA gun is a tool designed for killing, a nailgun is a tool designed to drive nails into things. If nailguns were banned houses would still be built, but they would be built more slowly with less nails driven over time. That's why firearm regulation has successfully decreased gun crime in most of the other countries that have correctly implemented it.", "2_Subreddit": "TopMindsOfReddit"}], "dwn1vii": [{"0_Comment Submission": "Top Mind explains how access to certain items could cause greater death tolls, but refuses to accept that access to certain guns leads to greater death tolls", "1_Text": "Listen man your long Gish Gallup of nonsense did nothing to take my points away and your hostile tone and ad hominem attacks really just make you look kind of sad and petty here, but it does tell me there isnt much point in continuing this discussion with you so feel free to respond after this but I wont. So I'm just going to make a couple of points here and if you really do consider yourself as someone open to thinking critically I'll let you walk away with your own conclusion.\n\nI really don't need to explain to you how decreasing access to a tool designed to make killing a simple point and click process can decrease deaths but I will anyway. Your wand analogy is so far off base its ridiculous. So aside from me just pointing out the lack of logic in it here are some in depth studies about how regulation helps decrease deaths. It also shows how assault weapons legislation has had a positive effect on limiting deaths in mass shootings debunking your statement that previous legislation had no effect.\n\nhttps://www.tandfonline.com/doi/abs/10.1080/13504851.2014.939367\n\nThat's from Marc Gius from Quinnepac University. Some of his previous studies have been touted by pro gun advocates for debunking other misconceptions about firearms so its hardly a biased or flawed source and the methodology and models for the study are well explained.\n\nFurther studies you can find from him will show that assault weapons bans do little to decrease overall gun violence but specifically decreases school shooting fatalities and injuries by more than 50%.\n\nNow as far as overall and more comprehensive gun control legislation lowering over all gun crime. Us Americans have both the most guns and the most gun related homicides, and homicides in general in the developed world. These two facts are very much related.\n\nHttps://academic.oup.com/epirev/article/38/1/140/2754868\n\nThis probably the most comprehensive study to date on the subject with sampling from 10 countries with 130 different studies. It shows without doubt that wide and varied measures from buybacks to more exclusive licensing measures all had a noticeable effect on decreasing gun crime.\n\nI could keep going dude but honestly you sound like some dumb teenager on the internet who got angry that he was wrong and shot back with a whole slew of piss poor projection so have a nice day.", "2_Subreddit": "TopMindsOfReddit"}], "dwn3fcx": [{"0_Comment Submission": "Pizzagate failed, so Top Minds tie (((Podesta))) emails to a child abduction. Their evidence: emails were sent the same day.", "1_Text": "What does Soros even pay you for bruh? Do your job properly /s", "2_Subreddit": "TopMindsOfReddit"}], "dwo3sra": [{"0_Comment Submission": "Top Mind of /r/JordanPeterson: \"The Holocaust was fake. The Jews were behind genocide in Russia. Jews are highly neurotic, low ethics, psychopaths, and that is responsible for their evictions from countries. They're descended from Khazars and not Hebrews at all. Oh, and Jews did 9/11.\"", "1_Text": "This is honestly how I've felt every time I see Peterson portrayed in this sub. I've yet to see any citation of his supposed alt-right rhetoric.", "2_Subreddit": "TopMindsOfReddit"}], "dwo3xpb": [{"0_Comment Submission": "Top mind states that Trump supporters are the punk movement of today", "1_Text": "Nazi punks fuck off", "2_Subreddit": "TopMindsOfReddit"}], "dwuop7w": [{"0_Comment Submission": "American conservatives are still clueless about the 97% expert climate consensus", "1_Text": "Damn that's crazy. Just goes to show the right knows how to propaganda. if someone in another country, who benefits from the same practices they're bemoaning in the, can side with this insanity then we really are fucked as a species,", "2_Subreddit": "politics"}], "dwvdfij": [{"0_Comment Submission": "Been craving IV cocaine something fierce.", "1_Text": "Heroin, cocaine and xannax together is the best high I've ever felt.", "2_Subreddit": "opiates"}], "dwvdxyh": [{"0_Comment Submission": "Regular top mind decides it's time to perform not-fascist warrant-free™ door-to-door searches in 'Commiefornia' to find aliens, which is justified despite amendment violations because we've been in a State of Emergency in 1979... • r/Republican", "1_Text": "Its called fascism sweety, look it up.", "2_Subreddit": "TopMindsOfReddit"}], "dwve3wf": [{"0_Comment Submission": "MLK would be considered an alt right extremist if he were alive today", "1_Text": "Ive noticed in your comment history youve also claimed to be a lawyer. Are you a finance lawyer?", "2_Subreddit": "TopMindsOfReddit"}], "dwvfo5v": [{"0_Comment Submission": "Why don’t top minds just ask Q to ask the GEOTUS what goes on at Epstein island?", "1_Text": "Pretty funny to talk about undisclosed wealth and then bring up Putin like he is the good guy.", "2_Subreddit": "TopMindsOfReddit"}]}], "1_submissions": [{}]}]}