{"nacho_bitch_": [{"0_comments": [{"dwubxsh": [{"0_Comment Submission": "Was given iron supplements for ferritin but have high serum iron", "1_Text": "I would suggest getting liver function labs, especially if you consume alcohol regularly or more than the average person.  The pain could be idiopathic (unknown cause) and could go away on its own. If the pain is persistent or worsens then you need to get it checked soooner. I am only a pharmacist, and all only trained in treatment, not diagnosis.", "2_Subreddit": "AskDocs"}], "dwuc2gn": [{"0_Comment Submission": "Low back pain", "1_Text": "Go to the hospital.  Running a fever for more than a couple days can be a sign of a more serious infection, such as a systemic infection.  Please take care. \n\nAlso... Why would you take Ambien for narcolepsy? That is counterintuitive.  My good friend has narcolepsy and nods off all the time unless she uses a stimulant, which kinda works.", "2_Subreddit": "ChronicPain"}], "dwuc4vq": [{"0_Comment Submission": "Welp, I told my dad..", "1_Text": "At least he didn't kill you. He is just reacting like he is because he loves you, and feels like he failed as a father.  Give him time. It's not all you, it's him too.  You did a great thing by telling him.  The hard part is over.", "2_Subreddit": "opiates"}], "dwuc9qb": [{"0_Comment Submission": "Can a 103.5 fever basically for the whole night cause brain damage??", "1_Text": "If you get over 104 that can be pretty bad, but I've seen it over 104, and people recover just fine. When you get into 106, that starts to become incompatible with life. \n\nEvery hear of Tylenol? It does this awesome thing called reducing fevers.  If that doesn't work, go to the hospital. Fevers occurs when there is infection.", "2_Subreddit": "AskDocs"}], "dwucf2x": [{"0_Comment Submission": "Feel like my brain can’t keep up with my mouth. I mix up my words often and unable to speak fluently. What is the cause of this and how can I fix it?", "1_Text": "Sounds like a manic episode or nerves. Should go see a psychiatrist", "2_Subreddit": "AskDocs"}], "dwucgyk": [{"0_Comment Submission": "Can the nerve in your ear be sensitive? If so is there a way to make it less sensitive?", "1_Text": "Start listening to really really loud music for extended periods of time, that should work.", "2_Subreddit": "AskDocs"}], "dwuckqq": [{"0_Comment Submission": "Awoken by bad breath?", "1_Text": "Do you eat or drink in the hours leading up to bed? Is the bad breath acidic at all? \n(I'm about to count sheep, sorry if I don't reply)", "2_Subreddit": "AskDocs"}], "dwucm02": [{"0_Comment Submission": "Awoken by bad breath?", "1_Text": "Do you eat or drink in the hours leading up to bed? Is be the bad breath acidic? \n\n(I'm about to count sheep, sorry if I don't reply)", "2_Subreddit": "AskDocs"}], "dwucmnh": [{"0_Comment Submission": "How do I get a prescription?", "1_Text": "You're welcome. I wish you the best!", "2_Subreddit": "AskDocs"}], "dwuct4z": [{"0_Comment Submission": "And they say they are hard to get .. 🧐", "1_Text": "Yes I did. I've got 3 herniations and tears, but my back surgeon said he is not sure that that is the cause of my pain. He said before he does surgery he wants to be 100% sure that is the cause.  Then I was thinking, crap do I have cancer again? Is it my hip? WTF? Life is on hold atm.", "2_Subreddit": "opiates"}], "dwud99q": [{"0_Comment Submission": "Is it possible that I have rhabdo?", "1_Text": "Rhabdomyolysis effects the entire body, like feeling like you worked out, but the whole body. It comes on for no known reason. It is highly unlikely that you have rhabdomyolysis, like the other commenter stated. It is very rare. You probably just overdid it, and being dehydrated didn't help your muscles out. If you are certain there is something wrong, go see medical attention.", "2_Subreddit": "AskDocs"}], "dwvgetg": [{"0_Comment Submission": "Low back pain", "1_Text": "Thanks for that info. I was not aware since I'm only experienced with my friends case.", "2_Subreddit": "ChronicPain"}], "dwvgjr9": [{"0_Comment Submission": "Low back pain", "1_Text": "Thanks. That is interesting info. I've only known one person with narcolepsy.", "2_Subreddit": "ChronicPain"}], "dwvgnz5": [{"0_Comment Submission": "And they say they are hard to get .. 🧐", "1_Text": "Sucks we are not alone!!", "2_Subreddit": "opiates"}], "dwvhp7m": [{"0_Comment Submission": "Fentanyl is 1000xs stronger than morphine...", "1_Text": "Didn't mean to piss anyone off. Like what I say or don't, just move on. It sucks that people are dying, so I'm adding my pharmacist knowledge. I don't appreciate being called names. I'm sorry you are dealing with addiction. I've been there and overcame it. I know fentanyl has a short half life, that it is what I stated... I know what it is like to chase a high. I'm no spring chicken.", "2_Subreddit": "opiates"}], "dwvi95p": [{"0_Comment Submission": "Awoken by bad breath?", "1_Text": "You could be having acid reflux. It is definitely hard to diagnose over the internet.", "2_Subreddit": "AskDocs"}], "dwvidu4": [{"0_Comment Submission": "Fentanyl is 1000xs stronger than morphine...", "1_Text": "What did you get your degree in? I hold a bachelor's in pharmaceutical science, a doctorate in pharmacy, and bachelor's in biology. I can get the actual citation if you'd like to challenge me.", "2_Subreddit": "opiates"}], "dwviens": [{"0_Comment Submission": "Fentanyl is 1000xs stronger than morphine...", "1_Text": "I am a woman", "2_Subreddit": "opiates"}], "dwvikoh": [{"0_Comment Submission": "Fentanyl is 1000xs stronger than morphine...", "1_Text": "There is a reason that fentanyl is dosed in micrograms and not milligrams like morphine.", "2_Subreddit": "opiates"}], "dwviy0j": [{"0_Comment Submission": "Fentanyl is 1000xs stronger than morphine...", "1_Text": "Believe whatever you want. The books I learned from to take my board exams must be based on lies. Why would you even give a flying fuck anyway? Doesn't make any sense to me if you care or not. Go ahead and do an extra strong shot for me... PLEASE, since I can't or I'll lose my license.", "2_Subreddit": "opiates"}], "dwvsidh": [{"0_Comment Submission": "This is going to clash with my outfit.", "1_Text": "Antibiotic resistance is MORE of any issue and how doctors overprescribe antibiotics and how doctors give too much antibiotics in the hospital!! In the not too distant future, bacteria will be resistant to everything!", "2_Subreddit": "ChronicPain"}], "dwxnh1x": [{"0_Comment Submission": "And they say they are hard to get .. 🧐", "1_Text": "I had a never study done yesterday, it was inconclusive, said my good leg was worse than my bad one.  The doctor did say she is certain it is not my back and think it's coming from my pelvis.  I'm getting a bone scan to look for cancer, and it that is inconclusive, either a PET/CT, or MRI of pelvis. All I know is I'm a mystery, and clinically not a textbook case.", "2_Subreddit": "opiates"}], "dwxnp1a": [{"0_Comment Submission": "This is going to clash with my outfit.", "1_Text": "I understand! With people trying to take away medicine that works for us. I say the addicts should go ahead and will themselves. I'm a former junkie, 10 years sober in March, and I would do almost anything. I've done drugs I didn't even know what they were. I'm surprised I'm not dead. I don't think junkies should prevent us from getting pain meds who use them responsibly for real pain. This country is fucked up.", "2_Subreddit": "ChronicPain"}], "dwxnyr7": [{"0_Comment Submission": "Fentanyl is 1000xs stronger than morphine...", "1_Text": "Thanks for not debating me. I didn't look in my textbooks, and really only work with diabetics in clinic, I just remember sufentanyl being used only for elephants and it was 10,000 xs as potent. The conversions for all opiates is never easy. That's why pharmacists do the conversions. I just hate hearing all the deaths, and was trying to be helpful not try to piss anyone off, or get bullied, which is what happened, so I deleted the post. I am a pharmacist and worked hard a fuck for my license.", "2_Subreddit": "opiates"}], "dwxot5q": [{"0_Comment Submission": "Fentanyl is 1000xs stronger than morphine...", "1_Text": "Never said I wanted you to die. What kind of ass hole judges someone and challenges them like you have? I really am a pharmacist and worked pretty fucking hard for my license. I work mostly with diabetic patients who want to learn how to control their diabetes. I was taught pain in a 3 week lecture series and have numerous textbooks that include pain. I have access to databases like lexicomp and micromedex, and have read numerous inserts, you fool. I'm not ashamed of myself. I look back to my junkie days and I'm glad I am not dead because I would put damn near anything in my veins, once I did ketamine, thinking it was speed, and nearly died. PhDs cannot write scripts in the US. Pharmacists will not fill scripts from a PhD, because they do not have prescribing rights, it is not in the scope of their practice. I'm not a dumbass. Sufentanyl is 10000x more potent than morphine, which is why it is used in elephants only. The books where you find this information are called under the classification of medicinal chemistry.  It is never a straight conversation either, but an estimate. I realize that my level of education is well above most on this page so I took down the post. It had good intention, since there are too many deaths, but people took it the wrong way and wanted to challenge me. If someone wants to do a drug that they are unsure if it's contents, by all means, go ahead. I used to. Just trying to help. It's my duty as a pharmacist to help others. I miss my days of doing strong shots and getting fucked up beyond belief and having no responsibilities, but those days are long gone. I cleaned up, finished my first bachelor's, then went to pharmacy school, graduated, got licensed, got an amazing job, and help people who want fucking help. Sorry you too it the wrong way and don't believe I goddamn pharmacist. Short if giving you license number, which is a hell no, fuck that, never will. Don't know what I need to do to prove to you that I was only trying to help. .", "2_Subreddit": "opiates"}]}], "1_submissions": [{"874i69": [{"0_Title": "Advice... anyone else hear these words, \"... I cannot guarantee the pain is due to your back...\"?", "1_Text": "I would suggest getting liver function labs, especially if you consume alcohol regularly or more than the average person.  The pain could be idiopathic (unknown cause) and could go away on its own. If the pain is persistent or worsens then you need to get it checked soooner. I am only a pharmacist, and all only trained in treatment, not diagnosis.", "2_Subreddit": "Sciatica"}], "88xex2": [{"0_Title": "Anyone ever use AceCBD?", "1_Text": "I would suggest getting liver function labs, especially if you consume alcohol regularly or more than the average person.  The pain could be idiopathic (unknown cause) and could go away on its own. If the pain is persistent or worsens then you need to get it checked soooner. I am only a pharmacist, and all only trained in treatment, not diagnosis.", "2_Subreddit": "CBD"}]}]}]}