{"pALADINmEOW": [{"0_comments": [{"dqsonpm": [{"0_Comment Submission": "Official Drink of the Jingle Jangle 2017", "1_Text": "To be fair, you have to have a very high IQ to understand this joke.", "2_Subreddit": "Yogscast"}], "drumnkj": [{"0_Comment Submission": "What quote has been etched into your brain from a video game?", "1_Text": "Scramble all fighters, repeat scramble all fighters", "2_Subreddit": "AskReddit"}], "ds10fqs": [{"0_Comment Submission": "I was there", "1_Text": "I know how you feel, my case may be not as serious, but having my best friend \"steal\" my crush despite me telling him weeks before they started going out, and him even pressuring me to ask her out and so on. Throughout the past 3 years they have been together, they fight every week or two and I'm always there for her. Just fucking sucks how at the end of it all their back together and happy, and I'm stuck with myself, alone again. \n\nHoping that your situation gets better man, here is to a better year.", "2_Subreddit": "offmychest"}], "ds10nqh": [{"0_Comment Submission": "Honestly it’s New Years and I’m absolutely gone as heck but I just want to say", "1_Text": "The Yogscast has quite literally being my childhood, waking up each day before school to watch their video. Living in Australia the main channel stuff is usually up around 5-6am. Through my horrible years of 2015-2016 I was able to sit down and binge watch their videos and momentarily feel better about my existence.\n\nI absolutely love the Yogscast and everything they do, its been a magical experience following them for the past 8 years, and I thank them for everything they have helped me through. \n\nI am Dave EXCLAMATION MARK yognau(gh)t, and I have the balls.", "2_Subreddit": "Yogscast"}], "ds11fv5": [{"0_Comment Submission": "I was there", "1_Text": "I'm happy for them, glad they can get through it all. It just kills me inside a little when I see them together, happy, on social media and whatnot", "2_Subreddit": "offmychest"}], "ds11idn": [{"0_Comment Submission": "A waitress smiled at me", "1_Text": "I get the same thing whenever I pay for stuff at the checkout, always wondering if you did something wrong or creepy and that why they smiled at you, or maybe they were genuinely happy with your presence.  \n\nI guess we will never know.", "2_Subreddit": "offmychest"}], "dspj7fd": [{"0_Comment Submission": "Please tell your kids that they’re enough", "1_Text": "Almost everyday I deal with hour long monologs with my father where he interogates me on why I'm not trying hard enough, or what my plan for life is, I'm 16, and going through my final year of high school. \n\nHe expects me to score above 80% in every subject, which I have been failing to achieve, thus leads him to unrest and frustration. Constantly being told that I'm an idiot, stupid, wasting my opportunities, that I have my \"mums genes\" instead of his. \n\nTo clarify also I'm not failing at school, actually doing quite well, just not at the level he wants me at. One year left of this, and its all only going to get worse.", "2_Subreddit": "offmychest"}], "dt1ygaz": [{"0_Comment Submission": "I feel like my only friends are the Youtubers I watch every day", "1_Text": "apparently its something called a relationship, google about it", "2_Subreddit": "depression"}], "dtxfocw": [{"0_Comment Submission": "Relic leaves Dawn of War 3 behind as it moves on to new projects", "1_Text": "They did screw themselves by turning the rts into a moba, honestly dawn of war one was brilliant, no clue why they didn't just use that as a foundation and add features and improve graphics.", "2_Subreddit": "CompanyOfHeroes"}], "dvbbw9z": [{"0_Comment Submission": "Some shitty sketch I did while watching the big bastard.", "1_Text": "The stoned eyes really add so much to his lmao", "2_Subreddit": "sips"}], "dvbku5h": [{"0_Comment Submission": "Drawing of Pyrion from Yogsquest", "1_Text": "Looks really good my dude!", "2_Subreddit": "Yogscast"}], "dvf9sq5": [{"0_Comment Submission": "Unsure how legal this is", "1_Text": "The legend", "2_Subreddit": "madlads"}], "dvf9swa": [{"0_Comment Submission": "Unsure how legal this is", "1_Text": "Himself", "2_Subreddit": "madlads"}], "dvi84m9": [{"0_Comment Submission": "What is something everyone knows, but no one wants to admit?", "1_Text": "Ruuuuuuuunnnning ouuuuuut aggggggaaaaaain", "2_Subreddit": "AskReddit"}], "dw6cf36": [{"0_Comment Submission": "What was ruined because too many people started doing it?", "1_Text": "Rick and Morty.", "2_Subreddit": "AskReddit"}], "dwo0u9h": [{"0_Comment Submission": "105 Days Clean", "1_Text": "If I was you I'll check out after prison show on YouTube, he has so many helpful tips for prison that might save you allot of trouble.", "2_Subreddit": "opiates"}], "dwo12eq": [{"0_Comment Submission": "Hello Friends.", "1_Text": "Well I still support you dude, it was a joke on April fools, and shouldn't be taken so seriously, as soon as I saw the post I knew it was fake. I support you dude and believe you should stay.", "2_Subreddit": "Yogscast"}], "dwo143j": [{"0_Comment Submission": "Mods", "1_Text": "I honestly I believe he should stay, as soon as I saw the post I knew it was fake, and he shouldn't be denounced for this slip up.", "2_Subreddit": "Yogscast"}], "dwozcf1": [{"0_Comment Submission": "Appreciation post for Sjins Trolling", "1_Text": "Sjins trolling is fun, but man does he make me rip my dick sometimes", "2_Subreddit": "Yogscast"}], "dwpvw17": [{"0_Comment Submission": "Music should become country-themed when entering rural areas", "1_Text": "Atmosphere my dude", "2_Subreddit": "projectzomboid"}], "dwsbk66": [{"0_Comment Submission": "When your three land mattress crews miss literally every model in a retreating ostruppen blob", "1_Text": "Regrouping for further offensives*", "2_Subreddit": "CompanyOfHeroes"}], "dwshbgl": [{"0_Comment Submission": "\"Is Weed Addictive?\" Shut the fuck up already.", "1_Text": "Easiest way to calm down is knowing that your argument won't stop people from saying otherwise, and you have literally wasted your time, as I'm wasting mine.", "2_Subreddit": "Drugs"}], "dwwd168": [{"0_Comment Submission": "Ring of Fire", "1_Text": "Invite me, for ∞ kek power.\n\nShadilay my dude.", "2_Subreddit": "CircleofTrust"}], "dwwd2te": [{"0_Comment Submission": "Whats everyones political affiliation here?", "1_Text": "Praise shadilay.", "2_Subreddit": "EscapefromTarkov"}], "dwwmunj": [{"0_Comment Submission": "Synthetic Marijuana Starterpack", "1_Text": "Its often noted that synthetic weed is more addictive than opioids", "2_Subreddit": "starterpacks"}]}], "1_submissions": [{"2wql7f": [{"0_Title": "GTA5 animals", "1_Text": "To be fair, you have to have a very high IQ to understand this joke.", "2_Subreddit": "Yogscast"}], "6bkc49": [{"0_Title": "Living in a non-legal state.", "1_Text": "To be fair, you have to have a very high IQ to understand this joke.", "2_Subreddit": "trees"}], "6gilfz": [{"0_Title": "Car ideas", "1_Text": "To be fair, you have to have a very high IQ to understand this joke.", "2_Subreddit": "projectzomboid"}], "7230v8": [{"0_Title": "Something Looks oddly familiar", "1_Text": "To be fair, you have to have a very high IQ to understand this joke.", "2_Subreddit": "h3h3productions"}]}]}]}