{"Nolahelpdetox": [{"0_comments": [{"dvv1rjr": [{"0_Comment Submission": "Random story", "1_Text": "I will say that unfortunately W ODed and died about 2 years ago leaving behind a 2 month old", "2_Subreddit": "opiates"}], "dvvzdrw": [{"0_Comment Submission": "Random story", "1_Text": "Done sorry", "2_Subreddit": "opiates"}], "dvw03ap": [{"0_Comment Submission": "Random story", "1_Text": "Little info on the woman.\n\nShe was honestly my first out of high school supposed to be \"adult\" relationship. Total whore. Anal on the table the first time we hung out girl. Attractive in a slutty way. Full probably $4k back piece tattoo buddhist related for no reason...lots more ink...in tattoo mags at one point. Super bisexual.  My slam piece. It all came at a price tho i would find out.\n\nI started to sell tar in a mainly ECP area after making a 7 hour round trip to pick up and bring back. They ate it up man and since i was new to the area she put me on this whoooooole group of people and i blew up.  She also introduced me to her mexi plug so really top to bottom she put me on.\n\nI got 14 dime singles of tar for 100 brought back to where i stayed i could sell each balloon for 25 really all the way up if i wanted. Raised my startup  capital by robbing her ex who was a dealer for 80 balloons one night  while he OD'ed. They claimed to be besties but she basically robbed this guy blind every single chance we got (we hung out alot) and even told him right after when we bout ran a train on his current girlfriend (Cs mom walked in thinking we were shooting up. No your daughter is munchin cat i got my dick in her mouth. Beautiful girl. Dead now). She told dude and i happened to be there in his room and he threw about 7g of tar on a cooking spoon and tried to do a mega shot and die. His new only few weeks in GF cheated on him with his whore ex whose supposedly  his best friend and satan (me). He did fall out i took all of the dope and cash hit him with 8mg of subs and when he was lucid i dipped. He got over it and they stayed together  until she passed. Edit: so i was always mad i didnt get to fuck that girl. I even let it slip to C that i was mad her mom ruined that and a HUGE fight ensued bc apparently she can initiate 3somes i just cant want it to happen or remember it fondly. Yes typical immature jealousy bs. Anyways. A couple years fast forward (as all you will find it ended i moved) C and the chick would come down to where i moved to and we had this amateur night strip club hustle where they would enter amateur night, id make it rain some singles hype em up to win like i didnt know em. Theyd pick up my drizzle money plus my enthusiasm usually made C win the other chick usually got 3rd which was 20-50 i think ANYWAYS thats not the point the point is i smashed and it was awesome sauce. She did wanna know if she gave better dome than C since they both dated the same guys and yeah C loses that one.\n\nOk hold on. I know i sound like a POS. And i was. But i didnt treat everyone like that. This was my current girls ten year ex BF and best friend.  Constantly surrounded by him and his friends and these  cats were mid to upper 20s emo band guys which is not my scene (idk what i am a hippie who wears polo. Really just a junkie). Every time they hugged and inside joked and did their thing jealous young buck me decided it was fair game to use and abuse the dude. I mean my chick orchestrated it. He was business competition as well. He was closer to the main clique but i could afford to pick up ten times what he did (same plug). I got sketched one week after mofos  kept falling out in my nice ass house  and enacted a  strict NO SHOOTING policy. He stayed over one night and had just re upped. Did a  shot i caught him warned him. Went to bed and woke up early to make a sale and he was nodded out on my couch (did a shot again) but had every single balloon arranged by color and in bundle count on my kitchen counter! Yes i took like 95 of the hundred bags and when he woke up freaking out i told him i had people in n out all morning why was he disrespecting my house fixing up again and leaving shit out like that. I mean that was a 2grand mistake lol. Yes i was a bad person...mostly to that guy tho. I gets my payback later.\n\nEdit: you must want to know about the dope! It was tar. Good tar. We were all heavy users and 3 singles .1 to .15 each was all the heaviest user could really do. I always gave W dope and 3 bags was fine but if i dropped a balloon and he found it and did 4 he went out. This stuff was gooooood. I was doing about ten bags a day. We had people close to us  half keys of 4mmc and we got really into shooting that shit in mass quantities. I would watch W do a half gram shot and his hips would stick up from the couch and he would hump the air uncontrollably while his eyes rolled into the back of his head and his jaw  so crazy he couldn't speak even tho he really wanted to tell u how awesome that shot was. You could redose the shit all night like coke. We had a party with like an oz out one time and this poor girl was too fuckef up to hit and i kid you not 6 spunions all surrounded her all with loaded bent ass used bloody rigs like eyeing her with one eye open offering to hit her like EEEEEK. Miss that shit bad.\n\nMe and W thought we were on our way to the top. Me and him lived in a 1br apt with sometimes up to 4 100lb professional german shepherd show dogs at a time. W went to work with his uncle every day and kept the clean act up and uncle rewarded us with a badasssss town home 250k plus we were renting to own basically.\n\nWe had a nicer house than we could have imagined at 21 and 22. He moved up  ranks at work and i had so much cash my high ass didnt even count it like i shouldve. Unlimited free dope for us. I ran a pretty tight ship and other than a couple bad OD scares during parties (one i will never forget was during a mephedrone rager that ruined me just getting glowstick number 2 in Cs ass. Had to rush dude to hospital with a car full of people whod been shooting crazy huge 4mmc shots ALL night. Me C and dudes friend end up in notoriously strict small town police station at 2am...i was only one coherent enough to say we found OD kid at a party no one would help so we good citizens saved him) we thought we had it going on. This is when C started to work her magic.", "2_Subreddit": "opiates"}], "dvwimwf": [{"0_Comment Submission": "Need help in nola", "1_Text": "Have a user saying he is going to help me out with a package tomo.\n\nThis subreddit is amazing. I wont name the user unless he gives me permission but he is amazing", "2_Subreddit": "kratom"}], "dvwjd1j": [{"0_Comment Submission": "Best RC benzo for a nasty opiate WD", "1_Text": "I am going to be in bad shape. I was worried diclazepam wouldnt pack the punch i would need.", "2_Subreddit": "benzodiazepines"}], "dw9wukc": [{"0_Comment Submission": "I’ll take WD over a heartbreak anyday", "1_Text": "Pains me to see dudes let some probably non  adult female run off with their nutsack\n\nIf its meant to be it will. People make mistakes smart people LEARN from them.\n\nChicks dig confidence. Hope yall are hiding your scars or your gonna be lonely", "2_Subreddit": "opiates"}], "dwhm60d": [{"0_Comment Submission": "Random story", "1_Text": "No one liked it", "2_Subreddit": "opiates"}], "dwhnghn": [{"0_Comment Submission": "My first junkie love SUPER LONG", "1_Text": "Anyways.\n\nWas doing pretty well moving tar but like i said i believe W started to get jealous that he had to work and i got to lay around and chill. \n\nSide note: W had hpv and didnt tell me for a long time. Basically had a wart on his dick. He was super embarassed and would only hook up with yellow pages escorts. This added to his attitude problem im sure. A couple chicks swore he was gay bc they threw themselves at him and he wouldnt smash.\n\nSpeaking of stds. So C caught herpes. She had this friend we would stay with sometimes when we would cop and she was a total whore. They were old friends and whored around together since teenagers. She was making fun of her before she introduced us (ya know, talking shit so i wouldnt think she was an option over my gf...typical jealous girl shit). Anyways she said she had herpes. Lo and behold we are at her house and they both try and start a threeway. Now thank the lord my dick would not get hard because girl was hot but my shit was comatose. I was kinda trying to hint to C to stop it but i guess she was super high and didnt think she would catch anything bc chicks pussy seemed fine. They broke out a double sided dildo and im sure that is what infected C. Sure enough just a few days later C has an outbreak and discharge had to go to ER. She was upset but more upset she had it and not me. This really killed our sex life bc obv i protected myself. What a dumbass.", "2_Subreddit": "opiates"}], "dwhom5s": [{"0_Comment Submission": "My first junkie love SUPER LONG", "1_Text": "C was engaged once before me. To a dude we will call A.\n\nSupposedly it was fairy tale type shit.\n\nUntil C stuck her nose in her neighbors business one day and got dude killed.\n\nApparently her and neighbor dude haf a bad relationship and one day the cops showed up there since dude was on probation. C seen the cops and walked next door and apparently was talking shit bc dude was going to jail. A commotion ensued and some how some way the neighbor guy got a hold of a tire iron  hit A once. A fell to the pavement and split his skull. Died three days later.", "2_Subreddit": "opiates"}], "dwhoy33": [{"0_Comment Submission": "My first junkie love SUPER LONG", "1_Text": "Im consolidating it and adding some new shit and gonna try and delete the first  bc the shit is out of order", "2_Subreddit": "opiates"}]}], "1_submissions": [{"854w04": [{"0_Title": "Need help in nola", "1_Text": "I will say that unfortunately W ODed and died about 2 years ago leaving behind a 2 month old", "2_Subreddit": "kratom"}], "856i12": [{"0_Title": "Random story", "1_Text": "I will say that unfortunately W ODed and died about 2 years ago leaving behind a 2 month old", "2_Subreddit": "opiates"}], "85d766": [{"0_Title": "Best RC benzo for a nasty opiate WD", "1_Text": "I will say that unfortunately W ODed and died about 2 years ago leaving behind a 2 month old", "2_Subreddit": "benzodiazepines"}], "883w95": [{"0_Title": "My first junkie love SUPER LONG", "1_Text": "I will say that unfortunately W ODed and died about 2 years ago leaving behind a 2 month old", "2_Subreddit": "opiates"}]}]}]}