{"JimmyTheSkinCLT": [{"0_comments": [{"dw558qq": [{"0_Comment Submission": "Undercard", "1_Text": "Saw Two Feet at Okee at the beginning of this month and he killed his set there. I'm digging him and if you get the chance to see him at Lolla, take it.", "2_Subreddit": "Lollapalooza"}], "dw55k1p": [{"0_Comment Submission": "Saints legend Steve Gleason released from Ochsner Medical Center", "1_Text": "God bless the Gleason family. Steve is one tough SOB! He’s overcome so much more in life than one should ever have to.", "2_Subreddit": "nfl"}], "dw66pmu": [{"0_Comment Submission": "Pick one.", "1_Text": "Money for life and I can take care of the rest, LOL.", "2_Subreddit": "opiates"}], "dw6ohku": [{"0_Comment Submission": "Meet and greets", "1_Text": "The fest will release a daily lineup as the date approaches.", "2_Subreddit": "Lollapalooza"}], "dw840lb": [{"0_Comment Submission": "Anyone else sick of the weather?", "1_Text": "Yes, where is this Spring they speak of?", "2_Subreddit": "NorthCarolina"}], "dwdwt5k": [{"0_Comment Submission": "I think I’m sick.", "1_Text": "Ask for help! Depending on how long, and how much you’ve been using your DOC, you could do a buprenorphine taper (via a doctor in your area that is able to write the prescription) or go to a local methadone clinic with the intent of doing a taper. If you aren’t in a stable place regarding your mental health issues, and fear that relapse is possible, you could always continue treatment with buprenorphine, or methadone, maintenance dosing, if needed. These options provide the least disruption to your personal and work life and your medical treatment is completely confidential. The alternative is to go to a detox center and come off your DOC with minimal medical intervention over the course of a few days (or attempt to wean off/use a DOC substitute, such as Kratom/go cold turkey at home but I was never successful with these methods, personally). Help is only a phone call away. Get on Google right now and begin your recovery journey. You can overcome your opioid use disorder. I got your back fam!", "2_Subreddit": "OpiatesRecovery"}], "dwdxm51": [{"0_Comment Submission": "I think I’m sick.", "1_Text": "If you go to a methadone clinic, no medical provider has to know that you were ever a patient that was prescribed methadone (some even offer buprenorphine now, if you prefer that medication). The daily dosed/take home medication isn’t entered into any state’s PDMP. The only way that your doctor would know this information is if you continued to see him/her in order to continue obtaining your narcotic prescription(s) and you happened to pop for methadone/buprenorphine after providing a random drug sample. Even then you wouldn’t necessarily have to admit to being a patient at a clinic but for somehow obtaining another opioid medication, you would sacrifice your current narcotic prescriptions, for sure, and have the failed drug screen entered into that treatment provider’s medical record regarding your history there. If you are trying to give up using, and get clean, then giving up the narcotic prescription(s) is the best bet, anyway!", "2_Subreddit": "OpiatesRecovery"}], "dwdy3e5": [{"0_Comment Submission": "Can I go to sleep on Subutex?", "1_Text": "You will be fine! Even if you are opioid naive, the fact that you are alert enough, more than 3 hours after insufflation, to type up a post on Reddit about this, assures me that you will survive this episode. I’m a longtime opioid addict, who worked for EMS in NYC, and I’m telling you that if you keep messing around with opioids, you may die, just not from the buprenorphine that you snorted 3 hours ago 😉", "2_Subreddit": "Drugs"}], "dweroom": [{"0_Comment Submission": "Can I go to sleep on Subutex?", "1_Text": "Shouldn’t last more than 24 hours. Buprenorphine has a long half life as it’s meant to hold a person, taking it as prescribed, 12-24 hours until their next dose (for opioid dependence or pain management). Usually any strong effect should wear off by around 12 hours, if that. You can have a “hangover” effect after using opioids but it’s nothing to worry over.", "2_Subreddit": "Drugs"}], "dwh616c": [{"0_Comment Submission": "Good pic of a trip painting I did.", "1_Text": "Are you selling it?", "2_Subreddit": "DMT"}], "dwh6d66": [{"0_Comment Submission": "Good pic of a trip painting I did.", "1_Text": "I’d love to purchase a print, whenever they become available ✌️Do you have photos of the two others as well? Just curious bc I love this piece you did!", "2_Subreddit": "DMT"}], "dwh6hmy": [{"0_Comment Submission": "Good pic of a trip painting I did.", "1_Text": "Awesome, thanks!", "2_Subreddit": "DMT"}], "dwk1ojs": [{"0_Comment Submission": "Need help making decision on mdma", "1_Text": "My question, exactly.", "2_Subreddit": "Drugs"}], "dwk2b9e": [{"0_Comment Submission": "Need help making decision on mdma", "1_Text": "Ok, thanks 🙏 I’m really sorry to hear about your friends and their experience, as well as what you went through. Being that you have their past situation on your mind, I think that you should put off rolling until you are in a different mindset. Personally, I prefer the right set and setting and from reading your post, I don’t feel that your current situation fits well with using. I also prefer to party with others who are partying and vibing with me but to each their own. If you know the people you will be with really well, and they’re cool peeps, and you know that you’ll be alright taking what you got then you know whether or not to go for it in an attempt to “feel good” or “feel better”. Just my two cents. Be safe and have fun no matter what you decide though! Let me know how it goes too, if you remember.", "2_Subreddit": "Drugs"}], "dwq2g1i": [{"0_Comment Submission": "Anyone use phenibut for opiate WD?", "1_Text": "I’ve used high doses of DXM and Loperamide for Methadone withdrawal somewhat successfully. Definitely takes the edge off but isn’t a cure all. Helped me to get through work though. My dose was 140 MG of Methadone (after coming off a 2.5g/day H habit and/or 300MG+/day Oxycodone habit) and I needed about 150 MG of the extended release DXM twice daily coupled with 15-30 MG doses of immediate release DXM every hour or two and about 20 MG of Loperamide twice daily to get through each day without my dose. I’d throw in 600-800 MG of Ibuprofen twice daily for good measure. At night, 1 pill of a Magnesium supplement would help with the RLS. I’m a 200 lbs 35 y/o male, if that helps somewhat. Sorry, if this isn’t what you’re looking for, but I’ve never used Phenibut during WDs. Definitely be careful as both DXM and Loperamide can cause tachycardia and Loperamide alone is cardiotoxic. I’m not sure of your health history so I definitely wouldn’t recommend following my regimen exactly as written. Hopefully, you will find what works best for you to get through whatever it is that you need to do. Sorry that you’re going to be sick, it always sucks to go through withdrawal. Good luck, and feel better soon!", "2_Subreddit": "opiates"}], "dwqncpy": [{"0_Comment Submission": "Anyone use phenibut for opiate WD?", "1_Text": "Sure is", "2_Subreddit": "opiates"}], "dwqyuev": [{"0_Comment Submission": "Anyone use phenibut for opiate WD?", "1_Text": "Delsym is the brand of extended release DXM and you’ll have to find the store brand (if you want to save some money) of Robitussin with only Dextromethorphan as the active ingredient.", "2_Subreddit": "opiates"}], "dws13sg": [{"0_Comment Submission": "Giving away two tickets to see the SOLD OUT Rainbow Kitten Surprise show on the 4th!", "1_Text": "Here here, may I have them, please?", "2_Subreddit": "Charlotte"}], "dws1870": [{"0_Comment Submission": "Methadone Tapering and Intestinal Pain", "1_Text": "Maybe regular doses of loperamide would help? That sounds awful, I’m so sorry!", "2_Subreddit": "opiates"}], "dwse4f6": [{"0_Comment Submission": "Methadone Tapering and Intestinal Pain", "1_Text": "I’m with you. Had been completely clean, relapsed, did subs, relapsed, now I’ve been on methadone for 6+ years and I see why they say “liquid handcuffs”. I just want to be free too!", "2_Subreddit": "opiates"}], "dwsf57k": [{"0_Comment Submission": "Livenation problems?", "1_Text": "Usually, you’ll hear arguments along the lines of the festival “sold out” to their corporate overlord. They are blamed for everything from increased ticket prices (not entirely their fault) to the more generic lineups of the past few years (partly their fault, although I’m pretty stoked about this year’s Roo lineup). I’m all for comfort as I age so the added money LiveNation brings to the table means upgrades are possible to infrastructure on the Farm (such as more flushable toilets, or campground upgrades like the barns this year). All in all, it’s really just the give/take of the festival scene these days so as long as the vibe and music keep bringing me back, I’m cool with Roo.", "2_Subreddit": "bonnaroo"}], "dwuf20n": [{"0_Comment Submission": "/r/Charlotte Random Daily Discussion - April 05, 2018", "1_Text": "RKS last night at the Underground just killed it! Brought down the house!", "2_Subreddit": "Charlotte"}], "dwuf6tk": [{"0_Comment Submission": "Dumb question RE pill", "1_Text": "Your symptoms sound like normal bodily reactions to a 5 MG Norco for someone who is opioid naive. You are “safe” as far as being alert and oriented enough to post on this sub informs me.", "2_Subreddit": "opiates"}], "dwufbwq": [{"0_Comment Submission": "I'am destroying my life because of alcohol", "1_Text": "AA/12 Step Meetings (if available) can be your saving grace! You have acknowledged your problem and can take steps to overcome your addiction and begin a life of recovery. Don’t ever lose hope! You can beat this, I believe in you!", "2_Subreddit": "Drugs"}], "dwuffpg": [{"0_Comment Submission": "Unpopular opinion: cannabis for the developing brain?", "1_Text": "I agree with this sentiment, exactly!", "2_Subreddit": "trees"}]}], "1_submissions": [{"7nb0sb": [{"0_Title": "Effed in MA", "1_Text": "Saw Two Feet at Okee at the beginning of this month and he killed his set there. I'm digging him and if you get the chance to see him at Lolla, take it.", "2_Subreddit": "Methadone"}], "7zpmfx": [{"0_Title": "Roo to Firefly ‘18", "1_Text": "Saw Two Feet at Okee at the beginning of this month and he killed his set there. I'm digging him and if you get the chance to see him at Lolla, take it.", "2_Subreddit": "bonnaroo"}], "7zps82": [{"0_Title": "Ride to Chobee from CLT area", "1_Text": "Saw Two Feet at Okee at the beginning of this month and he killed his set there. I'm digging him and if you get the chance to see him at Lolla, take it.", "2_Subreddit": "okeechobeemusicfest"}], "7zpzm4": [{"0_Title": "Tax Season Deaths", "1_Text": "Saw Two Feet at Okee at the beginning of this month and he killed his set there. I'm digging him and if you get the chance to see him at Lolla, take it.", "2_Subreddit": "opiates"}]}]}]}