{"Joltzzzz": [{"0_comments": [{"dhqebe8": [{"0_Comment Submission": "OxyContin OP 80s", "1_Text": "Of course you're going to have a percentage of fakers, it's inevitable. BUT, in my area hardly anybody can even find pills on the black market, the days of pill mills and free-flowing scripts are long over. 5-10 years ago they were everywhere. Today, that's not the case, pills are hard/impossible to find but H is everywhere. So, I'm guessing that the percentage of scripts being flipped for cash is pretty damn low and shouldn't be a major concern of yours. \nThat said, I'm a long-term pain patient, almost 10 years, and my scripts straight-up make my life livable. They don't kill the pain completely, just back it off enough to stop the suicidal thoughts. So, thanks for being one of the few MDs still willing to help cp patients. \nThe direction our country is going with treatment of pain is terrifying to ppl like me - ppl with debilitating 24/7 pain and no treatment options except for opioid therapy. Every day online I read posts from pain patients who can't find treatment and are left crippled considering suicide or street drugs. \nI'll add I used to \"party\" before I got sick, and I like to read this sub, but pain is a huge buzz-kill. Just trying to survive at this point.", "2_Subreddit": "opiates"}], "dhqjr53": [{"0_Comment Submission": "OxyContin OP 80s", "1_Text": "Hmmmm... your post got me thinking. Where r the black market/DNM pills coming from today? The OP in this post mentions a dboy; I've seen reports of ppl getting busted with thousands of pills in hand. That's not a diverted script, ya know? I personally think it's organised crime syndicates. \nBack in the day, my ppl got their stock from pill mills. Those are 100% gone now. You might have the odd, broke older person selling their script today, but every last addict I know who tried to work a doctor either failed to get a script or eventually got booted - failed UA, one too many lost/stolen scripts, just basic addict shit that eventually shows itself. \nI'm in a major city and black market pills are *really* hard to come by, my ppl still in the game have turned to H. Imo, the pill epidemic is and has been over. We now have a heroin epidemic, cause addicts are gonna addict regardless. Booze, pills, H, meth, it's been something since the beginning of time.", "2_Subreddit": "opiates"}], "dht7cz7": [{"0_Comment Submission": "Please call me", "1_Text": "Hoping you found a chat partner. <3\nThis is a inspirational and funny (I lol'd) video on choosing to stick around to make the best of this life. https://youtu.be/zIO4j4ze8Nc", "2_Subreddit": "opiates"}], "dht95rn": [{"0_Comment Submission": "Say What?", "1_Text": "Jeez, I'm sorry... I hope when/if I'm in your position I'll have the courage to make the same choice, to just to enjoy the time I have. I read somewhere that the majority of physicians make the same choice, too. To me, it makes perfect sense to spend our last days in a good way instead of sick from treatments no one expects will work. \nI have a chronic illness, for now not terminal, and I have a \"check-out\" plan should I ever need it. Morbid perhaps, but I do get where you're coming from. \nMuch love <3", "2_Subreddit": "opiates"}], "dhudzkq": [{"0_Comment Submission": "Tin foil hat for me?", "1_Text": "I've seen pics of US soldiers guarding the Afghanistan poppy fields and have read about CIA involvement in the drug trade... so, yes to govt involvement in heroin availability.\nBut the fent problem is most likely just individual people at all points in the chain making the decision to add it to increase profits. Fent is dirt cheap.", "2_Subreddit": "opiates"}], "dhue7yp": [{"0_Comment Submission": "Blew out top left foot during Sat Lunch break, thank Jesus I could still drive bike home (lied I was going for xray due to injury).... wonder if I could walk in to a clinic, claim injury, walk out with 30 pain pills and charge it to the company", "1_Text": "Once you \"charge it to the company\" drug testing gets involved. Pretty sure they don't pay if you test positive for *anything*...", "2_Subreddit": "opiates"}], "dhuo2rw": [{"0_Comment Submission": "Roughneck was my baby brother.", "1_Text": "Sorry for your loss, hoping you and your family find peace, much love to you all. RIP roughneck.", "2_Subreddit": "opiates"}], "dhyk1wy": [{"0_Comment Submission": "Kaiser's system of UA", "1_Text": "If you fail with most doctors, there might be a \"probation\" period where you're tested more frequently or you could be discharged from the dr.s care. Depends on the dr. I don't know anything about kaiser specifically. Good luck", "2_Subreddit": "opiates"}], "di6batb": [{"0_Comment Submission": "Post Apocalypse Junkie - Writing Prompt (Bored as fuck, sub is dead, everyone must be enjoying memorial day weekend)", "1_Text": "(This reminds me of r/ writingprompts. Figures the first prompt I contribute to is on r/ opiates, lmao)\n\nPart 1\n\n*Fuck me for always finishing my script early, god damn it why do I keep doing this to myself, I shouldn't be spending this money, I'm such an absolute fuck up*... the thoughts cut like daggers as I barrelled down the interstate to meet my dboy, Gavin, to grab a handful of pills to tide me over until my next script refill. \nI had tried to make it this month, really I had, but, same as every month, I ran out of pills early and the sickness had started it's inevitable creep. At 1am, I finally broke and I made the call, set up a pick-up, and now found myself on the 3am desolate, empty interstate, for the moment not another car in sight. I was busy beating myself up and longing for the relief a few pills would bring. \n\"Holy Shit! What the actual fuck is that!\" I shouted to my empty car as the entire sky suddenly lit up, a blue-tinted, bright light illuminated everything as far as I could see. The luminescent glow lasted almost 15 seconds, and then quickly faded and everything went dark. And, I do mean *everything* went dark... no streetlights, no ambient light from the houses that line the interstate... just nothing but darkness and the light of the sliver moon. I pulled to the side as my car started to putter to a stop. My first thought was \"goddamnit, how am I gonna get to Gavin's house now?!?\" My second thought was \"They better fix this shit quick.\" I naively thought it was some huge electric/internet grid outage that fried my car, but that it would be quickly repaired. I wasn't worried. Yet. \nI climbed out of my car and felt the crisp chill of the late night air, shivered and popped my trunk thinking I had an old sweatshirt in there... no luck, just my friend's forgotten golf clubs and an old box cutter. \nI looked slowly around, finally taking it all in. It was so unbelievably dark... and so unbelievably quiet. As an afterthought, I grabbed the box cutter and shoved it in my pocket. Then, I closed the trunk, locked the car and started walking. \nAs I trudged glumly along, miserable, I crafted my plan. I'd made this 150 mile trek many times and knew it well. I was thrilled to be only two miles out from Gavin's exit, and he lived in an old, beat-up neighbourhood close to the highway. By the time I hiked to his house and picked up, the power would be back up. I could deal with the car then, it probably just needed a jump. Not ideal, but definitely doable. \nI pulled out my phone to call Gavin and tell him I was gonna be late and to hold them pills. Much to my surprise, my phone was dead, too. Finally my mind strayed from the task at hand and I thought of something other than the pills. \nThis was an outage like none I'd ever seen. Cars, phones, lights, every.last.thing was off. There was no hum of cars and electronics in the distance, it was eerily quiet. \nAt that moment, I heard a long, high-pitched scream far off in the distance, it sounded human but I found myself deciding it was a coyote. I instinctively wrapped my hand around the box cutter, shivered, and picked up my pace to that of a slow jog... *god damnit*, Gavin better be fucking home and still holding.", "2_Subreddit": "opiates"}], "diil599": [{"0_Comment Submission": "I think theres a poppy plant growing out of my sink. WTF!", "1_Text": "Lol, it's Revenge of the Poppy. Wait til they start busting through the walls. \nBut, yeah, heads up, seeds down the sink is a no-no. My sister had the same idea and after a few months of seed build-up we had a plumber digging under our house.", "2_Subreddit": "opiates"}], "diilt0x": [{"0_Comment Submission": "Does your family judge you after rehab?", "1_Text": "People usually follow your lead. If you act weird and shifty about it, so will they. If you own it and are at peace w it (easier said than done,) they will be too. \nEither way, though, you gotta do you. If old Aunt Bertha gets her knickers in a knot over it at thanksgiving, try to just let it go, it's your life to live, not hers.", "2_Subreddit": "opiates"}], "dilg51e": [{"0_Comment Submission": "New Beginner", "1_Text": "Pretty sure it has a higher bioavailability orally. But, it's really the acetaminophen that should stop you from snorting it. I've seen a warning post here where a guy permanently wrecked his sinus cavities from acetaminophen.", "2_Subreddit": "opiates"}], "diop71p": [{"0_Comment Submission": "You know you're a junkie when..", "1_Text": "When you don't need an alarm clock because your body wakes you up like clockwork for your morning dose.", "2_Subreddit": "opiates"}], "dip2111": [{"0_Comment Submission": "FDA requests removal of Opana ER for risks related to abuse", "1_Text": "I don't think you'll change that guy's mind... he seems to believe he can't trust patients who report a significantly improved quality of life on opioid therapy, wtf? He is clearly someone who hasn't had his life touched by severe chronic pain. \nAs most patients with severe pain know, opioid therapy works, even long term. Chronic pain is extremely hard on the body and even damages brain functionality. It's simply cruel to leave people bed bound, depressed and suicidal when there is an alternative option available to allow that person some quality of life. \nThe updated guidelines desperately need further tweaking, lots of scientists and MDs have weighed in, here's a compilation of articles critiquing the guidelines: https://edsinfo.wordpress.com/2017/02/01/evidence-against-cdc-opioid-guidelines/", "2_Subreddit": "opiates"}], "dje8bwt": [{"0_Comment Submission": "hy everyone askin where I'm at...had a stroke from too many speedbslls...8 more monyhd in icu", "1_Text": "Wow, dude, sorry you're going through this. Stay strong, much love.", "2_Subreddit": "opiates"}], "djhlu1e": [{"0_Comment Submission": "I want something good to die for. To make it beautiful to live.", "1_Text": "It's not sad that she gets support from other family, it's a gift. The more people our kids can count on in their lives, the better. \nKids will choose different ppl first at different times for different things, lol. Who cares who's first today, ya know? As long as she knows you love her, you're good.", "2_Subreddit": "opiates"}], "djhm38o": [{"0_Comment Submission": "Another loss.", "1_Text": "He will be missed. RIP Tim.", "2_Subreddit": "opiates"}], "dkcv6gh": [{"0_Comment Submission": "hi, its me, one post then im gone, it gets alot worst for vae", "1_Text": "Horrible news, Vae, so so sorry. RIP Lu, you will be missed.", "2_Subreddit": "opiates"}], "dkgixuu": [{"0_Comment Submission": "Stole Grandma's Pain Meds", "1_Text": "Really, it sounds like you've been buying them for awhile, so granny must know her scripts go missing. I'm guessing she gets a cut of the money or she would've locked them up months ago. \nAll you have to go on is guesses. You didn't see the label, granny might've been pissed he was selling his scripts, not hers. If they are hers, she might be getting some cash, she might be in pain and mad they're gone. Whichever scenario, you have no way to know. \nWay too risky to you to try and return them.", "2_Subreddit": "opiates"}], "dl4uw3s": [{"0_Comment Submission": "Doctor here, want to ask you guys a question.", "1_Text": "You mention that giving them an opiate in the hospital isn't ethical because they will stay addicted. Ethical interpretations vary... I believe it's not ethical to leave them in pain, suffering a life threatening illness, withdrawing to the point that they knowingly risk death and leave in a sad and desperate attempt to stop the horrific pain of withdrawal. \nYou have multiple solutions at hand - low dose opiates, suboxone, methadone - that would not get them high, but would alleviate their pain, reducing stress on the body and allowing time for their body to heal from infection. It makes zero sense to force them out to find pain relief. \nI believe by withholding addiction treatment or maintenance while in the hospital, you are leaving the patient in pain, incredibly stressing their already infected body and forcing them to seek relief - *relief*, not a high - elsewhere. How on earth is that ethical? Please reconsider your definition of ethical treatment in these cases or at least on a case by case basis.", "2_Subreddit": "opiates"}], "dmv7x05": [{"0_Comment Submission": "Can someone explain to me what a buzz from Imodium feels like?", "1_Text": "People don't take it for a buzz. It has no buzz, but stops some opiate withdrawal symptoms, so some ppl will take it to lessen withdrawal even though it's risky to the heart.", "2_Subreddit": "opiates"}], "dvmoq2v": [{"0_Comment Submission": "Found a bottle of percs, JJ has blessed me", "1_Text": "Pretty sure kratom has a stronger hold on brain receptors than opis and can act as a blocker. If you can give it time for kratom to cycle off a bit, you'll pbly feel it more. Amazing find!", "2_Subreddit": "opiates"}], "dvn0ivd": [{"0_Comment Submission": "Crohns pain. All these pills and I’m scared to become an addict. I love the high so I stopped.", "1_Text": "My pm doc explained it to me like this:  the rate of addiction in cp patients is low, less than 10%. (article citing addiction rate: https://www.ncbi.nlm.nih.gov/pubmed/25785523/) Pain is far harder on the body than meds are, w pain causing increased stress, blood pressure, heart rate, brain changes, depression, on & on. \nImo, don't feel guilty for using all available tools to reduce pain, it's what you need to do to stay healthy. That said, of course keep an eye out for signs of addiction like finishing meds early, etc. If you have 2 months saved up you're in good shape right now.", "2_Subreddit": "opiates"}], "dw13vnn": [{"0_Comment Submission": "Does Kratom Block Oxy?", "1_Text": "I've heard it does, that they both effect the same receptors and that kratom has the stronger attachment, blocking the oxy. Hopefully someone will chime in w a source.", "2_Subreddit": "opiates"}], "dwq27x2": [{"0_Comment Submission": "Variety packs are always nice 😎", "1_Text": "Taste the rainbow", "2_Subreddit": "opiates"}]}], "1_submissions": [{}]}]}