{"GDSGFT2SCKCHSRS": [{"0_comments": [{"dvqmnu1": [{"0_Comment Submission": "TIL Frankie Muniz suffers from long term memory loss and doesn't even remember being on Malcolm in the Middle.", "1_Text": "The Fresh Maker?!", "2_Subreddit": "todayilearned"}], "dvqn7jf": [{"0_Comment Submission": "Country/Folk singer songwriter Woody Guthrie once wrote a song about his contempt for his landlord, Fred Trump, father's of President Donald Trump. In his song, Guthrie accuses Fred Trump of intentionally stirring up racial tension for his own profit.", "1_Text": "I thought all turtles were ninjas up until just recently and sadly im almost in my 40's.", "2_Subreddit": "Music"}], "dvqo8w3": [{"0_Comment Submission": "Seriously, what is he doing?", "1_Text": "You think if there was a Drill Instructor aboard The Enterprise that he would make that random crew member smoke Space Meth? Because that kind of focused \"Noodle Grooving\" can only be the result of ultra premium Space Meth", "2_Subreddit": "funny"}], "dvrc034": [{"0_Comment Submission": "Reddit, what is something that you can't believe is actually a REAL thing?", "1_Text": "Happy CockDay!", "2_Subreddit": "AskReddit"}], "dvvivkm": [{"0_Comment Submission": "What's the most WTF scene in an otherwise normal movie?", "1_Text": "He was a loner a rebel.", "2_Subreddit": "movies"}], "dvvixqb": [{"0_Comment Submission": "Country/Folk singer songwriter Woody Guthrie once wrote a song about his contempt for his landlord, Fred Trump, father's of President Donald Trump. In his song, Guthrie accuses Fred Trump of intentionally stirring up racial tension for his own profit.", "1_Text": "I don't make monkeys, I just train them.", "2_Subreddit": "Music"}], "dvvs8pe": [{"0_Comment Submission": "TIL Frankie Muniz suffers from long term memory loss and doesn't even remember being on Malcolm in the Middle.", "1_Text": "That's not how I remember it being spelled.", "2_Subreddit": "todayilearned"}], "dwabvrb": [{"0_Comment Submission": "Nerd in the 80s", "1_Text": "Currently:Billionaire", "2_Subreddit": "OldSchoolCool"}], "dwadirg": [{"0_Comment Submission": "How to open aluminium lock with gallium", "1_Text": "Who has 4 hours? Fuck going to Mount Olympus to get some gallium when you can just smack it with that hammer.", "2_Subreddit": "LearnUselessTalents"}], "dwag9h0": [{"0_Comment Submission": "Do insects have muscles? If so, are they structurally similar to ours, and why can some, like ants, carry so much more weight than us proportionally? If not, what to they have that acts as a muscle?", "1_Text": "I love the use of the little known Wu-citation.", "2_Subreddit": "askscience"}], "dwakluf": [{"0_Comment Submission": "If you died at this very moment, what would be in the loot crate you would drop?", "1_Text": "Aaaand now you have AIDS.", "2_Subreddit": "AskReddit"}], "dwbed5f": [{"0_Comment Submission": "350 pounds difference between these photos of my face. Same Chrysler 300.", "1_Text": "I never thought someone would view the massive weight loss that emaciates a person when they atr suffering from AIDS as a good thing.", "2_Subreddit": "mildlyinteresting"}], "dwc8v71": [{"0_Comment Submission": "Brother has first degree possession and paraphernalia charges in KY. Anyone gotten these charges before? What’s the outlook?", "1_Text": "Bleak, it's all a downward spiraling clusterfuck composed of terrible mistakes and unbearable regrets on a scale you had previously been convinced were only for other people and could never and would never befall you... But there you are a totally beat to shit shell of the person you once were. It's gonna be great. Enjoy.", "2_Subreddit": "meth"}], "dwcr49h": [{"0_Comment Submission": "Meth fingertips", "1_Text": "Put them in sleeping childrens asses.", "2_Subreddit": "meth"}], "dwdirov": [{"0_Comment Submission": "Meth fingertips", "1_Text": "What's the big whoop? It's a old fashioned home remedy that actually works like a charm. If you find yourself peaked&geeked with a nasty case of meth fingers and there's no Vaseline or Valvoline or Tiger Balm handy the healing and restorative properties of a adolescents rectum work wonders in a pinch...not to mention the results will blow your mind. I mean for the love of all things kosher, I watched a Rabbi put his mouth on a infants bloody penis in a room full of people and nobody tripped out as a matter of fact they seemed overjoyed. But if I have a pesky case of meth induced haggard hand and try and finger slam a random youngsters tiny ringpop everybody wants me to register as a sex offender and wear a swimsuit when I'm in a public pool. I try and tell them I'm naked bcuz it's a hot summer day and I am unashamed of my gargantuan erection. I have been keeping shit 100% since I've been measuring meth per cent. And you still couldn't see me even if I was on TV in 3D, and futher more you couldn't see me even if you scheduled an appointment for that matter. And I'm gone Gaundi and done Dundy. \n\n\n\n/S\nFor the official record I have never and do not encourage nor do I recommend that anyone should attempt to digitize any children's arsehold...unless your absolutely positive you can get away with it, in that case spit on your flanges like your name is Oral Hershizer!", "2_Subreddit": "meth"}], "dwdpvla": [{"0_Comment Submission": "Meth fingertips", "1_Text": "Oh, is that how you feel? Who's gonna make me shut up? You and what--Armenian Genocide was an unfortunate combination of lack of preparation for war and just the opportunist Turk's siezing upon that vulnerability...wait a minute what are we talking about? I think I was just asleep...fuckmylifelesscorpes.", "2_Subreddit": "meth"}], "dwf1tkz": [{"0_Comment Submission": "Cat-cher", "1_Text": "Of course she's crafty and clever, she's AI. She reminds me of of a real life version of that futuristic, sexy, Ghost In The Shell chick if instead of being a dedicated crime fighter she was instead a lifelike half cyborg half mobile semen desalinisation plant. All bullshit aside, she is a recent member to the...\n\"Im only gonna suck the cock of every strange man that waves 15 quid in my general direction temporarily...or until I'm able to get the best of this crippling cocaine addiction Club\"", "2_Subreddit": "gifs"}], "dwfmiln": [{"0_Comment Submission": "Lurking in the shadows", "1_Text": "\"!redditsilver\"", "2_Subreddit": "WTF"}], "dwgtrop": [{"0_Comment Submission": "[NSFW] yeah, even I didn’t see this coming...", "1_Text": "The Freshmaker?", "2_Subreddit": "Unexpected"}], "dwn5n3s": [{"0_Comment Submission": "Oxy got me laid last night", "1_Text": "Can confirm. I am the \"hot chick\" he is referring to in the story...aaaaaaand I'm a guy.", "2_Subreddit": "opiates"}], "dwpd91y": [{"0_Comment Submission": "Found this review while looking at reviews for back massagers on Amazon.", "1_Text": "Fuck that fat sneaky walrus, your brother and his hoe.", "2_Subreddit": "trashy"}], "dwr7d91": [{"0_Comment Submission": "Possible active shooter at Youtube in San Bruno", "1_Text": "Ugliness? You want to see things get ugly? Shit will get down right hideous if my YouTube Red service is interrupted.", "2_Subreddit": "news"}], "dwu3rc1": [{"0_Comment Submission": "🔥 Albino rhombic egg eater eats an egg", "1_Text": "Wow, believe it or not I used to know this chick who did something kinda simular.", "2_Subreddit": "NatureIsFuckingLit"}], "dwxjy6s": [{"0_Comment Submission": "Need info if you have it", "1_Text": "\"I'm not funny today Papa Joe... I uh...\" \n\"Finish the joke.\"", "2_Subreddit": "UFOs"}], "dwyd80x": [{"0_Comment Submission": "Time travelers cheat sheet", "1_Text": "Half life something, something...hilarity ensues.", "2_Subreddit": "interestingasfuck"}]}], "1_submissions": [{"76xkze": [{"0_Title": "He says his safe word is \"pineapplejuice\".", "1_Text": "The Fresh Maker?!", "2_Subreddit": "videos"}], "76xoqa": [{"0_Title": "He says his safeword is \"pineapplejuice\".", "1_Text": "The Fresh Maker?!", "2_Subreddit": "WTF"}]}]}]}