{"AKABrokenArrow": [{"0_comments": [{"dk1n4et": [{"0_Comment Submission": "Going to rehab tomorrow", "1_Text": "I saw that show too at Roseland in NY. Pearl Jam were handing out cassettes of their best songs. Great show. I didn't know who the openers were either!\n\nGood luck OP. I got 13 months, you can do it too.", "2_Subreddit": "opiates"}], "dk4r56t": [{"0_Comment Submission": "Checking in on /u/zeeryero", "1_Text": "I thought he was cool too. Hope you're doing ok, wherever you are.", "2_Subreddit": "opiates"}], "dk7ulqc": [{"0_Comment Submission": "Trial Separations", "1_Text": "My wife wanted to separate after my affair. I refused to participate in a \"trial divorce\" so I told her to call her lawyer and continue with divorce proceedings if she wanted me to go. Separation is not recognized by my state.\n\nThat was about 18 months ago and it feels like we are just starting to come out the other side of this. There's still a ton of work to be done on both our parts and I'll never give up.", "2_Subreddit": "survivinginfidelity"}], "dkbjhzt": [{"0_Comment Submission": "Just copped some fire Opana. I payed $50 for this, it is a 40mg tablet. How much should I take to get a solid buzz?", "1_Text": "I recommend you cut this in half and snort it thru a twizzler. That's how I used to do these. The twizzler adds at least 3% to the bioavailability.", "2_Subreddit": "opiates"}], "dkgofws": [{"0_Comment Submission": "Mercedes sells a 2018 C63 S too early and demand it back", "1_Text": "This dude obviously has never faced any real hardship in life. Give me a break.", "2_Subreddit": "cars"}], "dkgzk1g": [{"0_Comment Submission": "Mercedes sells a 2018 C63 S too early and demand it back", "1_Text": "I hear you and as an enthusiast I feel for his situation. He's going about it all wrong, though. Take the cash back, take the SL63 and have an awesome summer vacation in it. Fuck I'd drive that bitch to Vancouver and back, put 50,000 miles on it. I watched the whole video but it wasn't easy. Jeez.\n\nMy family was of modest means too growing up and I have some money now. I don't see myself ever acting this way about a car. And I love cars. The hospital botched my brothers cancer treatment? Maybe. The fire dept. came to my burning house and stood around and laughed instead of putting the fire out? Sure.", "2_Subreddit": "cars"}], "dkibo9t": [{"0_Comment Submission": "What depreciated luxury car do poor people buy, without knowing what they're getting into, that makes you think \"they're in for a rude awakening?", "1_Text": "Any car with ceramic brakes.", "2_Subreddit": "cars"}], "dkibsw5": [{"0_Comment Submission": "Anyone else seen Cars 3?", "1_Text": "Took the kids to see it last weekend. My daughter didn't want to go but she enjoyed it. I liked it too, I usually zone out when I go see kids movies but this one held my interest throughout.", "2_Subreddit": "cars"}], "dkkiutw": [{"0_Comment Submission": "To what degree should our children factor into the big decision?", "1_Text": "I don't have any advice, divorce is a personal decision that you have to make on your own. I've been fighting one for a year and a half now and I have never, ever once mentioned our 7 yo twins much less brought them into our mess. It's between me and my wife and if we make it through this, we'll do it for each other. Your wife is a monster for doing that and her actions can potentially scar your child for life. I'd want out too.\n\nOf course the kids are a factor but I'm doing all I can to protect them from our shitstorm.", "2_Subreddit": "Divorce"}], "dkm6fcp": [{"0_Comment Submission": "RIP zeeryero/MSTRSLFDSTRKT", "1_Text": "I don't interact with many people here but me and zeeryero had a few exchanges and he seemed like a good dude. Sad day. RIP. My sympathies to family and friends.", "2_Subreddit": "opiates"}], "dlgpgb8": [{"0_Comment Submission": "Right now Volvo is offering $23,500 OFF Leftover 2017 XC90 T8 Excellence Models - essentially 22% off a car to clear out old volume", "1_Text": "I have a 10 yo XC90 V8 purchased new. I've put about $18k into it in repairs over the years. Now's my chance to get it back!", "2_Subreddit": "cars"}], "dma7noq": [{"0_Comment Submission": "Got my new car the other day, and oh how I love it", "1_Text": "Nice, man! I had one as a loaner a while back. I liked it more than I thought I would. Good luck!", "2_Subreddit": "cars"}], "dma7tn6": [{"0_Comment Submission": "Any Love For a Newer Cuda'?(Challenger w/kit)", "1_Text": "I like, esp in B5 blue!", "2_Subreddit": "cars"}], "dnkxwxo": [{"0_Comment Submission": "How shooting dope led me to a fulfilling career.", "1_Text": "Shut your fuckin face, grandpa fucker!!!!", "2_Subreddit": "opiates"}], "do7qz1b": [{"0_Comment Submission": "Adults of Reddit, what Mistakes can I avoid now as a 16 year old?", "1_Text": "Don’t ever cheat on your wife/girlfriend. Be a man of high integrity.", "2_Subreddit": "AskMen"}], "do9xu36": [{"0_Comment Submission": "Why can't I be more motivated to reconcile for the sake of our kids?", "1_Text": "I'm sorry to hear this. I am in the almost exact same situation except that we are coming up on 2 years out. It's exactly as you describe it, some days good and some days/weeks bad. I don't think she'll ever forgive me but she does still love me as of today. I can't live like this forever and something has to give. She refuses any help/therapy/meds and I can't help her. \n\nI'm giving it the time I think we need to heal but I may face a very difficult decision somewhere down the road.", "2_Subreddit": "survivinginfidelity"}], "dpvv6fc": [{"0_Comment Submission": "Who’s ready for 🐼!!!! And oxy to boot!!!!", "1_Text": "Oh man I had scripts for that combo for years. It didn’t end well but it did end, eventually. Enjoy! Living vicariously through Reddit.", "2_Subreddit": "opiates"}], "dq0y335": [{"0_Comment Submission": "Officially 1 year", "1_Text": "Good for you! Coming up on 18 months myself. Life does get better but it doesn’t happen overnight.", "2_Subreddit": "opiates"}], "dsxayw9": [{"0_Comment Submission": "God I love how the R dials look like watches in a display case", "1_Text": "My XC90 Sport has that cluster. One of my favorite parts of the car.", "2_Subreddit": "Volvo"}], "dtk7k91": [{"0_Comment Submission": "Ruby’s BBQ Set to Close", "1_Text": "I’ve been here just over 12 years as well. I was never crazy about Ruby’s. Sad to see all the old places close, though.", "2_Subreddit": "Austin"}], "dunu827": [{"0_Comment Submission": "Really want to get off Bupropion ASAP, but my doctor isn't available for 2 weeks. Am I stuck?", "1_Text": "I recently tapered off of my Zoloft and I didn't even talk to my doc.  I called his office and left a message with his PA. She called me back the next day with a tapering schedule that has worked great so far.\n\nGood luck! I believe that part of taking an antidepressant is knowing when to stop (if you can, of course).", "2_Subreddit": "antidepressants"}], "dv8eg1x": [{"0_Comment Submission": "Hi y’all ~ weight gain/sex drive post", "1_Text": "It did affect my sex drive and it made me gain weight. Sorry! I took it for about 8 months and stopped it for good last week. I was only on 50mg so little to no withdrawal. It did help my mood, however but I'll take my chances. Good luck.\n\nGood luck.", "2_Subreddit": "zoloft"}], "dva54vh": [{"0_Comment Submission": "Noel in Austin at ACL Live last night", "1_Text": "Great show, wish he stayed for 2 nights.", "2_Subreddit": "oasis"}], "dvkskcj": [{"0_Comment Submission": "Zoloft and Wellbutrin", "1_Text": "I did for about 8-9 months or so but I just stopped the Zoloft because I no longer wanted the side effects. I put on some weight which made me snore which made my wife not want to sleep in the same bed anymore. I had some sexual side effects as well which I didn't appreciate. I'm still taking Wellbutrin. Good luck!", "2_Subreddit": "antidepressants"}], "dwu3hrr": [{"0_Comment Submission": "And they say they are hard to get .. 🧐", "1_Text": "Same here man, I’ll have 2 years next month and I still stop by here a few times a week. It doesn’t bother me, I get high vicariously through you guys lol. Congrats on 6 months, that’s awesome. I think the first 6 are the hardest. Good luck to you.", "2_Subreddit": "opiates"}]}], "1_submissions": [{"6e30tr": [{"0_Title": "One year clean", "1_Text": "I saw that show too at Roseland in NY. Pearl Jam were handing out cassettes of their best songs. Great show. I didn't know who the openers were either!\n\nGood luck OP. I got 13 months, you can do it too.", "2_Subreddit": "OpiatesRecovery"}], "7f5g9o": [{"0_Title": "I take Ginkgo Biloba for memory but sometimes I forget to take it.", "1_Text": "I saw that show too at Roseland in NY. Pearl Jam were handing out cassettes of their best songs. Great show. I didn't know who the openers were either!\n\nGood luck OP. I got 13 months, you can do it too.", "2_Subreddit": "Showerthoughts"}]}]}]}