{"Dick_Gozinia": [{"0_comments": [{"dwvvz3m": [{"0_Comment Submission": "Some ECP. Strong vinegar smell and good rush compared to the normal fent dope.", "1_Text": "That's been my experience as well", "2_Subreddit": "opiates"}], "dwvw1yr": [{"0_Comment Submission": "Holy Trinity, last of my OC 80, charlie rock and 2× 2mg clonazepam", "1_Text": "Cocaine rush can make people puke on its own. A fat IV dose of girl has always made my stomach twist", "2_Subreddit": "opiates"}], "dwvw5i5": [{"0_Comment Submission": "Why My Nose?", "1_Text": "Lmfao I can get that after a single full day of using.", "2_Subreddit": "opiates"}], "dwvx32p": [{"0_Comment Submission": "What do y’all think?", "1_Text": "I found no difference in brand name vs generic Vicodin", "2_Subreddit": "opiates"}], "dwvygns": [{"0_Comment Submission": "!!! Approaching 72 hours !!! (If you want to quit, you can. That’s the ONLY way)", "1_Text": "If you made it 61 hours with nothing m, why did you use that bupe? Seems like you made it halfway through the detox with nothing.", "2_Subreddit": "opiates"}], "dwvz8qs": [{"0_Comment Submission": "I’m leaving Saturday", "1_Text": "I've found it to be immensely easier to detox in a medical setting. My symptoms were much more managed and easy to tolerate plus I knew caving would be more difficult", "2_Subreddit": "opiates"}], "dww15i6": [{"0_Comment Submission": "What do y’all think?", "1_Text": "Yeah when I was getting them, it didn't much matter to me cause my tolerance was low enough that the APAP wasn't a problem. I got norco 10s when my pill habit was bad then switched to dope months later", "2_Subreddit": "opiates"}], "dww2bpk": [{"0_Comment Submission": "What do y’all think?", "1_Text": "If and when you wake up dope sick The last thing I wanted to do was put something in my mouth. Always made me gag", "2_Subreddit": "opiates"}], "dww3z3c": [{"0_Comment Submission": "Afternoon treat! A fat point! And I'm so sick (not for long!)", "1_Text": "I just don't know why the fuck OP isn't clearing this debate up 😂", "2_Subreddit": "opiates"}], "dww4c8e": [{"0_Comment Submission": "What do y’all think?", "1_Text": "Haha yup", "2_Subreddit": "opiates"}], "dww5l00": [{"0_Comment Submission": "Who got the link of the post about the guy claiming he's in Afghanistan or somewhere in Iraq or something about him and 10 other Muhammad's cooking up dope from start to finish. It was like a 30 pic Imgur link.", "1_Text": "That was just an erowid guide. He was trolling and just copy pasta'd it", "2_Subreddit": "opiates"}], "dww6ojr": [{"0_Comment Submission": "!!! Approaching 72 hours !!! (If you want to quit, you can. That’s the ONLY way)", "1_Text": "Ahh that's understandable. You were taking the pills whole?", "2_Subreddit": "opiates"}], "dww773g": [{"0_Comment Submission": "YOU GUYS WANNA KNOW HOW TO MAKE BIG BUCKS LIKE ME? I made this in just one week!!! I hope my dboy takes ones......", "1_Text": "Yeah but just think lots of people call him for 20 a a time frequently. To most of these guys money is money", "2_Subreddit": "opiates"}], "dwwaoxa": [{"0_Comment Submission": "Today’s pick up", "1_Text": "That's a fine looking chunk of girl there man. I'd need at least 5 bags of pins for that and I'd still be using each syringe like 3-4 times lol", "2_Subreddit": "opiates"}], "dwwr3m3": [{"0_Comment Submission": "My dick after 3 days off opiates", "1_Text": "Yeah so the first time having sex after coming off opiates, lasts about 20 seconds lol. It's super destructive to self esteem", "2_Subreddit": "opiates"}], "dwwr5vs": [{"0_Comment Submission": "My dick after 3 days off opiates", "1_Text": "Ejaculating from a half erect penis is definitely fucking weird haha", "2_Subreddit": "opiates"}], "dwwugq0": [{"0_Comment Submission": "My dick after 3 days off opiates", "1_Text": "Haha it's incredible what happens to libido after cessation of opiates. What makes it even worse is getting off opiates and using anabolic steroids...you have no idea what an absolutely absurd sex drive is until you go from suppressed libido to supercharged haha. Problem is, my 7 year heroin addiction fucked with my bodies sensory system and I still haven't regained complete control over climax. Sometimes I can seem to hold off fine, but mostly it causes extremely fast orgasm. I'm pretty sure getting clean from an opiate addiction is a common cause of premature ejaculation.", "2_Subreddit": "opiates"}], "dwwvsf3": [{"0_Comment Submission": "My dick after 3 days off opiates", "1_Text": "Wonder if it's the same for women? Like do you think it takes them like 3-4 minutes instead of however long it ususally takes?", "2_Subreddit": "opiates"}], "dwx5g4e": [{"0_Comment Submission": "My dick after 3 days off opiates", "1_Text": "Damn, I'm glad my wife doesn't fake it. It gets frustrating sometimes when she's got a lot on her mind and it takes 20 minutes but in the end it's worth it", "2_Subreddit": "opiates"}], "dwx5jeq": [{"0_Comment Submission": "My dick after 3 days off opiates", "1_Text": "It's so weird, but it makes sense. When you're used to nerves and senses being dulled, it's only natural it wouldn't take much effort", "2_Subreddit": "opiates"}], "dwxabob": [{"0_Comment Submission": "My dick after 3 days off opiates", "1_Text": "Nothing weirder than cumming with a softee lmfao", "2_Subreddit": "opiates"}], "dwxaq09": [{"0_Comment Submission": "Waiting For My Man", "1_Text": "I still haven't seen the sequel. Does it even have anything to do with drugs, or is it just the aftermath of the betrayal from the first movie?", "2_Subreddit": "opiates"}], "dwxiic1": [{"0_Comment Submission": "My dick after 3 days off opiates", "1_Text": "I'm currently still using steroids yes. Considering how opiates tank your natural testosterone levels, at least getting bloodwork done to see if you need hormone replacement therapy is a great idea. I wouldn't recommend using steroids if you're going to continue to use opiates because they don't tend to go well together. Opiates tend to make you lose focus of your goals, and lifting will take he back burner and you won't get great results. If you quit and use steroids, I would suggest your first time running would be just testosterone only. Once you start adding in hormones that aren't native to your body, side effects can really become prominent. After running testosterone only, if you tolerate it well, then you can look into adding some other compounds in. If you do decide to do this, getting bloodwork is very important because you can permanently damage your body. Testosterone aromatizes into estrogen so you will need to get bloodwork done mid run to find out how much to increase or decrease aromatase inhibitor dosages. Without an aromatase inhibitor estrogen levels can get really high which will cause you to grow glandular tissue behind your nipples which is called gynecomastia aka bitch tits. If this is something you are seriously interested in, I can share the wealth of information I have on the topic.", "2_Subreddit": "opiates"}], "dwxnffo": [{"0_Comment Submission": "How to tell time", "1_Text": "In my experience \"I'm walking down the street you're on\" means \"I'm on the other side of town waiting on my ride\"... like what the fuck bro, I'm the junkie giving you every dime I have and I got a reliable vehicle. How the hell can you be selling heroin but can't afford even a piece of shit car that will get you to and fro", "2_Subreddit": "opiates"}], "dwxootx": [{"0_Comment Submission": "How to tell time", "1_Text": "lol I hate when the dboy tries to sit and small talk. Last time this dude asked if I could bring Him to a bar in east town. I said I didn't have time and he said that's fine can you just bring me around the corner a little ways at least so I obliged. He kept telling me to take turns and I realize he is directing me to that fucking bar. I had to kick him out before I wet an extra 17 minutes out of my way. Fuckin dboys man", "2_Subreddit": "opiates"}]}], "1_submissions": [{}]}]}