{"OnAcidButUrThedum1": [{"0_comments": [{"dgepq3w": [{"0_Comment Submission": "Rare photograph of dope_hammahead", "1_Text": "Hahaha, same thing that came to mind. Too fucking funny.", "2_Subreddit": "opiates"}], "dgf1qge": [{"0_Comment Submission": "LPT: Use cable binders in this specific way to organize multiple lose cables under your desk (picture in text).", "1_Text": "This is an impractical LPT. 4 thumbs down!👎👎👎👎", "2_Subreddit": "LifeProTips"}], "dhdguc6": [{"0_Comment Submission": "Ridiculous price increase in my Area!", "1_Text": "This is some of the craziest shit I've ever read honestly. I want to know where all these people are getting shitloads of money in such a small town? Not really adding up.\n\nCan't blame her for trying to rake it in though...if people will pay it then lucky her. I gotta say though that my gut is giving me a bad feeling about her. Something is coming her way...I can just tell. If she was smart she would sell out at these crazy prices and then step out the game for a minute...then if/when she returns charge even more since people will be desperate...make a fuckload and then quit for good.", "2_Subreddit": "opiates"}], "dhdh169": [{"0_Comment Submission": "I Don't Understand How People Can Enjoy Methamphetamine!?", "1_Text": "The only time meth is cool is if you smpke some and then have a crazy jerk off session or have sex/get a blowjob. Pretty fucking incredible.\n\nBesides that, it just helps with my ADD and chills me out. Honestly it works better than Adderall for me in that regard. I still don't ever use it though...I just stick with heroin and other stuff here and there.", "2_Subreddit": "opiates"}], "dhdhi8c": [{"0_Comment Submission": "I Don't Understand How People Can Enjoy Methamphetamine!?", "1_Text": "Wow. I just learned something totally new and interesting, thank you for posting this.\n\nFor years I've always said that there are two kinds of people...those that take opiates and feel \"up\" on them and enjoy the effects and those who don't get any enjoyment and always say \"It just made me tired\" I've had loads of people agree with me and I have tons of examples that validate this.\n\nI've always thought it had something to do with me having ADD. Uppers like amphetamines or cocaine will make me chill the fuck out. Everything is just kinda just whatever...I become a lot quieter and relaxed than sober/opiates. When I take opiates though, I get energized, I go on walks, I want to do things, I feel \"up\"\n\nOne of my best friends is the opposite and it's always so funny whenever we do drugs together. We'll snort some rails of coke and he's constantly standing up, moving around, talking non-stop, etc and I'm just sitting in a chair...smoking a cigarette and taking everything in...not really having anything to say.\n\nI'm excited to do more research on paradoxical opiate reaction now! Again, thank you for bringing this to my attention!", "2_Subreddit": "opiates"}], "dhdibh6": [{"0_Comment Submission": "Why do you do drugs?", "1_Text": "Opiates feel great and give me a physical and mental boost. I don't use them to escape life...I use them to further embrace it. When I'm not using, I hole up in my room, in bed, and feel like shit. I don't want to do fucking anything. If I'm on heroin...total opposite. I either feel normal and like how I was before I started doing heroin or I get really nice and high and it's fantastic!\n\nI have depression and heroin \"fixes\" it. Life seems better on it.", "2_Subreddit": "opiates"}], "dhdigkp": [{"0_Comment Submission": "Let's talk: How old are you and how did you start using opiates?", "1_Text": "Been using off and on for about 7 years.", "2_Subreddit": "opiates"}], "dhdis39": [{"0_Comment Submission": "Withdrawal", "1_Text": "Story of all of our lives man; you aren't alone. Luckily, some of us make it to the other side and quit or unluckily the shit kills us. I hope someday to be one of those people on the \"lucky\" side...just need to find the determination for it and really stick it out. Depression is a bitch though and when it's bad, my whole life gets put on hold. Heroin stops that from happening...\n\n-sigh-", "2_Subreddit": "opiates"}], "dhdj20q": [{"0_Comment Submission": "Tolerance break", "1_Text": "I really don't believe there is such a thing with opiates. You're either high, sick, or kicking. The speed at which the cycle goes around depends on your current financial situation. If you're able to stop for that long and lower your tolerance, then just quit using. You'll be so much better off. Tolerance takes quite some time to lower with opiates while rapidly getting higher everyday you use.", "2_Subreddit": "opiates"}], "dvit75l": [{"0_Comment Submission": "What should people stop buying?", "1_Text": "Win-denburg*", "2_Subreddit": "AskReddit"}], "dvvr7s5": [{"0_Comment Submission": "I got a tweaker this delivers anything I want to my window at all times of the night", "1_Text": "Obama phone prolly", "2_Subreddit": "opiates"}], "dvvvyio": [{"0_Comment Submission": "What is the most scumbag/backstabbing thing a friend has ever done to you?", "1_Text": "Much respect for owning what you did and sharing it. Drugs...especially in active addiction,  leads us to do some shitty things.\n\nCongrats on turning your life around!", "2_Subreddit": "AskReddit"}], "dvw2ndi": [{"0_Comment Submission": "Jeffrey Tambor Quits 'Transparent' Show Amid Sexual Harassment Allegations", "1_Text": "\"Why are men such trash\"\n\nFirst, you automatically assume the accusations are true without proof.\n\nSecond, you go on to put all men into a box of being inherently bad, as if there aren't women, middlesex, non-identifying, etc. that can be bad too. A statement on par with that but reversed is quick to have tons of people up in arm's but I'm the only one to comment on this... PEOPLE can be \"trash\" or \"treasure.\" Everyone is responsible for their actions alone. \n\nYou love Transparent so you should remember Josh and Rita, no? Her actions were much more calculated, abusive, and traumatic...they also have proof (I am speaking in terms of the shows universe) unlike the actions of Tambor, which is only hearsay. So I guess I should say \"Come on Rita......Why are women such trash :(\"\n\nComments like that further the negative attitudes that believe women have it out for men and lie about their abuse. You are fueling the fire of idiots whogeneralize that way and putting yourself right alongside with them since you do the same. Hold individuals accountable for what they have done when you have verifiable PROOF and have investigated a scenario without bias. Don't generalize and give a voice to untrue and negative statements like you have made here. That gives you credibility.\n\nAlso I have to say, I am sure you said that as a one off comment. I hope so at least. I say things all the time that a comment like I just made could be written to me. Everyone does. Nobody is perfect and that again goes back to PEOPLE being perfectly flawed. Don't take my comment as an attack..what you said was just a prime opportunity for bringing a topic I think a lot about to the forefront. I just had to say something and hopefully these comments can be made less and less...regardless of gender. Much love fellow Redditor. <3", "2_Subreddit": "Transparent"}], "dvw3qvz": [{"0_Comment Submission": "Rewatching the show", "1_Text": "Why would you let what is going on taint the show? You liked it before *accusations* were made, so you should still enjoy it! Watch it again and you'll gain more than you did the first time.", "2_Subreddit": "Transparent"}], "dvzexak": [{"0_Comment Submission": "What cases do you think have mundane explanations?", "1_Text": "Out of curiosity, why did you feel the need to hide what you were doing? I am always adventuring around but I share my experiences when asked what I did that day or whatever. \n\nSince I live alone, I have trips out of state nobody knows about but nobody was around to ask. Did you lie about what you did or were you not even asked about your day?", "2_Subreddit": "UnresolvedMysteries"}], "dvzjj8o": [{"0_Comment Submission": "What cases do you think have mundane explanations?", "1_Text": "I've been there and then some...still am haha! I totally understand. In that case, good on you for being smart and keeping your mouth shut. So many people could avoid getting busted by keeping their illegal activities to themselves. \n\nI'm assuming here, but it sounds like you were married to the wrong person and I'm glad that you are out of it and have also changed your personal life for the better. Good for you! Thank you for answering my questions as well, I appreciate  it.\n\nYou bring up an excellent point and I wish more people would take it into consideration. One of my favorite bands, Modest Mouse, put it perfectly: \"No one really knows the ones they love. If you knew everything they thought, I bet that you would wish that they'd just shut up.\"", "2_Subreddit": "UnresolvedMysteries"}], "dvzjrsd": [{"0_Comment Submission": "What is the creepiest \"glitch in the matrix\" you've experienced?", "1_Text": "You and I would get along. I am curious to see what other topics you have noticed your own correlations with after hearing friends/family/acquaintances  talk about _________. My list is quite varied and I have tons of theories...I am willing to bet you are the same?", "2_Subreddit": "AskReddit"}], "dvzjtxv": [{"0_Comment Submission": "What is the creepiest \"glitch in the matrix\" you've experienced?", "1_Text": "Quantum physics", "2_Subreddit": "AskReddit"}], "dw5fbkt": [{"0_Comment Submission": "I Think I Might Have PTSD, HPPD, or Both", "1_Text": "Back in 2012 I learned all about HPPD. After the \"mindset\" wouldn't end and  the visuals wouldn't stop, I did some research and accepted that for the un-foreseeable future I would have to cope with a disorder I had never known existed. I already had enough on my plate and this was the icing on the shit cake.\n\nI was tripping on various psychedelics often, smoked weed all day, and also abused a plethora of other drugs. I used cocaine and oxycodone/heroin daily. GBL, MDMA, methylone,  Klonopin, Xanax, Valium, various members of the 2C-x family, and research chemicals from A to Z. I was dealing drugs in \"large quantities\" (About 15 to 20 pounds of marijuana a week) that I sourced from a particular gang of Asians that starts with Y. I had more money than I had ever seen moving in and out of my hands that I tried to keep under wraps while also trying to share the wealth with the cult of friends I had and my family; the family who lied to daily and told fabricated stories to keep my real life from being discovered. I was in two serious romantic relationships that exploded into a world of problems I can't even summarize here. All of this kept me under an IMMENSE amount of stress. One night my door was kicked in while my girl\nfriend and I were having a beautiful conversation and a gun was held to my head (while I was naked since we had just had sex) and I was robbed out of $00,000 and a few pounds of weed. That event triggered PTSD which also turned into HPPD. \n\nI will always remember the moment it started. I took a bong hit and as I blew out the smoke, I noticed slight fractals and shimmering colors as it swirled through the air. My kitchen table turned two-dimensional and stretched out and then it all hit me super hard. It was like taking a gram of shrooms and two hits of 100ug LSD together. I went silent and completely checked out from my friends around me. I got confused and anxious. I had no issues tripping but that was by choice...this was forced and without warning. The visuals lasted for a few hours and I thought it was going to be an isolated incident. I was wrong. The next day, same thing; a bong hit turned into a ++ level trip.\n\nI'll  have to type up the events following that day sometime,  but HPPD stuck with me for months and finally went away in rehab after I had a little over a month sober. For two years I would have the occasional \"glitch\" in my brain that induced a visual/visuals. To this day, I can \"force\" visuals and see tracers, albeit slight, on moving things. The hardest part was constantly having the mindset of tripping. At first, I semi-enjoyed it but it quickly deteriorated my mental health and stability. The mixture of stress and being on a psychedelic trip called a disorder got me very close to having a psychotic break. \n\nI would encourage you to stay off drugs and take extra care of yourself for a while. Talk to people you trust and don't let yourself go too deep with things. If you have trauma, now is the time to process it. If you ever want to talk to someone who has been there and understands, PM me. I will help as much as I can. You will get through this. I keep journals and during that time I wrote a special one about my HPPD which helped a lot. SLEEP! You NEED to rest your body and mind right now. Before I knew I had HPPD, I had delusional thoughts that I had \"reached a higher plane\" and that my mind had evolved which led me to exacerbate the problem. Please be careful and stay relaxed. You will come out of this experience at some point. Remember that.", "2_Subreddit": "Drugs"}], "dw6rsy0": [{"0_Comment Submission": "I Think I Might Have PTSD, HPPD, or Both", "1_Text": "What drugs do you use besides psychs?", "2_Subreddit": "Drugs"}], "dwgjfq3": [{"0_Comment Submission": "Picked up some of this today. 2nd time ive gotten and the first time I immediately was like wtf is this so i texted my dude and he said its all good these guys add food coloring haha. Anybody ever experienced this?", "1_Text": "I would venture to say you are most likely correct. Fools realized they didn't know what they were doing and can't lose out.\n\nOP...your dope will be normal colored as soon as these idiots move this shit.", "2_Subreddit": "opiates"}], "dwgjg3c": [{"0_Comment Submission": "Picked up some of this today. 2nd time ive gotten and the first time I immediately was like wtf is this so i texted my dude and he said its all good these guys add food coloring haha. Anybody ever experienced this?", "1_Text": "I would venture to say you are most likely correct. Fools realized they didn't know what they were doing and can't lose out.\n\nOP...your dope will be normal colored as soon as these idiots move this shit.", "2_Subreddit": "opiates"}], "dwgjhjz": [{"0_Comment Submission": "Picked up some of this today. 2nd time ive gotten and the first time I immediately was like wtf is this so i texted my dude and he said its all good these guys add food coloring haha. Anybody ever experienced this?", "1_Text": "What is the quality like?\n\nI sincerely hope you're sniffing.", "2_Subreddit": "opiates"}], "dwiqqgd": [{"0_Comment Submission": "Robbed my connect", "1_Text": "😂😂😂\n\nToo fucking true. I picture some Dr Frink looking ass nigguh hahaha", "2_Subreddit": "opiates"}], "dwnl9mg": [{"0_Comment Submission": "Policy Change regarding human consumption", "1_Text": "This is definitely a joke and it's in really bad taste honestly.", "2_Subreddit": "opiates"}]}], "1_submissions": [{}]}]}