{"lbiohazard": [{"0_comments": [{"c9oo80n": [{"0_Comment Submission": "The game that sold me on the original Xbox", "1_Text": "Halo: Combat Evolved is what sold me the original xbox", "2_Subreddit": "gaming"}], "c9opx66": [{"0_Comment Submission": "Made this mirror with a Halo themed etching in my art class, thought you guys like it.", "1_Text": "Nicely done! I made one with a giant Biohazard symbol, when i had to do this back in high school. \nI love halo.", "2_Subreddit": "gaming"}], "cau6qz3": [{"0_Comment Submission": "I am David X. Cohen, head writer on FUTURAMA - AMA!", "1_Text": "I actually noticed this about the 2nd time see this episode.", "2_Subreddit": "IAmA"}], "cau78sw": [{"0_Comment Submission": "I am David X. Cohen, head writer on FUTURAMA - AMA!", "1_Text": "I remember the episode where fry attempts to get his dog back. At the end, it shows how his pup lived out the rest of his days waiting for fry. That was a tearjerker.", "2_Subreddit": "IAmA"}], "cawwvp7": [{"0_Comment Submission": "Which movie ending sent shivers down your spine?", "1_Text": "Crash", "2_Subreddit": "AskReddit"}], "cb47o1m": [{"0_Comment Submission": "*HEALING UPDATE! So, my friends dog rejected my kiss", "1_Text": "That is one bad ass scar.", "2_Subreddit": "WTF"}], "cbov7i3": [{"0_Comment Submission": "She's got the longest whiskers I've ever seen. She calmly rides shotgun in the car. She's the most beautiful, regal queen of my life. This is Emma", "1_Text": "And my cat, Mr. Keeks, has singed whiskers from a lit candle. Curiosity didn't kill him, just burnt him.", "2_Subreddit": "aww"}], "cbovczg": [{"0_Comment Submission": "What's the matter? Ain't you never seen a naked chick riding a clam before? [f]", "1_Text": "Thank you for this. (or for making this)", "2_Subreddit": "gonewild"}], "ciq5udy": [{"0_Comment Submission": "Guess I have to go ring shopping", "1_Text": "She asked for hot sauce so you gave her mild, that's why she was crying.", "2_Subreddit": "funny"}], "ciqvlmm": [{"0_Comment Submission": "My wife managed to capture the least manly shot of me launching fireworks", "1_Text": "From what I remember the last time I shot off fireworks, the directions on all of them clearly state: light fuse and run away. Not light fuse and lean far enough back until you think you're alright.", "2_Subreddit": "pics"}], "cixzypd": [{"0_Comment Submission": "Fuck the silence - Intro", "1_Text": "wow crazy, i cant wait to hear more", "2_Subreddit": "nosleep"}], "cp3v12i": [{"0_Comment Submission": "What video game have you spent the most time playing?", "1_Text": "The Elder Scrolls 3: Morrowind", "2_Subreddit": "AskReddit"}], "cp3v3l5": [{"0_Comment Submission": "What video game have you spent the most time playing?", "1_Text": "I have 165 days. Reddit user name is the same as my Runescape name", "2_Subreddit": "AskReddit"}], "cwdzp0a": [{"0_Comment Submission": "The town heralds seem incredibly confident that the Invasion of Falador will end in 7 days.", "1_Text": "First genuine lol of the day", "2_Subreddit": "runescape"}], "cxutfav": [{"0_Comment Submission": "What is the first members item you remember buying when you became member?", "1_Text": "Team cape, bone scythe, and mabey some H.A.M robes too I believe", "2_Subreddit": "runescape"}], "cy63raj": [{"0_Comment Submission": "FeelsGoodMan", "1_Text": "Alc that stuff! Alc all dem platebodies!", "2_Subreddit": "runescape"}], "dd0egim": [{"0_Comment Submission": "Glitter-Guts", "1_Text": "This was a very original and unusual story. I liked it.", "2_Subreddit": "nosleep"}], "dddzxp2": [{"0_Comment Submission": "My Father's Nightmare", "1_Text": "Wow what a powerful story. I'm very sorry for you, your father and his brother. Finding this out must have been very hard. Thank you for taking the time to share this with us though. This really makes you think about the awful things that were done to African-Americans, and how brutal and terrifying those experiences can be.", "2_Subreddit": "nosleep"}], "dlehlrp": [{"0_Comment Submission": "Had to be done", "1_Text": "If you shoot it with the rocket launcher it goes though. Sometimes grenades work too", "2_Subreddit": "gaming"}], "dvenug2": [{"0_Comment Submission": "A year and a half ago I quit doing heroin and all other mind altering chemicals. It’s crazy to look back and see just how far I’ve come", "1_Text": "I love seeing stuff like this. I'm so proud of you! I am also a recovering heroin addict. 75 days today, can't wait till I can post one of these myself when I get my year", "2_Subreddit": "pics"}], "dvenze5": [{"0_Comment Submission": "What is something that we can ALL disagree on?", "1_Text": "Chocolate? Your right, cookie dough", "2_Subreddit": "AskReddit"}], "dvyl6yh": [{"0_Comment Submission": "If you could revive one game that has \"died\" what would it be?", "1_Text": "Halo 3", "2_Subreddit": "gaming"}], "dvyl9yp": [{"0_Comment Submission": "Halo temptation", "1_Text": "How so? This is just from some simple meme maker I downloaded yesterday", "2_Subreddit": "gaming"}], "dvylhr9": [{"0_Comment Submission": "Halo temptation", "1_Text": "Oh I understand, thanks for the input, first meme and first reddit post", "2_Subreddit": "gaming"}], "dwvmfzk": [{"0_Comment Submission": "Wondering how you guys met your now-dealers? (Don't worry, I'm not trying to source)", "1_Text": "What is CL?", "2_Subreddit": "opiates"}]}], "1_submissions": [{"85mhur": [{"0_Title": "Halo temptation", "1_Text": "Halo: Combat Evolved is what sold me the original xbox", "2_Subreddit": "gaming"}]}]}]}