{"InTheLatrine": [{"0_comments": [{"dwor7ec": [{"0_Comment Submission": "How to recreate this amazing ZHU deep bass? (Portugal the man remix)", "1_Text": "I'm getting downvoted left and right because there are a ton of VST users on here, obviously. I doubt any of them have owned analog gear. VSTs are amazing - I use U-he Repro 1/5 for a lot of things and it sounds glorious. Where every soft synth (that is currently available) falls down is punchy monosynth sounds - exactly what you're looking for here.\n\nAnyhow, a Sub Phatty would probably get you where you want to go. You could also probably get a comparable sound out of a Behringer Model D for only $300. Do keep in mind that a certain percentage of this sound is also due to mixing, and of course there's the layering I mentioned before. It all starts with the source, though, and the two I gave you above will be a big step forward.", "2_Subreddit": "edmproduction"}], "dworf8q": [{"0_Comment Submission": "How do you prevent clipping while keeping the track loud and powerful?", "1_Text": "First, you need to realize that is a very, very broad question. Preventing clipping can be done with a simple limiter on the master track. What makes the track loud and powerful has everything to do with what happens in the mix before it hits that final limiter. You're basically asking \"how do I mix?\". That can't be covered here. You'll need to either ask a more specific question or get a book on it.", "2_Subreddit": "edmproduction"}], "dwqoyb5": [{"0_Comment Submission": "This should be shown at every graduation", "1_Text": "I definitely didn't think this way, and I don't know many who do. Do kids these days really expect that they graduate college and it's just smooth sailing from there? Life is where you either fail or succeed, not school.", "2_Subreddit": "funny"}], "dwqvw0r": [{"0_Comment Submission": "A ? For any1 who been in the seed game for 8-15 yrs", "1_Text": "Yeah, but pods never came back because they were actually illegal. The only reason we had good ones in the first place is because of one farm in Yuma, AZ that was crazy enough to actually grow tons of Papaver Somniferum on US soil. It was only a matter of time before the DEA caught up with them and the supply of quality pods to the entire US was cut off.", "2_Subreddit": "PoppyTea"}], "dwr1dtg": [{"0_Comment Submission": "A ? For any1 who been in the seed game for 8-15 yrs", "1_Text": "I don't mess with seeds anymore and haven't in years (I find it has terrible side effects on my health), but I can definitely agree that they were complete crap back in 2010 and even a few years after that. Some of the 2015 batches were so strong it was hard to believe you could even buy such a thing legally.", "2_Subreddit": "PoppyTea"}], "dwr1grg": [{"0_Comment Submission": "Another solid (but probably expensive) synth is on its way from Black Corporation", "1_Text": "From the pic, it's a KIJIMI", "2_Subreddit": "synthesizers"}], "dwr2smk": [{"0_Comment Submission": "I met a legend today! Any tips & tricks?", "1_Text": "Brush your ass as well if required.", "2_Subreddit": "synthesizers"}], "dwr30ts": [{"0_Comment Submission": "Seeking audio interface with many inputs", "1_Text": "> Scarlett 18i8\n\nI have been using a Focusrite Saffire Pro 40 since they came out, and it's been a great unit. Although I don't own a Scarlett, I would recommend the 18i20 based on my experience with the company.", "2_Subreddit": "synthesizers"}], "dwr3b78": [{"0_Comment Submission": "Free diving in Hawaii.", "1_Text": "If only we could see an eye-tracking heatmap of this vid to show where viewers were focusing their...attention.", "2_Subreddit": "gifs"}], "dwrezob": [{"0_Comment Submission": "Real life example how savings can be good for your mental well-being", "1_Text": "3 months? And I'm freaking out because I only have enough to cover mortgage and bills for 16 months.", "2_Subreddit": "personalfinance"}], "dwrqw2m": [{"0_Comment Submission": "My Personal Experience With Free Will & Determinism - Carl Jung's Archetypes' connection with Determinism", "1_Text": "So now we're ignoring the fact that quantum physics has given us plenty evidence that the universe is not deterministic? If physics isn't deterministic, then our future reality cannot be predetermined from past events. This is really just a mental exercise and while it's interesting to think about, we have actual evidence that it's wrong.", "2_Subreddit": "philosophy"}], "dwsg6yt": [{"0_Comment Submission": "Sukicat and her majestic poses!", "1_Text": "Awesome cat, but not sure why haz almost 1,000,000 followers...\n\nLooks at instagram and sees catmom is super hot and likes to be partially or completely naked.\n\nOh.", "2_Subreddit": "aww"}], "dwsmbvq": [{"0_Comment Submission": "Sukicat and her majestic poses!", "1_Text": "You really want to see her naked, huh! Notice I said catmom. She plays the synergy of the two accounts off eachother. Here's one:\n\nhttps://www.instagram.com/p/BXwSPm_Bv04/", "2_Subreddit": "aww"}], "dwt8tvd": [{"0_Comment Submission": "Say you were a rapper or someshit that had stacks of cash, what “immoral” or “frowned upon” thing would you do?", "1_Text": "Two chicks at the same time.", "2_Subreddit": "Drugs"}], "dwt9y3j": [{"0_Comment Submission": "I know what my problem is-- I want to use heroin forever.", "1_Text": "Personally, opiates are my true love but I think heroin sucks. I've done a metric ton if it, but only because I usually couldn't get what I really wanted - oxy.\n\nAnyhow, I've been clean for more than a year now, and it's really because after 10 years I learned that the whole opiates thing is unsustainable. Another withdrawal actually seemed worse than living without another high. I think you can only quit if you come to that point, where the cost is higher than the reward. If you aren't ready then you aren't ready. You may or may not ever come to that point. You may decide that dying is a better option than living without the high, and die you will. \n\nOne thing to keep in mind about being a \"lifer\", though - you won't meet very many old junkies. If you decide to stick with using, you should realize that you will likely die from the drug. You aren't going to die at 92 years old with a long life of happy heroin memories. That is a fantasy.", "2_Subreddit": "Drugs"}], "dwta9e7": [{"0_Comment Submission": "I’m addicted to being high because I don’t feel anything when I’m sober.", "1_Text": "I realized this about myself years ago, and it's a good thing to know about yourself because it gets you one step closer to seeing how to fix yourself. Your problem is that your life has no reward and no passion. You need to find something that gets you off without drugs. No, you're not stuck that way. You just need to put some effort into it.", "2_Subreddit": "Drugs"}], "dwtadk8": [{"0_Comment Submission": "Are there any drug withdrawals that CAUSE brain damage?", "1_Text": "Benzo withdrawal can cause excitotoxicity, which can directly cause neuron death. That's part of why it's so important to taper benzos.", "2_Subreddit": "Drugs"}], "dwtdpjv": [{"0_Comment Submission": "Say you were a rapper or someshit that had stacks of cash, what “immoral” or “frowned upon” thing would you do?", "1_Text": "It was a reference to Office Space.", "2_Subreddit": "Drugs"}], "dwtmqwr": [{"0_Comment Submission": "New modular softsynth by TAL: TAL-Mod", "1_Text": "Demo is up on the website now. Guys - this thing sounds GOOD. $40? Sign me up.", "2_Subreddit": "synthesizers"}], "dwum9mc": [{"0_Comment Submission": "Don’t respond to PMs asking for sources", "1_Text": "It's hilarious that some of you are so paranoid that you think you have info that the US Government doesn't already have. Yes...you're THAT in-the-know. Please.", "2_Subreddit": "researchchemicals"}], "dwumnhi": [{"0_Comment Submission": "Sonar re-released as free DAW! Fuck you Gibson", "1_Text": "For the same reason that some people are busy buying new gear all the time but barely ever finish any music. People fool themselves into believing that the reason they aren't producing amazing art is because their tools aren't good enough. It's easier than looking at the real reason - they lack discipline.", "2_Subreddit": "synthesizers"}], "dwun02z": [{"0_Comment Submission": "My Office :-)", "1_Text": "I can smell the 1990's emanating from that room just by looking at the pic.", "2_Subreddit": "synthesizers"}], "dwupi8s": [{"0_Comment Submission": "Techniques for going from one idea to a song", "1_Text": "Not all music is written the same way, but here's what I've learned in 20 years of making music: harmonic progression is king. Study and understand harmonic progression and harmonic rhythm. My process looks something like this:\n\nSit down with a piano or some other simple instrument that has a wide range of frequencies. Piano is great because you have access to everything from extreme lows to extreme highs all at once.\n\nFigure out a chord progression that sounds good. You really need to study common harmonic progressions at the very least for this. Understanding why certain chords sound good next to each other, why some want to resolve to the tonic, etc is very important. It's important to note that you aren't messing with ARRANGEMENT at this point - you're just keeping it simple and figuring out your progression.\n\nIf you have a verse/chorus/bridge structure then figure out if you want to keep the same progression all the way through (nothing wrong with this, but you'll have to be more creative to keep the song from getting boring) or if you want to write additional progressions.\n\nOnce you have all of your progressions and know what order you want to play them in (again, study existing songs) lay them down in a DAW and start working on the drums. Use the drums to add and subtract energy from different parts of the song.\n\nOnce your drums are laid down, create a vocal scratch track. I could write a book about creating good vocals. I can tell you that if you want to write popular music, you need to have the drums in place before you start messing with vocals. Making a song catchy has a LOT to do with how the rhythm of the vocals bounces off the rhythm of the drums. I've found it impossible to create this interplay unless you have the drums down first. Changing the drums once you've created the vocals can really disrupt that interplay as well. Another thing to note about vocals is that catchy vocals often do not make huge pitch changes between syllables. There is often a lot of note repetition, which brings the rhythm of the vocal more into focus. Notice how rap songs can be catchy even with almost no melodic shift in the vocals. That's because the rhythm is incredibly important here. Learn about motifs, and use them throughout your vocals and elsewhere in the song.\n\nNow you have drums, a piano playing the basic harmony and at least a good idea of what the vocals are going to do. Time to tear that piano track apart and start creating an actual arrangement of it with other instruments (unless you just love the simple piano part on its own). You need to learn to IMPLY the underlying chords that you used in the piano track, but you may not be directly playing them at all. You may have the bass playing the root of each chord rhythmically, then a synth moving between the third and fifth, which would imply a triad chord for that part, even though you aren't playing all of the notes at once.\n\nNow you're getting somewhere. Keep revising that arrangement and use it to move the dynamics of the song. At this point, your process could go anywhere. Think outside the box. Also, do NOT mess with mixing or advanced effects stuff at this point or you'll again get derailed. You'll want to, but writing a song to completion takes discipline.\n\nOnce you have an arrangement you're happy with, you need to go back and add unique details to each section to break up any monotony. You can do this with little additions to the rhythm in one part or by triggering unique samples here and there that each appears only once in the song.\n\nRefine, refine, refine. Once you listen to your song a million times, you will start to tune out the little bits that could be better, but a fresh set of ears will hear them immediately. If any section starts to sound boring, a transition doesn't flow or that something is just off, you need to figure out how to fix it. Sometimes you will have to delete a lot of hard work to go back and rethink it. If you want the track to be GOOD, this is what it takes.\n\nFinally, get into the mixing, mastering, etc.", "2_Subreddit": "synthesizers"}], "dwuy0xl": [{"0_Comment Submission": "Say you were a rapper or someshit that had stacks of cash, what “immoral” or “frowned upon” thing would you do?", "1_Text": "Pretty sure as soon as you accept cash for sex, that makes you a hooker by definition. I'm just saying.", "2_Subreddit": "Drugs"}], "dwyu39q": [{"0_Comment Submission": "Called out a guy that jumped line in front of me and another lady. Remember to use your words.", "1_Text": "It’s a bit strange that merely standing up for yourself warrants a post on reddit. Congrats, I guess.", "2_Subreddit": "TwoXChromosomes"}]}], "1_submissions": [{"5gb7n1": [{"0_Title": "Incredibly sexy amateur wife sucks off her husband's friends. Does anyone know where I can find more of her? [13:55]", "1_Text": "I'm getting downvoted left and right because there are a ton of VST users on here, obviously. I doubt any of them have owned analog gear. VSTs are amazing - I use U-he Repro 1/5 for a lot of things and it sounds glorious. Where every soft synth (that is currently available) falls down is punchy monosynth sounds - exactly what you're looking for here.\n\nAnyhow, a Sub Phatty would probably get you where you want to go. You could also probably get a comparable sound out of a Behringer Model D for only $300. Do keep in mind that a certain percentage of this sound is also due to mixing, and of course there's the layering I mentioned before. It all starts with the source, though, and the two I gave you above will be a big step forward.", "2_Subreddit": "homemadexxx"}], "5hzjmb": [{"0_Title": "[Skin Concerns] Tinea Versicolor Sufferers - Here's My Treatment", "1_Text": "I'm getting downvoted left and right because there are a ton of VST users on here, obviously. I doubt any of them have owned analog gear. VSTs are amazing - I use U-he Repro 1/5 for a lot of things and it sounds glorious. Where every soft synth (that is currently available) falls down is punchy monosynth sounds - exactly what you're looking for here.\n\nAnyhow, a Sub Phatty would probably get you where you want to go. You could also probably get a comparable sound out of a Behringer Model D for only $300. Do keep in mind that a certain percentage of this sound is also due to mixing, and of course there's the layering I mentioned before. It all starts with the source, though, and the two I gave you above will be a big step forward.", "2_Subreddit": "SkincareAddiction"}], "5sfu6b": [{"0_Title": "Something similar to Bottega Veneta Pour Homme", "1_Text": "I'm getting downvoted left and right because there are a ton of VST users on here, obviously. I doubt any of them have owned analog gear. VSTs are amazing - I use U-he Repro 1/5 for a lot of things and it sounds glorious. Where every soft synth (that is currently available) falls down is punchy monosynth sounds - exactly what you're looking for here.\n\nAnyhow, a Sub Phatty would probably get you where you want to go. You could also probably get a comparable sound out of a Behringer Model D for only $300. Do keep in mind that a certain percentage of this sound is also due to mixing, and of course there's the layering I mentioned before. It all starts with the source, though, and the two I gave you above will be a big step forward.", "2_Subreddit": "fragrance"}], "6fap17": [{"0_Title": "Guys with the \"athletic\" shape - I found a decent shirt today.", "1_Text": "I'm getting downvoted left and right because there are a ton of VST users on here, obviously. I doubt any of them have owned analog gear. VSTs are amazing - I use U-he Repro 1/5 for a lot of things and it sounds glorious. Where every soft synth (that is currently available) falls down is punchy monosynth sounds - exactly what you're looking for here.\n\nAnyhow, a Sub Phatty would probably get you where you want to go. You could also probably get a comparable sound out of a Behringer Model D for only $300. Do keep in mind that a certain percentage of this sound is also due to mixing, and of course there's the layering I mentioned before. It all starts with the source, though, and the two I gave you above will be a big step forward.", "2_Subreddit": "malefashionadvice"}], "6oyqjj": [{"0_Title": "Sock Purrito", "1_Text": "I'm getting downvoted left and right because there are a ton of VST users on here, obviously. I doubt any of them have owned analog gear. VSTs are amazing - I use U-he Repro 1/5 for a lot of things and it sounds glorious. Where every soft synth (that is currently available) falls down is punchy monosynth sounds - exactly what you're looking for here.\n\nAnyhow, a Sub Phatty would probably get you where you want to go. You could also probably get a comparable sound out of a Behringer Model D for only $300. Do keep in mind that a certain percentage of this sound is also due to mixing, and of course there's the layering I mentioned before. It all starts with the source, though, and the two I gave you above will be a big step forward.", "2_Subreddit": "Purrito"}], "78fvot": [{"0_Title": "Frequency analysis for multiple tracks at the same time", "1_Text": "I'm getting downvoted left and right because there are a ton of VST users on here, obviously. I doubt any of them have owned analog gear. VSTs are amazing - I use U-he Repro 1/5 for a lot of things and it sounds glorious. Where every soft synth (that is currently available) falls down is punchy monosynth sounds - exactly what you're looking for here.\n\nAnyhow, a Sub Phatty would probably get you where you want to go. You could also probably get a comparable sound out of a Behringer Model D for only $300. Do keep in mind that a certain percentage of this sound is also due to mixing, and of course there's the layering I mentioned before. It all starts with the source, though, and the two I gave you above will be a big step forward.", "2_Subreddit": "audioengineering"}], "7gaol4": [{"0_Title": "Mr. Manhole", "1_Text": "I'm getting downvoted left and right because there are a ton of VST users on here, obviously. I doubt any of them have owned analog gear. VSTs are amazing - I use U-he Repro 1/5 for a lot of things and it sounds glorious. Where every soft synth (that is currently available) falls down is punchy monosynth sounds - exactly what you're looking for here.\n\nAnyhow, a Sub Phatty would probably get you where you want to go. You could also probably get a comparable sound out of a Behringer Model D for only $300. Do keep in mind that a certain percentage of this sound is also due to mixing, and of course there's the layering I mentioned before. It all starts with the source, though, and the two I gave you above will be a big step forward.", "2_Subreddit": "oddlysatisfying"}], "7l9l7h": [{"0_Title": "8800 by Jan-21-2018", "1_Text": "I'm getting downvoted left and right because there are a ton of VST users on here, obviously. I doubt any of them have owned analog gear. VSTs are amazing - I use U-he Repro 1/5 for a lot of things and it sounds glorious. Where every soft synth (that is currently available) falls down is punchy monosynth sounds - exactly what you're looking for here.\n\nAnyhow, a Sub Phatty would probably get you where you want to go. You could also probably get a comparable sound out of a Behringer Model D for only $300. Do keep in mind that a certain percentage of this sound is also due to mixing, and of course there's the layering I mentioned before. It all starts with the source, though, and the two I gave you above will be a big step forward.", "2_Subreddit": "btc"}], "7t9u7t": [{"0_Title": "They're almost too pretty to eat...", "1_Text": "I'm getting downvoted left and right because there are a ton of VST users on here, obviously. I doubt any of them have owned analog gear. VSTs are amazing - I use U-he Repro 1/5 for a lot of things and it sounds glorious. Where every soft synth (that is currently available) falls down is punchy monosynth sounds - exactly what you're looking for here.\n\nAnyhow, a Sub Phatty would probably get you where you want to go. You could also probably get a comparable sound out of a Behringer Model D for only $300. Do keep in mind that a certain percentage of this sound is also due to mixing, and of course there's the layering I mentioned before. It all starts with the source, though, and the two I gave you above will be a big step forward.", "2_Subreddit": "DrugStashes"}], "7xj0gd": [{"0_Title": "Bottom hit. Landing gear up. Prepare for takeoff.", "1_Text": "I'm getting downvoted left and right because there are a ton of VST users on here, obviously. I doubt any of them have owned analog gear. VSTs are amazing - I use U-he Repro 1/5 for a lot of things and it sounds glorious. Where every soft synth (that is currently available) falls down is punchy monosynth sounds - exactly what you're looking for here.\n\nAnyhow, a Sub Phatty would probably get you where you want to go. You could also probably get a comparable sound out of a Behringer Model D for only $300. Do keep in mind that a certain percentage of this sound is also due to mixing, and of course there's the layering I mentioned before. It all starts with the source, though, and the two I gave you above will be a big step forward.", "2_Subreddit": "BitcoinMarkets"}], "7xr670": [{"0_Title": "Upcoming Targets", "1_Text": "I'm getting downvoted left and right because there are a ton of VST users on here, obviously. I doubt any of them have owned analog gear. VSTs are amazing - I use U-he Repro 1/5 for a lot of things and it sounds glorious. Where every soft synth (that is currently available) falls down is punchy monosynth sounds - exactly what you're looking for here.\n\nAnyhow, a Sub Phatty would probably get you where you want to go. You could also probably get a comparable sound out of a Behringer Model D for only $300. Do keep in mind that a certain percentage of this sound is also due to mixing, and of course there's the layering I mentioned before. It all starts with the source, though, and the two I gave you above will be a big step forward.", "2_Subreddit": "BitcoinMarkets"}], "85mg2w": [{"0_Title": "Facebook has suspended the account of the whistleblower who exposed Cambridge Analytica", "1_Text": "I'm getting downvoted left and right because there are a ton of VST users on here, obviously. I doubt any of them have owned analog gear. VSTs are amazing - I use U-he Repro 1/5 for a lot of things and it sounds glorious. Where every soft synth (that is currently available) falls down is punchy monosynth sounds - exactly what you're looking for here.\n\nAnyhow, a Sub Phatty would probably get you where you want to go. You could also probably get a comparable sound out of a Behringer Model D for only $300. Do keep in mind that a certain percentage of this sound is also due to mixing, and of course there's the layering I mentioned before. It all starts with the source, though, and the two I gave you above will be a big step forward.", "2_Subreddit": "worldnews"}], "85p8rp": [{"0_Title": "It looks like games are about to get a HUGE boost in realism", "1_Text": "I'm getting downvoted left and right because there are a ton of VST users on here, obviously. I doubt any of them have owned analog gear. VSTs are amazing - I use U-he Repro 1/5 for a lot of things and it sounds glorious. Where every soft synth (that is currently available) falls down is punchy monosynth sounds - exactly what you're looking for here.\n\nAnyhow, a Sub Phatty would probably get you where you want to go. You could also probably get a comparable sound out of a Behringer Model D for only $300. Do keep in mind that a certain percentage of this sound is also due to mixing, and of course there's the layering I mentioned before. It all starts with the source, though, and the two I gave you above will be a big step forward.", "2_Subreddit": "gaming"}], "85pabn": [{"0_Title": "#deletefacebook", "1_Text": "I'm getting downvoted left and right because there are a ton of VST users on here, obviously. I doubt any of them have owned analog gear. VSTs are amazing - I use U-he Repro 1/5 for a lot of things and it sounds glorious. Where every soft synth (that is currently available) falls down is punchy monosynth sounds - exactly what you're looking for here.\n\nAnyhow, a Sub Phatty would probably get you where you want to go. You could also probably get a comparable sound out of a Behringer Model D for only $300. Do keep in mind that a certain percentage of this sound is also due to mixing, and of course there's the layering I mentioned before. It all starts with the source, though, and the two I gave you above will be a big step forward.", "2_Subreddit": "worldnews"}], "85uqz5": [{"0_Title": "FTC Probing Facebook for Use of Personal Data", "1_Text": "I'm getting downvoted left and right because there are a ton of VST users on here, obviously. I doubt any of them have owned analog gear. VSTs are amazing - I use U-he Repro 1/5 for a lot of things and it sounds glorious. Where every soft synth (that is currently available) falls down is punchy monosynth sounds - exactly what you're looking for here.\n\nAnyhow, a Sub Phatty would probably get you where you want to go. You could also probably get a comparable sound out of a Behringer Model D for only $300. Do keep in mind that a certain percentage of this sound is also due to mixing, and of course there's the layering I mentioned before. It all starts with the source, though, and the two I gave you above will be a big step forward.", "2_Subreddit": "worldnews"}], "86lc41": [{"0_Title": "I found a really nice combination", "1_Text": "I'm getting downvoted left and right because there are a ton of VST users on here, obviously. I doubt any of them have owned analog gear. VSTs are amazing - I use U-he Repro 1/5 for a lot of things and it sounds glorious. Where every soft synth (that is currently available) falls down is punchy monosynth sounds - exactly what you're looking for here.\n\nAnyhow, a Sub Phatty would probably get you where you want to go. You could also probably get a comparable sound out of a Behringer Model D for only $300. Do keep in mind that a certain percentage of this sound is also due to mixing, and of course there's the layering I mentioned before. It all starts with the source, though, and the two I gave you above will be a big step forward.", "2_Subreddit": "Drugs"}], "86q92g": [{"0_Title": "Trump moves to ban most transgender troops", "1_Text": "I'm getting downvoted left and right because there are a ton of VST users on here, obviously. I doubt any of them have owned analog gear. VSTs are amazing - I use U-he Repro 1/5 for a lot of things and it sounds glorious. Where every soft synth (that is currently available) falls down is punchy monosynth sounds - exactly what you're looking for here.\n\nAnyhow, a Sub Phatty would probably get you where you want to go. You could also probably get a comparable sound out of a Behringer Model D for only $300. Do keep in mind that a certain percentage of this sound is also due to mixing, and of course there's the layering I mentioned before. It all starts with the source, though, and the two I gave you above will be a big step forward.", "2_Subreddit": "worldnews"}], "86qbqn": [{"0_Title": "Trump moves to ban most transgender troops", "1_Text": "I'm getting downvoted left and right because there are a ton of VST users on here, obviously. I doubt any of them have owned analog gear. VSTs are amazing - I use U-he Repro 1/5 for a lot of things and it sounds glorious. Where every soft synth (that is currently available) falls down is punchy monosynth sounds - exactly what you're looking for here.\n\nAnyhow, a Sub Phatty would probably get you where you want to go. You could also probably get a comparable sound out of a Behringer Model D for only $300. Do keep in mind that a certain percentage of this sound is also due to mixing, and of course there's the layering I mentioned before. It all starts with the source, though, and the two I gave you above will be a big step forward.", "2_Subreddit": "politics"}], "86qd1m": [{"0_Title": "US Military Aims to Start Using Laser Weapon That Produces Voices by 2021", "1_Text": "I'm getting downvoted left and right because there are a ton of VST users on here, obviously. I doubt any of them have owned analog gear. VSTs are amazing - I use U-he Repro 1/5 for a lot of things and it sounds glorious. Where every soft synth (that is currently available) falls down is punchy monosynth sounds - exactly what you're looking for here.\n\nAnyhow, a Sub Phatty would probably get you where you want to go. You could also probably get a comparable sound out of a Behringer Model D for only $300. Do keep in mind that a certain percentage of this sound is also due to mixing, and of course there's the layering I mentioned before. It all starts with the source, though, and the two I gave you above will be a big step forward.", "2_Subreddit": "worldnews"}], "86qf16": [{"0_Title": "Bitcoin's scripting language is Turing complete, paper shows", "1_Text": "I'm getting downvoted left and right because there are a ton of VST users on here, obviously. I doubt any of them have owned analog gear. VSTs are amazing - I use U-he Repro 1/5 for a lot of things and it sounds glorious. Where every soft synth (that is currently available) falls down is punchy monosynth sounds - exactly what you're looking for here.\n\nAnyhow, a Sub Phatty would probably get you where you want to go. You could also probably get a comparable sound out of a Behringer Model D for only $300. Do keep in mind that a certain percentage of this sound is also due to mixing, and of course there's the layering I mentioned before. It all starts with the source, though, and the two I gave you above will be a big step forward.", "2_Subreddit": "Bitcoin"}], "86ww3h": [{"0_Title": "Facebook scraped call, text message data for years from Android phones", "1_Text": "I'm getting downvoted left and right because there are a ton of VST users on here, obviously. I doubt any of them have owned analog gear. VSTs are amazing - I use U-he Repro 1/5 for a lot of things and it sounds glorious. Where every soft synth (that is currently available) falls down is punchy monosynth sounds - exactly what you're looking for here.\n\nAnyhow, a Sub Phatty would probably get you where you want to go. You could also probably get a comparable sound out of a Behringer Model D for only $300. Do keep in mind that a certain percentage of this sound is also due to mixing, and of course there's the layering I mentioned before. It all starts with the source, though, and the two I gave you above will be a big step forward.", "2_Subreddit": "worldnews"}], "87wcyj": [{"0_Title": "Facebook pauses app reviews, disables new user authorizations", "1_Text": "I'm getting downvoted left and right because there are a ton of VST users on here, obviously. I doubt any of them have owned analog gear. VSTs are amazing - I use U-he Repro 1/5 for a lot of things and it sounds glorious. Where every soft synth (that is currently available) falls down is punchy monosynth sounds - exactly what you're looking for here.\n\nAnyhow, a Sub Phatty would probably get you where you want to go. You could also probably get a comparable sound out of a Behringer Model D for only $300. Do keep in mind that a certain percentage of this sound is also due to mixing, and of course there's the layering I mentioned before. It all starts with the source, though, and the two I gave you above will be a big step forward.", "2_Subreddit": "worldnews"}]}]}]}