{"Desperation61": [{"0_comments": [{"dv9tt9m": [{"0_Comment Submission": "Im going to federal prison", "1_Text": "I'm sorry to say this but what I know if federal prison if you get 20 years you pull all the time sorry buddy good luck I think if I was looking at 20 years I'd say good by everyone I'm Mexico bound", "2_Subreddit": "Drugs"}], "dva5546": [{"0_Comment Submission": "Im going to federal prison", "1_Text": "I wish you all the luck buddy you sound like a good guy be careful buddy", "2_Subreddit": "Drugs"}], "dvbi4as": [{"0_Comment Submission": "Im going to federal prison", "1_Text": "Federal is much better than state but I really don't want to go to ether place but I have know people been to federal and they say hands down it's better", "2_Subreddit": "Drugs"}], "dvyywl4": [{"0_Comment Submission": "At the back doctors today and they had this little diddy hanging up....there is hope that Peyronie’s disease sufferers!", "1_Text": "Hey I've got it went to Dr the cure was a drug that cost like 20.000 per shot so I took things in my hands and tied a nylon rope to it with a 10 pound weight to it every night for two weeks went back to Dr he said what did you do to straighten you're dick out so I told him he was amazed lost like 2 inches but dick us straight and works just fine", "2_Subreddit": "opiates"}], "dvzion1": [{"0_Comment Submission": "At the back doctors today and they had this little diddy hanging up....there is hope that Peyronie’s disease sufferers!", "1_Text": "Hell yes try fucking with a bend in you're Wang when errect almost was looking back at you're balls it took like a year but it works just fine becudes that those injection procedure would cause you to loose length", "2_Subreddit": "opiates"}], "dwllhja": [{"0_Comment Submission": "Dream market isn't working for me", "1_Text": "Hello I need I'm not computer savvy \nNeed to get BTH anyone willing to help me", "2_Subreddit": "darknet"}], "dwllk8n": [{"0_Comment Submission": "Dream market isn't working for me", "1_Text": "Anyone like to help old man get on deep web to find pain products???😒😒😒😒", "2_Subreddit": "darknet"}], "dwlm6cw": [{"0_Comment Submission": "Download tor and vpn, disable JavaScript and get bitcoin...is that about it", "1_Text": "Hello you online I am asking for assistance please", "2_Subreddit": "darknet"}], "dwlmalx": [{"0_Comment Submission": "Download tor and vpn, disable JavaScript and get bitcoin...is that about it", "1_Text": "Hello please help I'm not very good with computer", "2_Subreddit": "darknet"}], "dwlmdxb": [{"0_Comment Submission": "Today it's Ross Ulbricht's 5th birthday spent in prison.", "1_Text": "Could I ask you question about deep web", "2_Subreddit": "darknet"}], "dwlr3k4": [{"0_Comment Submission": "Fucking dilemma on my hands... Advice needed.", "1_Text": "No don't I'm a lucky ass I tried it 17 years ago slammed it I didn't 90 days stopped I was building a new home at the time and I needed something for pain I worked my ass off when I stopped had no withdrawal symptoms but I'd worked so hard I couldn't hardely walk .\nMy back is so fucked up.\nDon't get me wrong it's wonderful a drug that will give you the power to do anything \nBut from what I read on here it will fuck most people lives up .\nSo Please stay the fuck away you'll be better off I've got no reason to lie I also had a friend that was my connect and he turned me on but found out later he'd been an addict for 25 years and to this day he fights addition he's spent millions on H .\nWait for you're pills buddy trust me stay the fuck away from that shit if you've got any addicted personality at all good luck drink a beer or something later good luck buddy be careful", "2_Subreddit": "opiates"}], "dwmlp6b": [{"0_Comment Submission": "Today it's Ross Ulbricht's 5th birthday spent in prison.", "1_Text": "How do I pm you not been here long", "2_Subreddit": "darknet"}], "dwn3snj": [{"0_Comment Submission": "Fell Asleep In My Hometown, Woke Up Stranded Almost 200 Miles Away With Clothes, Writing Supplies, Solar Panels and Excitement To Lose My Hitchhiking Virginity", "1_Text": "Wow ! Sounds like a interesting life to say the least hope you get back close to you're home town be safe", "2_Subreddit": "opiates"}], "dwn4qm5": [{"0_Comment Submission": "Mmmmm 😈💦", "1_Text": "Cool wish I had a dboy in my small \nAss town looking good", "2_Subreddit": "opiates"}], "dwn5z14": [{"0_Comment Submission": "Today it's Ross Ulbricht's 5th birthday spent in prison.", "1_Text": "Hello I'm interested in getting H think I can find something good", "2_Subreddit": "darknet"}], "dwn7d0q": [{"0_Comment Submission": "Today it's Ross Ulbricht's 5th birthday spent in prison.", "1_Text": "Help in need of help please I will set you up with some everytime I get somei", "2_Subreddit": "darknet"}], "dwn8wl2": [{"0_Comment Submission": "Today it's Ross Ulbricht's 5th birthday spent in prison.", "1_Text": "Are we in same country and you're current time \nI'm 5:34 and USA", "2_Subreddit": "darknet"}], "dwn8xo1": [{"0_Comment Submission": "Today it's Ross Ulbricht's 5th birthday spent in prison.", "1_Text": "Oh Ronnie", "2_Subreddit": "darknet"}], "dwn9x5y": [{"0_Comment Submission": "Today it's Ross Ulbricht's 5th birthday spent in prison.", "1_Text": "By the way I'm not very good in internet and never been on dark web it seems to be rather complicated to me anyway and keeping myself behind the curtain is a must I own .\nLet's just say the lives of 35 employees depends on me not fucking up with police but I've got bad issues with my back and I've been cutoff from pm like 10 months now but I've got opiates back now but I've got to be good as far as clean drug screen every 2 weeks now it's about to go to 30 days then after that 2 months I need to work for my people but can't do much if anything without something for pain and I cannot let them down some of them been with me 25 years it's been 17 years since I've done and H but the way I don't have withdrawal symptoms but I gotta work for them I need sometime to make sure .\nMe men can keep there jobs so if you would help me I'll fix you up .\nI'm a little busy now but tomorrow I will be here \nIn house but I'm here all time now help me please thanks buddy", "2_Subreddit": "darknet"}], "dwnj5f0": [{"0_Comment Submission": "Today it's Ross Ulbricht's 5th birthday spent in prison.", "1_Text": "Damn you been there well I really don't know if I'll do it or not I've been cutoff like 10 months I think but I know my pain Dr and have for ten years .\nHess good guy I didn't abuse them but he's slowly giving me them back low doses has told me he would increase them .\nI feel so bad for my employees there good people good old Baptist Christian so I gotta help them somehow I really am scared of H.\nBecause of fyntanyl\nPeople are mean to put it in dope it's scary \nI've tried everything I lay in bed like 5 days straight .\nMy life sucks now I just want to do this a year my business I'm planning on selling it to someone who will take care of them or I won't sell it they were business minded I'd let them take over .\nBut that won't work I wish you all the best buddy I find blame you this buying off internet is scary shit problem I don't associate with dopers I got to keep this low sounds can't go around asking scetchy people ???? \nI do appreciate you responding to my messages don't blame you a bit I wish you all the best I'm not thinking I'll go threw this.\nScary mess and no wouldn't send it to kin friend that would be thought out before if I was going there thanks alot", "2_Subreddit": "darknet"}], "dwnj84c": [{"0_Comment Submission": "Today it's Ross Ulbricht's 5th birthday spent in prison.", "1_Text": "Good look reading my text I'm dumb country boy that has worked all his life 🤔thought will be my next move", "2_Subreddit": "darknet"}], "dwnkl15": [{"0_Comment Submission": "Today it's Ross Ulbricht's 5th birthday spent in prison.", "1_Text": "Best of luck to you also sounds like you've got you're mess together now", "2_Subreddit": "darknet"}], "dwwtliz": [{"0_Comment Submission": "Got my hands on these. I have NO idea how to use them, have only done oral and intranasal oxy. Would be so grateful if someone gave me a step by step. How do I get a needle?", "1_Text": "Top breaks off then you stick needle in it", "2_Subreddit": "opiates"}], "dwwtna3": [{"0_Comment Submission": "Got my hands on these. I have NO idea how to use them, have only done oral and intranasal oxy. Would be so grateful if someone gave me a step by step. How do I get a needle?", "1_Text": "Pinch with fingers to break bottle top off", "2_Subreddit": "opiates"}], "dwwwyez": [{"0_Comment Submission": "Got my hands on these. I have NO idea how to use them, have only done oral and intranasal oxy. Would be so grateful if someone gave me a step by step. How do I get a needle?", "1_Text": "Not unless you're slamming it", "2_Subreddit": "opiates"}]}], "1_submissions": [{"7p3yrz": [{"0_Title": "Desperation61", "1_Text": "I'm sorry to say this but what I know if federal prison if you get 20 years you pull all the time sorry buddy good luck I think if I was looking at 20 years I'd say good by everyone I'm Mexico bound", "2_Subreddit": "posts"}], "7xtbdg": [{"0_Title": "Hello i can't answer you by posts on last things about HGH can you send me a link", "1_Text": "I'm sorry to say this but what I know if federal prison if you get 20 years you pull all the time sorry buddy good luck I think if I was looking at 20 years I'd say good by everyone I'm Mexico bound", "2_Subreddit": "u_Desperation61"}], "7yxi5e": [{"0_Title": "Got back operate today after a year", "1_Text": "I'm sorry to say this but what I know if federal prison if you get 20 years you pull all the time sorry buddy good luck I think if I was looking at 20 years I'd say good by everyone I'm Mexico bound", "2_Subreddit": "u_Desperation61"}]}]}]}