{"FuckPinaColadas": [{"0_comments": [{"dvwk4xk": [{"0_Comment Submission": "What are some of the best negotiating tactics you know of?", "1_Text": "Story?", "2_Subreddit": "AskReddit"}], "dvy47d2": [{"0_Comment Submission": "Who, if President of the United States in the future, would make you say, \"Damn, I sure miss Trump as President.\"?", "1_Text": ">And I suspect that politician aren't actually more prone to corruption than everybody else, they just have more opportunities to be corrupted.\n\nWhich then makes the career politicians that haven’t been corrupted (like Bernie) that much better as candidates and as people. What could have been...", "2_Subreddit": "AskReddit"}], "dvydcyw": [{"0_Comment Submission": "Who, if President of the United States in the future, would make you say, \"Damn, I sure miss Trump as President.\"?", "1_Text": "Cool, fine by me if that's your opinion of him. Have a good one :)", "2_Subreddit": "AskReddit"}], "dvypwq1": [{"0_Comment Submission": "Belichick coaching Bradley Chubb at NC State Pro Day.", "1_Text": "I feel personally attacked right now tbh.", "2_Subreddit": "nfl"}], "dw0yz6t": [{"0_Comment Submission": "Buffalo Bills Zay Jones in Nude, Bloody Arrest After Penthouse Meltdown", "1_Text": "I agree. I get that people want to know what’s going on and stuff, and I’m sure they mean well, but I don’t think we should be making any specific assumptions about what he’s dealing with, whether it be drugs or mental illness. In any case, I hope he’s getting the help he needs.", "2_Subreddit": "nfl"}], "dw1qw9k": [{"0_Comment Submission": "From last night: The facility Zay Jones is being held in, per the inmate report, is a hospital ward of the jail where suspects are taken for medical and/or psychiatric attention.", "1_Text": "To be fair, alcohol is a drug, but I certainly get what you mean.", "2_Subreddit": "nfl"}], "dw6i7q4": [{"0_Comment Submission": "'Come As You Are' If Nirvana Was Happy", "1_Text": "Hey whatever, I honestly thought it was really cool. People on this sub get super jaded about things.\n\nEdit: weirdly has a kind of Pet Sounds feel, now that I think about it. Interesting.", "2_Subreddit": "Nirvana"}], "dw80xb6": [{"0_Comment Submission": "NSFW, What caused your most intense orgasm?", "1_Text": "Or he likes to jerk off in front of random people. *ahem*...", "2_Subreddit": "AskReddit"}], "dw981nx": [{"0_Comment Submission": "\"In Utero\" Album Awards Results", "1_Text": "Definitely the hardest album out of all of them to pick favorites from. Really only two songs on it I’m not a huge fan of, but even then I still think they’re really good (Tourette’s and Very Ape)\n\nEdit: out of curiosity, are you planning on doing one of these for the self titled greatest hits album?", "2_Subreddit": "Nirvana"}], "dwaa2h7": [{"0_Comment Submission": "TIL President Harry S. Truman was so poor after his presidency that Congress had to enact a law to give him a pension. President Herbert Hoover the only other living ex-president took the pension as well, despite his wealth, to avoid embarrassing Truman.", "1_Text": ">Besides they were too busy fighting among themselves\n\nHaha, I don’t mean to stir up any arguments or anything with this comment, but honestly that’s VERY true.", "2_Subreddit": "todayilearned"}], "dwbqdux": [{"0_Comment Submission": "Anthony Kiedis and his father (1976)", "1_Text": "IIRC, his dad and his friends left a few lines of heroin out the morning after a party, and AK did them thinking the stuff was coke while everyone else was out of the house or whatever. Then they came back and got really concerned because apparently the amount he did could potentially kill someone with no tolerance.\n\nMight be remembering some details incorrectly, but that's the idea of it. Pretty scummy of his dad to have his kid be raised in that kind of environment.", "2_Subreddit": "OldSchoolCool"}], "dwckyyn": [{"0_Comment Submission": "Why isn't there a \"legalize it\" movement for opiates?", "1_Text": "Right, obviously there are exceptions or outliers to their point on a more individual level, but on a more general and societal level, what they’re saying is very true, in that the difference between the two drugs is significant enough for them to be treated differently by the government. Or whatever, I don’t know, lol.", "2_Subreddit": "opiates"}], "dwg9edj": [{"0_Comment Submission": "You have been accepted for an experiment: you must stay in a room with nothing but bed/toilet/food/water and no human contact for one month. If you succeed for the whole month without giving up, you get $5,000,000. Do you accept? And what are your coping strategies to avoid mental breakdown?", "1_Text": "And for 5 million no less. Fuck it, I’d do it for my monthly income plus 1k or something.", "2_Subreddit": "AskReddit"}], "dwijx7a": [{"0_Comment Submission": "Don't you just love everyone whose personality revolves solely around the fact that they smoke weed is always a \"drug expert\" on literally everything about every drug?", "1_Text": "Damn, I honestly wish that existed lol.", "2_Subreddit": "opiates"}], "dwlw4rl": [{"0_Comment Submission": "Women of reddit, what are some things you’ve been dying to tell men?", "1_Text": "Huh interesting, so you just have a decreased ability to smell things in general? Like the equivalent to having bad ears or eyes? I feel like this is something I should know about, but it just never occurred to me as a thing that can happen.", "2_Subreddit": "AskReddit"}], "dwmisxr": [{"0_Comment Submission": "Welcome to Reddit Alpha, the Future of Now", "1_Text": "Preferences > display options > allow subreddits to show me custom themes\n\nYou’re welcome", "2_Subreddit": "nfl"}], "dwpefrm": [{"0_Comment Submission": "Opiates and motivation/creativity", "1_Text": "Yeah OP, listen to this person. I’m a musician, so I’m sure it’s a bit different, but opiates eventually *will* rob you of most of your creative energy. It fucking sucks.", "2_Subreddit": "opiates"}], "dwr4wka": [{"0_Comment Submission": "{NSFW} Boof Queen!", "1_Text": "Oooooh, sick burn.", "2_Subreddit": "opiates"}], "dww4ei2": [{"0_Comment Submission": "I just find this amusing. Thanks for a great year Cookie", "1_Text": "They’re fucking memes. The bar was never too high to begin with. \n\nIt’s alright dude, just lighten up a bit.", "2_Subreddit": "Patriots"}], "dwxfqkp": [{"0_Comment Submission": "LSD and Fentanyl", "1_Text": "An obvious difference being that rape or child rape is inherently harmful towards other people and not so much towards the rapist (unless they get caught), whereas heroin use is extremely harmful towards the person doing it and often an attempt to self medicate emotional or physical issues.", "2_Subreddit": "Drugs"}], "dwxg2h4": [{"0_Comment Submission": "Why did Louis CK's career get destroyed over jacking off in front of someone while Chris Brown beat up a female celebrity and is now bigger than ever?", "1_Text": "No matter what", "2_Subreddit": "AskReddit"}], "dwxwdv7": [{"0_Comment Submission": "Frances Bean Cobain shares her first original track.", "1_Text": "How so?", "2_Subreddit": "Nirvana"}]}], "1_submissions": [{}]}]}