{"Foxes_and_Fireflies": [{"0_comments": [{"dvi143i": [{"0_Comment Submission": "Is this 10 a fake? Notice the \"I\" instead of the \"1\"", "1_Text": "Yep. They make fakes of almost anything these days.", "2_Subreddit": "opiates"}], "dvk6ewb": [{"0_Comment Submission": "Endless nausea? Solutions?", "1_Text": "Zofran or Phenergan would help. Do you have any antinausea medications handy? Pepto, anything at all?\n\nIf you don't have that, there's always good ol' ginger ale or ginger tea, which my grandma used to make me any time I had an upset stomach.", "2_Subreddit": "opiates"}], "dvluk1x": [{"0_Comment Submission": "Super high level functioning addicts", "1_Text": "That sounds like a horrific crash waiting to happen. He loses his job, or the market crashes and he suddenly isn't making money like he used to... man rehab with a habit like that (or even just living into old age... well, he probably wouldn't make it to old age with that kind of intake) would be an even worse hell than I hear it is normally.", "2_Subreddit": "opiates"}], "dvmqz1q": [{"0_Comment Submission": "i officially hate hydrocodone", "1_Text": "Cold Water Extraction. It's a way to sort of draw out and filter the APAP.", "2_Subreddit": "opiates"}], "dvn6m39": [{"0_Comment Submission": "Spelling of \"opioid\"", "1_Text": "The difference between the two is that opioids are synthetic (like Opana for example) and opiates are derived from poppies/morphine. At least, that's my understanding.", "2_Subreddit": "opiates"}], "dw07qba": [{"0_Comment Submission": "Help with script", "1_Text": "I've been there. It's really, really easy to go through an entire prescription that fast. If possible, find someone who can ration them out for you. There are little pill safes you can get too, where you put a week's worth of meds in it separated by days, then it only unlocks one day at a time (or one dose at a time, depending on how you set it up). I've been considering the pill safe myself.", "2_Subreddit": "opiates"}], "dw4z8em": [{"0_Comment Submission": "Best painkillers for pain management, need advice please", "1_Text": "Hi there, fellow chronic pain patient here! My advice to you, and what  most pain clinics do, is have one ER for around the clock pain relief and then one IR for breakthrough pain.\n\nIf he offered oxycodone and Oxycontin, I'd take him up on those. He's not going to offer them and tell you to call in if the current relief isn't working, and then when you call in, say \"PSYCHE I was just testing you, NO PAIN RELIEF FOR YOU!\" \n\nRoxicodone is just a name brand Oxycodone, and OxyContin is just name brand extended release oxycodone. If you're on a long-acting pain med like Oxycontin, you won't need to take as much of the instant release, short acting oxycodone when your pain spikes. Dilaudid (hydromorphone) is still prescribed but it's rarer and is used for more severe pain.\n\nI'm not sure that his being from Syria will change the way he prescribes medications. I've had doctors from India, the Middle East, Korea, and Vietnam and never had an issue getting help when I needed it.", "2_Subreddit": "opiates"}], "dw4zcml": [{"0_Comment Submission": "All of a sudden opiates not getting me the euphoria as before", "1_Text": "\"This time I got my meds and took 70 mgs right off the bat. I had incredible energy but absolutely no high whatsoever.\"\n\nThat's your tolerance rising. If you're prescribed these monthly, and you keep taking them monthly, you're going to get a higher and higher tolerance as time goes on.", "2_Subreddit": "opiates"}], "dw4zjqp": [{"0_Comment Submission": "My first papaver somniferum sprout!", "1_Text": "The product you look for is poppy seeds.\n\nJust like if you want to grow pumpkins, you buy pumpkin seeds. \n\nI'm not sure what other answer you're looking for.", "2_Subreddit": "opiates"}], "dw60fjd": [{"0_Comment Submission": "The Mother plant. Dumb to get poppies tattooed on my arm. For future life in general", "1_Text": "I don't think a poppy tattoo is dumb at all. As with most tattoos, there are a million reasons you could get it. Not everyone with a syringe tattoo is a junkie; they could be in the medical field. Poppies could remind you of The Wizard of Oz, your Grandma's garden, a trip you took overseas, all kinds of things. I doubt most people would even see that and immediately make the connection that it's a poppy. They'll probably just see a flower that must have special meaning to you.", "2_Subreddit": "opiates"}], "dw60p9q": [{"0_Comment Submission": "Dboy... Falling hard?", "1_Text": "And even if she were a sex worker, so what? Sex work is work. If it's what she does to make ends meet, or even to get some nice litte extras like a G here and there, that's her business. I don't see anything wrong with her performing physical labor to get what she wants. We wouldn't be upset at someone who weeds their dboy's garden, or helps clean the garage, or cleans the kitchen to get a discount or to get product. There's no problem with her labor either. I mean, if someone has personal hangups about sex and has issues with sex workers, that's their own personal drama and shouldn't be thrown onto the person doing the work, you know?", "2_Subreddit": "opiates"}], "dw60xrf": [{"0_Comment Submission": "Dboy... Falling hard?", "1_Text": "If he's sleeping with her in exchange for drugs, I don't think he's \"losing\" product. He's getting something in exchange for it. I wouldn't see it as \"losing\" a batch of cookies if I told some neighborhood kids I'd give them a dozen if they mow my yard, even if it became me making a batch of cookies once a week for consistent yard maintenance. \n\nHe's getting his junk maintained consistently in exchange for some product, and it sounds like he's also getting friendship and emotional support out of the deal too. He's making out fairly well in this deal, honestly.", "2_Subreddit": "opiates"}], "dw74arw": [{"0_Comment Submission": "Help with script", "1_Text": "You can buy them lots of places, but like almost everything else, is recommend getting it on Amazon :-)", "2_Subreddit": "opiates"}], "dw75rp6": [{"0_Comment Submission": "These are your dishes. These are your dishes on drugs..", "1_Text": "Wow, itsjust the opposite for me. It's much easier for me to keep the house neat and tidy when I'm in a fabulous mood than it is when I'm not.", "2_Subreddit": "opiates"}], "dw861ei": [{"0_Comment Submission": "Need some help", "1_Text": "You're probably going to have to go to pain management if you want something stronger, tbh.", "2_Subreddit": "opiates"}], "dw9pi0i": [{"0_Comment Submission": "I dropped a piece of my panda. After 10 minutes of searching I started getting worried that my dog ate it. And then....", "1_Text": "It's slang for Opana.", "2_Subreddit": "opiates"}], "dwc7057": [{"0_Comment Submission": "From r/scottishpeopletwitter, unexpected junkie in bagging area", "1_Text": "If he had a cookie in hand, I'd almost wonder if he was a diabetic with a blood sugar issue.", "2_Subreddit": "opiates"}], "dwc75hv": [{"0_Comment Submission": "E795 10MG PANDA", "1_Text": "Dude.\n\nWhy did you steal my photo?\n\nYou coulda just asked and I'd post it again lol.\n\nDon't think it got this many likes the first time around. Wonder if my others will pop up again soon?", "2_Subreddit": "opiates"}], "dwc7bm4": [{"0_Comment Submission": "E795 10MG PANDA", "1_Text": "Just checked; only 19 upvotes originally! Maybe I should have zoomed in more like this version?", "2_Subreddit": "opiates"}], "dwc8g78": [{"0_Comment Submission": "Who is HowToBasic?", "1_Text": "Goodbye", "2_Subreddit": "AskOuija"}], "dwhzk6k": [{"0_Comment Submission": "E795 10MG PANDA", "1_Text": "I appreciate it :-)", "2_Subreddit": "opiates"}], "dwj341x": [{"0_Comment Submission": "Told my connect to Fuck off", "1_Text": "That seems to be the only insult you know. I feel like you're a kid going \"oh man what's the worst swear I can use?\"\n\nAlso, the MOD flair isn't fooling anyone. :-)", "2_Subreddit": "opiates"}], "dwjw5jd": [{"0_Comment Submission": "Lope price hike?", "1_Text": "Does that depend on what substance you're on? I'd assume Opana is different from oxy, for example.", "2_Subreddit": "opiates"}], "dwjx6dk": [{"0_Comment Submission": "Lope price hike?", "1_Text": "I wonder how much you'd need for something like Opana. Seems like it would be a lot.", "2_Subreddit": "opiates"}], "dwmzj0f": [{"0_Comment Submission": "Opiophile", "1_Text": "They've got the Fabulous Furry Freak Brothers on their site, they're ok by me!", "2_Subreddit": "opiates"}]}], "1_submissions": [{"73gmxx": [{"0_Title": "Just picked up my refill", "1_Text": "Yep. They make fakes of almost anything these days.", "2_Subreddit": "opiates"}], "768k9f": [{"0_Title": "Come on JJ!", "1_Text": "Yep. They make fakes of almost anything these days.", "2_Subreddit": "opiates"}], "79q0rh": [{"0_Title": "🐼 refill day!", "1_Text": "Yep. They make fakes of almost anything these days.", "2_Subreddit": "opiates"}], "79zv32": [{"0_Title": "What's your tool of choice? (Insufflation)", "1_Text": "Yep. They make fakes of almost anything these days.", "2_Subreddit": "opiates"}], "7c5d99": [{"0_Title": "Had a bunch of dental work done a few days ago", "1_Text": "Yep. They make fakes of almost anything these days.", "2_Subreddit": "opiates"}], "7dfj6j": [{"0_Title": "Fioricet for withdrawal?", "1_Text": "Yep. They make fakes of almost anything these days.", "2_Subreddit": "opiates"}], "7e9f9s": [{"0_Title": "Having dreams", "1_Text": "Yep. They make fakes of almost anything these days.", "2_Subreddit": "opiates"}], "7gqmjw": [{"0_Title": "It's 🐼 refill day!", "1_Text": "Yep. They make fakes of almost anything these days.", "2_Subreddit": "opiates"}], "7hn41h": [{"0_Title": "Crosspost from r/opiates", "1_Text": "Yep. They make fakes of almost anything these days.", "2_Subreddit": "pillhead"}], "7omjb5": [{"0_Title": "It's the best day of the month", "1_Text": "Yep. They make fakes of almost anything these days.", "2_Subreddit": "opiates"}], "7ry2ys": [{"0_Title": "When Dad is JJ from many miles away", "1_Text": "Yep. They make fakes of almost anything these days.", "2_Subreddit": "opiates"}], "7zf5xr": [{"0_Title": "Question about Trazadone for withdrawals", "1_Text": "Yep. They make fakes of almost anything these days.", "2_Subreddit": "opiates"}], "8324dj": [{"0_Title": "One frustrating day [shitpost]", "1_Text": "Yep. They make fakes of almost anything these days.", "2_Subreddit": "opiates"}]}]}]}