{"detoxdave89": [{"0_comments": [{"dvykfkq": [{"0_Comment Submission": "This is a Silver Bullet for Opiate Withdrawal", "1_Text": "I'm UK, advice for finding kratom, 20 yr opiate hell, heroin PLUS methadone simultaneously", "2_Subreddit": "kratom"}], "dvyl9yi": [{"0_Comment Submission": "Opiate withdrawal death in jail", "1_Text": "That's proper wrong. I'm UK, and here for years now we have been getting help in jail. I'm off script after two decades, will be going prison matter of days, only couple of weeks but bring it on it'll actually HELP getting back on script!!!!!", "2_Subreddit": "opiates"}], "dvz1bud": [{"0_Comment Submission": "M'done/H 20yr stpd m'done straight", "1_Text": "Thanks for the quick reply fella, believe it or not I (kinda!) consider myself to be half intelligent guy, UK based, bit too old now for all this.... Just screwed up atm, also consume alcohol daily, and a hardcore disrespectful smokabke stimulant (work that 1 out 4 yourself? Considering I'm UK based?!..)... Ye I know, putting myself up for proper criticism........ Of crse health is gonna be bad? OF COURSE I know this.. Not making ANY excuses, only reason I can give is I'm so f'ing ensconced in drug culture, to some that may be pitiful. To me?.... Not exactly just learnt  behaviour, but the amount of time using substances to self medicate /to forget blah blah blah. Nah, not looking for ANY sympathy..... tbh, I'm hoping it it's the loong methadone addiction, then stopping abruptly just like that. Thanks again p.s (even though I wldnt take again, especially atm) MDMA, personally I wld say is my 'drug', that whole culture... And I'll take that to the grave. Most opiate addicts etc look at me like I'm crazy when I tell them that, they either haven't tried (REAL mcjoy old school product), or don't want that 'I love you etc' experience... FORGIVE Me, rambling, gone RIGHT off topic, prop newbie to all this for var reasons... (mainly for almost 2decades all £££ has gone on opiates etc) BUT ANY1 ELSE PLEASE, ANY IMPUT 4 MY REASON OF THE POST, PLSE TELL ME, IF YOU'VE EXPERIENCED MY SYMPTOMS /ISSUES RE: STOPPING METHADONE ABRUPTLY??..... *PEACE GUYS*", "2_Subreddit": "opiates"}], "dvzq2d9": [{"0_Comment Submission": "Stopped 70 abruptly, double habit", "1_Text": "I'm UK, tbh I cld cry for you guys over the pond. My fault, but used meth daily for 2 decades but heroin ALSO... here you don't pay for the juice, you can can test positive over and over, seriously. And you guys pay for it and can't smoke cannabis?? Wtf!! Bet you can't believe it over here?! Unfortunately with my double habit, subutex (mostly wot we have) wld give me precipitated w/d, s, add the naltrexone n it'll kill me.... I was on a Dr rehabilitation order, coz of crime, which I breached, left clinic, that's why I stopped methadone. I've gotta serve just couple weeks jail, v soon, and will get the help /script started off in prison, tbh bring it on!! (another thing, Yr jails are in a different league to ours, which r like holiday camps in comparison,!! If I lived Yr side..... Well don't think I'd be using/in justice system tbh, seriously..... But, the issues I'm suffering with, I'm seriously scared, all indications DO point to bad cardiac problems. So 1st thing is to see a doctor tomorrow. Truthfully I'm very very good at putting off /avoiding etc the things I'm scared of.... At my age, middle age you don't worry if people judge you if you're honest as I'm being. Hope you're well and clean fella, thanks 4 the input, I'm a noob to the Internet kind of, any input and comments, advice etc r greatly appreciated, so don't hold back guys on input", "2_Subreddit": "Methadone"}], "dw1n8wk": [{"0_Comment Submission": "Stopped 70 abruptly, double habit", "1_Text": "UK guy again, had ecg, they say o.k, but cursory 30 second Google re: methadone cardio toxicity throws up a bloody myriad of the most scary heart disease problems some can get with it, sudden death arrhythmia, so many more. Saw a medic today, bloods next (over 2 weeks for app!) tbh I'm surprised she didn't recommend hospital immediately, espec wot I wrote for her, symptoms, the reports found on Google which point to my symptoms to a tee.... They've been going on yrs, I've always pushed em out of mind, self medicated big time, and put down to lungs and other things. Basically I'm still scared as shit, I cld list the other symptoms I've had long time (if anyone's interested?!!..) thought she'd be more concerned bout these cardio issues, especially in myself after 20 yrs methadone use......", "2_Subreddit": "Methadone"}], "dw6anv5": [{"0_Comment Submission": "Stopped 70 abruptly, double habit", "1_Text": "Yeah cheers for Yr down to earth response, bit of an old boy noob, so ramble in my posts. Wot is mad, on the way 36th? Day had wot I've called a breakthrough, not an epiphany lol or a revaluation but 35 days first was living like a scumbag, locked myself away might be the juice leaving me but after 'breakthrough' as I've called it, dunno....... Having first bath for mths, am slowly cleaning bleaching everything slowly bit by bit, washing machines on, but best thing, shaved my hair and I'm walking around head up, looking people In the eye, haven't done that for time. I feel liberated, euphoric. been smoking bud on/since breakthrough....OK day it happened I DID take 50 ml valium n 450ml pregablin. BUT that was 48 hrs ago now. In my junky hovel I have tiny stash, of only 4 rivatrol (can but more), 4 valium and bout 825 mg pregablin.. But as I say, strange feeling of liberation, also I'm seeing and feeling the world bit more, am aware etc. 1 more thing bout my 'breakthrough'!! A friend commentated that's the first time he's ever seen me be able to hold into said lil pill stash n he's correct, I'm amazed myself, am proper fiend normally, those mixture of pills wld normally of gone down the throat together at first opportunity.. Also drinking quite a bit less, alot less so, something has changed, my brain chemicals, signals???? Sorry for the mega long post, reckon you guys find them annoying??!! Peace guys and girls, welcome to get back to OLD UK addict bless you all", "2_Subreddit": "Methadone"}], "dwfceuc": [{"0_Comment Submission": "1 day without I'm seething", "1_Text": "Hard to cop UK??!! What part of UK r u bro???? Scoring is so so easy", "2_Subreddit": "opiates"}], "dwfchf0": [{"0_Comment Submission": "1 day without I'm seething", "1_Text": "Imo, your town, must be some beggars?? Ask them, they will probably be able to hook you up", "2_Subreddit": "opiates"}], "dwfxrsr": [{"0_Comment Submission": "1 day without I'm seething", "1_Text": "N. W, p'haps there's been a bust your way?? I've been in the game jus too long now 2 solid decades, has to end. V. Skint atm, came off methadone after 20 yrs, nearly killed me, literally, 41 days now, the H, 20yr also, use went right up, had 5 bags, was gonna spread it/taper but obviously?!...... Done em all, jus had last, gonna go for the turkey (never get clean /clean time) but this time it's more than a thought, it's a plan, (HUGE!). target etc. Only have 26 df's, few pregabs and just ONE rivatrol!..... I'm SE, Essex, and brown a\nIs abundant and very cheap, what I need for this turkey is benzo's, now THAT'S what i struggle to get, coz my polydrug career gp's won't give me a smartie,nd to buy off others. You fancy doing a trade??!!! My abundant H for some val's etc?!....", "2_Subreddit": "opiates"}], "dwfybcl": [{"0_Comment Submission": "$10,000 a week for H???", "1_Text": "I've just won the lottery! Anyone fancy buddying up with me for a week and seeing if we can get through 10 grands worth of drugs??!. Looool", "2_Subreddit": "opiates"}], "dwfydxm": [{"0_Comment Submission": "$10,000 a week for H???", "1_Text": "U'll have to come UK tho!!", "2_Subreddit": "opiates"}], "dwh3nc2": [{"0_Comment Submission": "$10,000 a week for H???", "1_Text": "You're welcome to visit!!!!", "2_Subreddit": "opiates"}], "dwh4k7g": [{"0_Comment Submission": "The worst withdrawal symptom", "1_Text": "Wow, am not digging at you but you're getting a FEW hours sleep at night??? How far are you time wise (hours /days) into it?? Honestly, if you can actually get a few hours sleep then ffs just get out of the game now, I beg you. If you can get a few hours than trust me, your withdrawals r minor, it only gets (much) worse. If I'm turkeying 3 hours sleep = totally unobtainable mega fantasy man?!...... Peace fr UK opiate dependant", "2_Subreddit": "opiates"}], "dwheq96": [{"0_Comment Submission": "The worst withdrawal symptom", "1_Text": "Ye I'm with you, and as I said, was not digging at the poster, and ye, everyone has wd symptoms that differ in intensity with each specific symptom, for example my dry retching & diarrhea r both extreme, but I don't get machine gun rapid sneezing and others seem to have worse RLS than myself..... Am rambling, so in a nutshell yes, I agree with you......", "2_Subreddit": "opiates"}], "dwhf4j1": [{"0_Comment Submission": "$10,000 a week for H???", "1_Text": "Lol!!!", "2_Subreddit": "opiates"}], "dwhi4i4": [{"0_Comment Submission": "The worst withdrawal symptom", "1_Text": "Thanks, I'm getting on in age, also kind of a newbie, didn't have ££ for tech, also incarcerated, thanks for realising I wasn't being all arsey, I'm learning with every post. P'haps after 20 yrs of monkey on bak I may (unintentionally) go into 'I'm old skool, know it inside out' mode, really don't mean to. Also my heads shot /emotions all over as I stepped off 70ml methadone after 20 yrs, (check my posts)??, life threatening thing to do. Doing more H to compensate, had enuf, but don't MEAN to or want to be a dick, suppose I post before thinking wot I'm saying, as I said, newbie to online......", "2_Subreddit": "opiates"}], "dwi89sn": [{"0_Comment Submission": "152 days.", "1_Text": "Fella, I'm UK respect for clean time. I've had enough, wasted 20 yrs, straight dropped off methadone 20 yrs, fuk!! What was I thinking, deluded on that one. Had enough, had last dig pm, so far got, 10's diazepam, dhydrocodeine, bud, prob will need more,!!! Can't wait to say, as you said so many days clean time. I've had enuf guys, 20 yrs, my Las hit ever today I hope. RESPECT TO ALL OF YOU WITH CLEAN TIME, CRACKED IT ETC, I love reading all posts, feel really weird tho 99%of posters live across the pond from me, the big land!!! Actually it's really interesting, your opiate scene is TOTALLY DIFFERENT TO UK?! I love your posts, all the different opioids you get on script, not here guys...... BUT WHY AM I TALKING POSATIVE BOUT IT I'VE KNOCKED IT ON THE HEAD TODAY, GOING COLD. Does that mean I can't read the posts, see the porn pics (I love em coz..) porn pics of opiate/opioids that we RARELY OR NEVER SEE (suppose if ure loaded and pay a willing doc?? Over here we may get a few of the pills you have. Any way fuk all that, I'm going cold as of today,,, (well yesterday now, last dig at 5pm,had pregabs... Wish me luck, hopefully you'll see an old man junkie get his life back (I'm 46)", "2_Subreddit": "opiates"}], "dwkp0b6": [{"0_Comment Submission": "USA CHOICE!!", "1_Text": "Seriously guys, your USA porn pics, r literally that to UK user, flies coming down lol.... Nah, always loved reading /research diff (opiate especially obviously) meds, in fact 2ce I Yr I lift fr.......? The BNF (British national formula) its £50 and not huge, can't pay for it. Every doctor /health bod etc will have one on desk/beside them, full 'catalogue' of every medication 'apparently available' in UK. But coz we don't pay doctors they won't prescribe.... Honestly, all them beautiful different coloured pharmaceuticals you guys get, fuk, wld love to have a go. Just UK flooded wiv #3 tho, its crazy. Methadone and subutex is easy to get onto but benzos r hard, nothing else much of us get really....", "2_Subreddit": "u_detoxdave89"}]}], "1_submissions": [{"85oerq": [{"0_Title": "M'done/H 20yr stpd m'done straight", "1_Text": "I'm UK, advice for finding kratom, 20 yr opiate hell, heroin PLUS methadone simultaneously", "2_Subreddit": "opiates"}], "85pctg": [{"0_Title": "Stopped 70 abruptly, double habit", "1_Text": "I'm UK, advice for finding kratom, 20 yr opiate hell, heroin PLUS methadone simultaneously", "2_Subreddit": "Methadone"}], "88g5xf": [{"0_Title": "USA CHOICE!!", "1_Text": "I'm UK, advice for finding kratom, 20 yr opiate hell, heroin PLUS methadone simultaneously", "2_Subreddit": "u_detoxdave89"}]}]}]}