{"avecmabite": [{"0_comments": [{"dwo6yoa": [{"0_Comment Submission": "Took Tramadol yesterday and it was surprisingly strong but cant relly understand why anyone would enjoy taking it.", "1_Text": "Tramadol is the shittest of the opioids. Be careful with it, withdrawals are hell on earth and the high you get is rubbish in comparison.\n\nIt lowers your seizure threshold too so don't go messing around with benzos", "2_Subreddit": "Drugs"}], "dwo6zm1": [{"0_Comment Submission": "Oxy after coke?", "1_Text": "Getting addicted to opioids. Physically you run basically zero risk", "2_Subreddit": "Drugs"}], "dwo73vj": [{"0_Comment Submission": "Took Tramadol yesterday and it was surprisingly strong but cant relly understand why anyone would enjoy taking it.", "1_Text": "Don't feel comfortable encouraging the use of opioids as I know first-hand how they can fuck your life. (151 days clean from heroin today). I would leave this particular rabbit hole unexplored if I were you", "2_Subreddit": "Drugs"}], "dwo7cbu": [{"0_Comment Submission": "Lost my job of 4 years--the one thing is was proud of in my life", "1_Text": "I know it sucks right now but remember, there is nothing stopping you from getting clean and getting back to where you were. Your former employer didn't call the police on you so no one else has to know, and they sound pretty compassionate so I don't think they're going to be telling everyone they know what happened.\n\nIf you work hard you can easily turn this around. Just have to keep putting one foot in front of the other.", "2_Subreddit": "opiates"}], "dwo7e1d": [{"0_Comment Submission": "Took Tramadol yesterday and it was surprisingly strong but cant relly understand why anyone would enjoy taking it.", "1_Text": "Thanks buddy :)", "2_Subreddit": "Drugs"}], "dwo8sg0": [{"0_Comment Submission": "Lost my job of 4 years--the one thing is was proud of in my life", "1_Text": "Yeah, and this might just be the impetus you need to flip that switch in your brain when you decide this is as low as you're willing to go.", "2_Subreddit": "opiates"}], "dwo8zmy": [{"0_Comment Submission": "600 mg pregabalin report", "1_Text": "I definitely get something out of 300mg. Although I very rarely use pregabalin (maybe once or twice every couple of months) so maybe my tolerance is just lower than yours.\n\nI agree though, pregabalin is really nice and fairly subtle. Felt like I was walking on clouds", "2_Subreddit": "Drugs"}], "dwoz4h4": [{"0_Comment Submission": "Stomach aches with ops", "1_Text": "Opioid tolerance decreases quickly, and 40mg is quite a lot for a low tolerance. I reckon you just took too much for your tolerance level. When I was chipping heroin and leaving about 10 days between each use, I noticed I would get a bit nauseous at the start of my chip. Three weeks would have seen your tolerance probably almost entirely reset.", "2_Subreddit": "opiates"}], "dwp7rxs": [{"0_Comment Submission": "Can weed give you psychedelic-like or disassociative-like experiences when you vape it in bulk, or is it just my strain?", "1_Text": "What’s your tolerance to weed like? Weed is a psychedelic drug, and people with low tolerances can pretty easily get a “trippy” or dissociative  experience, e.g. effects on proprioception (the sense which tells your brain where in space your limbs are).", "2_Subreddit": "Drugs"}], "dwp7y16": [{"0_Comment Submission": "How to deal with anxiety when taking psychedelics?", "1_Text": "Take a low dose of a fast-acting benzo like Xanax. About 30 minutes after dropping the acid, swallow .5mg of Xanax. This will get you through the come up anxiety and ease you into the experience.\n\nA lot of people talk about using benzos to abort trips, but in fact all the they’re doing is taking a high dose of benzo which just knocks them out. You can take a smaller dose to take the edge off, you don’t need to take so much you fall asleep.", "2_Subreddit": "Drugs"}], "dwp80uv": [{"0_Comment Submission": "Tell me about the best high you’ve ever had.", "1_Text": "MDMA & 2CB & weed & ketamine, in that order.\n\nStarted taking the ketamine when I was beginning to come down from the MDMA and 2CB, most euphoria I’ve ever felt and I’m a heroin addict", "2_Subreddit": "Drugs"}], "dwp81wi": [{"0_Comment Submission": "Hallucinating after taking Zopiclone?", "1_Text": "Yeah this is pretty widely observed, google “ambien walrus” for some funny stories", "2_Subreddit": "Drugs"}], "dwp88c8": [{"0_Comment Submission": "Could a one time MDMA bomb have ruined my friend?", "1_Text": "Is he psychotic? I.e. is he saying things which suggest that he isn’t quite connected to reality? Things like people are chasing him, or he can read minds/people can read his mind?\n\nUnless you think he’s at risk of hurting someone or himself I would just leave him a bit and see if he improves. If he doesn’t, take him to a doctor", "2_Subreddit": "Drugs"}], "dwp8h6m": [{"0_Comment Submission": "Depression after stopping", "1_Text": "Anhedonia is a very common symptom belonging to that wonderful thing we call PAWS. In a nutshell, you’ve been flooding your brain with exogenous opioids for so long that it’s begun producing fewer endorphins than normal. Endorphins means endogenous morphine (internal morphine).\n\nWhen your brain realises that it needs to pick production of endorphins up again things will improve. For me it took about 6-7 weeks to get mostly better.\n\nYou can do things which stimulate the release of endorphins to try and speed this process up, so things like exercise, watching a scary movie, listening to stirring music etc. Basically anything that gives you a natural rush.", "2_Subreddit": "opiates"}], "dwp8mn8": [{"0_Comment Submission": "I hate this. (shitpost)", "1_Text": "There really isn’t any work, from me deciding I want to get something to having placed the order takes like one hour, and most vendors say if you order before like 15:00 they’ll send it out the same day.\n\nBut yeah if you’re worried about it becoming too easy that’s a very valid concern", "2_Subreddit": "opiates"}], "dwp8vyl": [{"0_Comment Submission": "How quickly does adderall stop being fun?", "1_Text": "When you redose all you’re ever doing is delaying the crash. When I was a speed freak I never let myself redose if I could help it, it always felt much better getting a good night’s sleep and then waking up and dosing the next morning than redosing and redosing and then before I realised it I hadn’t slept in three days and I hadn’t eaten anything except a couple of bananas and a protein shake.", "2_Subreddit": "Drugs"}], "dwp8yw4": [{"0_Comment Submission": "Xanax and Alzheimers", "1_Text": "Ask for a source. If you think about it, how would they go about proving it? It’s like when people say smoking off the shiny side gives you Alzheimer’s, seems unlikely that there’s much of an overlap in the demographics of drug users who smoke off foil and people with Alzheimer’s, but maybe that’s a silly assertion.", "2_Subreddit": "Drugs"}], "dwp93wq": [{"0_Comment Submission": "Depression after stopping", "1_Text": "Well what I would say is that your current thinking is coloured by the fact that you’ve just come off opioids. I know because I was just looking back at a chat log of a conversation I had with my friend when I was recently off opioids. I was basically saying exactly the same things as you. Now that I’m clean I know that I love reading, tennis, my job as a software developer, going out with friends etc.\n\nSeriously, give it a couple of weeks and I bet you will start to feel better.", "2_Subreddit": "opiates"}], "dwp96w9": [{"0_Comment Submission": "Most recreational benzo?", "1_Text": "I always liked etizolam when I used to use benzos. A lot of people don’t rate it but I found it great.", "2_Subreddit": "Drugs"}], "dwqqieb": [{"0_Comment Submission": "Question re: withdrawals", "1_Text": "I would leave it a bit longer, but yes, once you’re out of withdrawals you can use for short periods again without getting withdrawals.\n\nIt’s nothing like it is when you first start using (I was able to use all day every day for like two weeks straight before I started noticing withdrawals), but one or two days won’t cause you to experience withdrawals.\n\nJust out of interest, why are you thinking of getting back on having just gone through withdrawal seemingly successfully?", "2_Subreddit": "opiates"}], "dwqqs24": [{"0_Comment Submission": "30 days clean still craving really bad", "1_Text": "My cravings started to subside around like 45 days. Still there, definitely, but I shifted from *always* trying to distract myself to managing cravings as they arose. \n\nHang in there!", "2_Subreddit": "opiates"}], "dwqqx74": [{"0_Comment Submission": "RLS in a single leg?", "1_Text": "Hot baths really helped me, the relief only lasts like 45 minutes max but I have shed tears while lowering myself into the bath because it felt so good.\n\nAlso my GP said quinine helps with RLS, never tried it myself. (You can find quinine in tonic water)", "2_Subreddit": "opiates"}], "dws21ui": [{"0_Comment Submission": "Anyone know what these red pills are?", "1_Text": "Looks like DXM?", "2_Subreddit": "opiates"}], "dwtqy1h": [{"0_Comment Submission": "Is taking Xanax really dangerous ?", "1_Text": "Alprazolam on its own and taken as recommended (very short courses of very low doses) is very safe.\n\nEven at black out doses it’s pretty unlikely that you experience medical issues related to the taking of alprazolam per se.  What you end up doing while you’re blacked out is another story. You might get in your car and kill someone or yourself or both. You could end up doing literally anything because alprazolam chemically turns off all your inhibitions.\n\nAlso it’s incredibly addictive, psychologically and physically. Despite being an anxiolytic drug, it fairly quickly begins to cause paradoxical effects (I.e. heightening anxiety), meaning you try to take more to reduce your anxiety which is at this point worse than it was originally.\n\nPhysically, an alprazolam-dependent addict is at serious risk of seizures, and once you’ve had one seizure your body’s seizure threshold never returns to what it was before.\n\nIf the seizures weren’t enough, being a gabaergic drug, cold-turkey withdraw has a not-insignificant chance of killing you.\n\nI was physically dependent on alprazolam for about 3/4 of a year, I had a couple of seizures when I went home for Christmas, I was burning through money, my anxiety was through the roof and definitely worse than it was when I started, I was constantly playing with fire because 99% of the Xanax pills you see (in the country I’m from anyway) are pressed and you don’t know what you’re getting.\n\nI could go on but you get the picture\n\nSo imo it’s a bad idea", "2_Subreddit": "Drugs"}], "dwtrcr0": [{"0_Comment Submission": "Is taking Xanax really dangerous ?", "1_Text": "There are no 4mg real Xanax tablets so straight off you know it’s a fake press, which means it could have anything in it.\n\nLots of the presses these days don’t even contain alprazolam, they contain super cheap RC benzos because they’re so cheap. There might not be any benzo in it at all, whoever pressed them might just have been looking for the cheapest downer they could find.", "2_Subreddit": "Drugs"}]}], "1_submissions": [{"4wdtcf": [{"0_Title": "I just took a ridiculous amount of acid for my first time", "1_Text": "Tramadol is the shittest of the opioids. Be careful with it, withdrawals are hell on earth and the high you get is rubbish in comparison.\n\nIt lowers your seizure threshold too so don't go messing around with benzos", "2_Subreddit": "Drugs"}], "5iz5o5": [{"0_Title": "Just wanted to say I'm really impressed with the Discord", "1_Text": "Tramadol is the shittest of the opioids. Be careful with it, withdrawals are hell on earth and the high you get is rubbish in comparison.\n\nIt lowers your seizure threshold too so don't go messing around with benzos", "2_Subreddit": "Stims"}], "5oju0z": [{"0_Title": "4FA", "1_Text": "Tramadol is the shittest of the opioids. Be careful with it, withdrawals are hell on earth and the high you get is rubbish in comparison.\n\nIt lowers your seizure threshold too so don't go messing around with benzos", "2_Subreddit": "Stims"}], "6ehfex": [{"0_Title": "My benzo experience (long)", "1_Text": "Tramadol is the shittest of the opioids. Be careful with it, withdrawals are hell on earth and the high you get is rubbish in comparison.\n\nIt lowers your seizure threshold too so don't go messing around with benzos", "2_Subreddit": "Drugs"}], "6lt4sl": [{"0_Title": "Disabling “<app> is currently using your location “ banner on iOS 11?", "1_Text": "Tramadol is the shittest of the opioids. Be careful with it, withdrawals are hell on earth and the high you get is rubbish in comparison.\n\nIt lowers your seizure threshold too so don't go messing around with benzos", "2_Subreddit": "apple"}], "7c48pc": [{"0_Title": "7 days clean after six months of copious amounts of heroin, oxy, poppy seed tea", "1_Text": "Tramadol is the shittest of the opioids. Be careful with it, withdrawals are hell on earth and the high you get is rubbish in comparison.\n\nIt lowers your seizure threshold too so don't go messing around with benzos", "2_Subreddit": "OpiatesRecovery"}], "7elnew": [{"0_Title": "Needle échange", "1_Text": "Tramadol is the shittest of the opioids. Be careful with it, withdrawals are hell on earth and the high you get is rubbish in comparison.\n\nIt lowers your seizure threshold too so don't go messing around with benzos", "2_Subreddit": "northernireland"}], "7fb0y3": [{"0_Title": "22 days today. Went from begging for subs to deciding to cold turkey completely", "1_Text": "Tramadol is the shittest of the opioids. Be careful with it, withdrawals are hell on earth and the high you get is rubbish in comparison.\n\nIt lowers your seizure threshold too so don't go messing around with benzos", "2_Subreddit": "OpiatesRecovery"}], "7go2sd": [{"0_Title": "28 days cold turkey, fuck yeah", "1_Text": "Tramadol is the shittest of the opioids. Be careful with it, withdrawals are hell on earth and the high you get is rubbish in comparison.\n\nIt lowers your seizure threshold too so don't go messing around with benzos", "2_Subreddit": "OpiatesRecovery"}], "7k7xxk": [{"0_Title": "44 days clean, PAWS kicking my arse", "1_Text": "Tramadol is the shittest of the opioids. Be careful with it, withdrawals are hell on earth and the high you get is rubbish in comparison.\n\nIt lowers your seizure threshold too so don't go messing around with benzos", "2_Subreddit": "OpiatesRecovery"}]}]}]}