{"GoodTimes85": [{"0_comments": [{"diwwh1t": [{"0_Comment Submission": "Any Drinkers near the Fort Worth/Dallas ,TX area???", "1_Text": "Off topic ... but I am one of those desperate fools in search of Pappy. My dad lives in DFW Midlothoian area and I was wondering if there were any liquor stores you could recommend that I could have him check out?", "2_Subreddit": "bourbon"}], "dj2waup": [{"0_Comment Submission": "Any Drinkers near the Fort Worth/Dallas ,TX area???", "1_Text": "Well the whiskey is actually for me! I live In San Diego, CA and I am actually looking for Weller 12 year. I found it for $150 and the special reserve for $30. I bought the Special Reserve and enjoyed it. So now I want to ask him to look for the 12 year. So yes if you recommend some stores he could check out", "2_Subreddit": "bourbon"}], "dj38k2v": [{"0_Comment Submission": "Any Drinkers near the Fort Worth/Dallas ,TX area???", "1_Text": "Another store out here had it for $200. So yeah I think I'm gonna have to recruit my dad to get me a properly priced bottle. Where should I send him to in DFW?", "2_Subreddit": "bourbon"}], "dj95jy4": [{"0_Comment Submission": "IndiaSt[USA][San Diego]", "1_Text": "I'm curious about your \"poor man's Pappy\". At this point that's the closest I'm going to get to trying Pappy so of the different mixtures and percentages which one do you prefer? And were you able to buy Weller locally at a fair price? The cheapest I've seen 12 year is $150 near me in San Marcos. I'm trying to recruit my dad who lives in Texas to buy me some. Thanks!", "2_Subreddit": "whiskyinventory"}], "dj96kb6": [{"0_Comment Submission": "IndiaSt[USA][San Diego]", "1_Text": "I'm curious about your \"Poor Man's Pappy\". At this point that's probably the closest I'm going to get to ever testing Pappy. So which concoction do you prefer out of the different mixtures and percentages? And were you able to buy WL weller locally at a fair price? The cheapest I've seen the 12 year is $150. I'm trying to get my dad who lives inn texas to find me some.", "2_Subreddit": "whiskyinventory"}], "dkler5e": [{"0_Comment Submission": "Review #238: W.L. Weller 12 Year", "1_Text": "Wow! This is manna from heaven. I live in San Diego California where when I find it they want $150-$200. My dad lives in Midlothian, TX. Near DFW and I have been calling blindly trying to find it so at least now I know which stores to call!", "2_Subreddit": "bourbon"}], "dsbvrol": [{"0_Comment Submission": "[QUESTION] Vintage or New Hagstrom?", "1_Text": "Pics?!!", "2_Subreddit": "Guitar"}], "dvlrjy9": [{"0_Comment Submission": "I hate the dope game and methadone game", "1_Text": "Oh man I am so sorry ... what is cold copping? Back in the day my guy was sleeping in and I was getting sick so I went on Craigslist and finally got someone to reply. I only wanted. Ahalf but he said it comes pre packaged in grams and he can’t seperate them. Desperate I say fine, drive an hour. Wait for him at a Carl’s Jr. Make the exchange and when I go to smoke it I find out I spent $80 on candy ... I cried, and when I got back into town my guy had just woken up and hit me up.", "2_Subreddit": "opiates"}], "dvluiez": [{"0_Comment Submission": "I hate the dope game and methadone game", "1_Text": "You would think that everyone in the game would respect or at least have some empathy but no. My wife and some people would say we deserve it “we’re junkies” but for the most part when you’re that desperate you’re not even looking to get high just to get well. In that instance I was at work and needed to get well to work. That’s pretty standard prices here in Southern Cali. $40 a half and $80 for a full. There is a special place in Hell for the asshole who preys on sick junkies ... well brother I’m glad you were able to at least get well I’m l’m “happy” for you. Do this long enough and we’ve all been in that desperate position... what’s your plan tomorrow? You might be able to meet some connects at the clinic. That’s just one of my stories. I’ve lost a bag. Hell I vacuumed a bag out of my truck once. And I was dumb enough to get sold candy again.", "2_Subreddit": "opiates"}], "dvp9o0k": [{"0_Comment Submission": "I hate the dope game and methadone game", "1_Text": "Hey bro how you doing? What’s the latest?", "2_Subreddit": "opiates"}], "dwtw41u": [{"0_Comment Submission": "[Gear] Selling my 1967 Hagstrom III", "1_Text": "That’s another thing ... how do I figure out how much it’s worth?", "2_Subreddit": "Guitar"}], "dwuzpwq": [{"0_Comment Submission": "I hate the dope game and methadone game", "1_Text": "Hey bro just checking in on you ... how are things going?", "2_Subreddit": "opiates"}], "dwv0ffz": [{"0_Comment Submission": "How can I find a dealer for brown now that craigslist is done for?", "1_Text": "Tar", "2_Subreddit": "opiates"}], "dwv7l3c": [{"0_Comment Submission": "I hate the dope game and methadone game", "1_Text": "Oh man did you go through WD cold turkey? Is t true that Methadone WD’s are worse than Heroin? I’m planning on tapering off methadone one of these days. Probably gonna use Keaton towards the end. And a lot of pot.", "2_Subreddit": "opiates"}], "dwv7oeh": [{"0_Comment Submission": "[Gear] Selling my 1967 Hagstrom III", "1_Text": "True ... does Reverb do an auction or just a set price? I don’t even remember what Percentage EBay takes ... but maybe that’s the way to go by having people bid on it.", "2_Subreddit": "Guitar"}], "dwv7ptg": [{"0_Comment Submission": "[Gear] Selling my 1967 Hagstrom III", "1_Text": "I was asking $800 but I’m open to offers.", "2_Subreddit": "Guitar"}], "dwv7t05": [{"0_Comment Submission": "[Gear] Selling my 1967 Hagstrom III", "1_Text": "Right but there is such a vast difference on eBay $600-$1,400. Like my guitar is a 1967 and I saw a 1968 for like $1,500 I think. Like a year can’t make that much of a difference.", "2_Subreddit": "Guitar"}], "dwvvs3p": [{"0_Comment Submission": "[Gear] Selling my 1967 Hagstrom III", "1_Text": "I’m a noob ... how do I post pictures? Yes it came in a vintage very classy tiger print lol on the inside case.", "2_Subreddit": "Guitar"}], "dwvvzph": [{"0_Comment Submission": "I hate the dope game and methadone game", "1_Text": "Wow man I’m proud of you. It’s always inspiring to hear a success story. Gives the rest of us hope. Yeah my wife says I’m crazy for saying that weed makes me sleepy ... she would say and heroin didn’t? And I tried to explain that dope kind of ebbed and flowed with nodding and euphoria ... but weed would defiantly help the WD’s. And if you end up substituting weed for dope that really isn’t a bad thing. Good Luck man. You ever go to NA? It’s always good to fill the obsession with something to help you stay clean.", "2_Subreddit": "opiates"}], "dwxpgtb": [{"0_Comment Submission": "I hate the dope game and methadone game", "1_Text": "I know what you mean about NA making you want to use ... even though they say it’s not about war stories that’s what it feels like. Like you can’t help but be thinking about it when you’re there. Wow you kicked 90MG cold turkey? Yeah I can definitely taper and just deal with the uncomfortableness. Good luck to you. Feel free to reach out anytime and I probably will reach out for some reassurance ...", "2_Subreddit": "opiates"}]}], "1_submissions": [{"89usc7": [{"0_Title": "WTS 1967 Black Hagstrom III", "1_Text": "Off topic ... but I am one of those desperate fools in search of Pappy. My dad lives in DFW Midlothoian area and I was wondering if there were any liquor stores you could recommend that I could have him check out?", "2_Subreddit": "Gear4Sale"}], "89uwvd": [{"0_Title": "[Gear] Selling my 1967 Hagstrom III", "1_Text": "Off topic ... but I am one of those desperate fools in search of Pappy. My dad lives in DFW Midlothoian area and I was wondering if there were any liquor stores you could recommend that I could have him check out?", "2_Subreddit": "Guitar"}]}]}]}