{"jessfrss": [{"0_comments": [{"dwmsmmw": [{"0_Comment Submission": "Sure he's a good boy though", "1_Text": "Fuck if you were near me I’d help you steal and rehome those poor huskies", "2_Subreddit": "AdviceAnimals"}], "dwnt26d": [{"0_Comment Submission": "LPT: Don’t talk about an achievement until it is 100% set in stone.", "1_Text": "I was going to say this was me with runescape, 14 years later and I’m still playing", "2_Subreddit": "LifeProTips"}], "dwntw4k": [{"0_Comment Submission": "This car has two paint jobs", "1_Text": "Nah I was just planning my new wrap once I saw this, let’s make it a trend", "2_Subreddit": "mildlyinteresting"}], "dwnxlz9": [{"0_Comment Submission": "My Airbnb host also has dogs; rescued huskies!", "1_Text": "Plot twist this is an ad for your air bnb and it worked yes I’ll totally stay and play with those big boiiisss", "2_Subreddit": "Awww"}], "dwo988r": [{"0_Comment Submission": "LPT: did you buy a 6-pack of cans with the plastic tie holding them together? Do a bird, turtle, or fish a favor and snip the circular loops before throwing it out so they don’t get caught up in it.", "1_Text": "Good bot", "2_Subreddit": "LifeProTips"}], "dwoc8xy": [{"0_Comment Submission": "‌Toe injury", "1_Text": "This reminds me of the time I was riding my bike, barefoot, about age 8, and I abruptly stopped at a stop sign (absolutely no cars in any direction, idk why I stopped so fast) and my foot went straight into the spokes, my little toes were torn about and I was stuck on the road, literally TWO houses down from mine, no phones because this was before cell phones were a thing, so I waited until a pizza boy saw me and he ran two houses down to get my dad, who just laughed at me the whole way to the ER where they sewed up my toes instead of letting them fall off, for visual purposes, it was my two smallest toes that were hanging by a little piece of skin. Good times, good good times...", "2_Subreddit": "MedicalGore"}], "dwoykmj": [{"0_Comment Submission": "Starting today, more people will have access to the redesign", "1_Text": "It would be my pleasure to try !", "2_Subreddit": "announcements"}], "dwrqr6p": [{"0_Comment Submission": "The “After School in the Late 90s/Early 2000s” Starter Pack", "1_Text": "Is it sad if I still play, and I even still continue to make rs music videos .. nostalgia", "2_Subreddit": "starterpacks"}], "dwsdy17": [{"0_Comment Submission": "[Serious]Teachers who have taught future murderers and major criminals, what were they like when they were under your tutelage?", "1_Text": "Hits close to home, my brother joined the “family business” and dropped out of high school and now in prison. Sad really, I’m the only one in the family not associated wit my the meth business.", "2_Subreddit": "AskReddit"}], "dwsq8if": [{"0_Comment Submission": "BULL RUN CONFIRMED - STDCHECK.COM ACCEPTS BITCOIN!!!", "1_Text": "No, Free STD tests are highly inaccurate and the wait to get in to the testing center and the wait for results could be weeks. STDcheck is the company I work for actually :)", "2_Subreddit": "Buttcoin"}], "dwsqyvq": [{"0_Comment Submission": "Insisting on using protection as a sugar baby", "1_Text": "I work for stdcheck actually and have been *working girl*  as well, I can say some STDs can be passed even if wearing a condom, like HPV, herpes being the main two. Oral herpes can be spread sharing drinks and saliva, but I wouldn’t worry about that since oral\nHerpes is cold sores of the mouth and 8/10 people have it. Just wear protection and be careful- a man can pass oral herpes to *your*  genitalia if they go down on you. Or if they have genital herpes and are not even showing symptoms, if you go down on them they can give you genital herpes in your mouth area, confusing I know, but pretty much HSV1(oral) and HSV2(genital) can show in either area. They make a “dental dam” as well to help avoid the spread of saliva/potential blood even since STDs such as HIV Hep spread via blood.  [dental dam](https://www.cdc.gov/condomeffectiveness/Dental-dam-use.html)", "2_Subreddit": "sugarlifestyleforum"}], "dwsr87f": [{"0_Comment Submission": "ULPT: Feeling petty toward an ex, co-worker, or friend? Report you tested positive for STD's anonymously. They won't know it was you, and you get the smug satisfaction knowing you they are freaking out.", "1_Text": "AHHHH! I work for this company and get messages all day saying “who tf sent this anonymous message to me” and it’s literally anonymous so we do not know and it makes me soooo mad at work and I kneeeeew someone posted it online somewhere lmaooo thank you guys for making my work a living hell some days, but on the real some people get really offended and it’s hilarious", "2_Subreddit": "UnethicalLifeProTips"}], "dwsrol2": [{"0_Comment Submission": "STDcheck.com", "1_Text": "Hi I work for STDCHECK and noooo you do NOT need an ID, it also states that on our lab order form, if you arrive to the lab and they ask for it you can call us and we will gladly speak to them and say no :) \nStdcheck also runs healthlabs and utitreatment just FYI :) \nWe never ever check names or info, funny, we get some people using “Jane doe living at 420 weed st phone number 00000000” sometimes. \nPs I did not say this! \nPss, there’s a few labs that do require it, maybe like 2 in each state but when testing with us the other 99% will not argue, and if they do we will argue for you :)", "2_Subreddit": "STD"}], "dwsrx1e": [{"0_Comment Submission": "STDcheck.com", "1_Text": "If they asked for an ID please please call us, it clearly states on the lab order form “NO ID” and we will be happy to speak to them for you and tell them no. Some lab techs don’t realize and will auto ask but if you bring it up and they actually *read*  the lab order form, it’s resolved. We have a loooot if people using alias since we do not verify annnny info you give us. Also, HIV RNA, Trich, and the NE Region may take 1 more additional day for processing but we still post 7 days a week. Thank you for saying 10/10!!!! Really appreciate that :)", "2_Subreddit": "STD"}], "dwsrz7b": [{"0_Comment Submission": "STDcheck.com", "1_Text": "The chat thing is great, highly recommend, 10/10, ;) they’re open 6am to 10 pm and they’re suuuuper great people who just browse Reddit all day", "2_Subreddit": "STD"}], "dwss4un": [{"0_Comment Submission": "Probably minimal risk, right?", "1_Text": "Hi! I work for this company so if you have questions please reach out to me:) hpv and herpes can be passed w/o condom", "2_Subreddit": "STD"}], "dwss76r": [{"0_Comment Submission": "Probably minimal risk, right?", "1_Text": "If you want to do 10 panel it is suggested to wait 8-10 weeks for best accuracy, or you can buy the panel and call us to split it up and take chlaymdia gonnerhea early and the rest later :)", "2_Subreddit": "STD"}], "dwsssvm": [{"0_Comment Submission": "5 days of hell - opiate withdrawal", "1_Text": "Fuck honestly Like death, kratom and xans aren’t helping, my best friend shipped me like 20 kpins and those are only helping somethings, The cold sweats and the joint pain is fucking with me so bad and my stomach is all sorts of fucked I think because of kratom, mentally Idk wtf to think, weed isn’t helping at all either. I deleted all my dealers info but hid them somewhere so they’re technically in arms reach and it’s fucking hard not to pick up the phone and say wya ya feel meee. I’ve been playing runescape to try to distract myself but it’d be so easy to fix this sickness ya feel. I think my animals know I’m sick tho my cats all up on me more than usual so that’s nice I guess.", "2_Subreddit": "Drugs"}], "dwt96w4": [{"0_Comment Submission": "Insisting on using protection as a sugar baby", "1_Text": "My pleasure if you ever have questions regarding stdcheck.com I’m ya gurrrl ;) play safe out there, and be careful, I’ve come across many girls whom almost gotten kidnapped from a potential SD", "2_Subreddit": "sugarlifestyleforum"}], "dwz2qcr": [{"0_Comment Submission": "[META] This subreddit", "1_Text": "Beautiful sub", "2_Subreddit": "ExpectationVsReality"}], "dwz4bsx": [{"0_Comment Submission": "25000 mg", "1_Text": "This hits so close to home, I took 30 acetaminophen along with some SSRI and Xanax, probably 75 pills total, blacked out on the phone with my boyfriend at the time who called my mom immediately, went to ER and they tried to force charcoal down my throat but I couldn’t drink it, they had such a hard time putting tubes down my throat they ran out of time and had to use defibrillators. When I woke up and realized I survived it, I was all alone in the hospital. My mom, dad, not even boyfriend came to visit me, for the entire week I was in there. I was 16 yrs old and can’t take Tylenol or shit anymore because of my liver. Shit alcohol is dangerous too at this point. I think about that shit almost daily, and now I’m 22 and my mom won’t even admit that happened, can’t say I’m “cured” I still would much rather be dead, but I literally force myself to take it one damn day at a time.", "2_Subreddit": "SuicideWatch"}], "dwz4n6m": [{"0_Comment Submission": "Got a gun in my mouth, i have never been more ready", "1_Text": "Hey if you need to reach out please do, my bestest guy friends wife killer herself recently and seeing him overcome the struggle was a miracle, but op you can do it, trust me, please believe me when I say this, you can overcome this.", "2_Subreddit": "SuicideWatch"}], "dwz4t85": [{"0_Comment Submission": "I just want someone to talk to", "1_Text": "You can always pm me", "2_Subreddit": "SuicideWatch"}], "dwz4xrn": [{"0_Comment Submission": "I will jump from the window in my apartaments tommorow.", "1_Text": "Wanna talk? I’m here op", "2_Subreddit": "SuicideWatch"}], "dwz55gz": [{"0_Comment Submission": "Smile and stay quiet", "1_Text": "Fuck op... you hit all the spots.. if you need to talk I’m here, I’ll listen", "2_Subreddit": "SuicideWatch"}]}], "1_submissions": [{"85vii7": [{"0_Title": "EMS reports to murder/suicide, found suspect walking around without his face", "1_Text": "Fuck if you were near me I’d help you steal and rehome those poor huskies", "2_Subreddit": "CrimeScene"}]}]}]}