{"jones-singh": [{"0_comments": [{"dfg7krn": [{"0_Comment Submission": "Anyone willing to make an order for me through the onion patches", "1_Text": "Are you sure?  I've never used one but I was always under the impression that you could write tails to a flash drive and boot off of that.", "2_Subreddit": "opiates"}], "dfg7nug": [{"0_Comment Submission": "Anyone willing to make an order for me through the onion patches", "1_Text": "Pretty sure there are tor-enabled distros for the pi specifically.  Dig around and I'm sure you can find something.  You could always use Kali in a pinch on it and use tor that way.  Not the most secure setup around, but not bad.", "2_Subreddit": "opiates"}], "dfpc7b1": [{"0_Comment Submission": "What would /r/opiates April Fool's be?", "1_Text": "I feel like we are overdue for a new loperamide BBB \"breakthrough\" claim.", "2_Subreddit": "opiates"}], "dfpcuog": [{"0_Comment Submission": "New Rule Regarding Memes", "1_Text": "I love you, Fash.  ♥  :)  Good to see a •good• Apr 1 gag", "2_Subreddit": "opiates"}], "dftzb7a": [{"0_Comment Submission": "Shitposting some Dandy Warhols", "1_Text": "Yeah.  They have a really shitty attitude.  Went through a time when I listened to them on heavy rotation.  Still love that video though.  \nAnd makes sense about David LaChapelle directing it.", "2_Subreddit": "opiates"}], "dfuch44": [{"0_Comment Submission": "Shitposting some Dandy Warhols", "1_Text": "A friend of mine was huge into the Dandy Warhols and tried to get me to watch the documentary.  Have been meaning to for a while.  I just get the sense that they're super super egotistical, so it has never made it to my Top Ten Must-Watch movies.", "2_Subreddit": "opiates"}], "dh1s0of": [{"0_Comment Submission": "Today's boulder.", "1_Text": "JESUS FUCKING CHRIST.  I'm drooling over here.", "2_Subreddit": "opiates"}], "dh1ue8t": [{"0_Comment Submission": "Best way to convert PayPal to dope? Anyone got better ideas than I?", "1_Text": "It's instant, but I don't have that luxury, unfortunately.  All of my friends just recently came to know about my habit.  And they're right - I shouldn't be using anyway, but if I will, and if I ask anyone about money-related things, they'll immediately think (correctly) that I'm up to something.  Ugh...", "2_Subreddit": "opiates"}], "dh1ugvi": [{"0_Comment Submission": "Best way to convert PayPal to dope? Anyone got better ideas than I?", "1_Text": "Correct.  No (current (valid)) checking account.  And yeah, it takes a couple days even if I weren't a scumbag junkie who ran out on my bank when it appeared I wouldn't be able to cover my overdraft fees.  These things have a way of catching up, don't they?  ;)", "2_Subreddit": "opiates"}], "dh1uhem": [{"0_Comment Submission": "Best way to convert PayPal to dope? Anyone got better ideas than I?", "1_Text": "?", "2_Subreddit": "opiates"}], "dh1uin3": [{"0_Comment Submission": "Best way to convert PayPal to dope? Anyone got better ideas than I?", "1_Text": "Because it takes something like 2-3 days to link the account, I don't have a bank account anymore, and the one business day thing makes it take even longer.", "2_Subreddit": "opiates"}], "dh1us2i": [{"0_Comment Submission": "Best way to convert PayPal to dope? Anyone got better ideas than I?", "1_Text": "Thanks man. :/", "2_Subreddit": "opiates"}], "dh1uu1p": [{"0_Comment Submission": "Best way to convert PayPal to dope? Anyone got better ideas than I?", "1_Text": "I like this idea but I don't know that I can go to social media with this.  Mentioned in another post that the cat is out of the bag in regard to my habit, and it'll go badly I'm sure.  Otherwise solid idea.", "2_Subreddit": "opiates"}], "dh2p8y4": [{"0_Comment Submission": "Best way to convert PayPal to dope? Anyone got better ideas than I?", "1_Text": "None of them do unfortunately.  They all are cash desperate.", "2_Subreddit": "opiates"}], "dh2p9un": [{"0_Comment Submission": "Best way to convert PayPal to dope? Anyone got better ideas than I?", "1_Text": "Thanks, but that requires me to link it as a bank account and wait a few days for that to happen, right?", "2_Subreddit": "opiates"}], "dh2pf78": [{"0_Comment Submission": "Best way to convert PayPal to dope? Anyone got better ideas than I?", "1_Text": "Yeah, I wish I could do any of those, but I believe I am fucked.  I'm getting a ride to the store in a few mins.  Maybe I can go to Dollar general (where they actually accept PayPal) and buy some household items, then go back and return them.  I've had them refund cash before, but it is hit or miss.  Dunno what else I can do.  Maybe I could get my client to pay me via WU but that's kinda sketchy and I try my best to keep my junkie business separate from my real business the best I can.  \n\nThank you for the ideas though.", "2_Subreddit": "opiates"}], "dh4avt5": [{"0_Comment Submission": "Best way to convert PayPal to dope? Anyone got better ideas than I?", "1_Text": "I have a card linked, but I can't seem to load my card.", "2_Subreddit": "opiates"}], "di8h3nh": [{"0_Comment Submission": "Tuesday, may, 30, 2017 CHECK IN", "1_Text": "Good afternoon, everyone.  I have had an amazing past few days.  Rather, an amazing month, as I just came from a WONDERFUL treatment center last Friday and checked into a recovery house upon discharge.  I've been hitting at least two meetings per day, fellowshipping with the recovery community (including my housemates,) and just had my first IOP this morning.  I found a truly fantastic sponsor on Sunday morning and every time I talk to him, I feel my Higher Power working through our interactions.  I've had little struggles here and there, but have talked them out in meetings, with housemates, and with my sponsor.  I've never felt more passionate about anything in my life as I feel about recovery.  50 days clean today, and taking in so much about this beautiful process.  If you'd have told me two months ago that I was about to undergo a spiritual journey that would lead to this degree of wonder and awe, I would have told you to piss off while I banged some dope.  I'm deeply grateful for everything I've been through, continue to experience, and whatever my Higher Power has in store for me.", "2_Subreddit": "OpiatesRecovery"}], "duw8ifb": [{"0_Comment Submission": "How naive is it to think you can use heroin daily as a part of your lifestyle?", "1_Text": "You already answered your question, but I think it bears emphasis that you will not be able to keep it going forever if you use every day.\n\nEven if you're not WDing and haven't destroyed your life yet, you've allowed yourself to *believe* that you \"need\" the dope.  That promise of the next high is irresistible, is it not?  Desire and its bastard child, obsession, can be the most difficult thing to contend with in life.  However, it is never too late to change your beliefs.  \n\nOver the past several months, I have been reading a lot of works by psychologists and neuroscientists who are currently pioneering the addiction field, and most of their philosophy can be traced back to the works of the great Dr. Albert Ellis.  He created a self-empowering, highly effective  psychological tool in the '50s called Rational Emotive Behavior Therapy, or REBT.\n\nWhat Ellis did was revolutionary, in my opinion, and in the opinion of many mental health professionals today.  He often worked with addicts, alcoholics, people who were struggling with self-confidence or motivation problems, and found that by changing one's *beliefs* about obstacles in life, they could overcome them.  \n\nOften, we think of therapy as sitting on a couch and boo-hooing about our feelings, right?  This approach puts the ball in the client's court.  You can feel or think a certain way and express it all you like, and while there may be some benefits to doing so, you're not really doing anything about those thoughts and feelings.  REBT tells us that we can acknowledge what's referred to as (A) - the Activating event (constantly craving dope, for example,) (B) - our Beliefs about it (\"I *CAN'T* stand this obsession,\") and (C) - the Consequences of giving into our beliefs about our problem (using over and over again, Hep C, going to jail, etc.)  Ellis believed that if we challenged the (B) in this scenario by thinking realistically, critically, and rationally about the consequences of giving into (A), we could take the power away from all three of these things and change the way we perceive our problems.  By conquering our urges little by little through reframing our perspective, we gain more self-confidence and it becomes even easier to discredit our previously strong beliefs about our substance use.  Do that several hundred times over (not by resisting urges, but by discrediting their power,) and you find that the drug or behavior doesn't have nearly the power over you as you used to believe.  \n\nAddiction CAN be a harsh, lonely, heart-breaking road.  It certainly was for me when I was using heavily.  OR on the other hand, it can be a mere obstacle that you encounter and get over, just like any other problems you run into in life.  It doesn't HAVE to be the doom and gloom - that foregone conclusion of despair that society reminds us of.  It certainly can be if you choose to buy into it, but it can also be conquered with rational thought, critical thinking, and self-empowerment.\n\nYou don't have to buy into the disease model and the 12-step philosophy of \"powerlessness\".  I learned this the hard way and refute that garbage every chance I get.  I was a sick, foundering junkie shooting around a gram and a half a day.  I believed I had no prospects and no future when I got to rehab and the 12-step machine.  They reinforced that thinking and told me that without their way, I'd die a junkie.  Their way was something like this - admitting powerlessness, believing that I am diseased and will be for life, telling me that there's NO WAY I can get better without being subservient to a sponsor and turning my will and life over to a higher power, making me find all of my faults and atone for them via prayer and amends, and proselytizing this pseudoscientific faith healing nonsense to others.\n\nI drank the Kool-Aid and put all my eggs in that basket until I realized that I was deluding myself.  I reject ALL of that crap and am doing just fine.  Life is beautiful and full of possibilities, and I'm a bright, capable, promising human being. Why?  Certainly not because I prayed for \"God\" to \"remove my 'defects' of character,\" but because I began to believe in myself again and started changing my beliefs about life struggles, depression, and drugs.  I can choose to use or I can choose not to.  There is no wrong answer.  \n\nSorry for the rant, but if anything I said strikes any kind of chord with you, please do yourself a favor and check out SMART Recovery or just plain old REBT.  It has proven to be a crucial tool in my life and allowed me to stop feeling guilty or sorry for myself and get on with life.", "2_Subreddit": "opiates"}], "duw9ju4": [{"0_Comment Submission": "Sub doctor arrested...this left for 400 now sick patients", "1_Text": "You're a far more gracious person than I for scribbling out that quack's name.  Sub doctors, by and large, are opportunistic slime bags as far as I'm concerned.  True, they provide meds to those who are trying to make a change in their lives, but they often go overboard with the dosage and fill their patients' heads with misinformation and fear.  I've seen far too many people on Suboxone for several years at absolutely insane daily dosages.  I have more moral respect for your average dope boy.  At least with him, you're getting high out of the deal, and withdrawal from fent or heroin, while extremely uncomfortable and shitty (no pun intended,) isn't as long and miserable as detoxing from 36mg of daily buprenorphine for a month or two.  Not to mention, doctors take the Hippocratic Oath (\"do no harm\") and pretend to provide a ray of hope in the lives of their patients, all the while cashing in big time on their disgusting scam.  \n\nFuck sub doctors, and I earnestly hope that piece of human waste feels even a slight percentage of the suffering he or she inflicted upon his/her patients in the days, months, and hopefully years to come.", "2_Subreddit": "opiates"}], "duw9uzu": [{"0_Comment Submission": "Sub doctor arrested...this left for 400 now sick patients", "1_Text": "Why am I not surprised Medicaid fraud came up in this thread?  Sub docs, methadone clinics, and rehabs are constantly pulling this kind of shit in the name of providing hope for the down trodden - hope for a better life against the Disease of Addiction™, and they line their pockets often at the expense of taxpayers, complete with cheesy slogans on billboards and the support of the public - a public that is woefully misinformed about what addictive behavior is and how it can be overcome.  \n\nI'm all for MAT if someone needs it, but I'm only for RESPONSIBLE treatment.  This shit is the Wild West right now, and these peddlers of \"hope\" and \"compassion\" should be burned at the stake as far as I'm concerned.  That goes for shady MAT providers and 12-Step-Facilitated rehab facilities alike.  \n\nEducation and action are the key.  Not false claims of hopelessness for those who already feel like they have no power to change their lives.  \n\nTo the gulag with this piece of trash and everyone like him.  I have no sympathy.", "2_Subreddit": "opiates"}], "duw9xno": [{"0_Comment Submission": "Sub doctor arrested...this left for 400 now sick patients", "1_Text": "A common misconception is that being smart is a prerequisite for financial success.  Intelligence doesn't have to be part of the equation at all.  It can certainly help, but in order to succeed in any sort of business, the only real requirement is the desire to take.", "2_Subreddit": "opiates"}], "duwa3lf": [{"0_Comment Submission": "Sub doctor arrested...this left for 400 now sick patients", "1_Text": "Where, indeed.  Probably was never there to begin with, and the only reason this oxygen thief got into medicine to begin with was the concept that doctors, by and large, make a ton of money.  \n\nIt's the biggest motivator for most people - not common decency or a willingness to serve others in need and make a comfortable living while making the world a better place.  No, no.  The near-guarantee of making an absolute killing after med school was what got this guy into the profession.  Oath schmoath... It's all about raking in the money from a panicked and heartbroken public who are terrified of addiction.", "2_Subreddit": "opiates"}], "duwa5o6": [{"0_Comment Submission": "Sub doctor arrested...this left for 400 now sick patients", "1_Text": "Yep, and in either of those scenarios, it's not the doc's problem.  Out of sight, out of mind.  He'll likely do time for a couple months and take money baths nightly when he gets out.  Hey, he got his.  That's the important part. Fuck everyone else.", "2_Subreddit": "opiates"}], "dwgifkn": [{"0_Comment Submission": "Greetings! Cold cop story", "1_Text": "Confirmed.  Every time I cold copped, this was the way to do it.  Was always super quick and I always walked away with a bag and a new plug.", "2_Subreddit": "opiates"}]}], "1_submissions": [{"3ucgja": [{"0_Title": "Thankful for being able to enjoy the day today with my family rather than being worried about copping later. Better than last year by a mile. Thank you, Junkie Jesus.", "1_Text": "Are you sure?  I've never used one but I was always under the impression that you could write tails to a flash drive and boot off of that.", "2_Subreddit": "opiates"}], "3v62pe": [{"0_Title": "Dope Porn: my score from today that almost didn't happen", "1_Text": "Are you sure?  I've never used one but I was always under the impression that you could write tails to a flash drive and boot off of that.", "2_Subreddit": "opiates"}], "4bxikj": [{"0_Title": "I am weak, sad, and angry at myself, and I need to vent.", "1_Text": "Are you sure?  I've never used one but I was always under the impression that you could write tails to a flash drive and boot off of that.", "2_Subreddit": "opiates"}], "4cglxo": [{"0_Title": "Gang Starr - Full Clip", "1_Text": "Are you sure?  I've never used one but I was always under the impression that you could write tails to a flash drive and boot off of that.", "2_Subreddit": "WNOD"}], "4dcqgo": [{"0_Title": "To sub or not to sub...", "1_Text": "Are you sure?  I've never used one but I was always under the impression that you could write tails to a flash drive and boot off of that.", "2_Subreddit": "opiates"}], "4e99uy": [{"0_Title": "So what do you guys do to take your mind off of this lifestyle and its repercussions?", "1_Text": "Are you sure?  I've never used one but I was always under the impression that you could write tails to a flash drive and boot off of that.", "2_Subreddit": "opiates"}], "4i5t3o": [{"0_Title": "Wish me luck", "1_Text": "Are you sure?  I've never used one but I was always under the impression that you could write tails to a flash drive and boot off of that.", "2_Subreddit": "opiates"}], "5cbx20": [{"0_Title": "[Mild Dope Porn] My evening's refreshments", "1_Text": "Are you sure?  I've never used one but I was always under the impression that you could write tails to a flash drive and boot off of that.", "2_Subreddit": "opiates"}], "5fjsbm": [{"0_Title": "I'm in a weird spot", "1_Text": "Are you sure?  I've never used one but I was always under the impression that you could write tails to a flash drive and boot off of that.", "2_Subreddit": "opiates"}], "5gtmac": [{"0_Title": "For those of you without exchanges, how do you get rigs?", "1_Text": "Are you sure?  I've never used one but I was always under the impression that you could write tails to a flash drive and boot off of that.", "2_Subreddit": "opiates"}], "5hdpge": [{"0_Title": "Just got my breakfast shot into my vein. Suddenly remembered this track as soon as I copped.", "1_Text": "Are you sure?  I've never used one but I was always under the impression that you could write tails to a flash drive and boot off of that.", "2_Subreddit": "opiates"}], "5hdpgf": [{"0_Title": "Just got my breakfast shot into my vein. Suddenly remembered this track as soon as I copped.", "1_Text": "Are you sure?  I've never used one but I was always under the impression that you could write tails to a flash drive and boot off of that.", "2_Subreddit": "opiates"}], "5oy07r": [{"0_Title": "A passing thought about dope and local economies", "1_Text": "Are you sure?  I've never used one but I was always under the impression that you could write tails to a flash drive and boot off of that.", "2_Subreddit": "opiates"}], "5stdp7": [{"0_Title": "[Shitpost] Hope you're all having a nice morning!", "1_Text": "Are you sure?  I've never used one but I was always under the impression that you could write tails to a flash drive and boot off of that.", "2_Subreddit": "opiates"}], "5z5030": [{"0_Title": "What's in my dope? [Shitpost]", "1_Text": "Are you sure?  I've never used one but I was always under the impression that you could write tails to a flash drive and boot off of that.", "2_Subreddit": "opiates"}], "63gdxn": [{"0_Title": "Shitposting some Dandy Warhols", "1_Text": "Are you sure?  I've never used one but I was always under the impression that you could write tails to a flash drive and boot off of that.", "2_Subreddit": "opiates"}], "68w9dm": [{"0_Title": "Best way to convert PayPal to dope? Anyone got better ideas than I?", "1_Text": "Are you sure?  I've never used one but I was always under the impression that you could write tails to a flash drive and boot off of that.", "2_Subreddit": "opiates"}], "79aife": [{"0_Title": "First time in the hospital for an OD. Really depressed. :(", "1_Text": "Are you sure?  I've never used one but I was always under the impression that you could write tails to a flash drive and boot off of that.", "2_Subreddit": "opiates"}]}]}]}