{"PhatSkinnyNigga": [{"0_comments": [{"dw9y8k0": [{"0_Comment Submission": "Scored a 100 pack of blues... Last hooray before getting sober for good", "1_Text": "I know but these dude swear they pay 15-20 and their connect is a nigga in the Mexican mafia lmfao lyin ass", "2_Subreddit": "opiates"}], "dwad93e": [{"0_Comment Submission": "Hate seeing this sub in /trashy", "1_Text": "Niggas want that karma that’s why....they’re addicted to it, ironic right?", "2_Subreddit": "opiates"}], "dwadddv": [{"0_Comment Submission": "Snorting oxy VS swallowing", "1_Text": "When I started fuckin wit these I made myself a rule that I would never sniff them and I’ve always stuck to that, over 7-8 years and plus it’s like you said it lasts way longer and I feel like u get ur money’s worth", "2_Subreddit": "opiates"}], "dwadjpz": [{"0_Comment Submission": "HELP ASAP POSSIBLE OD", "1_Text": "Bruh you’re dumb as fuck please don’t ever call 911 on your dealer, this has gotta be the dumbest shit I’ve seen on here. Y’all panic the fuck out over every single thing that happens and somehow come up with the worst possible solution, break into your dealers home or call the cops because you think he’s dead? Those were literally the best options you came up with?", "2_Subreddit": "opiates"}], "dwadosx": [{"0_Comment Submission": "Getting off probation in 2 weeks. Very excited but also very worried.", "1_Text": "Honestly I wouldn’t even start smoking weed or drinking again you know exactly where it’ll lead. Go hit the gym or some shit", "2_Subreddit": "opiates"}], "dwai73d": [{"0_Comment Submission": "Comment here to get notified by the bot.", "1_Text": "Poopy", "2_Subreddit": "CreepyAskredditBot"}], "dwbr6pc": [{"0_Comment Submission": "Nods and Fortnite", "1_Text": "Xbox, PC or PS4??", "2_Subreddit": "opiates"}], "dwcm3cy": [{"0_Comment Submission": "Scored a 100 pack of blues... Last hooray before getting sober for good", "1_Text": "Nigga I didn’t say it was a good price", "2_Subreddit": "opiates"}], "dwdmrnb": [{"0_Comment Submission": "People who use security cameras, what's the creepiest thing you've seen on your camera?", "1_Text": "Do you have the footage still", "2_Subreddit": "AskReddit"}], "dwdmytr": [{"0_Comment Submission": "Nodding at work like", "1_Text": "The worst is when you’re scrolling facebook and leave 6-7 random comments on people’s pictures and have to explain when you come back around why you commented “no I dont hczzhbcfjbb” on a bikini pic from a vacation in Cancun", "2_Subreddit": "opiates"}], "dwe8kej": [{"0_Comment Submission": "BE CAREFUL OF SOME NEW ACCOUNTS!!", "1_Text": "Still can’t believe they clapped stringer and the lil homie Wallace", "2_Subreddit": "opiates"}], "dwethi9": [{"0_Comment Submission": "Getting high and watching white girl", "1_Text": "That bitch busted", "2_Subreddit": "cocainegonewild"}], "dwey85s": [{"0_Comment Submission": "Difference between opiate highs. Also help with determining if a blue I got was pressed", "1_Text": "Used to be from LI so many fake A’s and M’s I had a steady connect but once in a blue moon I would go to someone else and it was always problems", "2_Subreddit": "opiates"}], "dwfy6b0": [{"0_Comment Submission": "Anyone else getting jammed in Hope county!!?", "1_Text": "Game is fuckin crazy addicting", "2_Subreddit": "opiates"}], "dwininp": [{"0_Comment Submission": "What movie did you see as a child that still disturbs you now that you are an adult?", "1_Text": "That guy is Glenn Close", "2_Subreddit": "AskReddit"}], "dwmd32t": [{"0_Comment Submission": "Got super high, turned into a blood monster, and scared all of the people at my local walgreens", "1_Text": "Lmao bruh", "2_Subreddit": "Drugs"}], "dwmzi75": [{"0_Comment Submission": "I overdosed and nearly died last night", "1_Text": "Damn bruh", "2_Subreddit": "Drugs"}], "dwqkl1g": [{"0_Comment Submission": "Found in /trashy. While y'all striking out on Whisper this chick letting the drugs find her.", "1_Text": "Story time", "2_Subreddit": "opiates"}], "dwsuens": [{"0_Comment Submission": "Why isn't my percocet kicking in?", "1_Text": "Definitely cause you ate. When I eat and take shit right after it takes hella long to kick in if it all. I learned to wait like an hour after eating to take anything. Something with the food and pills being digested at the same time. Just take a little extra you’ll be iight", "2_Subreddit": "opiates"}], "dwsupri": [{"0_Comment Submission": "Why isn't my percocet kicking in?", "1_Text": "No problem homie, take a Benadryl instead of another perc it’ll bring the nod on heavy. Good luck", "2_Subreddit": "opiates"}], "dwu5aoq": [{"0_Comment Submission": "I'm Eric Hafner, I'm running for U.S. Congress in Portland, Oregon (OR-3). I want to legalize all drugs, including opiates, but offer ibogaine therapy too, and free drugs for addicts via prescription.", "1_Text": "Ma nigga gangsta as fuck he said “y’all could pull up wit the strap, but I keep that .45 tucked too cuh”", "2_Subreddit": "opiates"}], "dwv2q8g": [{"0_Comment Submission": "Ok experts. Which one is real and which one is fake?? One is from a sealed bottle and one was bought online that was marketed on a site as “movie props” it’s simply a sugar pill..", "1_Text": "I think you’re fucking around and they’re both real or both fake probably real", "2_Subreddit": "opiates"}], "dwv2ved": [{"0_Comment Submission": "Ok experts. Which one is real and which one is fake?? One is from a sealed bottle and one was bought online that was marketed on a site as “movie props” it’s simply a sugar pill..", "1_Text": "So I’ll go with the one on the right is real, I guess?", "2_Subreddit": "opiates"}], "dwwbqgz": [{"0_Comment Submission": "My dboy who sold me these bricks invited me into his trap house to party. I politely declined", "1_Text": "Nicky Barnes and them through the 70s/80s then the coke fad came in and alpo/AZ/rich porter and a few others were pumping heavy in Harlem then a bunch of crazy shit happened then a few rappers moved decent weight in Harlem/Spanish harlem then papis/mafia were plugs now it’s all cartels.", "2_Subreddit": "opiates"}], "dwwevga": [{"0_Comment Submission": "what the fuck just happened", "1_Text": "And of his innocence, I think that’s why the piano was painted those colors, they could’ve painted darker colors but they specifically chose those bright “child finger paint” like colors. Darius’ innocence was the piano and as he was ALMOST gonna leave with it, it was stripped away from him by teddy and then the cops. I think the elevator also has something to do with prince’s death. He died in an elevator in his mansion. Darius took the elevator with his innocence, as prince did and but when he left the elevator entering the basement he realized how fucked up the situation was and his innocence was again taken away when he was asked to get the gun and kill teddy.  And the drop of blood on the piano signifies his “innocence” being tainted but he loves music so he didn’t really care.", "2_Subreddit": "AtlantaTV"}]}], "1_submissions": [{}]}]}