{"infecteduser": [{"0_comments": [{"dwfookj": [{"0_Comment Submission": "Just finished adding sound/LED's to $2000 dollars worth of brass this past week", "1_Text": "Aww :(", "2_Subreddit": "modeltrains"}], "dwhzami": [{"0_Comment Submission": "I'm a forensic toxicology researcher investigating kratom", "1_Text": "Thank you for your work", "2_Subreddit": "kratom"}], "dwio4oc": [{"0_Comment Submission": "This one goes out to all the people with broken hearts right now", "1_Text": "See you on the red pill sub", "2_Subreddit": "kratom"}], "dwio78z": [{"0_Comment Submission": "Take kratom AFTER you work out.", "1_Text": "I take 2.5 gram of white before i walk into the gym. Bout a half hour later it kicks in and powers me through my workout. By the time I leave the gym half hour later I feel fucking fantastic", "2_Subreddit": "kratom"}], "dwioi2u": [{"0_Comment Submission": "I am so sad about the Reddit rule changes. :(", "1_Text": "Look here's what happened.  After the school shootings and crap about guns Reddit wanted to shut down anyone selling or trading guns on the platform. In order to do that they had to shut down selling and trading of everything or risk losing a huge base of users. We are just one small casualty. You can still direct message people if you're struggling or having questions about vendors and strains", "2_Subreddit": "kratom"}], "dwiomqj": [{"0_Comment Submission": "Kratom with an antidepressant?", "1_Text": "Successfully used kratom to ween off zoloft. And it's kept me off dog food for years. It shouldn't be a problem in my experience. But self medicating my depression never worked.  What did work was diet exercise getting a job I like and kratom instead of weed dope and beer", "2_Subreddit": "kratom"}], "dwioshc": [{"0_Comment Submission": "Hardcore Sweating?", "1_Text": "Some strains are known to be vascodialators. This can cause flushing of the face hands and feet as well as increased sweating. Your options are to take less, take a different kind or turn up your a.c.  nice glass of lemonade might help. But seriously stay hydrated it helps", "2_Subreddit": "kratom"}], "dwip7rl": [{"0_Comment Submission": "New user looking for dosage advice", "1_Text": "The best dose is the minimal effective dose for you. We can guess based on your age height weight and bmi but how it makes you feel is most important. Don't bother trying to chase a high because that's not how kratom works. Remember minimal effective dose. I'm 34 yo male 6foot tall and 165lbs. I've been taking 2.5 gram 3 times a day. On days I workout like MWF I take an additional 1.5 gram before gym. I only dose in the morning on Sundays and take the rest of the day off. I hope that helps get u started", "2_Subreddit": "kratom"}], "dwjkmsx": [{"0_Comment Submission": "This one goes out to all the people with broken hearts right now", "1_Text": "don't be a Chad OP.  Take the red pill. Get some knowledge", "2_Subreddit": "kratom"}], "dwmif72": [{"0_Comment Submission": "Perhaps those of us who have used kratom to overcome opiates can give our take on how kratom has helped us.", "1_Text": "I don't trust CNN to give an honest opinion anymore than I'd trust fox news to write something critical of Trump. They are both horrible. However I've been off dope for more than 2 years now. No more ssri' s either. I've never been happier or healthier. God bless kratom", "2_Subreddit": "kratom"}], "dwmiw3v": [{"0_Comment Submission": "We're Back, Baby", "1_Text": "And on the 10th day gun deals rose from the dead in fulfillment of the scriptures!", "2_Subreddit": "gundeals"}], "dwmj2ny": [{"0_Comment Submission": "This sub has really really really slowed down since the new rules", "1_Text": "R/gundeals is back. This bodes well for us. I hope", "2_Subreddit": "kratom"}], "dwmj9qq": [{"0_Comment Submission": "This sub has really really really slowed down since the new rules", "1_Text": "Gun deals is back. Rejoice! Kratom reviews are next", "2_Subreddit": "kratom"}], "dwmjfst": [{"0_Comment Submission": "Phenibut for tolerance taper?", "1_Text": "Worst.\nIdea. \nEver.", "2_Subreddit": "kratom"}], "dwmkfwj": [{"0_Comment Submission": "R/buildapcsales and r/gundeals back up", "1_Text": "You're right they never went down but there was rumor they would. I think this all stems from Reddit being anti gun and anti drug. I think if the kratom community kept all the vendor/ strain talk on swapsell we could strike a nice balance.", "2_Subreddit": "kratom"}], "dwms9lk": [{"0_Comment Submission": "R/buildapcsales and r/gundeals back up", "1_Text": "I hope so too. I can do without the shilling tho.", "2_Subreddit": "kratom"}], "dwnbe9l": [{"0_Comment Submission": "R/buildapcsales and r/gundeals back up", "1_Text": "The cancer had spread. That's true. But I wouldn't say the patient is dead quite yet!", "2_Subreddit": "kratom"}], "dwngldz": [{"0_Comment Submission": "I just can't stand kratom's taste. Help!", "1_Text": "Time to start making capsuls", "2_Subreddit": "kratom"}], "dwnj87z": [{"0_Comment Submission": "R/buildapcsales and r/gundeals back up", "1_Text": "I've never seen a pharma ad on Reddit but I've never googled erectile dysfunction. There is a kratom discord now you know?", "2_Subreddit": "kratom"}], "dwnl1zd": [{"0_Comment Submission": "Policy Change regarding human consumption", "1_Text": "There is actually no law against consuming illegal drugs. It's your body and you can do whatever you want with it. However it is illegal to be in possession of said drugs.", "2_Subreddit": "opiates"}], "dwo7zly": [{"0_Comment Submission": "OTR aerobics", "1_Text": "Jump rope buddy. Jumping rope for ten minutes is the same as running 30", "2_Subreddit": "Truckers"}], "dwp9bo8": [{"0_Comment Submission": "So apparently all emergency departments don't treat addicts like garbage.", "1_Text": "My roommates work in the ED. They get a lot of overdoses. Like 15 to 20 in a ten hour shift on the weekends. They get them in the early morning they get them in the afternoon. All day. Everyday. If you are nice to your nurses and courteous they will get you on your way quickly because they have better things to do. Car accidents and gun shot wounds and chainsaw mishaps. Serious shit. Once an addict spit in my roommate's face. Instead of being released in the normal hour and a half my friend had security strap him to the bed. Forced him to sit there strapped down sick for 7 hours. Even made him piss his pants. Be nice to your nurses and never assult them cause they can and will make your life hell.", "2_Subreddit": "opiates"}], "dwpdp7j": [{"0_Comment Submission": "Relapsed", "1_Text": "Kratom?", "2_Subreddit": "opiates"}], "dwrjoa3": [{"0_Comment Submission": "So apparently all emergency departments don't treat addicts like garbage.", "1_Text": "My roommates are men. Rather fit guys. Pretty nice dudes unless you fuck with them. They've literally seen it all working in the ER", "2_Subreddit": "opiates"}], "dwrnjjk": [{"0_Comment Submission": "I know what my problem is-- I want to use heroin forever.", "1_Text": "love you too", "2_Subreddit": "opiates"}]}], "1_submissions": [{"6f70nd": [{"0_Title": "Krabot is closed who has good caps?", "1_Text": "Aww :(", "2_Subreddit": "kratom"}], "7vrhab": [{"0_Title": "Is there enough kratom left? Will we run out?", "1_Text": "Aww :(", "2_Subreddit": "kratom"}], "7ybrqi": [{"0_Title": "Alkaloid content", "1_Text": "Aww :(", "2_Subreddit": "kratom"}], "88qprl": [{"0_Title": "R/buildapcsales and r/gundeals back up", "1_Text": "Aww :(", "2_Subreddit": "kratom"}]}]}]}