{"michaeljw12": [{"0_comments": [{"dw0bcu1": [{"0_Comment Submission": "An outsider curious about heroin users’ first time using the substance", "1_Text": "The story that the media touts about people switching to heroin after being cut off opiate prescriptions they didn't need wasn't the main driving force in and of itself. As a second order effect however, the excess of opiate scripts that were floating around meant that a lot of pills were sold on the street. The widespread availability resulted in the birth of an uncountable number of addicts that never had to get prescriptions. The availability of opiates started to decrease and the street price of pills doubled or even tripled in some cases. In my experience, this is what caused many people to make the jump to heroin. The fact that the high from pills and the high from heroin are extremely similar plays a big part as well.", "2_Subreddit": "opiates"}], "dw0neyw": [{"0_Comment Submission": "Is this what you'd call gunpowder?", "1_Text": "That's what I'd call mulch stuck to the lawn mower deck XD It might be weird looking tar I suppose but not gunpowder.", "2_Subreddit": "opiates"}], "dw53i9a": [{"0_Comment Submission": "What's everybody's favorite way to ingest codeine syrup?", "1_Text": "Obligatory boof that shit.", "2_Subreddit": "opiates"}], "dw6bjjr": [{"0_Comment Submission": "Can somebody explain the basics of buying good quality meth for a total noob?", "1_Text": "It's supposed to taste nasty and burn like a mofo when railed. If it doesn't fit that criteria than whatever you're getting isn't ice.", "2_Subreddit": "Stims"}], "dw7vpky": [{"0_Comment Submission": "What is your reason for using opiates?", "1_Text": "Damn, even though it's a pretty simple question on the surface, you made me think. If I'm being honest with myself, opiates are one of the few things in life that make me feel genuinely happy and at ease. They block out most of life's unpleasantries, albet only temporarily. Granted, life wouldn't seem nearly as unpalatable if my brain had never become dependant on the artificial bliss opiates bring with them, but I think myself and many others are stuck running on the hamster wheel in a perpetual feedback loop.", "2_Subreddit": "opiates"}], "dw8x29z": [{"0_Comment Submission": "Cold copping tips", "1_Text": "Honestly, the high from oxy is just as good, if not better. It's shocking how similar they are. Heroin is just more sedating and noddy. This is assuming you aren't banging it, the rush from IV is what sets it apart and will undoubtedly suck you in deeper. \n\nThat's not to say you should start fucking with dope, my only point is they're two sides of the same coin.", "2_Subreddit": "opiates"}], "dwa2f3p": [{"0_Comment Submission": "Can anyone tell me if they believe this is an Abscess?", "1_Text": "Yes, that is most likely the beginning of an abscess. If going to a walk in clinic or other form of professional medical care is an option for you, please take that route. If there's absolutely no possible way to make that happen, hit me back.", "2_Subreddit": "opiates"}], "dwkq796": [{"0_Comment Submission": "Man dies from too much lope", "1_Text": "I was up to 400mg at a time every two days and it really does wreak your tolerance. 200mg oral oxy had almost no effect. Lope is a dirty, nasty, uncomfortable high but the \"high\" is present at those doses. I dropped a deuce once every seven to ten days at that point and it took a terrifing amount of effort and pain to get it out. Using lope like that was not a fun existence, even if it kept me functional.", "2_Subreddit": "opiates"}], "dwlr52s": [{"0_Comment Submission": "Sleep Paralysis - culprit for my derailed clean up", "1_Text": "Yup, probably six or so times a year. Shits scary, gets a bit less terrifing as time goes on but it always leaves my heart fucking racing", "2_Subreddit": "Stims"}], "dwmzynk": [{"0_Comment Submission": "Missed a shot about 4 days ago the pain has gone away but it doesnt look much better should i go to the ER or is the pain going away a good sign?", "1_Text": "That's an abscess and will need medical attention. It's most likely a sterile abscess which is a good thing but will still need to be drained, something that's accomplished with a scalpel and medical training. If you have a needle exchange near you, there's a good chance they can either help you there or refer you somewhere that will.", "2_Subreddit": "opiates"}], "dwnytvj": [{"0_Comment Submission": "My last resort isn't for the faint of heart.", "1_Text": "Damn homie, might as well swap that barrel for tubing and start yourself a \"motivational\" IV drip XD", "2_Subreddit": "Stims"}], "dwppqya": [{"0_Comment Submission": "ECP, BTH, #3, #4...which is the purest/least pure?", "1_Text": "All of that is spot on except the part about acetic acid. You still need acetic anhydride or acetyl chloride, vinegar wouldn't get the job done.", "2_Subreddit": "opiates"}], "dwreqw6": [{"0_Comment Submission": "Hypothermic reaction upon wbyaking up day after binge", "1_Text": "If what you said is correct, than 12 fl oz water equals 14.4 fl oz 5% EtOH beer, really not a crazy difference.", "2_Subreddit": "Stims"}], "dws67b9": [{"0_Comment Submission": "What's up my fellow degenerates? Grade A shitpost coming atcha...", "1_Text": "Hahaha that fucked me up, it's been a while since I've laughed that hard. For real though, I'm strongly considering typing up a rough script for a skit based around this story being reported in the news and send it off to one of my cousins that worked for the Onion News Network for a while and have her send it to someone she knows could pitch it to try and make it happen! If I go through with it, I'll post a copy for y'all!", "2_Subreddit": "Stims"}], "dws6ccc": [{"0_Comment Submission": "What's up my fellow degenerates? Grade A shitpost coming atcha...", "1_Text": "Thank you man, I appreciate it! I'm going to try my best to get into the habit of doing at least one small good deed a day and see what comes of it. It would be cool if it caught on and I stuck with it long enough that I didn't even have to consciously decide to go out of my way.", "2_Subreddit": "Stims"}], "dws6myj": [{"0_Comment Submission": "What's up my fellow degenerates? Grade A shitpost coming atcha...", "1_Text": "Thank you G, that's extremely reassuring to hear from a subjective viewpoint. I've always been the reserved type and although it's improved as I got older, I still get irrationally anxious over small stuff and that ends up making me doubt myself sometimes. I'll definitely be doing story time here more often!", "2_Subreddit": "Stims"}], "dws7f9c": [{"0_Comment Submission": "What's up my fellow degenerates? Grade A shitpost coming atcha...", "1_Text": "Yanno, I ended up getting kinda stuck at the sentence about the act of helping one another being the most powerful way to feel human. I started trying to think of counterpoints and things that are even better and the main one that popped into my head was that the glow from sex is at least a magnitude stronger than selflessness. I started writing a long reply but to my dismay, had to delete it.\n\nI changed my mind because even though sex might provide the most intense feeling of human connection, feeling connected and in tune with another person is only one piece of the jigsaw puzzle that makes up the broad and inclusive experience of feeling human as a whole.\n\nI think you might be right, I can't think an example that either I nor most others would probably agree beats it. Granted, what it means to be human is an entirely subjective question and if every person on earth wrote an essay on it, you would probably have around 7 billion unique essays lol. I appreciate the food for thought.\n\nAnd shit G, if I had a list of all the shit choices I've made that ended up causing collateral damage to other people in some shape or form, there's no way I would be able to read it without breaking down into a slobbering mess.\n\nGo out and help someone out for no reason and accept that what you did today, last month, and last year can't be changed. All you can do is learn from it and take an earnest shot at righting the wrong that you feel needs to be. And hey, don't beat up on yourself about not being able to fix it all, life has a funny way of working itself out.\n\nLike I mentioned, karm-othafuckin-a lol. It can bite you in the ass if you let it, but you can also fix it and nurse it back to health, no matter how broken it is when you start. Shoot me a message if you ever need to get shit off your chest.", "2_Subreddit": "Stims"}], "dws82n9": [{"0_Comment Submission": "Just say NO to N- ISO! [2018 P.S.A.]", "1_Text": "It's an alleged cut that the Mexican superlabs are compounding into all their shard as a cut. Both its physical and chemical properties make it very difficult to detect as well as separate in stark contrast to MSM that used to be the gold standard for meth cuts. I've heard lots of conflicting information on it's presence and prevalence and can't speak to that part of it. n,-isopropylbenzalamine I think if you want to research it.", "2_Subreddit": "Stims"}], "dws8kwa": [{"0_Comment Submission": "What's up my fellow degenerates? Grade A shitpost coming atcha...", "1_Text": "Fuck man, you caught me. That was a hardcore highdeia without question lol. Still sounds tempting to me but the fact that I completely forgot about it after 30 seconds tops of replying is a pretty good sigh it might have been that loud mouthed bitch tina talking again.\n\nNeway, I'll for sure be doing something to brighten sometimes day once normal people wake up lol. I'm not entirely sure if giving a lesson on proper IV technique was /s or not rofl. If it wasn't, I can appreciate the humor in it, if it was, than I think showing someone how to intravenously administer hard street drugs would be some bad ju-ju. There's very few situations where I would even consider helping.", "2_Subreddit": "Stims"}], "dws8osz": [{"0_Comment Submission": "What's up my fellow degenerates? Grade A shitpost coming atcha...", "1_Text": "I would be open to the idea of being \"Meth Man\" assuming a cape can be part of the deal?", "2_Subreddit": "Stims"}], "dwsacn0": [{"0_Comment Submission": "Who's stimmed up up and away that wants to participate in lengthy and possibly controversial tweak-talk? Kik at me y'all! Kik is my username.", "1_Text": "Ahh, fucking Chad responsibilities, always getting in the way of the shit that's legitimately important XD", "2_Subreddit": "Stims"}], "dwsafvp": [{"0_Comment Submission": "Maybe just a stupid tweaker question.", "1_Text": "It's not a stupid question, she just left out an important detail. She failed to mention that what she's creating aren't just ordinary meth capsules. If memory serves me right, they actually happen to be meth capsules... with glitter!", "2_Subreddit": "Stims"}], "dwsb9y4": [{"0_Comment Submission": "What's up my fellow degenerates? Grade A shitpost coming atcha...", "1_Text": "Well fuck me, I didn't really look at it from that perspective. I feel like a bit of a prick now for being so closed minded. The perfect analogy would be letting your kid drink at home so they can handle their shit when they became independent.\n\nCome here little Johnny, your teacher says you're having some problems being picked on. I'll fix you right up though because your bout to take this half gram slam straight to your only half way developed dome piece. Buckle up motherfucker!", "2_Subreddit": "Stims"}], "dwtcotu": [{"0_Comment Submission": "What do you think the government or society could do to minimize the deaths related to the opioid epidemic?", "1_Text": "Subsidize buprenorphine and methadone maintenance while incentivizing the expansion of these types of programs. Ideally, their efforts should focus heavily on improving the accessibility of treatment in the parts of America that remain grossly underserved.\n\nThe majority of health professionals understand this means of Tx to be the most effective route to the individual success of an addict and this finding is solidly backed by data collected from a wide variety of addiction studies.\n\nInterestingly enough, the lives saved by implementing an intensive maintenance program would pale in comparison to the lives that would be saved from legalizing and regulating the distribution of heroin to those that would benefit. Just a shot in the dark, but I would bet our annual OD mortality rate would drop to under one percent of it's present state. Unfortunately, this is an unthinkably radical solution for most people to be on board with and it just isn't a realistic possibility anytime soon.\n\nWe would also benefit greatly from the implementation of set standard for drug education in public schools that was rooted in fact and completely open and upfront. I have a strong distain for common core style education but in this specific area, I think having a uniform curriculum would do more good than harm.", "2_Subreddit": "opiates"}], "dwvo9qu": [{"0_Comment Submission": "Syringes in The US’s cock.", "1_Text": "Wait, you mean they'll hit you and push off? Are you in the US? I mean, that's cool as fuck but opens them to a crazy high chance of a lawsuit that would shut them the fuck down in a heartbeat. That seems recklessly negligent even though their intentions are good.", "2_Subreddit": "opiates"}]}], "1_submissions": [{"2zbkz6": [{"0_Title": "TIDTRT By returning money stuck in the ATM", "1_Text": "The story that the media touts about people switching to heroin after being cut off opiate prescriptions they didn't need wasn't the main driving force in and of itself. As a second order effect however, the excess of opiate scripts that were floating around meant that a lot of pills were sold on the street. The widespread availability resulted in the birth of an uncountable number of addicts that never had to get prescriptions. The availability of opiates started to decrease and the street price of pills doubled or even tripled in some cases. In my experience, this is what caused many people to make the jump to heroin. The fact that the high from pills and the high from heroin are extremely similar plays a big part as well.", "2_Subreddit": "TIDTRT"}], "4i8ehb": [{"0_Title": "Tool -- Title Unknown 2016 [Alt metal / Progressive metal] -- Audio leak from new Tool album!", "1_Text": "The story that the media touts about people switching to heroin after being cut off opiate prescriptions they didn't need wasn't the main driving force in and of itself. As a second order effect however, the excess of opiate scripts that were floating around meant that a lot of pills were sold on the street. The widespread availability resulted in the birth of an uncountable number of addicts that never had to get prescriptions. The availability of opiates started to decrease and the street price of pills doubled or even tripled in some cases. In my experience, this is what caused many people to make the jump to heroin. The fact that the high from pills and the high from heroin are extremely similar plays a big part as well.", "2_Subreddit": "listentothis"}], "4jmlz1": [{"0_Title": "TIFU by not realizing my first reddit post ever was guilded", "1_Text": "The story that the media touts about people switching to heroin after being cut off opiate prescriptions they didn't need wasn't the main driving force in and of itself. As a second order effect however, the excess of opiate scripts that were floating around meant that a lot of pills were sold on the street. The widespread availability resulted in the birth of an uncountable number of addicts that never had to get prescriptions. The availability of opiates started to decrease and the street price of pills doubled or even tripled in some cases. In my experience, this is what caused many people to make the jump to heroin. The fact that the high from pills and the high from heroin are extremely similar plays a big part as well.", "2_Subreddit": "tifu"}], "4vla4r": [{"0_Title": "Meet my kitten/dog Freedom. He was born this past September 11 which is what his name takes after.. He enjoys light swimming, belly rubs, playing fetch*, and sleeping. * - Fetch at this time is only played with plastic milk jug lids only, non-negotiable.", "1_Text": "The story that the media touts about people switching to heroin after being cut off opiate prescriptions they didn't need wasn't the main driving force in and of itself. As a second order effect however, the excess of opiate scripts that were floating around meant that a lot of pills were sold on the street. The widespread availability resulted in the birth of an uncountable number of addicts that never had to get prescriptions. The availability of opiates started to decrease and the street price of pills doubled or even tripled in some cases. In my experience, this is what caused many people to make the jump to heroin. The fact that the high from pills and the high from heroin are extremely similar plays a big part as well.", "2_Subreddit": "cat"}], "4vlcv0": [{"0_Title": "I would like to introduce to everyone to Freedom. He was born this past September 11th, which is the source of his name. He enjoys light swimming, belly rubs, taking long and frequent naps, and playing fetch*. * - Fetch is only possible with a plastic milk jug lid.", "1_Text": "The story that the media touts about people switching to heroin after being cut off opiate prescriptions they didn't need wasn't the main driving force in and of itself. As a second order effect however, the excess of opiate scripts that were floating around meant that a lot of pills were sold on the street. The widespread availability resulted in the birth of an uncountable number of addicts that never had to get prescriptions. The availability of opiates started to decrease and the street price of pills doubled or even tripled in some cases. In my experience, this is what caused many people to make the jump to heroin. The fact that the high from pills and the high from heroin are extremely similar plays a big part as well.", "2_Subreddit": "cats"}], "548l8m": [{"0_Title": "Reddit, I just found out my house has bedbugs spread through a roommate's friend. I have now developed a rash on ny arm, any advice?", "1_Text": "The story that the media touts about people switching to heroin after being cut off opiate prescriptions they didn't need wasn't the main driving force in and of itself. As a second order effect however, the excess of opiate scripts that were floating around meant that a lot of pills were sold on the street. The widespread availability resulted in the birth of an uncountable number of addicts that never had to get prescriptions. The availability of opiates started to decrease and the street price of pills doubled or even tripled in some cases. In my experience, this is what caused many people to make the jump to heroin. The fact that the high from pills and the high from heroin are extremely similar plays a big part as well.", "2_Subreddit": "AskReddit"}], "56y4bz": [{"0_Title": "My smartphone has twice the processing power of my 10 year old computer, yet when I accidentally set my alarm clock an hour too late, I'm forced to press a button 23 times to correct it.", "1_Text": "The story that the media touts about people switching to heroin after being cut off opiate prescriptions they didn't need wasn't the main driving force in and of itself. As a second order effect however, the excess of opiate scripts that were floating around meant that a lot of pills were sold on the street. The widespread availability resulted in the birth of an uncountable number of addicts that never had to get prescriptions. The availability of opiates started to decrease and the street price of pills doubled or even tripled in some cases. In my experience, this is what caused many people to make the jump to heroin. The fact that the high from pills and the high from heroin are extremely similar plays a big part as well.", "2_Subreddit": "Showerthoughts"}], "5egc37": [{"0_Title": "Hey guys/gals. Could I get y'alls opinion on whether this is pressed or legit? I think It's real.but heard the guy popping them off had fakes last week. Thank yee!", "1_Text": "The story that the media touts about people switching to heroin after being cut off opiate prescriptions they didn't need wasn't the main driving force in and of itself. As a second order effect however, the excess of opiate scripts that were floating around meant that a lot of pills were sold on the street. The widespread availability resulted in the birth of an uncountable number of addicts that never had to get prescriptions. The availability of opiates started to decrease and the street price of pills doubled or even tripled in some cases. In my experience, this is what caused many people to make the jump to heroin. The fact that the high from pills and the high from heroin are extremely similar plays a big part as well.", "2_Subreddit": "opiates"}], "5ewp39": [{"0_Title": "Anyone else have some after Turkey Day super tasty stashes they would like to share?", "1_Text": "The story that the media touts about people switching to heroin after being cut off opiate prescriptions they didn't need wasn't the main driving force in and of itself. As a second order effect however, the excess of opiate scripts that were floating around meant that a lot of pills were sold on the street. The widespread availability resulted in the birth of an uncountable number of addicts that never had to get prescriptions. The availability of opiates started to decrease and the street price of pills doubled or even tripled in some cases. In my experience, this is what caused many people to make the jump to heroin. The fact that the high from pills and the high from heroin are extremely similar plays a big part as well.", "2_Subreddit": "opiates"}], "5xqwt8": [{"0_Title": "Government only made heroin illegal because of greedy profiteering", "1_Text": "The story that the media touts about people switching to heroin after being cut off opiate prescriptions they didn't need wasn't the main driving force in and of itself. As a second order effect however, the excess of opiate scripts that were floating around meant that a lot of pills were sold on the street. The widespread availability resulted in the birth of an uncountable number of addicts that never had to get prescriptions. The availability of opiates started to decrease and the street price of pills doubled or even tripled in some cases. In my experience, this is what caused many people to make the jump to heroin. The fact that the high from pills and the high from heroin are extremely similar plays a big part as well.", "2_Subreddit": "opiatescirclejerk"}], "61v1cz": [{"0_Title": "Introduction/I think I found my new home", "1_Text": "The story that the media touts about people switching to heroin after being cut off opiate prescriptions they didn't need wasn't the main driving force in and of itself. As a second order effect however, the excess of opiate scripts that were floating around meant that a lot of pills were sold on the street. The widespread availability resulted in the birth of an uncountable number of addicts that never had to get prescriptions. The availability of opiates started to decrease and the street price of pills doubled or even tripled in some cases. In my experience, this is what caused many people to make the jump to heroin. The fact that the high from pills and the high from heroin are extremely similar plays a big part as well.", "2_Subreddit": "fentanyl"}], "677icy": [{"0_Title": "1975 Autographed Photos of Entire Apollo-Soyuz Crew, Handwritten Letter, Original Envelopes & More.", "1_Text": "The story that the media touts about people switching to heroin after being cut off opiate prescriptions they didn't need wasn't the main driving force in and of itself. As a second order effect however, the excess of opiate scripts that were floating around meant that a lot of pills were sold on the street. The widespread availability resulted in the birth of an uncountable number of addicts that never had to get prescriptions. The availability of opiates started to decrease and the street price of pills doubled or even tripled in some cases. In my experience, this is what caused many people to make the jump to heroin. The fact that the high from pills and the high from heroin are extremely similar plays a big part as well.", "2_Subreddit": "whatsthisworth"}], "82d81m": [{"0_Title": "Sometimes I forget... Warning: Shitpost incoming", "1_Text": "The story that the media touts about people switching to heroin after being cut off opiate prescriptions they didn't need wasn't the main driving force in and of itself. As a second order effect however, the excess of opiate scripts that were floating around meant that a lot of pills were sold on the street. The widespread availability resulted in the birth of an uncountable number of addicts that never had to get prescriptions. The availability of opiates started to decrease and the street price of pills doubled or even tripled in some cases. In my experience, this is what caused many people to make the jump to heroin. The fact that the high from pills and the high from heroin are extremely similar plays a big part as well.", "2_Subreddit": "opiates"}], "840d8s": [{"0_Title": "Who's with me?", "1_Text": "The story that the media touts about people switching to heroin after being cut off opiate prescriptions they didn't need wasn't the main driving force in and of itself. As a second order effect however, the excess of opiate scripts that were floating around meant that a lot of pills were sold on the street. The widespread availability resulted in the birth of an uncountable number of addicts that never had to get prescriptions. The availability of opiates started to decrease and the street price of pills doubled or even tripled in some cases. In my experience, this is what caused many people to make the jump to heroin. The fact that the high from pills and the high from heroin are extremely similar plays a big part as well.", "2_Subreddit": "Stims"}], "89myvo": [{"0_Title": "What's up my fellow degenerates? Grade A shitpost coming atcha...", "1_Text": "The story that the media touts about people switching to heroin after being cut off opiate prescriptions they didn't need wasn't the main driving force in and of itself. As a second order effect however, the excess of opiate scripts that were floating around meant that a lot of pills were sold on the street. The widespread availability resulted in the birth of an uncountable number of addicts that never had to get prescriptions. The availability of opiates started to decrease and the street price of pills doubled or even tripled in some cases. In my experience, this is what caused many people to make the jump to heroin. The fact that the high from pills and the high from heroin are extremely similar plays a big part as well.", "2_Subreddit": "Stims"}], "89nspo": [{"0_Title": "Who's stimmed up up and away that wants to participate in lengthy and possibly controversial tweak-talk? Kik at me y'all! Kik is my username.", "1_Text": "The story that the media touts about people switching to heroin after being cut off opiate prescriptions they didn't need wasn't the main driving force in and of itself. As a second order effect however, the excess of opiate scripts that were floating around meant that a lot of pills were sold on the street. The widespread availability resulted in the birth of an uncountable number of addicts that never had to get prescriptions. The availability of opiates started to decrease and the street price of pills doubled or even tripled in some cases. In my experience, this is what caused many people to make the jump to heroin. The fact that the high from pills and the high from heroin are extremely similar plays a big part as well.", "2_Subreddit": "Stims"}]}]}]}