{"J_U_N_K_I_E": [{"0_comments": [{"dwnz9ev": [{"0_Comment Submission": "Policy Change regarding human consumption", "1_Text": "Lol this is such a joke, no regular drug subs were banned. Only sourcing ones", "2_Subreddit": "opiates"}], "dwnza7h": [{"0_Comment Submission": "Happy April Fool's, guys.", "1_Text": "I knew it, no regular drug subs were banned or even mentioned thuw", "2_Subreddit": "opiates"}], "dwnzg84": [{"0_Comment Submission": "Happy April Fool's, guys.", "1_Text": "What was last year's? ???", "2_Subreddit": "opiates"}], "dwnzhy4": [{"0_Comment Submission": "Happy April Fool's, guys.", "1_Text": "What drug is it...?", "2_Subreddit": "opiates"}], "dwo01pk": [{"0_Comment Submission": "Girlfriend of 3 1/2 gets hooked on opiates, robs me blind.", "1_Text": "She may not admit to stealing the other stuff over the phone, she could be worried you just want to press charges and it could be recorded, that's how I think anyway. Go see her In person. Make it clear that the $ didn't break you but she HAS to be 100% if she wants a chance again. If she won't admit to it all then I'd say she'll end up doing it again. It she's truly sorry you'll also see an explosion of emotion and crying estatically when you see her. If it's a kind of \"yeah it happened and I'm sorry 😕\"\n\n-\n\nI know some people can fake extreme emotion, but not most people.", "2_Subreddit": "opiates"}], "dwotdni": [{"0_Comment Submission": "Random Baby just puked on me", "1_Text": "It was actually a good question. I see countless terrible parents at my methadone clinic and when I read this I immediately envisioned the mom just being like \"lol oh my bad\" and then continuing on with her discussion to the person next to her and ignoring the baby", "2_Subreddit": "Drugs"}], "dwp5g8x": [{"0_Comment Submission": "Fuck these chapped lips", "1_Text": "\"No, Fuck **YOU!!!**\"\n\n-\n\n-These chapped lips", "2_Subreddit": "Stims"}], "dwp9gco": [{"0_Comment Submission": "Creating your own slang", "1_Text": "*\"they'll NEVER know we're smoking meth and will just think we're smoking Crack now. HA! The fools!\"*", "2_Subreddit": "Stims"}], "dwpej57": [{"0_Comment Submission": "So i got arrested for paraphernalia today and", "1_Text": "I think It has more to do with charging you and having evidence, and less to do with thinking you'll never know where to get another spoon\n\n-\n\nHell, they even don't expect us to not know where to get more dope- nor do they really WANT us not to get it. Much like the satanic bible says Satan is good for the church because it's kept them in business all these years... well, you see what I'm getting at", "2_Subreddit": "opiates"}], "dwpx2cn": [{"0_Comment Submission": "FIRST ORDER OF MPF AND ETIZOLAM", "1_Text": "NO MORE REVIEWS,  YOURE GOING TO GET THE COMMUNITY BANNED", "2_Subreddit": "fentanyl"}], "dwpxbq0": [{"0_Comment Submission": "A southern chain gang, 1906. [7,402 x 9,252]", "1_Text": "Spoken like a true person who knows nothing about prison👍", "2_Subreddit": "HistoryPorn"}], "dwqhnjo": [{"0_Comment Submission": "Pray for post pt 2 dope porn! 2Gs, it's gonna be a good few days! Hope your all good today opiate peeps!", "1_Text": ".... if it's USA and not specified it's #4\n\n-\n\nIf you're in the UK or Europe it's probably #3\n\n-\n\nIt looks like the #4 I've always gotten, but #3 is(/can be) brown too", "2_Subreddit": "opiates"}], "dws7epr": [{"0_Comment Submission": "In love with a user", "1_Text": "Haha I love it!", "2_Subreddit": "opiates"}], "dws7fuh": [{"0_Comment Submission": "In love with a user", "1_Text": "She's using the FUCK out of you.... I know love can blind you but it's time to WAKE THE FUCK UP. She's not just \"wish him since she feels bad for him'. The reality is she's using you and you're letting her because YOU feel bad for HER.\n\n-\n\nFuck that girl", "2_Subreddit": "opiates"}], "dws7j99": [{"0_Comment Submission": "In love with a user", "1_Text": "If she really cares about you shed talk to you and want to be around you with zero money involved.\n\n-\n\n\nPersonally it's not worth risking YOU being able to stick to your guns trying it, but you technically could see how long she sticks around when you tell her you won't give her a penny or ENABLE her addiction in ANY way (that means no help with food, shelter, $.... if she wants food and shelter the resources are out there and she knows it). If she asks for help with \"food or shelter\" guarantee she'll put whatever resources towards dope instead. Anyway my point is if she knew there was NO way you'd give her another penny and offer only your mental support and companionship there's NO way she sticks around. I'm sorry man... free your mind from this bitch!!! You deserve better....", "2_Subreddit": "opiates"}], "dws7l75": [{"0_Comment Submission": "All the comments below talk about a dog lol 😏 \"dog food\"", "1_Text": "When a **CIVILIZED** human is sick, you give it ginger ale. When your dawg is sick, you bring him the dog food :D", "2_Subreddit": "opiates"}], "dws99el": [{"0_Comment Submission": "Opiate Shower thoughts pt. 1", "1_Text": "No way, I simply don't believe it! Everyone in the dope game has always been 100% with me,  ever!", "2_Subreddit": "opiates"}], "dwscfvv": [{"0_Comment Submission": "4-ACO-DMT or 4-HO-MET", "1_Text": "If you enjoy the mental aspect of psychs get 4-aco-dmt without a doubt. It's better for mental cleansing/working through personal shit and therefore much more rewarding for me\n\n-\n\nThe mental aspect of shrooms is VERY recreational to me in and of itself\n\n-\n\nI always thought a psychedelic with only the visuals and zero mental stuff would be the holy grail.... that is until I tried 2c-b, and it was the most unbelievably boring drug I've ever tried, desire the visuals being almost as good as acid\n\n-\n\n\nI'll never buy a \"far predominantly visual\" psych again", "2_Subreddit": "researchchemicals"}], "dwtqqj3": [{"0_Comment Submission": "Just another day in Milwaukee", "1_Text": "WON'T SOMEONE THINK OF **THE CHILDREN**???", "2_Subreddit": "WTF"}], "dwuhsip": [{"0_Comment Submission": "No.", "1_Text": "Female condoms do exist... they aren't supposed to be just left in like that though, apparently it's not technically suggested to reuse them but [here at this link](http://www.aidsmap.com/Can-the-female-condom-be-reused/page/1746301/) some organization explains how to reuse them and that they should be reused no more then 5 times. I'm assuming that's on the low side as food/drug/etc. Expiration/use limits always are..... but I definitely wouldn't be risking overusing something as potentially life ruining if it fails as a condom!!!!\n\n-\n\nAs for the price, looks like they can be expensive as fuck although I'm unsure of what one is correct, because a quick Google shopping search the fist link was for 2 packs of 12, so 24 total, [for $283 at walmart LINK](https://www.walmart.com/ip/2-Pack-FC2-Female-Condoms-12-ea/888059826?wmlspartner=wlpa&selectedSellerId=1150&adid=22222222228140968551&wl0=&wl1=g&wl2=m&wl3=251221532052&wl4=pla-413795356205&wl5=9008121&wl6=&wl7=&wl8=&wl9=pla&wl10=112549851&wl11=online&wl12=888059826&wl13=&veh=sem).... it's got 12 reviews too, so someone bought that shit\n\n-\n\n\nBut then the second link was [for a 12 count for $25 LINK](https://worldcondoms.com/products/pasante-female-condoms?variant=45012261065&gclid=Cj0KCQjwkpfWBRDZARIsAAfeXapq6xPgROWQd4nYGuN-36qzurOFrWtoqG8xgNeCh7ldwvxjS50ta2UaAhDWEALw_wcB)..... so that's a pretty huge price difference and I have no idea what's right....", "2_Subreddit": "Stims"}], "dwuie06": [{"0_Comment Submission": "The come up", "1_Text": "Quinine \"eats\" dope and makes it go bad after a certain amount of time, right? (You seem knowledgeable so wanted to pick your brain)\n\n-\n\nI just know whenever I've had a dealer for scramble, they say that after a certain amount of time it goes bad and loses potency to the point of eventually becoming basically inactive....\n\n-\n\nQuinine/bonita quinine is fucking weird.  With both heroin AND fent, scramble (which is sold in a 00 gel capsule and I've always been told is primarily those 2 quinines + dope + whatever other cuts) it must bond so tightly to the actual drugs on a molecular level, because all scramble I've ever had is 100% useless if it's not cooked.... I'm talking getting absolutely zero effects from it, because I've definitely tried after so many people online swearing that \"heroin/fent will never ever have to be cooked to be shot)... I know scramble isn't available in the majority of the country though so the vast majority of users will never see it\n\n-\n\nThe rush it gives IS waaaaay better then just regular dope; but the way it goes bad seems like a huge & stupid risk for dealers. I guess they just know they're never going to have to sit on it, but still!-!!!", "2_Subreddit": "opiates"}], "dwvwa7z": [{"0_Comment Submission": "Just another day in Milwaukee", "1_Text": "Sheltering a child works excellently! Condition them early!\n\n-\n\nBut in all seriousness,  I grew lup exactly like that. It made me HATE religion and then from ~14 on ive been using drugs... hard drugs since 16, but st first it was a way to get away.\n\n'\n\nI understand everyone strongly religious isn't the psychotic lose their mind over some petty shit; and it was also due to a toxic household with the family situation,  parents leavung, you know, all the stuff every drug addict says happened lol\n\n-\n\n\nWe don't  just wake up one day and decide to be junkies.... lots of us just want the strongest thing that takes you away from life and it's problems", "2_Subreddit": "WTF"}], "dwwlegg": [{"0_Comment Submission": "My ridiculously good looking grandpa who joined the marines underage, to fight in W.W. 2 . A true badass but one of the gentlest men I've ever known.~1940", "1_Text": "[Really really really ridiculously good looking](https://youtube.com/watch?v=NHHEcmZtJvY)", "2_Subreddit": "OldSchoolCool"}], "dwwllac": [{"0_Comment Submission": "MRW my Eurotrash speed is cut with meth", "1_Text": "So are you referring to the speed as EuroTrash, or  yourself + the people of europe?\n\n-\n\nI know if I were European I'd refer to myself as eutotrash. I bask in my proudly self proclaimed degenrracy😆", "2_Subreddit": "Stims"}], "dwwlozr": [{"0_Comment Submission": "Whats the point of doing lines?", "1_Text": "I normally throw mine on the floor and sweep it into a mound with a broom\n\n-\n\nRegular brooms are too small though, [I have to use one of these](http://www.markoinc.com/images/D/Kristydustmopping72.jpg)", "2_Subreddit": "Stims"}]}], "1_submissions": [{"7s7ao1": [{"0_Title": "Crack vs. Meth", "1_Text": "Lol this is such a joke, no regular drug subs were banned. Only sourcing ones", "2_Subreddit": "Stims"}], "7svjxz": [{"0_Title": "Adderall KILLS my Sex drive. Indicative of meth doing The same?", "1_Text": "Lol this is such a joke, no regular drug subs were banned. Only sourcing ones", "2_Subreddit": "Stims"}], "7uhyof": [{"0_Title": "Consecutive Days Of Dosing Effectiveness - opana vs oxy", "1_Text": "Lol this is such a joke, no regular drug subs were banned. Only sourcing ones", "2_Subreddit": "opiates"}], "7wrnvb": [{"0_Title": "ALL fentanyl analogues Schedule 1 (blanket ban)", "1_Text": "Lol this is such a joke, no regular drug subs were banned. Only sourcing ones", "2_Subreddit": "fentanyl"}], "80vle6": [{"0_Title": "Wastedyouth/NorthwestVae??", "1_Text": "Lol this is such a joke, no regular drug subs were banned. Only sourcing ones", "2_Subreddit": "opiates"}], "83w3vq": [{"0_Title": "Banging dope while on methadone", "1_Text": "Lol this is such a joke, no regular drug subs were banned. Only sourcing ones", "2_Subreddit": "opiates"}], "84547c": [{"0_Title": "N-methyl-cyclazodone..?", "1_Text": "Lol this is such a joke, no regular drug subs were banned. Only sourcing ones", "2_Subreddit": "researchchemicals"}], "8457au": [{"0_Title": "N-methyl-cyclazodone..?", "1_Text": "Lol this is such a joke, no regular drug subs were banned. Only sourcing ones", "2_Subreddit": "Nootropics"}]}]}]}