{"Blbanks57": [{"0_comments": [{"dq0cynk": [{"0_Comment Submission": "Would this be a risky/dick thing to do?... don’t wanna piss this guy off", "1_Text": "Hahah I was pretty stoned when I wrote that. At the the time I thought it was a good idea lol", "2_Subreddit": "opiates"}], "dqajaey": [{"0_Comment Submission": "How against drugs were you growing up? And if you were... what changed?", "1_Text": "Until I was 23 or so I only drank and smoked week and the occasional delics. Was always against pills and powders because I have an older brother who completely fucked his life up because of them. But then the only girl I'll ever love killed herself which really affected me. I mean one of the last times I saw her I told her to get a gun and shoot me because I was already so depressed and she said no ud have to kill me first. So after that I was like fuck this I'm done trying to do the right thing and wanted to try everything. I never even tried percs or vics first I just went straight to dope. Been addicted ever since.", "2_Subreddit": "opiates"}], "drxy8g4": [{"0_Comment Submission": "I get off work in 2 hours, and I’m done.", "1_Text": "There's this 3 way intersection near where I live. The one road leads right into a big stone wall and telephone poll. All I want to do floor it straight into it. The only thing that's stopping me though is the media attention and problems it might cause property owners. I don't want to hurt anyone but myself. Try to think of a different way man. Try oding on heroin, it's fucking amazing man", "2_Subreddit": "SuicideWatch"}], "dryyowy": [{"0_Comment Submission": "What is the easiest way to end it?", "1_Text": "Jump from at least 5 stories or od on heroin", "2_Subreddit": "SuicideWatch"}], "dt2bsh9": [{"0_Comment Submission": "Guilt", "1_Text": "U should feel lucky/happy that u were able to have a kid with someone who u cared so deeply for. When we were younger, before she hurt me, we always fantasized about buying a house and having kids. We used to look at real estate listings for the house we wanted lol. He still lives on through ur kids don't ever forget that. Try to think if that's what he would have wanted, for his kids to grow up with neither their mom or dad, I highly doubt it. And yeah if u cared about him as much as I did her, u do have a long road ahead of u. Ur probably going to develope coping mechanisms like I have. A while ago, I started fiddling with whatever it was I had in my pockets, my keys, lighter, some coins, whatever. I still do it but now it leads me grasping on it firmly. As if I was holding her hand, like we did when I was driving or when we were walking down the street together. When I do that, it makes me feel a little bit better. I almost smile. I'm so sry for ur loss though, always here if u need someone to relate to. And yeah it really really sucks to know ur not ever going to see them again, atleaste in this life. I know. Worst feeling in the fucking world.", "2_Subreddit": "SuicideBereavement"}], "dt2bzo1": [{"0_Comment Submission": "Guilt", "1_Text": "I'm trying my best to, thanks. Honestly kind of impressed with myself that I've made it this far lol", "2_Subreddit": "SuicideBereavement"}], "dt2cvwg": [{"0_Comment Submission": "Guilt", "1_Text": "Your spot on with ur point. Exact same thing my friends/family tell me. I still feel like she would maybe still be here if I just did some things different but yeah don't dwell on regrets I know I know. Thanks.", "2_Subreddit": "SuicideBereavement"}], "durgsa6": [{"0_Comment Submission": "r/Opiaterollcall", "1_Text": "https://www.reddit.com/r/OpiateChat/", "2_Subreddit": "u_drugdylan999"}], "dv29n0e": [{"0_Comment Submission": "I fuck up every good thing in my life. Self-sabotage is my mistress.", "1_Text": "But what about if u started using in the first place because u indirectly influenced the love of ur life to kill herself which was actually the last thing u ever wanted and have since been masking all of ur negative emotions with dope and now when ever you go through w/d's the only thing u can think about is where the closest platform u can jump off of is? Lol yeah idk about u but that's been my life for the past 4 years. Just trying to give u some perspective bud", "2_Subreddit": "opiates"}], "dvehiv3": [{"0_Comment Submission": "Never seen this. Looked decent enough. Then got it wet and turned pink. No residue when stirred, no heat required. Very pink shot. Any thoughts?? Fent? Carfent?", "1_Text": "There's a few different stamps going around in kensingon that are like this. Supposively it's some weird new fentalogue. I had tried some of it and it deff wasnt strong enough to be carfent. It was real weird though almost no rush but decent legs and a kind of jumpy non-euphoric high. Idk where u got URS though so it could be totally different so tread lightly my friend.", "2_Subreddit": "opiates"}], "dvjsph4": [{"0_Comment Submission": "shoddy version of burmese method?", "1_Text": "I saw this the other day I think it prob would help u. \nhttps://www.ncbi.nlm.nih.gov/pmc/articles/PMC4959756/#!po=30.8511", "2_Subreddit": "opiates"}], "dvnk04y": [{"0_Comment Submission": "Someone fucking kill me", "1_Text": "YouJust be happy that she's alive the one love of my life killed herself 4 years ago partly due to my stupid mistakes abd u still think about her all the fucking time. The fact that I'm never going to be able to make things right with her is the worst feeling I've ever felt so just try to give her some time and if u really still love her that much maybe shell realize that's all that matters in the long run. But also don't forget to have some self dignity because girls hate when ur a little bitch. Life can be real fucked up sometimes man but it's better than being dead.", "2_Subreddit": "opiates"}], "dvpwoli": [{"0_Comment Submission": "How do you guys catch a nod effectively?", "1_Text": "Whisky or benzos", "2_Subreddit": "opiates"}], "dvq26kp": [{"0_Comment Submission": "How do you guys catch a nod effectively?", "1_Text": "I was in the zone too and didn't read ur question correctly I'm sry op. To answer ur question right though whatever opiate it is ur taking the best way would be to just split however much it is u plan on taking in half. Wait till u feel uve reached ur peak on the first half then dose the second. That's my best answer for ya bud. I'm still gonna hold to my original answer though, if u drink alittle but of whisky like a half hour before it would make a noticable difference just don't over do it. The last thing I would want is for someone to of due to my advice. Sry for coming off as such a shitty person.", "2_Subreddit": "opiates"}], "dw06vlj": [{"0_Comment Submission": "Current stash got it for freeee! 2 Nickle bags 2 dime bags an addy a few subs and some fire bud. The nickle bag is out it’s so fat", "1_Text": "How is the bmw I know where that's at", "2_Subreddit": "opiates"}], "dw2b2ck": [{"0_Comment Submission": "I took the plunge, and I've fallen so hard..", "1_Text": "Lost my s.o 4 fucking years ago under different circumstances u can read about it in my profile if u want but I still fucking cry almost everyday and still dream about her all the time. I can garuntee I loved her as much as u did urs and I feel ur pain man it really fucking sucks. If I knew there was even the slightest chance of seeing her on the other side I would probably do it but there's no way in knowing. So sry for ur loss bud", "2_Subreddit": "opiates"}], "dw2cmop": [{"0_Comment Submission": "I took the plunge, and I've fallen so hard..", "1_Text": "I od'd a while ago with no one around but thankfully I woke up a few hrs later coughing up blood and puking. I swear though before I even opened my eyes and was fully consious I felt a hand letting go of me.  But yeah I guess it's just not our time yet man. U got her kids to take care if too make sure ur there for them", "2_Subreddit": "opiates"}], "dw3dy53": [{"0_Comment Submission": "I took the plunge, and I've fallen so hard..", "1_Text": "I actually haven't been crying like everday recently I definitely used to though, but yeah random stupid shit triggers me sometimes it sucks. and yeah she was like the love of my fucking life and of course it had to be her. Life feels really empty sometimes but thanks man", "2_Subreddit": "opiates"}], "dw5c3nm": [{"0_Comment Submission": "Brain zaps", "1_Text": "Lol that sounds like some xrazy shit I've never had that happen I do get the full body muscel spasms sometimes though. That sounds pretty similar to exploding head syndrom which I've gotten only a few times when sleeping", "2_Subreddit": "opiates"}], "dwl7ew4": [{"0_Comment Submission": "Opiate induced schizophrenia?", "1_Text": "Drug psychosis was actually my first guess but I only use at most twice a day and I thought u only get that when ur like constantly high all day. Honestly if it does get to a point where it's affecting my daily life I'm prob gonna take a break and hope it stops..if it doesn't than thats where I may seek some help. Im hoping that this isn't some.kind of hereditary thing that I just sparked early or something.", "2_Subreddit": "opiates"}], "dwl7glm": [{"0_Comment Submission": "Opiate induced schizophrenia?", "1_Text": "This seems like a really good explanation thanks", "2_Subreddit": "opiates"}], "dwm48m1": [{"0_Comment Submission": "Opiate induced schizophrenia?", "1_Text": "27", "2_Subreddit": "opiates"}], "dwm4jng": [{"0_Comment Submission": "Opiate induced schizophrenia?", "1_Text": "Yeah I know what ur talking about but the thing is that this occurs in between nods and even up to hours later when coming down n still feeling a little delirious. It's hard to explain but it really is almost like there's a person inside ur head talking to u n respond without even thinking. Weird shit lol", "2_Subreddit": "opiates"}], "dwm4mbo": [{"0_Comment Submission": "Opiate induced schizophrenia?", "1_Text": "Lol", "2_Subreddit": "opiates"}], "dwtear2": [{"0_Comment Submission": "Why does dope have such a bad stigma?", "1_Text": "People say like \"once u switch to dope it's over\" but I mean how is it that much different than someone switching from ir30s to like ir60s? Idk sry if this comes off as really stupid", "2_Subreddit": "opiates"}]}], "1_submissions": [{"6sf1yc": [{"0_Title": "Dope and kratom", "1_Text": "Hahah I was pretty stoned when I wrote that. At the the time I thought it was a good idea lol", "2_Subreddit": "opiates"}], "6upmk9": [{"0_Title": "Has anyone else noticed this?", "1_Text": "Hahah I was pretty stoned when I wrote that. At the the time I thought it was a good idea lol", "2_Subreddit": "opiates"}], "6vmbo9": [{"0_Title": "Hell yeahh", "1_Text": "Hahah I was pretty stoned when I wrote that. At the the time I thought it was a good idea lol", "2_Subreddit": "opiates"}], "6w3ppo": [{"0_Title": "Trippy dope", "1_Text": "Hahah I was pretty stoned when I wrote that. At the the time I thought it was a good idea lol", "2_Subreddit": "opiates"}], "6z5vvv": [{"0_Title": "The dope jolt", "1_Text": "Hahah I was pretty stoned when I wrote that. At the the time I thought it was a good idea lol", "2_Subreddit": "opiates"}], "71tzx7": [{"0_Title": "Dolla Dolla bills yall", "1_Text": "Hahah I was pretty stoned when I wrote that. At the the time I thought it was a good idea lol", "2_Subreddit": "opiates"}], "7bgtac": [{"0_Title": "Herijuana", "1_Text": "Hahah I was pretty stoned when I wrote that. At the the time I thought it was a good idea lol", "2_Subreddit": "opiates"}], "7bxmzo": [{"0_Title": "Funny story", "1_Text": "Hahah I was pretty stoned when I wrote that. At the the time I thought it was a good idea lol", "2_Subreddit": "opiates"}], "7s1nlb": [{"0_Title": "Guilt", "1_Text": "Hahah I was pretty stoned when I wrote that. At the the time I thought it was a good idea lol", "2_Subreddit": "SuicideBereavement"}], "88joji": [{"0_Title": "Opiate induced schizophrenia?", "1_Text": "Hahah I was pretty stoned when I wrote that. At the the time I thought it was a good idea lol", "2_Subreddit": "opiates"}], "89stcs": [{"0_Title": "Why does dope have such a bad stigma?", "1_Text": "Hahah I was pretty stoned when I wrote that. At the the time I thought it was a good idea lol", "2_Subreddit": "opiates"}]}]}]}