{"blondinium": [{"0_comments": [{"dq525zu": [{"0_Comment Submission": "Finally going for it.", "1_Text": "lope will attach to the mu receptors but you need at least x4 dose its not a miracal drug but does help.", "2_Subreddit": "opiates"}], "dqjxgyx": [{"0_Comment Submission": "Just finished watching Trainspotting 2", "1_Text": "i was in tears for a lot of the movie as my life has followed all the characters in one way or another - it made me sit up and see what could have been and what a lucky cunt i am to have what i have now even though that still includes a habit. \nT1 was a classic not fair to compare it to t2 imo as it looks at very different situations,", "2_Subreddit": "opiates"}], "dttflfv": [{"0_Comment Submission": "What if you have been reincarnated 8+ billion times? You are everyone who has ever existed on your own planet. We all are on our own planet being reincarnated an infinite number of times.", "1_Text": "You are assuming that you reincarnate as a human and not and animal of which there are trillions.", "2_Subreddit": "conspiracy"}], "duc67hq": [{"0_Comment Submission": "Coke shot", "1_Text": "groin - but be v careful massive vein either side", "2_Subreddit": "opiates"}], "dujgh6x": [{"0_Comment Submission": "I couldn’t help but take a picture of the monster rock I got with this pickup", "1_Text": "I get 8 balls that are bang on 3,5g i guess its cos i come from london so there is no shortage of sellers. top #3 for £135 - expensive but worth it comes in chunks varying in size form 1/2 to 1g or there abouts", "2_Subreddit": "opiates"}], "duyiqw3": [{"0_Comment Submission": "Can you overdose from smoking black tar heroin?", "1_Text": "never knownn anyone od from smoking in 35 years as you will nod out before you ingest too much.", "2_Subreddit": "opiates"}], "duyj5vv": [{"0_Comment Submission": "Brain Damage from Overdoses - Any Anecdotes?", "1_Text": "mate of mine was shooting methadone in his neck and had a TIA stroke as his brain was soaked in the stuff so no oxygen could get in.", "2_Subreddit": "opiates"}], "duyjel9": [{"0_Comment Submission": "Hi there! Hope my dope can make ya'll as happy as it does for me. Stay safe out there and lets catch some wicked nods for those who cannot!", "1_Text": "looks liked you bought an OZ and got ripped by 4.5g's - is it afghani #3?", "2_Subreddit": "opiates"}], "dv0be76": [{"0_Comment Submission": "Hi there! Hope my dope can make ya'll as happy as it does for me. Stay safe out there and lets catch some wicked nods for those who cannot!", "1_Text": "tar is the dirtiest heroin like drug out there . It is strictly not heroin as the morphine base hasn't been aceytalised with A.A only with acetic acid hence the vinegery fumes. Contains high levels of 6mam and 3mam which is good but if i was getting it i would wash out the remaining acetic acid. Im in the UK and had a spell a long while back where i was getting some (you never see it over here only afghani#3) and on foil  i use to heat it so it bubbbled away slowly getting rid of the horrid vineger smel/taste then it ran on the foil really well and was a good high.", "2_Subreddit": "opiates"}], "dv0bx0s": [{"0_Comment Submission": "Here’s to getting ripped off.", "1_Text": "I had a guy that kept me waiting longer and longer over a period of time until onetime i flipped after waiting in the cold for 2 hours - put a knife to his throat took all his stash (about 100 balloons of H and W) and a few hundred quid. Needless to say i didnt go back to that area again lol.", "2_Subreddit": "opiates"}], "dvbdc3a": [{"0_Comment Submission": "Is this H?", "1_Text": "lol - could be anything from salt to fent... i would put a bit on some foil and burn it and smell the smoke, dab a bit for taste and snort a small line - maybe- but as it could be anything and possibly dangerous give it back and wait till he can tell you of someone who has tried it", "2_Subreddit": "opiates"}], "dvdej0o": [{"0_Comment Submission": "Weird Alexa Occurrence - Not the laughing...", "1_Text": "Have you never wondered why all 'smart' devices are so cheap now including big fuck off teevee's? 'They' want everyone to own one..why? for a start GPS, mike, camera, speakers... I think its scary what the future may hold , you not only have a device(s) but they could/can interact with each other. I don't know where its all heading but I don't think its a good place.", "2_Subreddit": "conspiracy"}], "dvkrpe5": [{"0_Comment Submission": "Feels like a come up to me", "1_Text": "so now you are a whore - rock bottom cant be far away...wait till he brings his friends round, do you see life getting better from here in? time to evaluate and take a reality/honesty check with yerself.", "2_Subreddit": "opiates"}], "dvku14i": [{"0_Comment Submission": "Feels like a come up to me", "1_Text": "it is what it  is mate- so sugar coating,", "2_Subreddit": "opiates"}], "dvsf5r5": [{"0_Comment Submission": "The most important conspiracy and hardly anyone talks about it.", "1_Text": "The world runs on fiat currency which is really a giant ponzi scheme. THough the paper and metal coins is rapidly been changed to ones and zeros on hard drives which gives it even less value. Gold is ubiquitous as are diamonds not particularly valuable especially diamonds which are very common and for which the supply and demand is regulated by de beers in the main a company which was founded in part by JP MOrgan...begining to see a pattern here : /", "2_Subreddit": "conspiracy"}], "dvzmcc1": [{"0_Comment Submission": "Barracudas - Codeine", "1_Text": "I use to use with Robin wills back in 82/83", "2_Subreddit": "opiates"}], "dvzpju4": [{"0_Comment Submission": "When you wake up at 3AM in full-blown withdrawals and realize you have work in a few hours..", "1_Text": "Loperamide is a synthetic opioid agonist, which exerts its antimotility effects partly by stimulating µ (mu) opioid receptors on the circular and longitudinal muscle in the small intestine. IT doesn't cross the blood/brain barrier but can helpin wd's yu need to take a fair bit - check out google for mg's", "2_Subreddit": "opiates"}], "dw1gzyi": [{"0_Comment Submission": "When you wake up at 3AM in full-blown withdrawals and realize you have work in a few hours..", "1_Text": "I am not convinced of your reasoning over the blood/brain barrier as this is why you dont get high from taking Lope' the depression of the CNS is a factor in the relief of WD symptoms", "2_Subreddit": "opiates"}], "dw1h1s2": [{"0_Comment Submission": "Barracudas - Codeine", "1_Text": "HE was actually - but in a quiet un pop star way. Still got the album they were working on at the time cant remember the name but had a black and white cover - tho' it may have been a 12 inch.", "2_Subreddit": "opiates"}], "dw3smia": [{"0_Comment Submission": "Turns red on foil", "1_Text": "Its cut with mannitol - bet it runs and runs for ever right? if its all red ten there is next  to no H in it", "2_Subreddit": "opiates"}], "dw3sxma": [{"0_Comment Submission": "Does anyone else on this sub trail M30s on foil?", "1_Text": "smoking pills....really?? completely pointless your smoking the coating  then the binders afterwards - no way to get high man...just a waste", "2_Subreddit": "opiates"}], "dwers66": [{"0_Comment Submission": "Roxies AND chasing/smoking ECP? worth it or a total waist?", "1_Text": "smoking ecp is a waste as the boiling point too high in the uk we get #3 afghani gear which is for smoking or if you add citric or another acid can be injected", "2_Subreddit": "opiates"}], "dwuot6u": [{"0_Comment Submission": "How much methadone for a high comparable to 30mg of oxycodone?", "1_Text": "15-20mg but there is no euphoria with 'done , one of the reasons its used to replace opiates.", "2_Subreddit": "opiates"}], "dwwoxam": [{"0_Comment Submission": "Just when I thought I was gonna have to go thru WD hell found these OTC.", "1_Text": "in cambodia get out of the towns in to the villages best #4 $5 a gram. Usually in a straw. V easy to get... well was for me", "2_Subreddit": "opiates"}], "dwwp163": [{"0_Comment Submission": "Please please help me!!!!!!!!!", "1_Text": "drink lots of water - 3 litres a day", "2_Subreddit": "opiates"}]}], "1_submissions": [{"2kg8yi": [{"0_Title": "Ebola is so passe its back to SARS", "1_Text": "lope will attach to the mu receptors but you need at least x4 dose its not a miracal drug but does help.", "2_Subreddit": "conspiracy"}], "5fw24x": [{"0_Title": "happy christmas", "1_Text": "lope will attach to the mu receptors but you need at least x4 dose its not a miracal drug but does help.", "2_Subreddit": "opiates"}], "5fw3ev": [{"0_Title": "Best xmas film evah - from Mr Borroughs", "1_Text": "lope will attach to the mu receptors but you need at least x4 dose its not a miracal drug but does help.", "2_Subreddit": "opiates"}], "5g9tcl": [{"0_Title": "UK roll call", "1_Text": "lope will attach to the mu receptors but you need at least x4 dose its not a miracal drug but does help.", "2_Subreddit": "opiates"}], "5hqn2u": [{"0_Title": "how many brits on here?", "1_Text": "lope will attach to the mu receptors but you need at least x4 dose its not a miracal drug but does help.", "2_Subreddit": "opiates"}], "5k85ae": [{"0_Title": "oxy xmas", "1_Text": "lope will attach to the mu receptors but you need at least x4 dose its not a miracal drug but does help.", "2_Subreddit": "opiates"}]}]}]}