{"Ol_DirtyDan": [{"0_comments": [{"dw6p8mq": [{"0_Comment Submission": "If you haven’t check this song out! I know a lot of us can relate lol “ i choose the Percs over you! Ayy!”", "1_Text": "Love maxo", "2_Subreddit": "opiates"}], "dwael7t": [{"0_Comment Submission": "too many memes on this sub lately", "1_Text": "I hate to say this, but the sub seems to have been flooded by an influx of young users. I say young because some of the posts I have read seem so immature or ignorant to the point that there is no way that they'd still be alive if they were an experienced user with any long term habit.  I've been on this sub for probably about 3+ years (different handles) and I've definitely seen a decrease in quality.  Now I understand why different subs are getting banned. Long gone are the days of the \"voldermort\" sub, morbo stories, and turning Reddit friends into IRL friends.  Not trying to sound like some r/opiates old head OG guy, but just missing some of the older days of the subreddit. That being said, if anyone can contact morbo, any way we can get some more stories?", "2_Subreddit": "opiates"}], "dwafc3r": [{"0_Comment Submission": "Getting off probation in 2 weeks. Very excited but also very worried.", "1_Text": "OP if you can afford it or if your insurance will cover it, get the vivitrol shot. Never had it, but if probation is keeping you clean than I would imagine a shot that effectively prevents you from getting high would be (almost) similar incentive to not get high", "2_Subreddit": "opiates"}], "dwan3n3": [{"0_Comment Submission": "too many memes on this sub lately", "1_Text": "I believe I read that somewhere, i just miss the new ones!  It used to be my early morning ritual; at the time I was hard pressed for money so i would be up all night sick and read his stories. His new ones were like a sick w/d gift. I'm glad for him being clean,  just miss kym's antics!", "2_Subreddit": "opiates"}], "dwan5hc": [{"0_Comment Submission": "too many memes on this sub lately", "1_Text": "Hands down, in my opinion, he had the best stories. Miss reading about kym and all the antics", "2_Subreddit": "opiates"}], "dwao5r7": [{"0_Comment Submission": "Back in my day...", "1_Text": "Jim, you're the man. This post showcases the stupidity that has flooded the sub. In this day and age those ridiculous prices just don't exist anymore and if you swear they do you either are stupid, have a kid in high school selling a couple pills for weed money, or are just coming to fake flex on the internet.  Cheap pills are dead, it's not like the pill mill days", "2_Subreddit": "opiates"}], "dwb2x1i": [{"0_Comment Submission": "Mouth swap", "1_Text": "It's like a junkie Face/off. Is there anything nicholas cage can't do?", "2_Subreddit": "opiates"}], "dwbovqb": [{"0_Comment Submission": "Mouth swap", "1_Text": "You want to talk about cage being absurd, check out Wickerman. It's so bad it's good haha", "2_Subreddit": "opiates"}], "dwdppw6": [{"0_Comment Submission": "Am i doing something wrong trying to catch the hard fish?", "1_Text": "Reel in slowly after you cast. Like if on console barely pull the trigger", "2_Subreddit": "farcry"}], "dwfjuap": [{"0_Comment Submission": "Problems with Boomer?", "1_Text": "False alarm, I just killed the poor guy and revived him and it's all good. Guess it just glitched out on me", "2_Subreddit": "farcry"}], "dwia28x": [{"0_Comment Submission": "Grace Armstrong not at Lamb of God Church", "1_Text": "Anyone figure it out? I'm having the same issue glad I'm not alone, haha", "2_Subreddit": "farcry"}], "dwiauch": [{"0_Comment Submission": "Grace Armstrong not at Lamb of God Church", "1_Text": "Sucks man, I wanted Grace for some solid stealth help. Not to mention that fucks up getting 100%...", "2_Subreddit": "farcry"}], "dwinqgn": [{"0_Comment Submission": "Grace Armstrong not at Lamb of God Church", "1_Text": "So I unlocked her today. Idk what was, maybe I had another mission active but I just left the area and did some other stuff and went back to it and it allowed me to do the mission", "2_Subreddit": "farcry"}], "dwno8rv": [{"0_Comment Submission": "Easter morning cold cop!!", "1_Text": "u/bigerock I wish I still knew that area, been years since I been there. It's not what it used to be a few years ago. Stay safe out there", "2_Subreddit": "opiates"}], "dwntp38": [{"0_Comment Submission": "Drug taking loophole", "1_Text": "Instead of going broke from one drug, fuck it, get strung out on 7!", "2_Subreddit": "opiates"}]}], "1_submissions": [{}]}]}