{"Jenna-Talls": [{"0_comments": [{"dwq6p9t": [{"0_Comment Submission": "Arrived", "1_Text": "Me too. Original order and a reship sitting. 3/12 on one and 3/29 other. Both read inbound Into customs. Would have received letter by now if it were seized. I'm guessing the tiny envelope got lost in the shuffle.", "2_Subreddit": "duckdose"}], "dwqcbxs": [{"0_Comment Submission": "Both orders stuck", "1_Text": "I'm in the same boat as you with 2 stuck but my 1st order flew thru in a matter of hours.", "2_Subreddit": "duckdose"}], "dwqdfig": [{"0_Comment Submission": "What parents have you met that make you think, “Yep, that kid is FUCKED”?", "1_Text": "A 14 year old only child who's Mom puts pictures on the internet of their snuggle train with her the dad and the Son, she also does all his homework and projects for him and does not let him go to school when it rains. The kid is going to grow up to be a huge pussy.", "2_Subreddit": "AskReddit"}], "dwqrcn1": [{"0_Comment Submission": "How often do you see scripts for suboxone?", "1_Text": "I happened to be a 46 year-old married mother-of-two who functions in the real world in the medical field myself but due to circumstances with injuries that started in 2006 I too became addicted to pain medicine. I live that life for many years. The first time I went on Suboxone I was on it for 3 years. I know it seems like an incredibly long time but once you start a drug like that you literally need about 2 to 3 weeks of your life where you can put things on pause to withdraw. It is worse than coming off of heroin. I've never done heroin but working in the medical field I have seen people in withdrawal on a daily basis. After I went off of Suboxone I had a great 2 years but then I began to relapse. I am now on it again and have been for a year-and-a-half. This time I started out at being prescribed 16 mg then 8 then six but the whole time I never exceeded more than six and now I average two to four a day. I know I have a hard road ahead of me coming off of it again but this is the second time it's probably saved my life. I do know a lot of people sell it but it is mainly sold to heroin addicts to get them through until they are there recover or score again. You really can't dissolve and shoot the films, it's just nearly impossible. If somebody intends on abusing drugs while they're on Suboxone they tend to ask for Subutex which doesn't have naloxone. Suboxone is not an opiate but it is a partial opiate Agonist. You don't get high on it. I can attest to seeing two different doctors on two different occasions and the doctors themselves don't really know much about these drugs nor how to truly help you I believe they get into the business just for the money. It is very hard to find a doctor that prescribe Suboxone that also takes your insurance. Most of them want cash. Some even sell the Suboxone out of their office for cash. I wasn't aware of a shortage of this medication but I suppose I could see why there would be one. I also started using a mom-and-pop pharmacy that is next to the doctor's office and exclusively prescribes to his patients. You get tired of being judged and discriminated against especially if you don't look like your typical addict. Which there really is no look for a typical addict because it can happen to anybody from jail to Yale. If you are a pharmacist just treat your customer with at most respect as you don't know what they are dealing with and don't assume that they are selling it or abusing it. That's just my two cents.", "2_Subreddit": "pharmacy"}], "dwqs8u9": [{"0_Comment Submission": "Is it really possible to taper down where your brain heals and you don’t have withdrawals. I can’t miss work and I can’t not perform at work. I’m getting so discouraged. If I can effectively taper down. How do I do it? What Vitamins do I need? Kratom? I take zubsolv at 1mg morning and night", "1_Text": "When I quit the 1st time, I sneezed for 4 months!", "2_Subreddit": "suboxone"}], "dwqt8jc": [{"0_Comment Submission": "Just wanna vent", "1_Text": "There is a coupon on Suboxone dot com. I pay 25 for a box of 30 and take 4mg and have 7 boxes saved. Always have a back up.", "2_Subreddit": "suboxone"}], "dwqtlxp": [{"0_Comment Submission": "Are Sub withdrawals really that much worse than Oxy withdrawals?", "1_Text": "Subs are way worse. Opi's you're ok at a week. This...months.", "2_Subreddit": "suboxone"}], "dwrfl41": [{"0_Comment Submission": "Inbound to customs?", "1_Text": "Me too. One since 3/12 and reship 3/29.", "2_Subreddit": "duckdose"}], "dwtv25m": [{"0_Comment Submission": "Delivered but strangely", "1_Text": "When did the reship hit customs and is it NYC?", "2_Subreddit": "duckdose"}], "dwvl56h": [{"0_Comment Submission": "My 600-lb Life - 6x13 - \"Schenee's Story\" - Initial Episode Discussion", "1_Text": "No...WE who work take care of YOU financially", "2_Subreddit": "My600lbLife"}], "dwvmuqe": [{"0_Comment Submission": "Looks like i got boned to.", "1_Text": "If you go on Twitter they have a # you can call.", "2_Subreddit": "duckdose"}], "dwvzgsa": [{"0_Comment Submission": "Question regarding narcan and opiates", "1_Text": "Police don't order Labs...lol...I've worked in 2 ER's", "2_Subreddit": "opiates"}], "dwvzms7": [{"0_Comment Submission": "Question regarding narcan and opiates", "1_Text": "Also I've never seen a panel to include fentanyl. Morphine yes.", "2_Subreddit": "opiates"}], "dww4oy0": [{"0_Comment Submission": "\"I can't eat spaghetti without sugar.\" 🍝", "1_Text": "But I'm trying so hard!", "2_Subreddit": "My600lbLife"}], "dwwn6ob": [{"0_Comment Submission": "Question regarding narcan and opiates", "1_Text": "Nope...they will never divulge. Not even to prisons when inmatea have clearly od'ed. They have to subpeopna the hospital for results.", "2_Subreddit": "opiates"}], "dwwn7kn": [{"0_Comment Submission": "Question regarding narcan and opiates", "1_Text": "Popo don't stick around. They drop them and leave. They don't have time to see if someone's pos or not.", "2_Subreddit": "opiates"}], "dwwnch8": [{"0_Comment Submission": "Question regarding narcan and opiates", "1_Text": "That paperwork has ero to do with it being under influence. All Labs are confidential, I'm sure they know already by blowing in the field. It's not how people assume it is. HIPAA is a huge deal that's taken very seriously.", "2_Subreddit": "opiates"}], "dwwnght": [{"0_Comment Submission": "My customs letter", "1_Text": "50 tabs...yep", "2_Subreddit": "duckdose"}], "dwwnwj6": [{"0_Comment Submission": "My customs letter", "1_Text": "It took 2 days to hear back from duckdose when I originally\nTold them my 50 tabs were seized. They refunded me. Thanks duckdose!", "2_Subreddit": "duckdose"}], "dwwosv2": [{"0_Comment Submission": "Order seized by customs, what should I do ?", "1_Text": "Mine was seized too. I didn't get an email though. I just threw it out. Visit duckdose sub.", "2_Subreddit": "afinil"}], "dwwrn3w": [{"0_Comment Submission": "Question regarding narcan and opiates", "1_Text": "Correct. Sub peona, was, whatever for the results, they just can't blurt it out. Are you an ED tech? We had corrections bring in 2 inmates who od'ed after a visitor. They were chomping at the bit to see if they were pos, no go, they had their boss call and they couldn't even divulge then. Subpeona had to be ordered. This is where I think HIPAA is a bit ridiculous. All tests were neg. They chewed on a fent patch. Had to send it out for that one.", "2_Subreddit": "opiates"}], "dwwrsmo": [{"0_Comment Submission": "Question regarding narcan and opiates", "1_Text": "@kitten, to answer your question,they will still be pos for the drug since it's in their bloodstream. The narcan is a brain thing.", "2_Subreddit": "opiates"}], "dwws8gd": [{"0_Comment Submission": "Tonight my 8 year old daughter was apparently watching us have sex", "1_Text": "I saw my parents when I was her age doing it on the floor in the living room between the couch and coffee table. I'm 47 and will never forget it..lol..my mom was shocked when I told her the next day (I was a huge dr.ruth fan and very self educated in that dept :) ) she swore I was sleep walking and seeing things. FF lots of years to be in your scenario with my then 6 yo son at the bedside. I just made a joke about it and said, yes! Busted! We were having sex. He forgot about it. Now doors are always closed and locked but with a small house of 2 now teenagers, you are more aware of sounds. It's so awkward.", "2_Subreddit": "sex"}], "dwxwszx": [{"0_Comment Submission": "1st Ship and Re-Ship both in Transit", "1_Text": "I get mine the same or next day it's in Jamaica.", "2_Subreddit": "duckdose"}], "dwy31jx": [{"0_Comment Submission": "Order seized", "1_Text": "No...they both read inbound into customs still. I find Usps updates quicker than DD site.", "2_Subreddit": "duckdose"}]}], "1_submissions": [{"871ily": [{"0_Title": "How is this possible?!", "1_Text": "Me too. Original order and a reship sitting. 3/12 on one and 3/29 other. Both read inbound Into customs. Would have received letter by now if it were seized. I'm guessing the tiny envelope got lost in the shuffle.", "2_Subreddit": "HOSPITAL"}], "871max": [{"0_Title": "How is this possible?!", "1_Text": "Me too. Original order and a reship sitting. 3/12 on one and 3/29 other. Both read inbound Into customs. Would have received letter by now if it were seized. I'm guessing the tiny envelope got lost in the shuffle.", "2_Subreddit": "nursing"}], "87o13m": [{"0_Title": "What is longest customs time?", "1_Text": "Me too. Original order and a reship sitting. 3/12 on one and 3/29 other. Both read inbound Into customs. Would have received letter by now if it were seized. I'm guessing the tiny envelope got lost in the shuffle.", "2_Subreddit": "duckdose"}]}]}]}