{"makedopegr8again": [{"0_comments": [{"drugnlb": [{"0_Comment Submission": "Dog sat for a friend over Christmas, made this to explain why his dog (the black one) might be a bit tired this week. GoPro Hero6 w/ karma grip.", "1_Text": "He looks absolutely thrilled to be out there!", "2_Subreddit": "gopro"}], "dsnarx7": [{"0_Comment Submission": "Shitpost: grateful", "1_Text": "You said it. Unfortunately the fun is gonna be over for me soon. I gotta kick and focus on other things I've been getting a little carried away w the opiates lol", "2_Subreddit": "opiates"}], "dsnvhp7": [{"0_Comment Submission": "Gf controls my usage, it's making me hate her.", "1_Text": "Dope wins this 10/10 times", "2_Subreddit": "opiates"}], "dsnvrcq": [{"0_Comment Submission": "What’s the craziest pick up experience you’ve ever had???", "1_Text": "A cop would probably smoke weed or maybe MAYBE do coke. I seriously doubt a cop would snort dope unless he absolutely had to. \n\nOr it if was some major investigation they were on. Cop ain't snorting dope to bust a street dealer.. unless the cop is a low key fiend and got himself a sweet gig where people force him to do drugs  😉", "2_Subreddit": "opiates"}], "dsnvvix": [{"0_Comment Submission": "Who else is watching Playoffs and getting Well?", "1_Text": "Will never understand smoking pills.. just seems so odd to me idk why.", "2_Subreddit": "opiates"}], "dsnw5wd": [{"0_Comment Submission": "Its been a while", "1_Text": "Dilly dilly!", "2_Subreddit": "opiates"}], "dsnwq94": [{"0_Comment Submission": "Usually I dab my black because I’m not big on IV. Today went to buy a new bag of rigs and the pharmacist was a bitch. She didn’t even want to help me at first but did. Asked for my usual 31g 1cc short tip and she gave me these! Didn’t know it till I got home. Like tf can I do with these dumb things", "1_Text": "What do you mean by \"dab\" ? I've never heard that in reference to dope before", "2_Subreddit": "opiates"}], "dssp7ix": [{"0_Comment Submission": "My insane roommate thinks she's turning tums into H/coke.", "1_Text": "Ur fuckin mad for putting this crazy lady's shit in ur arm knowing how off the walls she is lol. Ur mad!", "2_Subreddit": "opiates"}], "dssq8wd": [{"0_Comment Submission": "Cocaine", "1_Text": "Only reason I don't like doing coke is because you basically have to go through withdrawal every time you use it..", "2_Subreddit": "opiates"}], "dssrg25": [{"0_Comment Submission": "My Story: Comfortably Detoxing Off Norco's 15-20 times in the last 5 years; Guide & Tips", "1_Text": "Dude you can't even write a complete/legible... kidding! \n\nYou're a good writer. You should write more. Very entertaining.", "2_Subreddit": "opiates"}], "dstc8jq": [{"0_Comment Submission": "Are most oxys in the streets pressed with fent? If so how are some ways to check if they are or not.", "1_Text": "Taste is obvious, they also feel way different then real oxy. \n\nIf you're not 100% certain they are real,  you should assume they're fake and pressed w fent.", "2_Subreddit": "opiates"}], "dsw7gum": [{"0_Comment Submission": "I feel like dancing a fucking jig!! Shitpost...", "1_Text": "Link to OP's original post \n\nhttps://www.reddit.com/r/opiates/comments/7kr79l/fucking_rant/?st=JCL5GBXV&sh=45058e39", "2_Subreddit": "opiates"}], "dswn72e": [{"0_Comment Submission": "Baby blues ⭕", "1_Text": "Looks delightful", "2_Subreddit": "opiates"}], "dsy1e7d": [{"0_Comment Submission": "The day before yesterday 2 of my friends shot someone in the face while I was about 30 feet away", "1_Text": "Damn that is fucked up! If I were you I'd prolly feel confused too but fuck.. u didn't pull the trigger!", "2_Subreddit": "opiates"}], "dsy1hp7": [{"0_Comment Submission": "Work and addiction", "1_Text": "Finance (sales) - it has its ups and downs.", "2_Subreddit": "opiates"}], "dt3jcws": [{"0_Comment Submission": "Most interesting place you got your groove on......", "1_Text": "First time I've ever taken an opiate, ever: \n\nI was flying home on a business trip, I was at an Airport about to get on my last flight home, I was stoked! I got to my terminal and most the seats were taken except a few. I looked around and a woman made eye contact w me, and shit you not sort of like waved me over w her eyes. I was wearing a suit because I had meetings all day and she immediately commented on what I was wearing. I thought to myself \"is this real life? This shit never happens to me.. \"\n\nAnyways we got to chatting, and I told her flying is boring. I always have a few drinks before flying because wtf else am I going to do.. it's boring as hell!  I didn't know it then, but she was about to change my life for good. She looks at me and says \"you want a couple Percocet?\"\n\nI immediately said yes  -to be fair I knew what I was getting into, I had friends w problems and everything but I said fuck it I'm gonna do this. I didn't know pills at the time but I now know I took 20 mgs, and I was high out of my mind. We aggressively flirted the entire ride back to our home city. She was showing me naked pictures of her and shit, I was talking absurdly loud about how fun it would be to fuck in the bathroom on the plane and shit lol fuck it!  Looking back I can't even imagine what the poor people on the plane had to sit thru... hilarious to some, repulsive to  others I'm sure. \n\nWe got off the plane, exchanged numbers , etc and then shit got kind of weird w her.. she wanted me to sell her hubby weed and I just got wicked sus'd out and thought they were cops so I totally stopped talking to her. \n\nNow that I think of it... I should hit her up and see if she got any more of them perc's!! Lmao", "2_Subreddit": "opiates"}], "dt3l6bk": [{"0_Comment Submission": "Gonna be a good week. Cheers! (65 Oxycodone 30mg & 33 Xanax 2mg)", "1_Text": "2 blues and a bar for breakfast.. my god mate you're a champion!", "2_Subreddit": "opiates"}], "dvf0km5": [{"0_Comment Submission": "Trump Agrees To Meet With Kim Jong Un", "1_Text": "Mike pence was at the SK NK border where they hold peace talks a few months ago. It's likely that's where they will meet.. it's not that big of a lift. Obviously it's a bigger deal because it's POTUS but it's not like we're going to meet the dude in Pyongyang", "2_Subreddit": "conspiracy"}], "dvxawd4": [{"0_Comment Submission": "I’m one happy gal today", "1_Text": "These r my absolute fav!", "2_Subreddit": "opiates"}], "dwdbym0": [{"0_Comment Submission": "Getting a script - do's and dont's", "1_Text": "I understand that to be true in most cases but this doc seems like he's willing to write that day. Tough to explain exactly how the assistant said it.. but she was pretty much like you pay us, you get the diagnoses/script and then come back and see us every few weeks...    \n\nThe doc seems suss. Which is exactly what I'm looking for lol", "2_Subreddit": "benzodiazepines"}], "dwl52c7": [{"0_Comment Submission": "My day on acid", "1_Text": "Ya man someone else said it below but.. just go out there and do it. Don’t ask urself over and over again “is it working? Am I feeling it?”  Just he present and have fun. \n\nBuy the ticket take the ride baby!", "2_Subreddit": "Drugs"}], "dwoi7jt": [{"0_Comment Submission": "Getting a script - do's and dont's", "1_Text": "Can I say my gf is prescribed them and she’s given them to me to help me go to sleep.. but I’ve never had one during the day so I’m not sure how it would combat my anxiety? Or is that too much?", "2_Subreddit": "benzodiazepines"}], "dwud8sk": [{"0_Comment Submission": "Kurt Cobain: An Alternative Conspiracy (not about his death, but his life)", "1_Text": "You are an incredible writer.", "2_Subreddit": "conspiracy"}], "dwuda9g": [{"0_Comment Submission": "Some perks", "1_Text": "Those look yummy!", "2_Subreddit": "opiates"}], "dwudiz9": [{"0_Comment Submission": "I wonder if anyone makes customized syringes with replaceable sharps", "1_Text": "I always wondered if people had stuff like this. Similar to weed paraphernalia in the sense that you could have your “own” stuff. \n\nNothin wrong w the standard orange needle we see all the time but it would be cool if people had unique kits", "2_Subreddit": "opiates"}]}], "1_submissions": [{"6t656x": [{"0_Title": "Edible marijuana and your liver", "1_Text": "He looks absolutely thrilled to be out there!", "2_Subreddit": "Drugs"}], "6w1tq3": [{"0_Title": "Attempted cold cop today", "1_Text": "He looks absolutely thrilled to be out there!", "2_Subreddit": "opiates"}], "722b7o": [{"0_Title": "How many Reddit accounts do you have, and what subreddits make up each one?", "1_Text": "He looks absolutely thrilled to be out there!", "2_Subreddit": "AskReddit"}], "722fy6": [{"0_Title": "How many r/usernames do you have and what how are they compartmentalized?", "1_Text": "He looks absolutely thrilled to be out there!", "2_Subreddit": "AskReddit"}], "76q2ry": [{"0_Title": "What's your favorite thing to do when high?", "1_Text": "He looks absolutely thrilled to be out there!", "2_Subreddit": "opiates"}], "78xmtw": [{"0_Title": "Is Donald trump about to make Heroin great again??", "1_Text": "He looks absolutely thrilled to be out there!", "2_Subreddit": "opiates"}], "7q4gcw": [{"0_Title": "Shitpost: grateful", "1_Text": "He looks absolutely thrilled to be out there!", "2_Subreddit": "opiates"}], "85kpbq": [{"0_Title": "High dosing hydros (shit post)", "1_Text": "He looks absolutely thrilled to be out there!", "2_Subreddit": "opiates"}], "87jmlm": [{"0_Title": "Getting a script - do's and dont's", "1_Text": "He looks absolutely thrilled to be out there!", "2_Subreddit": "benzodiazepines"}], "88fyc2": [{"0_Title": "My day on acid", "1_Text": "He looks absolutely thrilled to be out there!", "2_Subreddit": "Drugs"}]}]}]}