{"opithrow12345": [{"0_comments": [{"dwjxojk": [{"0_Comment Submission": "Seven years after graduating, I am done paying off my undergrad loans. Principal + interest = $171,000. I am free", "1_Text": "Thanks dude. I never thought I'd be the one telling people it's not so bad, and when you've paid it off you'll be feeling like a bad boy/bad bitch for sure.", "2_Subreddit": "StudentLoans"}], "dwjxpf7": [{"0_Comment Submission": "Seven years after graduating, I am done paying off my undergrad loans. Principal + interest = $171,000. I am free", "1_Text": "I didn't mean any antagonism towards the dude, I see his point. Just a rather extreme and dismissive way of putting it.", "2_Subreddit": "StudentLoans"}], "dwjxst8": [{"0_Comment Submission": "Seven years after graduating, I am done paying off my undergrad loans. Principal + interest = $171,000. I am free", "1_Text": "Hey dude, I wasn't trying to be so antagonistic, I kind of assumed you were trolling. Sorry. I appreciate the discussion and I do hear what you're saying. It's tough to admit that being jealous affects your behavior and I admire that. \n\nYour shit is rough, and I hope you get through it as soon as you can. If it makes it better, I am jealous that you've had to fend entirely for yourself the whole time-- I think I would have been more happy and more mature right now if I started doing that from day 1.", "2_Subreddit": "StudentLoans"}], "dwjxzfp": [{"0_Comment Submission": "Seven years after graduating, I am done paying off my undergrad loans. Principal + interest = $171,000. I am free", "1_Text": "Unbelievable, right? I went through a phase where I was furious with my parents for not being a check against my cluelessness. But I realized they fell pray to the same shit. In their country, getting educated was EVERYTHING. They are highly educated but their degrees don't mean shit here so they worked menial jobs and did babysitting on the side to take care of me and my siblings. It was so deeply ingrained in them that they didn't even think about how much unhappiness the ridiculous debt  would cause me down the line, and literally their lives have been about me finding happiness. \n\nThey're smart people, and I'm no moron. Funnily enough, I studied econ, I'm a decent poker player, and I make objectively good decisions about my finances all the time. But then this shit happened. It could happen to anyone, don't be too quick to judge before you've heard em out.", "2_Subreddit": "StudentLoans"}], "dwjy7ve": [{"0_Comment Submission": "Seven years after graduating, I am done paying off my undergrad loans. Principal + interest = $171,000. I am free", "1_Text": "Economics. I didn't have the grades or the hustle to make it at an investment bank, and I was honestly so depressed after graduating that I could barely get myself to interview for those kinds of jobs. I don't blame the debt, but it was a factor for sure. I worked hard at a few middle management jobs, mostly pencil pushing and writing emails. The only reason I got those was cuz I was a well-spoken white boy with a decent degree. I am very lucky I even landed something paying 45-50k for a few years, when I started I was looking at $18/hr internships in marketing and PR.\n\nNow I'm a software engineer and I love it. I'm underpaid for my city/skillset, and will move on soon. I've got about $6k of cc debt (0% interest, I took it when I left my old job to train for engineering) so I'm still technically in the red, but i feel like the illest motherfucker alive rn", "2_Subreddit": "StudentLoans"}], "dwjydch": [{"0_Comment Submission": "Seven years after graduating, I am done paying off my undergrad loans. Principal + interest = $171,000. I am free", "1_Text": "Fuck, 2k a month, when you put it that way... Yikes, I could have bought a house, started a company, had a real IRA going...\n\nAnyway, I do feel amazing, and you will too when you're done with that. Glancing at your history it looks like it's for a house? At least it's not student debt. And I see you're a dota 2 player-- that was definitely one of my go-to cheap hobbies (not free b/c real talk, i was buying those international compendiums every year)", "2_Subreddit": "StudentLoans"}], "dwjygel": [{"0_Comment Submission": "Seven years after graduating, I am done paying off my undergrad loans. Principal + interest = $171,000. I am free", "1_Text": "Thanks friendo, I'm glad you like it. The feeling's a slow, steady rush that hasn't subsided for 3 days if i stop doing anything I notice it. Good luck to you, I'm excited for you to feel ittoo", "2_Subreddit": "StudentLoans"}], "dwjz5fk": [{"0_Comment Submission": "Fuck my life", "1_Text": "talk to someone before you hurt yourself-- could be me or anyone else. dm me", "2_Subreddit": "opiates"}]}], "1_submissions": [{}]}]}