{"AquaTechFree": [{"0_comments": [{"duqvs84": [{"0_Comment Submission": "Cover of Tainted Love — Shae Altered [Alt Pop/Grunge Pop]", "1_Text": "First song I've wanted to save in awhile. I'll be leaving this tab up for awhile to re-listen.", "2_Subreddit": "listentothis"}], "duqwddt": [{"0_Comment Submission": "Two snowmobilers return a seal pup to its breathing hole in order to get it out of the sight of Polar bears", "1_Text": "Yeah, basically. Because we are so dominate on the chain it's very clear that we could completely alter every other part of the food chain if we acted on it. All those other parts work fairly okay together though in the long run so it's ideal we don't change that. Comparing us to other members on the chain is accurate but not really fair. \n\nAs for the Seal. Maybe it's going to work out like putting a small fish back in that in a few years they will be an ever larger and more rewarding meal.", "2_Subreddit": "HumansBeingBros"}], "durf7qv": [{"0_Comment Submission": "Dishwasher won't drain water; unknown clogged connection causes air gap to spill/overflow", "1_Text": "You can undo the hose right before the disposal and put it in a rubbermaid. Then run the unit and see if it all drains correctly. Your P-trap is very deep and may just be to slow draining for the sudden burst of water a dishwasher dispenses. Really you should probably move the disposal to the other sink and that way you can get ride of that flex tubing and hard pipe it all. It's definitely within a DIY job to redo that piping even without much experience. Even if it's not your issue it'd be a good idea. If you dump a big pot of water in your sink do they ever back up?", "2_Subreddit": "Plumbing"}], "durvbeu": [{"0_Comment Submission": "MRW when I want to end it by jumping off a bridge but I'm disabled and can't get over the edge, but thankfully I have very supportive friends", "1_Text": "A permanent use wheelchair is usually made of aluminum or more likely titanium. My moms chair was about 10 pounds roughly. Also due to her having possible fragile bones in her hips and legs, the support the wheelchair gave may have helped bones from fracturing.", "2_Subreddit": "shittyreactiongifs"}], "dus62h3": [{"0_Comment Submission": "So, I was minding my own business when... (Story of my terrible assault inside!)", "1_Text": "Ducks can be lil gangstas from what I hear. It's a large reason many of us stick with chicks. They don't do a literal \"stick up\" as they have no guns but from the stories I've heard it's damn near close to one. Sorry you got had but at least their cute.", "2_Subreddit": "BackYardChickens"}], "duse0aw": [{"0_Comment Submission": "ELI5: How does sleep debt/build up work?", "1_Text": "You produce chemicals while asleep that make your body numb and your brain tired. Sleep cycles seem to come from the fact that in the wild you may need to wake up from a danger, so your body does not put you in REM sleep right from the start and instead goes through stages of lesser to then deeper stages of sleep. So if you wake up groggy in say stage 3 sleep and are only awake for a couple minutes then your body has no time to get rid of the chemicals and realize you are well rested. (If there is an actual danger though then Adrenalin will pump itself to the for front and cancel out your sleepy chemicals). Instead you wake up and in those couple of minutes still feel like you are tired due to the chemicals your body has produced, so you go back to sleep. It's not just the brain saying \"hey I'm tired lets sleep\" but also the chemicals your brain has already triggered to help you sleep. Kind of like trying to open a pickle jar right when you wake up. Sure your awake and it would make sense for you muscles to work right away, but if you are coming from a REM sleep then the chemicals are still there and your muscles won't work right for a few minutes meaning you probably cannot open that jar. \n\nSource: Who knows, I'm drunk and have no medical background.", "2_Subreddit": "explainlikeimfive"}], "dut8xn7": [{"0_Comment Submission": "ELI5: How does sleep debt/build up work?", "1_Text": "I've drank way to much in my adult life so I've gotten better at handling myself. It's not a good thing", "2_Subreddit": "explainlikeimfive"}], "dutensm": [{"0_Comment Submission": "[Spoilers] Before DBS ends, let's take a moment to appreciate all that it's done.", "1_Text": "I was just re-watching some fight highlights and Ultra Goku vs Kefla had such a great ending. Using his Kamehameha to surf her energy blast mid air, and then delivering his Kamehameha directly to her face was so awesome. I don't know what it is about point blank Kamehamehas but I love them. The one Goku delivered to Toppo after using Instant Transmission to get close was also an awesome one to watch.", "2_Subreddit": "dbz"}], "dutfby9": [{"0_Comment Submission": "[Spoilers] Before DBS ends, let's take a moment to appreciate all that it's done.", "1_Text": "With the Angels being possibly evil, multiple universes not even being in the the ToP or displayed, possible GoD fights, I feel like they left so many possible Arcs on the table which really surprises me. Heck from what we know Zeno is a GoD and the god of creation is still out there waiting to be introduced. Maybe it's a good thing they are going for a Seinfeld ending where they go out on top rather then milking every possible angle, but still makes me sad it's ending. \n\nI have to disagree with your other statements though I certainly can understand where you're coming from. I saw RoF in the theatres so I knew what the arc was going to be but I thought that and Battle of the Gods arc were still awesome to watch. I just didn't know how much I missed Dragon Ball until those got me back into the series. The movies were great but they simply never have enough time to develop the characters like the show can. So at least some of us didn't mind those arcs, and they almost certainly helped a new generation get into the show. Of course they are no where near as good as the current arc, but it was content worth watching.", "2_Subreddit": "dbz"}], "duy4unk": [{"0_Comment Submission": "Curious O C T O B O Y E asks hooman for a cuddle!", "1_Text": "I'm not a Christian. The fact that almost every animal, even sea goers, love them pets so much though would sure give me confidante god did in fact give us domain over all creatures. \n\nMaybe he never meant, 'hey you can eat them all' but instead was like 'hey dude you can pet every single one of them, even the ones in the oceans and they'll be your friends.'.", "2_Subreddit": "rarepuppers"}], "dv6edq3": [{"0_Comment Submission": "[SUB] Dragon Ball Super - Episode #129 - Discussion Thread!", "1_Text": "His normal state cannot block Jiren's Ki though. Even if he could act and react perfectly to every attack he would still have his base energy which woudn't work in a fight since an energy blast would kill him. This has to be a powerup of some type", "2_Subreddit": "dbz"}], "dv6f0e8": [{"0_Comment Submission": "[SUB] Dragon Ball Super - Episode #129 - Discussion Thread!", "1_Text": "He was in a defensive position at which just blocking he would still lose. That is why the GoDs were spotlighted saying that. Eventually that rock would crumble and Goku would lose and everything be erased. So with his back up against the wall Goku did what he does best and found new power. As the other poster said it has also been a progress.", "2_Subreddit": "dbz"}], "dvall3p": [{"0_Comment Submission": "Thank God they Added the Spoiler", "1_Text": "This was a concept solar car back in the late 90s early 2000s if I remember right. Out of some school which is why the body is odd. You also notice there is little room for an engine but the rear does have battery storage space. While the rear fin was supposed to capture the sunlight needed for the batteries. That's all I can remember though and in no way true. Looks like a go kart must power it", "2_Subreddit": "Shitty_Car_Mods"}], "dvi75oc": [{"0_Comment Submission": "Mold in crawlspace - new construction", "1_Text": "Not sure on this but in the greenhouse you can burn sulfur stones to kill mold spores, which eventually kills the mold itself. Unlike bleach that can spread the spores. Just something to maybe look into. \n\nProbably want a pro though so that the mold doesn't just spread and get more costly.", "2_Subreddit": "Construction"}], "dwikzgv": [{"0_Comment Submission": "How did Japan come to embrace the US as our ally/friend so quickly after WWII?", "1_Text": "You're citing Germany though. Japan was not handled the same.\n\n\"On September 2, 1945, Japan formally surrendered with the signing of the Japanese Instrument of Surrender. On September 6, US President Truman approved a document titled \"US Initial Post-Surrender Policy for Japan\".[8] The document set two main objectives for the occupation: (1) eliminating Japan's war potential and (2) turning Japan into a democratic-style nation with pro-United Nations orientation. \"\n\nWe were to disarm them, and then rebuild them in our image. Russia was not allowed and the nation was not divided into sectors each Ally could control, unlike Germany which was split into sections for each major ally to control. We(America) were to wake up the citizens to their errors and guide them to a better path. Germany was not viewed in this same light. \n\n\"MacArthur said, \"Measured by the standards of modern civilization, they would be like a boy of twelve\" compared to the maturity of the US and Germany, and had a good chance of putting away their troubled past.[11]\"\n\nhttps://en.wikipedia.org/wiki/Occupation_of_Japan", "2_Subreddit": "history"}], "dwirdus": [{"0_Comment Submission": "How did Japan come to embrace the US as our ally/friend so quickly after WWII?", "1_Text": "I misunderstood your comment then.  Thanks for the information.", "2_Subreddit": "history"}], "dwm35m0": [{"0_Comment Submission": "The new face of r/evilbuildings", "1_Text": "I mean being a kid and looking at this house must seem awesome. I'm 28 now so I've lost those goggles but for a kid to see Minnie living in a smallish house size decorated like this must seem pretty cool. I know the corporation side but I like this design considering bringing a family/kid to a park with this in it. 8/10 in my view.", "2_Subreddit": "evilbuildings"}], "dwn5761": [{"0_Comment Submission": "[Sanity Sunday] Before Easter is called 'Easter', it was the Passover. No, it's not Pagan Sex Day.", "1_Text": "For me Easter is just a great reason to get together with family and friends. There isn't a huge financial aspect like Christmas which is a plus and the activities like egg hunting are actually fun for both the kids and adults. I'm not any of the religions being debated and honestly besides it being fun to learn some history I don't care about what the origins were 2,000 years ago. Just that today it's used as a reason to create some family memories. I imagine many religious people feel the same and likely are not fully versed in the exact history. I mean even Wikipedia is apparently not fully educated on the topic so it's likely those people have no reason to have a bad conscious. I guess missing your actual religious holidays may seem wrong to some though, but still no reason to hate on families getting together. Clearly our opinions differ but that's my view on it all.", "2_Subreddit": "TumblrInAction"}], "dwn5uip": [{"0_Comment Submission": "weekend’s cocktail", "1_Text": "Those extended release capsules have two different beads inside them. One is a instant(ish) release while the other breaks down sometime around 4-6 hours later. So when you take the capsule your really only getting half of the dose listed on the capsule. That's why some people crush them, while others enjoy taking 1 in the morning and being set for the day. It's all preference and tolerance related.", "2_Subreddit": "opiates"}], "dwosegb": [{"0_Comment Submission": "u/AquaTechFree's circle", "1_Text": "ImmediateFluffyClerk", "2_Subreddit": "CircleofTrust"}], "dwp5wk9": [{"0_Comment Submission": "Watching snow evaporate off the cliffs from Taft Point, Yosemite National Park [OC][4409×5696]", "1_Text": "I clicked that link and about didn't read the article because I am so trained articles take forever to described hardly anything. That link was straight to the point without being technical. Thanks", "2_Subreddit": "EarthPorn"}], "dwskcoe": [{"0_Comment Submission": "Which side would you pick?", "1_Text": "I don't know much about comic books but in the Marvel VS DC comic didn't Thor die and it was left up to Superman to pickup his hammer and Cap's shield to kill the bad guy? A non-Cosmic Armor Superman? I don't see how Thor can help very much even if there are two of them.\n\nLike I said I don't know much on comics though and people keep mentioning Thor so apparently he is stronger then I know? I just really like Superman and Dr. Fate so my knowledge is limited haha", "2_Subreddit": "dbz"}], "dwtzshb": [{"0_Comment Submission": "Which side would you pick?", "1_Text": "Someone else mentioned the god thing but I don't see how that matters much. I know generally speaking gods are strong but really  you could be a deity and still be pretty weak I think. Just depends what your a god of.", "2_Subreddit": "dbz"}], "dwu0534": [{"0_Comment Submission": "Wage gap explained", "1_Text": "He was afraid and hid in the woods but I remember one situation back on court TV were like a 10 year old pulled a fire alarm at school and then shot on everyone once they were outside and lined up. Sure they could run all over so you'd have to act fast but that always struck me as a very simple plan that could of worked very well if you were inside the crowd.  (I think he just injured a few people) You'd likely have to wound most and then go back to kill them while they lay/crawl. \n\nBack when I was a kid and didn't have empathy well developed I used to think 'How could you have all this planning and enter a school fully equipped only to kill 9 people.' I would have never done it but I didn't relate well to those strangers suffering. So I think those thoughts may be slightly normal. Thankfully I grew out of them and I no longer think that way when I see news of a shooting", "2_Subreddit": "ImGoingToHellForThis"}], "dwu221b": [{"0_Comment Submission": "Wage gap explained", "1_Text": "Different strokes for different folks.", "2_Subreddit": "ImGoingToHellForThis"}]}], "1_submissions": [{"6oy2q3": [{"0_Title": "Today on NPR they were referencing something that happened last night. It was big enough to cause one of the bigger shows to say that they have been biased so far and going forward will start to hear both political sides' voices. What happened and on what show?", "1_Text": "First song I've wanted to save in awhile. I'll be leaving this tab up for awhile to re-listen.", "2_Subreddit": "OutOfTheLoop"}], "6wwfpy": [{"0_Title": "Tips to keep chickens out of a certain area?", "1_Text": "First song I've wanted to save in awhile. I'll be leaving this tab up for awhile to re-listen.", "2_Subreddit": "BackYardChickens"}], "8939wg": [{"0_Title": "u/AquaTechFree's circle", "1_Text": "First song I've wanted to save in awhile. I'll be leaving this tab up for awhile to re-listen.", "2_Subreddit": "CircleofTrust"}], "89wpjc": [{"0_Title": "Drying a couch washed by a garden hose. Should it be inside with fans or outside in the sun.", "1_Text": "First song I've wanted to save in awhile. I'll be leaving this tab up for awhile to re-listen.", "2_Subreddit": "CasualConversation"}]}]}]}