{"Mindbender1985": [{"0_comments": [{"csonnel": [{"0_Comment Submission": "best RC's to taper off of methadone?", "1_Text": "Try Kratom. Works for some people. It works well for me. I used it to get off Suboxone which is like a real light methadone type medication. May take some adjusting to get the dosage right but it is fairly inexpensive. Worth a shot.", "2_Subreddit": "researchchemicals"}], "dtevmeq": [{"0_Comment Submission": "How long do You dissolve for??", "1_Text": "15 minutes right under the tongue (look for the big vein) and press down your tongue with your head tilted forward. This method has always worked well with 2mg, 4mg, 8mg. Also, I would think about making a solution and using it like a nasal spray. Quicker onset and say better bioavailability. Just a thought everyone responds differnetly. Just avoid IV  sub use", "2_Subreddit": "suboxone"}], "dtevuix": [{"0_Comment Submission": "Blowjobs rescued me from hell", "1_Text": "Shit just made me almost spit out my coffee laughing at the wording of your post. Glad you made it through it man, great post shit deserves GOLD status man!", "2_Subreddit": "suboxone"}], "dtew4zh": [{"0_Comment Submission": "When will I get sex drive back?", "1_Text": "Soon buddy real soon. Give it another week to kick out that H off your receptors and you will be ready to rumble. It all differs for people (biochemistry shit) but my 8mg/daily suboxone dose gives me energy especially in the bed. No issues here finishing or getting it up. I'm 32yr old male (ex college athlete) don't know if that makes a difference. Best of luck at least you won't nod out while trying to smash like one does with heroin hahaha.", "2_Subreddit": "suboxone"}], "dth4ime": [{"0_Comment Submission": "We are a team of researchers looking into the unmet needs of people who use opioids. Please fill out our survey.", "1_Text": "I replied and have not heard back. I've been and seen it all regarding opioid addction/dependence and all other drugs of abuse. Get back to me if you truly want legit feedback and care about this study and epidemic. Mindbender1985 PM me please", "2_Subreddit": "suboxone"}], "du1e0bq": [{"0_Comment Submission": "Codeine addiction for a few years (max around 500mg per day). Prescribed 2mg subutex, to be reduced when ready.", "1_Text": "OP you don't need overpriced outpatient treatment. Rehabs are a failed system and we need to move away from these forms of treatment in my eyes, I've tried it all. Suboxone taper would work well or try maintenance and give recovery a chance. Do therapy (talk, bio, neurofeedback) I find these forms of treatment more beneficial.", "2_Subreddit": "suboxone"}], "du1epdt": [{"0_Comment Submission": "Recommendations??", "1_Text": "I agree especially for anyone with prior addiction. Kratom is a GODSEND lol for so many. Well I hate to burst your bubble when kratom finally gets banned all these people claiming how 'Benign\" this plant is. Wait until you run out, the withdrawals are tough. My doctor told me the reason the withdrawals are so harsh from heavy kratom use is that it acts on dopamine, serotonin, and norepinephrine unlike traditional opioid. I've got th through many different chemical withdrawals and kratom was my worst, worst than darnkent fent. I was using anywhere from 50-100 grams a day. Not so benign trust.", "2_Subreddit": "suboxone"}], "du47szv": [{"0_Comment Submission": "Recommendations??", "1_Text": "I am taking it after many failed attempts to stay abstinent. Rehab, vivitrol, everything under the sun. Chipped away with kratom for about a year after treatment thinking I was doing \"well\". Wow was I wrong that shit clouded my mind horribly and I've abused everything  (bone tumor). Fuck kratom. I'm doing weekly psychiatrist work with the Suboxone", "2_Subreddit": "suboxone"}], "du6ygqd": [{"0_Comment Submission": "I’m sorry", "1_Text": "Damn that's some heavy heart felt words from a co-dependent enabler. I'm an addict and have put my wife through the ringer (13 years of off and on relapse and recovery). Rehabs are a lot of false hope for the addict and loved ones. Rehabs are constructed to fail, straight facts. Sounds like he is in a deep and dire situation. He needs help, yes! You by the sounds of it have done everything in your control to make him \"BETTER\" but he has to be the one to make the change. Co-dependence sounds like a real issue at hand you are facing and you may need counseling of your own to understand his or her disease is out of your control. Wish you both the best. Suboxone and weekly psychiatrist visits have turned me back into a functional husband and father to my precious 2 year old daughter. Recovery is different for everyone and not one single approach will work. He may want to look into a Suboxone doctor and if all else fails get to a methadone clinic. The needle ends in death, point blank. Sad story but so familiar for many addicts and their co-dependents.", "2_Subreddit": "opiates"}], "du97f3m": [{"0_Comment Submission": "I’m sorry", "1_Text": "He needs to hit rock bottom, point blank. As harsh as it sounds you must have him evacuate your premise and stop enabling him. He will try any and everything under the Sun to guilt you into his next fix. Your living situation is very unhealthy and needs to end like now. And if he isn't willing to leave call the cops. If he won't go detox medically then maybe jail is the next best place for him. Just remember you can't save him or erase his addiction. Cut ties and wish him the best but letting him hang around isnt helping either of you, kicking him to the curb may just be the reality check he needs to accept real help. I would leave immediately before he or you does something that you can't erase. Addicts hate being called out on their shit, speaking from deep experience. He will keep blaming you for all his faults, addicts are great at deflecting the blame on others. My heart hurts for the both of you. LEAVE NOW! Please", "2_Subreddit": "opiates"}], "dut0wme": [{"0_Comment Submission": "How much does Suboxone eliminate cravings?", "1_Text": "After your body adjusts to your Suboxone dose and kicks out all the other opiates your cravings will become minimal. You can't just expect the medicine to do all the work. Don't start Suboxone with the mindset that you can still get \"high\" because the naloxone is inactive and just a marketing/patent ploy. I'm using Suboxone for long term maintenance, others use it for a short detox taper. Pm  me if you have any other pressing questions I have accurate scientific based research regarding Suboxone as well as personal experience. Peace and be well", "2_Subreddit": "suboxone"}], "duw58vu": [{"0_Comment Submission": "Bi-Weekly Check In - Wednesday February 21st", "1_Text": "Keep up the hard work, patience is a virtue as they say haha, slow and steady. I've jumped cold turkey off 2mg and it was hellish for a straight month but made it to all my college classes at the time looking like a damn zombie lol. I hear under 2mg gets tough who knows", "2_Subreddit": "suboxone"}], "dvfjh6k": [{"0_Comment Submission": "Life’s great again!", "1_Text": "Suboxone has enabled me to be a functional human, husband, father, friend, etc. Life changed for me. Failed rehabs I've tried it all and Suboxone with talk therapy, neurofeedback, meetings, healthy habits  (eating well and hitting the gym 3x weekly). I'm happy for you and keep up all the hard work and don't ever let another person dictate your recovery plan we are all unique and shit differs so just do you and if and when you want to get off your Dr will be able to help taper or may be your a lifer like myself. Harm reduction, for me no subs and it's OD central. Also has curbed my cravings for other substances (benzos, coke, E).", "2_Subreddit": "suboxone"}], "dvfjikd": [{"0_Comment Submission": "Life’s great again!", "1_Text": "I take 8mg daily for reference. Have been since late August 2017.", "2_Subreddit": "suboxone"}], "dvj40s4": [{"0_Comment Submission": "I need some help with dosing", "1_Text": "Depends on the mg of the percs you were taking. If you were only taking 30mg a day I would say do a rapid Suboxone detox and 2mg should be more than enough. Don't try to chase any high from bupe it's not going to get you anywhere", "2_Subreddit": "suboxone"}], "dvj4n4d": [{"0_Comment Submission": "3 months on 8mg daily", "1_Text": "Kratom will help you make it through work but you may need a higher dose  (30 plus grams/day). When I was withdrawing on Suboxone kratom hardly helped almost made it worse. Also, I took kratom only for (2) years and by the end I was taking literally 100 grams a day and kratom withdrawls are horrible at high doses so be cautious with that shit use it short term.", "2_Subreddit": "suboxone"}], "dvj4uuo": [{"0_Comment Submission": "Mental Fog", "1_Text": "Good for you dude. Keep up the hard work and don't rush the process. You sound like you can see the silver lining", "2_Subreddit": "suboxone"}], "dwr3vki": [{"0_Comment Submission": "Are there any rc opiods that are actually worth doing?", "1_Text": "Facts please. Your %'s are not accurate at all. You sound uneducated when you spout out information that you obviously have no real knowledge over. Post link", "2_Subreddit": "researchchemicals"}], "dwtlykw": [{"0_Comment Submission": "Just got referred Suboxone for kratom withdrawal, advice", "1_Text": "Kratom withdrawals are the worst point blank. I've been on every opioid under the Sun and my kratom intake skyrocketed to 50-100 grams a day and extract as well. Worst withdrawal of my life no bullshit and I'm not some pussy with no opioid tolerance either. Kratom is no miracle pIant, I  function 1000 times better on 8mg Suboxone. But I was also fuckin with dirty Chinese fent so that also played a part. Either way kratom isn't as benign as people claim. Take over 25 grams a day and go cold turkey and then tell me the withdrawals are minimal if not non existent lol. Misinformation! And trust me all you kratom diehards are gonna be shit out of luck when it gets banned, you all know it's getting banned just a matter of time. Suboxone and kratom are not even in the same discussion. Suboxone has anti-depressant effects and other uses kratom can be saturated with heavy metals and other shit, to each their own but I hate kratom shit sucks", "2_Subreddit": "opiates"}]}], "1_submissions": [{}]}]}