{"ohyeawellyousuck": [{"0_comments": [{"dwr07gj": [{"0_Comment Submission": "James Cameron attempted to buy the rights to the novel \"Jurassic Park\", but Spielberg beat him by a few hours. He described his version as \"'Aliens' with dinosaurs.\"", "1_Text": "Interesting. I wonder how I would feel about the storyline with that change. I kind of liked the dynamic between the scientists and Hammond, being a nice old fellow committed to his life goal; brilliant and kind, but misguided.\n\nI hear the book is pretty fantastic though. Did you prefer the books version of Hammond or the movies (just speaking about the character development, not of the entire plot as I imagine, as with most movies, the movie doesn't live up)?", "2_Subreddit": "movies"}], "dwr7jtm": [{"0_Comment Submission": "What would you say to you VP of Sales", "1_Text": "I like the top comment about brutal honesty as I agree. Personally, I love being in a room with higher ups because I like to pick their brain. I also am unafraid to challenge views just because of a title, so I will take the opportunity to talk about various decision making processes so that I can understand them better, and, hopefully, the VP can understand things better by getting a first hand account of the ground floor.\n\nMany people walk on egg shells around titles, and I think that behavior leads to companies missing out on the opportunity to improve. The nature of corporate structure has decision makers removed from what is happening in the field. Even great companies that work hard on connecting those two worlds still miss out on some of the subtle but potentially important details.\n\nI've gotten push back before, but it's typically because of the environment in which I voiced my concerns and opinions, not the opinions themselves. I've been told multiple times that VPs and other execs respected my tenacity and valued my opinions, and so I believe good VPs will respect you more if you come to them with valuable information and even challenge some decisions. That is how companies become better. It's not unlike a normal day in the life of a salesperson, bringing up important conversations that may be uncomfortable, but with the intent of helping your customers (the customer being your own company in this scenario) get better.\n\nI'm not necessarily saying push your VP in your first meeting, but I always enter these types of meetings having done enough research to bring some value to the conversation, and I always try to make some sort of impact by voicing any important concerns that I have.\n\nIf that's too intense for your taste, be prepared with how your territory is doing and have an answer for questions like \"how can I help?\" Treat it like a sales call, and spend some time thinking about what he or she is looking for out of the meeting. Have a clear goal for the meeting as well to ensure it isn't a waste of time. It's really a sales call (as is an interview), and your a salesperson, so treat it as such.", "2_Subreddit": "sales"}], "dwr8ejv": [{"0_Comment Submission": "Lethal Things...", "1_Text": "His health markers were all great after eating a red meat diet, so I'm interested into your definition of what \"bad for you\" means. What other health markers are you specifically looking at when condemning red meat?", "2_Subreddit": "funny"}], "dwr8i9h": [{"0_Comment Submission": "Lethal Things...", "1_Text": "Youre right, it's mainly full of healthy things.", "2_Subreddit": "funny"}], "dwrkc0t": [{"0_Comment Submission": "Lethal Things...", "1_Text": "Didn't answer the question, but I admire your use of that specific metaphor to highlight potential outliers of health problems due to specific habits.\n\nOr are you saying red meat causes cancer? In which case I would be interested how you arrived at this conclusion, whether it be to looking at scientific studies or accepting a general consensus. If it's the ladder, you should keep in mind that we thought cigarettes didn't cause cancer for a very long time, and it was generally accepted, even in scientific communities, before research emerged that negated the opinion. Similarly, we thought breakfast was the most important meal of the day, skipping meals was terrible for fat storage, high carbohydrate diets were good for heart health, muscle confusion was a thing that existed, and many other topics that have been refuted as more research is done.\n\nI can see your on the defensive, so I should note I'm not attacking you. It is tough for me to see a comment that claims something specific is unhealthy without allowing for any discussion on the reasons for that viewpoint. \n\nFull disclosure, I personally don't believe red meat is bad for you, as I believe it is a stigma left over from a time when we didn't understand nutrition well enough to condemn certain food groups. That doesn't mean that I'm not interested in hearing more about a differing theory, but it does mean that I'm not interested in hearing erroneous metaphors that compare red meat to cancer meant to entice intense emotion without any backup rather than factual discussion.\n\nEdit: if it is a cancer conversation, I think it would be beneficial to dive into the studies, such as the WHO report, and talk about correlation vs causation.", "2_Subreddit": "funny"}], "dwrlb1s": [{"0_Comment Submission": "Lethal Things...", "1_Text": "Then you are a moron because you never read any of those studies and everyone of them is a cause of correlation, that's it. Those studies talk about the connection between eating red meat and a very small risk increase for colon cancer, but none of them are able to connect the red meat specifically to this increase in risk. It's also thought to be, if anything with the meat, due to a portion of the red meat leftover from the animal that acts as a carbohydrate, not due to the protein and the fat content. However, this isn't clear and isn't proven so it's at best just a guess in an attempt to connect red meat to the problem. These examples could also be indicative of other things that people whom eat red meat typically do, representing the real cause that most likely has nothing to do with red meat at all.\n\nStop throwing Google sources around when you clearly have no idea what your talking about.", "2_Subreddit": "funny"}], "dwrlzkv": [{"0_Comment Submission": "Lethal Things...", "1_Text": "I wish more people had the aptitude to actually think before spouting bullshit. You're stubborn, so even in the face of overwhelming facts you won't change your opinion. Which is unfortunate for your health, but since if the entire world ate red meat we wouldn't have enough and prices would rise, I suppose I'll accept your tribute to us.", "2_Subreddit": "funny"}], "dwrm3th": [{"0_Comment Submission": "Lethal Things...", "1_Text": "His response when he loses the argument ^^^", "2_Subreddit": "funny"}], "dwrmpaf": [{"0_Comment Submission": "Lethal Things...", "1_Text": "Because it's propagation of bullshit. Red meat isn't bad for you. Sodium isn't bad for you. Breakfast isn't necessary. Fat isn't unhealthy.\n\nIt's incredibly annoying to constantly listen to people who have no idea what they are talking about making erroneous claims based on a report that they didn't read. It's the same thing that happened when cereal companies convinced us that we had to shovel sugar in our mouths for breakfast or we would get fat. It's incredibly problematic for the world to think these things, and the only way to switch the thinking is to challenge people on social media sights or internet forums who are propagating misinformation.", "2_Subreddit": "funny"}], "dwrn3q0": [{"0_Comment Submission": "The strike of 10000+ damage.", "1_Text": "This is what I was hoping for, and what I expected after the shit title.", "2_Subreddit": "funny"}], "dwrndsn": [{"0_Comment Submission": "Lethal Things...", "1_Text": "If I'm illiterate, how was I able to decipher the scientific studies surrounding your point, while you couldn't make it past googling them, looking at the title, and arriving at an uninformed opinion?", "2_Subreddit": "funny"}], "dwrpu9m": [{"0_Comment Submission": "Posted awhile back from here. Still laughing.... lol", "1_Text": "Yeah*", "2_Subreddit": "opiates"}], "dwrq8i0": [{"0_Comment Submission": "Found in /trashy. While y'all striking out on Whisper this chick letting the drugs find her.", "1_Text": "Look up", "2_Subreddit": "opiates"}], "dwrrqp9": [{"0_Comment Submission": "Saw this on here but never imagined it would work this well", "1_Text": "Would a McDonald's uniform work?", "2_Subreddit": "Tinder"}], "dwrwlyc": [{"0_Comment Submission": "🔥 Decapitated wasp grabs it's own head before flying away.", "1_Text": "Wut", "2_Subreddit": "NatureIsFuckingLit"}], "dwrwsi9": [{"0_Comment Submission": "🔥 Decapitated wasp grabs it's own head before flying away.", "1_Text": "Haha wasp ass?\n\n... Wasp ass...\n\nWasp ass. \n\n\n\n*unzips*", "2_Subreddit": "NatureIsFuckingLit"}], "dwuctwt": [{"0_Comment Submission": "Found in /trashy. While y'all striking out on Whisper this chick letting the drugs find her.", "1_Text": "He literally referenced the joke, and you still missed it....", "2_Subreddit": "opiates"}], "dwue1a7": [{"0_Comment Submission": "Zach Braff shared this faceswap of himself and Dax Shepard on Twitter", "1_Text": "I have zero problem with her vid breakdown. Thought it was funny and not a turnoff not a red flag. Still hot. Still awesome. Still marriage material IMO.\n\nThen again, the red pill - ites would call me a pussy bitch who would get rolled over by this woman in marriage and say I need to be more alpha or something. So there's that.", "2_Subreddit": "funny"}], "dww8872": [{"0_Comment Submission": "Bald eagle at the Twins home opener lands on Mariners starting pitcher James Paxtons shoulder", "1_Text": "Fuck.\n\nRight in the feels.", "2_Subreddit": "sports"}], "dww8ojz": [{"0_Comment Submission": "CrossFit Pull-up, Perfect Execution", "1_Text": "It's a different exercise with an entirely different stimulus goal. You don't do kipping and butterfly pull ups without having done plenty of standard pull ups, and standard or weighted pull ups are a foundation for any worthwhile crossfit programming. \n\nAn ex football player did a write up on the differences, but I won't waste my time finding it as most either wouldn't read it or say that specific football player is brain dead (or find some other bullshit reason to ignore his discussion).", "2_Subreddit": "gifs"}], "dww8rq3": [{"0_Comment Submission": "CrossFit Pull-up, Perfect Execution", "1_Text": "^someone who knows nothing about crossfit making an uneducated opinion based on a gif of an accident.\n\nI saw a guy hurt himself on a bench press. Must be because benching is unsafe and unnecessary. Should only use dumbbells so you can bail safely.", "2_Subreddit": "gifs"}], "dwwf39q": [{"0_Comment Submission": "[PICS] 185-133lbs=52lbs.", "1_Text": "/r/theydidthemath", "2_Subreddit": "keto"}], "dwxtx7o": [{"0_Comment Submission": "Jesus, would you look at the time", "1_Text": "The thought of this kind of absolutely scared the shit out of me.", "2_Subreddit": "funny"}], "dwy15cl": [{"0_Comment Submission": "Jesus, would you look at the time", "1_Text": "Yes.", "2_Subreddit": "funny"}], "dwy1767": [{"0_Comment Submission": "Life Goals:", "1_Text": "What am I missing here...?", "2_Subreddit": "P90X"}]}], "1_submissions": [{"7hou2z": [{"0_Title": "My Take on Addiction", "1_Text": "Interesting. I wonder how I would feel about the storyline with that change. I kind of liked the dynamic between the scientists and Hammond, being a nice old fellow committed to his life goal; brilliant and kind, but misguided.\n\nI hear the book is pretty fantastic though. Did you prefer the books version of Hammond or the movies (just speaking about the character development, not of the entire plot as I imagine, as with most movies, the movie doesn't live up)?", "2_Subreddit": "stopdrinking"}], "81nerz": [{"0_Title": "Kratom for Opiate Withdrawal - Questions about how to use Kratom for short term opiate detox without having to withdraw from Kratom", "1_Text": "Interesting. I wonder how I would feel about the storyline with that change. I kind of liked the dynamic between the scientists and Hammond, being a nice old fellow committed to his life goal; brilliant and kind, but misguided.\n\nI hear the book is pretty fantastic though. Did you prefer the books version of Hammond or the movies (just speaking about the character development, not of the entire plot as I imagine, as with most movies, the movie doesn't live up)?", "2_Subreddit": "kratom"}]}]}]}