{"mermaidmistress2018": [{"0_comments": [{"dw5vm63": [{"0_Comment Submission": "Dunder Mifflin is expanding south to Lexington, Kentucky", "1_Text": "My boyfriend and I are definitely checking this out later!! Thanks!", "2_Subreddit": "DunderMifflin"}], "dw94wpq": [{"0_Comment Submission": "This guy rear ended me and requested I take this photo right before he straight up drove off and fled the scene of the accident.", "1_Text": "As a UK fan, and Kentucky native who's traveled all over the US. UK fans are all over the country! So this could have been anywhere, lol.   But he probably was \"barred\" out. That's the thing here", "2_Subreddit": "trashy"}], "dw9ypj0": [{"0_Comment Submission": "Such classy text as “I ♻️ Boys” and a bedazzled “Jail Bait”", "1_Text": "idk what's trashier, the fact the store makes these, or that people actually bought these. ://", "2_Subreddit": "trashy"}], "dwgoyfq": [{"0_Comment Submission": "What Kratom?", "1_Text": "I just wanted to state Kratom doesn't work for everyone. So if you use it and it doesn't help the WD symptoms dont get discouraged. Power through, I know its harder done than said. I used Maeng Da Green Kratom, and Super red Bali which was recommended for WD symptoms. I tried it every way (tea, pill, straight powder,etc) and it never took away any of the symptoms. I just dont want you thinking kratom to be a miracle worker, and be disappointed as I was when I ingested this nasty stuff, and it didn't even help with the WD.", "2_Subreddit": "opiates"}], "dwjit56": [{"0_Comment Submission": "You guys have no idea how excited I am.", "1_Text": "lady boner here.", "2_Subreddit": "opiates"}], "dwoz5fx": [{"0_Comment Submission": "What is your most terrifying animal encounter?", "1_Text": "Mnt. lions are common in my state, as a little kid I was playing in my backyard alone in a sand box ane running around. Little did I know I was being stalked by a big cat. Until it popped out of the woods and was coming towards me fast, I ran to my backdoor as quick as I could. Never saw one after that day.", "2_Subreddit": "AskReddit"}]}], "1_submissions": [{}]}]}