{"Jimbo4235": [{"0_comments": [{"dvsgjp4": [{"0_Comment Submission": "I tried H my first time tonight/this morning!", "1_Text": "Your life changed tonight. Although it seems fun and feels great and seems like it changed for the better cause you don’t need as much to feel good, it actually just turned a pretty dark corner. You already have an addiction with pills from what I gather, but the monkey on your backs appetite just got bigger. Reconsider using H for the long term. Then I again I don’t know you and you very well may be able to keep it under wraps  unlike so many of us, but just know the tightrope you hopped on.", "2_Subreddit": "opiates"}], "dvsgvy7": [{"0_Comment Submission": "60 days after went into chinese herbalist.", "1_Text": "The only thing I understood was ginseng. What is all that supposed to do?", "2_Subreddit": "opiates"}], "dvsh7sm": [{"0_Comment Submission": "I tried H my first time tonight/this morning!", "1_Text": "For sure CP sucks, especially headaches. I suffer from a myriad of back issues, unfortunately I stared using dope little over 15 yrs ago before my injuries so I went into it with a tolerance that pills are unable touch most of the time. Be safe and keep your wits about you since you’re aware of the nature of the beast.", "2_Subreddit": "opiates"}], "dvshwbl": [{"0_Comment Submission": "I tried H my first time tonight/this morning!", "1_Text": "Sounds like a plan!", "2_Subreddit": "opiates"}], "dvzdjs7": [{"0_Comment Submission": "When you push down on the plunger.", "1_Text": "That’s a really cool looking frog.", "2_Subreddit": "opiates"}], "dvzdoss": [{"0_Comment Submission": "The worst!!!!", "1_Text": "Do they not have an RN or whatever they are that send a script in? I remember when my pops was in CPM it seemed like the doc never wrote the script themselves it was always an RN.", "2_Subreddit": "opiates"}], "dvzdyl2": [{"0_Comment Submission": "Girl scout cookies", "1_Text": "Thin mints smashed up in some vanilla ice cream is the shit. I love thin mints. Always stash a few sleeves of them in the freezer.", "2_Subreddit": "opiates"}], "dw2b2tr": [{"0_Comment Submission": "Reddit content policy update", "1_Text": "It really is mind blowing some of the BS y’all get which should really just boil down to plain common sense. Keep up the good work!!", "2_Subreddit": "opiates"}], "dw2cesg": [{"0_Comment Submission": "What's up with my dope? Only ever get powder but this is brown and sticky. Is it possible to snort?", "1_Text": "It looks like tar someone tried to make into cheese but some moisture got into it. Sometimes that will make dope look like this.", "2_Subreddit": "opiates"}], "dw2sd6q": [{"0_Comment Submission": "3 grams of the best bth in the city", "1_Text": "Yea I’m with you on that. I’ve had both and get tar mostly. ECP is a good clean buzz but the legs and nod from tar can’t be beat IMO.", "2_Subreddit": "opiates"}], "dw2vxua": [{"0_Comment Submission": "Everyone is saying grey dope is fire, but mine is completely not injectable.", "1_Text": "Fuck that. Hope you get right soon.", "2_Subreddit": "opiates"}], "dw2wb3w": [{"0_Comment Submission": "Best drugs with opiates?", "1_Text": "I think you’re thinking of DMT. DXM is in cough syrup otc stuff. At a large dose it has some dissassociative traits but DMT is a straight up hallucinogen.", "2_Subreddit": "opiates"}], "dwfvx43": [{"0_Comment Submission": "Girlfriend and her friend got popped over the weekend. Fml.", "1_Text": "Yup. I have to pay 3k over the next 2 years to get mine reinstated.", "2_Subreddit": "opiates"}], "dwfw2dc": [{"0_Comment Submission": "My back is killing", "1_Text": "If it’s one of those surgeries they have to go through the front then yeah the risk def outweighs the benefits. To easy to catch pneumonia or some other bull shit if they have to split your sternum.", "2_Subreddit": "opiates"}], "dwfw9xk": [{"0_Comment Submission": "#3 porn - I love my new guy", "1_Text": "If it’s #3 chances are they aren’t injecting. Most people smoke #3. The prep for IV seems like such a pain in the ass with having to use citric and all that.", "2_Subreddit": "opiates"}], "dwp2wvb": [{"0_Comment Submission": "Easter colors !!! 😂 60mg Oxy in the blue, 90mg Morphine in the pink.... Happy Easter Nods my friends 🤙🏻", "1_Text": "Fuck yea. Never plugged it, but I’ve always really enjoyed morphine. The legs and that warm subtle glow along with that itch. Love that shit. I never understand when people say they don’t like it. Oh well more for us I guess.", "2_Subreddit": "opiates"}], "dwpgug7": [{"0_Comment Submission": "Pretty dope views", "1_Text": "Man being in Texas there’s a lot of dope scenery when I fix up on my out to visit family out in the boonies. Got family north and south so I get flat land with really dope sunsets then I got scenery out in hill country.", "2_Subreddit": "opiates"}], "dwph0he": [{"0_Comment Submission": "Very limited info on these online, help?", "1_Text": "Got scripted the pink ones a long while ago. At the time I was clean and ate up to like 5 at once with no buzz, just a very dirty, toxic feeling.", "2_Subreddit": "opiates"}], "dws13nn": [{"0_Comment Submission": "Opiate Shower thoughts pt. 1", "1_Text": "I had dude who always had “fire”. He would try and play me by telling me it’s fire even when I could smell the boiled down cola. I lost his number. Fuck that guy", "2_Subreddit": "opiates"}], "dww0kxj": [{"0_Comment Submission": "Why My Nose?", "1_Text": "Nose and balls here too. My fucking nose is raw at the end right now. And scratching my nuts when I’m high feels awesome. Though it’s not really a scratch more like pinching a little bit in my fingers and rolling the excess around. That’s the only way to do it.", "2_Subreddit": "opiates"}], "dww268e": [{"0_Comment Submission": "Help ? Need input on these.", "1_Text": "That’s the first thing I noticed too. Hahaha", "2_Subreddit": "opiates"}]}], "1_submissions": [{}]}]}