{"Fentylove": [{"0_comments": [{"dpjuhpe": [{"0_Comment Submission": "Where to buy rigs ?", "1_Text": "I got 100 pack at a smaller Walmart for 12$ 😁", "2_Subreddit": "opiates"}], "dqdgpw0": [{"0_Comment Submission": "This just happened", "1_Text": "What is ecp?", "2_Subreddit": "opiates"}], "dqdhqxh": [{"0_Comment Submission": "This just happened", "1_Text": "Oh ok, I've never got the chance to try anything from the east coast. All we have here is bth", "2_Subreddit": "opiates"}], "dqld4ar": [{"0_Comment Submission": "Black tloaties", "1_Text": "Are you talking about smoking it? My bad I should have been more clear I iv use only", "2_Subreddit": "opiates"}], "dqlds40": [{"0_Comment Submission": "Black tloaties", "1_Text": "It's like very tiny black dots, I've been using for 2 years and honestly still don't know what temperature your  \"suppose\" to heat it to. I normally just heat it till its all melted, which is usually just when it starts to bubble , is it possible to burn it? Will overheating cause it to lose potency?", "2_Subreddit": "opiates"}], "dqlfrbx": [{"0_Comment Submission": "Black tloaties", "1_Text": "Ok appreciate the advice!", "2_Subreddit": "opiates"}], "dqmlmx0": [{"0_Comment Submission": "Black tloaties", "1_Text": "Omg! Can that hurt me?", "2_Subreddit": "opiates"}], "dqzt42o": [{"0_Comment Submission": "Pick up for the weekend. 😁💖", "1_Text": "3 grams in a day! I hope I never get to that point lol", "2_Subreddit": "opiates"}], "dryewt2": [{"0_Comment Submission": "whys it so dark 😓", "1_Text": "Mine has been pulling up real dark lately to, and honestly I think the dope is better when it pulls up a pretty Amber color. So I'm thinking it's just cut more than usual", "2_Subreddit": "opiates"}], "drz3hly": [{"0_Comment Submission": "whys it so dark 😓", "1_Text": "I'm talking about American tar", "2_Subreddit": "opiates"}], "ds3eiqy": [{"0_Comment Submission": "Copping off Craigslist?", "1_Text": "I coped off Craigslist successfuly, what I did was ask for black roofing tar and told them to hit me up if they knew what I meant. Alot of sketchy people tried to sale to me then one guy came along that seemed trust worthy, we exchanged facebooks to make sure we were both legit then we met up and I've been using the same plug ever since", "2_Subreddit": "opiates"}], "dse7pry": [{"0_Comment Submission": "Got that kill shot ready! Peace out y'all stay safe!", "1_Text": "I smoke the same cigs!", "2_Subreddit": "opiates"}], "dtcgt1h": [{"0_Comment Submission": "Makeup tutorials giving me cravings", "1_Text": "Reminds me how badly addicted I am :p lmao !", "2_Subreddit": "opiates"}], "dvjxf81": [{"0_Comment Submission": "Has anyone here considered doing ibogaine treatment?", "1_Text": "Last week I had to go to a drug offender class everynight from 5:30-9:30 and I happen to be the only one in class who had a heroine addiction or at least the only one who would admit it and on the last day of class when the teacher was filling out my paper work he told me look into a treatment that he had written down in my work book. And that treatment was ibogaine,I never even looked into cause I have never heard of I until rn when I read this post! That's crazy, I think it might be a sign because I haven't wanted to stop useing until this week I finally decided that I dont want to be a slave to this terribly wonderful drug anymore. Do you think I would have better luck with the ibogaine or should I follow through with my sub doctor appointment tomorrow? Im very experienced with LSD, shrooms and I've even broken through on DMT before and I loved every second of every trip I've ever had.", "2_Subreddit": "opiates"}], "dvm4g8w": [{"0_Comment Submission": "Has anyone here considered doing ibogaine treatment?", "1_Text": "How much would it cost? And I can't leave the US until 2020 sadly", "2_Subreddit": "opiates"}], "dwe3srk": [{"0_Comment Submission": "As requested, I 🅱️🅾️🅾️fed a Cadbury’s Creme Egg - Pics and “Trip Report” inside!", "1_Text": "Like the rest of us i couldn't resist looking LMAO But you kept your word so respect man XD", "2_Subreddit": "Drugs"}], "dweakq6": [{"0_Comment Submission": "As requested, I 🅱️🅾️🅾️fed a Cadbury’s Creme Egg - Pics and “Trip Report” inside!", "1_Text": "Yeah soft dicks are funny looking lol", "2_Subreddit": "Drugs"}], "dworj2i": [{"0_Comment Submission": "Micron filters", "1_Text": "Really lol, I wonder why they would have them there", "2_Subreddit": "opiates"}], "dwouigu": [{"0_Comment Submission": "Micron filters", "1_Text": "You think it's sanitary?", "2_Subreddit": "opiates"}], "dwoyqmh": [{"0_Comment Submission": "Micron filters", "1_Text": "lmao,  just seems sketchy.  I would like to hear of someone else using it", "2_Subreddit": "opiates"}], "dwozw1p": [{"0_Comment Submission": "Micron filters", "1_Text": "I tried smokeing once, ig I burned it cause it just ended up leaving a thick black residue where I put my Lil blob of tar", "2_Subreddit": "opiates"}], "dwp00bg": [{"0_Comment Submission": "Micron filters", "1_Text": "Thank you!!", "2_Subreddit": "opiates"}], "dwp56qq": [{"0_Comment Submission": "Micron filters", "1_Text": "I'm Having Problems Ordering Due To Changeing  Residence often. And a po  box is not an option", "2_Subreddit": "opiates"}], "dwpnx5h": [{"0_Comment Submission": "Micron filters", "1_Text": "I really want to get some of  [these](http://www.harmreduction.co.uk/product/filter-syringe/) but only can find them in UK and shippings insane! . Me and my boyfriend both use pretty heavily we would go through a 10 pack of filters in no time so if we do order some we would need 100 pack minimum and that's looking to be a Lil too pricey atm sadly,  I feel so sorry for my veins lol", "2_Subreddit": "opiates"}], "dwu13tu": [{"0_Comment Submission": "Questions about IV use", "1_Text": "I've never seen anyone try heating it , I'm curious what would even happen if you did. I tried meth before H but never IVed till I got on H , I always heard not to heat it but other then that I though everyone prepared it just like herion but then when I started hanging around fellow meth iver's I learned back loading was a thing and was flappergasted anyone would IV something unfiltered but it's extremely common almost everyone I met did it that way . As for other questions needle size is probably preference based but I've heard some people claim they can use a smaller gauge then with H because of clogging but they must have not been filtering their H very well. I thought missing H hurt but it is nothing compared to crystal and I feel the misses don't go away a LOT longer also unlike H applying heat didn't seem to help reducing the size so I feel IMing would go horribly n not sure if it would even get you high .", "2_Subreddit": "Stims"}]}], "1_submissions": [{"7ad6n9": [{"0_Title": "How did you meet your plug ?", "1_Text": "I got 100 pack at a smaller Walmart for 12$ 😁", "2_Subreddit": "opiates"}], "7b7r11": [{"0_Title": "Where to buy rigs ?", "1_Text": "I got 100 pack at a smaller Walmart for 12$ 😁", "2_Subreddit": "opiates"}], "7gs825": [{"0_Title": "Black tloaties", "1_Text": "I got 100 pack at a smaller Walmart for 12$ 😁", "2_Subreddit": "opiates"}], "7ikexy": [{"0_Title": "Pick up for the weekend. 😁💖", "1_Text": "I got 100 pack at a smaller Walmart for 12$ 😁", "2_Subreddit": "opiates"}], "7tfyqq": [{"0_Title": "Makeup tutorials giving me cravings", "1_Text": "I got 100 pack at a smaller Walmart for 12$ 😁", "2_Subreddit": "opiates"}], "8923ib": [{"0_Title": "Micron filters", "1_Text": "I got 100 pack at a smaller Walmart for 12$ 😁", "2_Subreddit": "opiates"}]}]}]}