{"Leathery420": [{"0_comments": [{"dvsfjg8": [{"0_Comment Submission": "What's the most satisfying gaming experience you've ever had?", "1_Text": "Project reality. Its a mod for BF2 that aims for a blend of \"realism\" and teamwork. Models many real world armies with their correct gear. Has 100 player servers so its about platoon level combat. Each squad has a role like basic Inf, logistics, transport helos, attack, mech inf, ect ect. It also has a custom mumble plugin that allows you to communicate in 3-d space with teammates, as well as squad level, and command level for squad leads. So your SL can call in the teansport or supplies from the cholpers. Or say call in mortars fired by real people, and dial in the impacts on the enemy before an assault. Or say working in close with your armor as an INF squad. There have also been 200 player events on normandy map, or the batlle that the movie we were soldiers was based on. Its just so satisfying to be working to keep your HMG lmg, or rpg supplied with ammo to keep effective fire on the enemy. Or say cslling out medics theough smoke, and gunfire. Ill also mention that the sound effects in that mod are some of the best even surpassing games like arma in terms of realism so much so you can tell who, and what is firing st who if one side has mostly Ar15s, and the others AKs. If you've seen Squad on steam its made by many of the same devs.", "2_Subreddit": "AskReddit"}], "dvv9rmf": [{"0_Comment Submission": "Housekeepers of Reddit, what is the craziest or most nsfw thing you’ve walked in on in a hotel or at a clients house?", "1_Text": "Worked for a company that owned some properties. I was part of the maintenance team. Though being just out of highschool I basically just hauleded out/gutteded aparments before renos, and notified people that the exterminator would becoming to deal with roaches/bed bugs so they needed to move their furniture, and remove light fictures so he could lay down traps, and ect. They owned a couple of motels, and 8 or 10 apartment buildings. \n\n\nWhile I never did much at the motels besides move furniture, and AC units in, and out. Anyway on the aparment side there were a few notable cases. Most NSFW moment would be dude fucking his girlfriend louldy in the other room while I recaulked his bathtub instead of asking me to come back some other day. I finished up, and got out.\n\n There was an elderly resident who died, and had sat in the hot apartment in july for 2 or 3 weeks, and thankly I never needed to enter while he was inside because the stench was unbareable. I was there when the coroners wheeled him out though, and Ill remember that smell until its toppeded. \n\nThen there was another unit where I had to tell the guy the exterminator was coming, but when he showed me it was evident he wouldnt be able to do much. The guy was on mental disability, and barely cleaned it if at all. Black mold was on basically every surface, as well as bed bugs. His case worker ended up coming, and they took him to the hospital to check him out until they could find someplace for him to stay. The room needed to be completely gutteded, it was a biological hazard. I refused to help in that as I was making a half dollar over minimum wage, and I already didnt feel great about needing to step into some of these other units. I quit a week or two as most other other maintenance staff had in the weeks prior, and weeks after I did. I found out they ended up selling the aparments from a local news, and the article said it had been getting even worse. Which is pretty nuts considering we hauled out like 8-10 bed bug infested matresses. Was a horror show.", "2_Subreddit": "AskReddit"}], "dvvaqpg": [{"0_Comment Submission": "If everyone you've ever had sex with were put in the same room, without knowing why they were gathered, how long would it take them to figure out what they had in common?", "1_Text": "Whats the big guy's problem, been drinking? He has narcolepsy. He like has sex with the dead?", "2_Subreddit": "AskReddit"}], "dvvc7e6": [{"0_Comment Submission": "If everyone you've ever had sex with were put in the same room, without knowing why they were gathered, how long would it take them to figure out what they had in common?", "1_Text": "Lol I know, Im quoting a movie Rolling Kansas where they get pulled over, and their friend is passed out from narcolepsy, and the cop mixes the two up.", "2_Subreddit": "AskReddit"}], "dvvdqk0": [{"0_Comment Submission": "If everyone you've ever had sex with were put in the same room, without knowing why they were gathered, how long would it take them to figure out what they had in common?", "1_Text": "Oh well its kind of late at this point, i didnt notice you were OP and thought you were making a joke. My bad, Sorry! My reply probably made that worse.", "2_Subreddit": "AskReddit"}], "dvvhmoy": [{"0_Comment Submission": "If everyone you've ever had sex with were put in the same room, without knowing why they were gathered, how long would it take them to figure out what they had in common?", "1_Text": "Haha its np. Its kinda an obscure movie about some stoners who head to kansas in search if a mythical pot field to save their brothers business, and marriage. Maybe check it out sometime if your not opposed stoner comedies, and need a laugh. Again I'm sorry for what I know now was a joke in somewhat bad taste. Anyway have a fantastic weekend!", "2_Subreddit": "AskReddit"}], "dvwe3vk": [{"0_Comment Submission": "Housekeepers of Reddit, what is the craziest or most nsfw thing you’ve walked in on in a hotel or at a clients house?", "1_Text": "Lol nice my bad, though I'm sure you can find more than just those two.", "2_Subreddit": "AskReddit"}], "dvz04sk": [{"0_Comment Submission": "What do you think will happen on the real October 23 2077?", "1_Text": "If the human race is still doing anything by that date Ill call it a win. We are pretty overdue for a large war between then, and now if history has much to say about it. Who knows maybe we will have left earth, and people could get a wicked view of the nuclear hell fire on earth from orbit. Though in reality they will probably be dropped before then if they are to be deopped. \n\nNot to be a buzz kill and get political, but that shit in syria doesnt look to be getting much better after ISIS kicked the bucket, because all the groups were focused on them are now fighting each other. Turkey is now getting involved so they may crush the kurds while they are tied up and take the land in syria they captured as, and likley in Iraq too. Then that leaves both the Syrians, and Iraqis with two options give them the land, or fight them. Given the history of the region it likely wont be the first option. Then there is the possability of other countries currently fighting insurgencies getting worse to the point of civil war seen in Syria, and Iraq. Which there are literally too many to name in africa, and the middle east that it would probably be easier to name the ones not fighting insurgencies.", "2_Subreddit": "Fallout"}], "dw6jn46": [{"0_Comment Submission": "People who \"switched sides\" in a highly divided community (political, religious, pizza topping debate), what happened that changed your mind? How did it go?", "1_Text": "Used too be pretty heavily against religion because of the community I grew up in. Was full of people who used it as a reason bring others down. I got out, and met athiests who did the same thing,  as well religous people who used it more as a personal moral code than a reason to judge folks for their views. Those experiences helped me see the ignorance in my ways. While I'm still not religious, I can appreciate others beliefs. I think the lyrics \"If your god is a judge or a jailer,\nI’m still an atheist.\nBut I try to have faith in the things that will happen;\nI get saved from myself when i do.\nSo maybe “god” isn’t the right word, but I believe in you.\" sum up most of my views on that subject pretty well. Religion can be great its, when its used by people, and organizations to control others that bothers me. \n\nI also grew up in a community that was pretty against firearms as well. Though when I got out, and met more firearms enthusists myself, and read up on the laws instead of just beliving what the community or media said about them I saw that most of what they said was borderline untrue. I get some people really dont like them, and thats 100% ok, but please see for yourself before you condemn them. The people in firearms community were for the most part some of the safest, and most peace loving people I've ever met. Though If I just belived what I was told about them I'd never have found that out.", "2_Subreddit": "AskReddit"}], "dw6v536": [{"0_Comment Submission": "TIFU by trying to look up the movie 'Moonlight' and inadvertently exposing my entire family (including kids) to gay black porn.", "1_Text": "Oh man lol. My friend in school kept on getting in shit for looking at porn in like 9th grade. Though it wasnt him. The dad was also giving his younger brothers shit for pissing in bottles. Though it turned out it really wasnt him. A friend of the youngest brother had showed them porn, and it turned out they'd watch it together, and piss in the bottles because they did know about cum/too young to. Well the way the mystery was solved by the dad walking in on the youngest brother, and a couple friends in the middle of a session. I heard the dad flip shit over other smaller things so I cant even imagin what that was like. Lol the oldest brother found out because he could hear his dad freaking out on them when he was outside in the backyard.", "2_Subreddit": "tifu"}], "dwcdze0": [{"0_Comment Submission": "You are dropped penniless into a village in the middle of England in the year 1500. You maintain all your current knowledge. How would you make your way to the top?", "1_Text": "Teach them about getting the potassium from their piss so we can make gunpowder. Then if I got any time left after the pee party, ill kick start the revolver design. That way when JMB comes along he'll work on laser gats instead of 1911s, and shotguns.", "2_Subreddit": "AskReddit"}], "dwdzeje": [{"0_Comment Submission": "Which fanbase has been betrayed the most?", "1_Text": "Fallout. Bethesda saved the beloved IP just to get rid of more, and more of what made it fallout. Then when fans want to recreate FO3, and NV in FO4s engine because FO4 isnt a good fallout game. They shoot those projects because they dont want mods that use the audio assets from FO3 or NV, even if the mod author makes it so the person using them owns a copy of said games. This is also with no intentions of working on a new fallout game for some time too, so its not like they are doing it on grounds of cauaing poor sales to future games. It wasnt enough that they made Obsidian rush NV because of skyrim, but then they also refuse to let Obsidian develop another FO game incase it makes them look even worse. If they can take only the things they got right in FO4, and none of the bad then FO5 will be great. Though if bethesda's previous choices are anything to go on that likely wont happen. Please bethesda dont let me down.", "2_Subreddit": "AskReddit"}], "dwhfhh5": [{"0_Comment Submission": "Whats the worst that would happen if you shouted out \"fuck\" as load as you can at this moment in time?", "1_Text": "In a lunch room with about 250-300 grown adults? Probably nothing. Like half might look, but moat probably wouldnt wvwn hear me. Place is a goddamn zoo.", "2_Subreddit": "AskReddit"}], "dwhg7hy": [{"0_Comment Submission": "Who are you strangely attracted to?", "1_Text": "Left handed? You mean wrong handed?", "2_Subreddit": "AskReddit"}], "dwi44bs": [{"0_Comment Submission": "Who are you strangely attracted to?", "1_Text": "Nice. I started greying around 19. I've got an alarming amount for being early 20s. To the point I've had people think I dyed it or something. Though my face is of the baby variety so I probably wouldnt do it for you.", "2_Subreddit": "AskReddit"}], "dwjoxr7": [{"0_Comment Submission": "Who started off as the hero, and lived long enough to become the villain?", "1_Text": "What about ranger chief Hanlon?", "2_Subreddit": "AskReddit"}], "dwolqqa": [{"0_Comment Submission": "Nerds of reddit, what was the nerdiest moment of your life?", "1_Text": "Probably whenever I get into the finer points of a firearm design, and the pros, and cons that go along with each. I can just see peoples eyes glaze over when I start talking short vs long stroke pistons, ect, ect.", "2_Subreddit": "AskReddit"}], "dwp5thl": [{"0_Comment Submission": "What socially unacceptable thing are you actually completely OK with?", "1_Text": "Since when is that not acceptable? Its either the side of the road, my pants, or the milk jug. If its the jug I'm drilling it out the window (way of the road)when done.", "2_Subreddit": "AskReddit"}], "dwqz4sx": [{"0_Comment Submission": "Engineers of Reddit, what's something that's designed into a machine, solely because of the stupidity of human beings?", "1_Text": "The electric starter motor. Back in the day you had to crank start your engine. If you didnt follow the instructions, and held onto it wrong you run the risk of getting sucked in or smashes in the face and or chest. The story goes it was invented by someone whos family memeber had got killes starting their vehicle.", "2_Subreddit": "AskReddit"}], "dwvxscr": [{"0_Comment Submission": "What’s not a big deal in real life, but is a red flag in movies?", "1_Text": "No No! Keep going we are fine. You just hit cans. Cans!?! It was a Mexican!", "2_Subreddit": "AskReddit"}], "dwvyncp": [{"0_Comment Submission": "What's your worst experience with a goose?", "1_Text": "I never got the insult behind being called a honky or cracka. It just reminds me of the best day of my life when I got to feed a goose a whole box of wheat thins. Only encounter with them so that counts as worst right?", "2_Subreddit": "AskReddit"}], "dwx87js": [{"0_Comment Submission": "Anyone ever think about going on a drug holiday in SE Asia?", "1_Text": "Raindeer spotting? Thats reason for not going. Well that and the guy i'd with spwnt 17,000CAD over 2-3 months, and isnt even into opiates.", "2_Subreddit": "opiates"}], "dwx9b8a": [{"0_Comment Submission": "Anyone ever think about going on a drug holiday in SE Asia?", "1_Text": "Lol yeah he did I saw the bank statments, and pictures. Dude is into hookers, but most of was just spent on trying to fuck european chicks on vacation. He did tonnes of stupid shit. Got a silk tux tailored there, and then proceeded to trash it riding around wasted on his scooter he rwnted. There is a whole list of questionable shit he got up to. Though the raindeer apotting comment is because there is a documentary about finnish junkies shooting subs, and they go for a heroin vacation to SE asia, and now you can see a post mortem pucture of the star of the film if you google it. Not reccomended, but you've probably seen worse.", "2_Subreddit": "opiates"}], "dwxo832": [{"0_Comment Submission": "Anyone ever think about going on a drug holiday in SE Asia?", "1_Text": "Eh I wont deny that he's dumb. Dude worked for months in the oil field, and then after paying a lawyer, and fines he decided he was gonna blow the rest. Also while I'm sure he fucked a hooker or two I dont think the white chicks were. One was a dutch student spending daddy's cash. Another from Argentina . Though they went to the ladyboys and shit too. He did get some fine/bribes for drinking, smoking, and traffic for sure. Dude is also a huge alcoholic had to take benzos to taper down near the end so he could get on a plane. Said it was cheap most the time like 400-800 baht if you aren't being retarded. Though he is. Would spend a few thousand baht in one night a couple times a week. Lol went to one of those tourist thai boxing bars, and got all fucked up. Whether they give everyone who fights a trophy I dont know, but he got one. \nHe wanted me to quit my job, and go. Though given how things go over here when I'm with him, I pretty sure i'd ended up like thw dude from reindeer spotting.", "2_Subreddit": "opiates"}], "dwxp66q": [{"0_Comment Submission": "If the internet was shut down forever, what's something that would quickly become very popular again?", "1_Text": "Dvds, porn mags are only a thing now because of prison.", "2_Subreddit": "AskReddit"}]}], "1_submissions": [{"5e7h66": [{"0_Title": "AR500 steel targets?", "1_Text": "Project reality. Its a mod for BF2 that aims for a blend of \"realism\" and teamwork. Models many real world armies with their correct gear. Has 100 player servers so its about platoon level combat. Each squad has a role like basic Inf, logistics, transport helos, attack, mech inf, ect ect. It also has a custom mumble plugin that allows you to communicate in 3-d space with teammates, as well as squad level, and command level for squad leads. So your SL can call in the teansport or supplies from the cholpers. Or say call in mortars fired by real people, and dial in the impacts on the enemy before an assault. Or say working in close with your armor as an INF squad. There have also been 200 player events on normandy map, or the batlle that the movie we were soldiers was based on. Its just so satisfying to be working to keep your HMG lmg, or rpg supplied with ammo to keep effective fire on the enemy. Or say cslling out medics theough smoke, and gunfire. Ill also mention that the sound effects in that mod are some of the best even surpassing games like arma in terms of realism so much so you can tell who, and what is firing st who if one side has mostly Ar15s, and the others AKs. If you've seen Squad on steam its made by many of the same devs.", "2_Subreddit": "canadaguns"}]}]}]}