{"MsOhm": [{"0_comments": [{"dwkuna6": [{"0_Comment Submission": "He's just calling it like he sees it", "1_Text": "I don’t think that that’s deleted. I may be wrong though.", "2_Subreddit": "DunderMifflin"}], "dwpuuvi": [{"0_Comment Submission": "The Psychopathology of Long-Term Addiction and Cessation.", "1_Text": "Awesome information. I haven’t read all of it yet cause I’m tired as fuck, but I’ll from what I’ve read, it’s really good", "2_Subreddit": "opiates"}], "dwpuwt1": [{"0_Comment Submission": "Should I tell someone?", "1_Text": "Thank you, this is what I was initially thinking, but then my dumb morals kicked in about lying to my friends. I probably won’t then. It helped enough just to even post this I think.", "2_Subreddit": "opiates"}], "dwpv2vj": [{"0_Comment Submission": "Should I tell someone?", "1_Text": "Good point. It’s not like they’re asking if I’ve done these drugs. Though, sometimes my friend asks about psychs. I’m making a bigger deal out of it than it has to be. Thank you for helping me realize that :)", "2_Subreddit": "opiates"}], "dwqg1l3": [{"0_Comment Submission": "Should I tell someone?", "1_Text": "Ok, I definitely won’t then. I’ll just keep it under wraps", "2_Subreddit": "opiates"}], "dwqga4o": [{"0_Comment Submission": "Should I tell someone?", "1_Text": "With all the replies it got me thinking of their responses, and like you said, I think now that it would make things much worse.", "2_Subreddit": "opiates"}], "dwqgcsd": [{"0_Comment Submission": "Should I tell someone?", "1_Text": "Well, my best friend always asks me about drugs because she knows I’m more open to trying stuff than most people. Never specifically heroin, it’s usually weed she asks about.", "2_Subreddit": "opiates"}], "dwqgdxx": [{"0_Comment Submission": "Should I tell someone?", "1_Text": "That sounds like the best plan :) I’ll stay off, thanks!", "2_Subreddit": "opiates"}], "dwqgjlm": [{"0_Comment Submission": "Should I tell someone?", "1_Text": "I will, and I understand the addiction potential and how it sneaks up on you. That’s why I’m just sticking psychs now. I’ve tried the opiates I wanted to, and now I’ll just try psychs to be more introspective occasionally.", "2_Subreddit": "opiates"}], "dwqgm9l": [{"0_Comment Submission": "Should I tell someone?", "1_Text": "Thanks for the comment :) I’m just sticking to psychs now. They keep me more entertained then opiates so that’s good", "2_Subreddit": "opiates"}], "dwqgolc": [{"0_Comment Submission": "Should I tell someone?", "1_Text": "I never thought about the possibility that they would tell my parents, now that you bring that up, I think they would. Thank you for the comment!", "2_Subreddit": "opiates"}], "dwqgppy": [{"0_Comment Submission": "Should I tell someone?", "1_Text": "My dog is a very conservative anti drug type", "2_Subreddit": "opiates"}], "dwqgrj9": [{"0_Comment Submission": "Should I tell someone?", "1_Text": "Lol, do you regret telling your dad?", "2_Subreddit": "opiates"}], "dwqgvk4": [{"0_Comment Submission": "Should I tell someone?", "1_Text": "Glad to meet someone of the same age! Thanks for the comment “Yeah I won’t tell a soul except you guys.”\n\nI’ll stick to that. I guess seeing all these comment made me realize it would make things worse, not better", "2_Subreddit": "opiates"}], "dwqk473": [{"0_Comment Submission": "Should I tell someone?", "1_Text": "Lol thanks for the advice. I don’t think she’s as open minded as other people, so probably best I not tell her", "2_Subreddit": "opiates"}], "dwqk8kj": [{"0_Comment Submission": "Should I tell someone?", "1_Text": "Yeah, that’s why I’m sketched out to talk to a therapist. I don’t want it on records which would make it harder to get a prescription if I need it", "2_Subreddit": "opiates"}], "dwsqi4k": [{"0_Comment Submission": "Do you prefer uppers or downers?", "1_Text": "Uppers make you very energetic, downers make you chill", "2_Subreddit": "Drugs"}], "dwtivnt": [{"0_Comment Submission": "What do you think the government or society could do to minimize the deaths related to the opioid epidemic?", "1_Text": "Thank you for your very thoughtful answer.\n\n“legalizing and regulating the distribution of heroin to those that would benefit.” I agree. This may seem very unethical and crazy to some people that don’t understand the drug well and just know it as a hard drug. If we did legalize it, it would be so much safer. You hardly hear about heroin overdose deaths, you mainly hear about fentenyl overdose deaths.\n\nI also agree that we need to educate teens on drugs and not just tell them “they are all bad and will kill you”. I have heard so many stories of kids being told this, then they finally try a drug and realize this is not the case. Then they think every drug is ok which is very dangerous for them.", "2_Subreddit": "opiates"}], "dwtizi9": [{"0_Comment Submission": "What do you think the government or society could do to minimize the deaths related to the opioid epidemic?", "1_Text": "Very true. People think it’s crazy to legalize a “hard drug” and they think it’s unethical and unthinkable. People are taught, heroin is the worst drug possible and it will kill you. This is not the case. The laced heroin is the worst and WILL kill you. If we legalize and regulate, we can be sure it is safe.", "2_Subreddit": "opiates"}], "dwu0tmu": [{"0_Comment Submission": "Uh oh...", "1_Text": "No! NO! PLEASE GOD! NO! NOOOOOOO", "2_Subreddit": "DunderMifflin"}], "dwu2r0n": [{"0_Comment Submission": "Heroin while working out", "1_Text": "Yeah, that’s kinda what I was thinking, shoulda been more specific. I meant take a low dose (to not nod) while doing light cardio to make you go farther", "2_Subreddit": "opiates"}], "dwu46q1": [{"0_Comment Submission": "Heroin while working out", "1_Text": "That’s great! Being an active user is quite respectable", "2_Subreddit": "opiates"}], "dwu74m6": [{"0_Comment Submission": "Heroin while working out", "1_Text": "We have a genius in the house", "2_Subreddit": "opiates"}], "dwun16r": [{"0_Comment Submission": "A bit of I am very smart aswell", "1_Text": "Should we give him glasses?", "2_Subreddit": "im14andthisisdeep"}], "dwv5iwg": [{"0_Comment Submission": "Anyone here confident with their drug use?", "1_Text": "I’m a youngin who’s pretty confident in my drug use. \n\nAlcohol \nKratom \nPhenibut\nDilaudid \nVicodin \nValium \nNitrous \nDXM (huge trip: changed me for the better)\nEtizolam \nHeroin \nLSD\n\nNever been physically or psychologically addicted (except when I first started using Kratom, I underestimated it due to its legality)\nNever gone through withdrawals and I’ve been very successful in school. \n\nI should add also that I have researched every single drug I have used to the fullest extent and used them in the safest way I knew how and I think that’s what helped me not fall into he traps of them, not to say I’m immune to addiction either. I am lucky enough to have a strong support system if anything happens and I also have a spiritual side which has helped more than anything to remain in control.", "2_Subreddit": "Drugs"}]}], "1_submissions": [{"86ve7i": [{"0_Title": "Roses are red, Dwight's wounds heal with pee,", "1_Text": "I don’t think that that’s deleted. I may be wrong though.", "2_Subreddit": "DunderMifflin"}], "87olgr": [{"0_Title": "Can someone help me with the famous heroin user on here", "1_Text": "I don’t think that that’s deleted. I may be wrong though.", "2_Subreddit": "opiates"}], "89s4oc": [{"0_Title": "What do you think the government or society could do to minimize the deaths related to the opioid epidemic?", "1_Text": "I don’t think that that’s deleted. I may be wrong though.", "2_Subreddit": "opiates"}], "89w9ye": [{"0_Title": "Heroin while working out", "1_Text": "I don’t think that that’s deleted. I may be wrong though.", "2_Subreddit": "opiates"}]}]}]}