{"MMMMMBOX300": [{"0_comments": [{"dvmyd7x": [{"0_Comment Submission": "Real or fake?", "1_Text": "Those are some 100% guaranteed FAKE oxycodone brother. Proceed with caution", "2_Subreddit": "opiates"}], "dvpadtt": [{"0_Comment Submission": "Familiar press ?", "1_Text": "HAHAHA motha fuckas ain’t even trying anymore - those are disgusting looking", "2_Subreddit": "opiates"}], "dvrdpzv": [{"0_Comment Submission": "Advice? Anniversary ideas", "1_Text": "How about anal", "2_Subreddit": "opiates"}], "dvrv9yv": [{"0_Comment Submission": "Advice? Anniversary ideas", "1_Text": "Booooorrrrinnnggggg", "2_Subreddit": "opiates"}], "dvrx7aj": [{"0_Comment Submission": "Help me with a photoshop real quick!", "1_Text": "Hahahahah: “hey mom! Me, mark, connor and Chris are having a blast bowling. Thanks for giving me money to go. Look at the scoreboard! I’m killing them lol Jeff sucks. I won’t be home too late. Love ya!” - u/IsMayoANoveltyAct", "2_Subreddit": "opiates"}], "dvuu3d7": [{"0_Comment Submission": "Pharma blues to take the pain away", "1_Text": "Nothing takes the pain away my man. They just mask it for a period of time", "2_Subreddit": "opiates"}], "dvvgd0v": [{"0_Comment Submission": "Take me away", "1_Text": "Is it straight fent mix/pure white or is there a tan hue to it?", "2_Subreddit": "opiates"}], "dw4f0ru": [{"0_Comment Submission": "Cold cop was a success", "1_Text": "Wow cold coppin pills is not easy, especially real ones that look as pristine as these. Care to share how it went down?!", "2_Subreddit": "opiates"}], "dw4ffv5": [{"0_Comment Submission": "Anyone have some ideas for opiate themed tattoos?", "1_Text": "Yeah I have a great idea. Grow the fuck up and stop even considering getting the brand logo ofyour favorite pill. No need to advertise a pharmaceutical company that is fucking you up. \n\nMake this whole opiate thing a small stage in your life that doesn’t leave behind a permanent mark. .", "2_Subreddit": "opiates"}], "dw4plpd": [{"0_Comment Submission": "Oh we gotta do a shoprite run give me 10 mins “get ready” ya feel me? Lil white lol tan callit jet fuel", "1_Text": "I have a feeling we would be good friends bc I too get fueled up prior to doing any sort of errand ever", "2_Subreddit": "opiates"}], "dw4pzzv": [{"0_Comment Submission": "How do i manage to quit if i have the greatest addict life ever?", "1_Text": "This is defined as the greatest addict life ever? Damn we have some different standards", "2_Subreddit": "opiates"}], "dw6rdk2": [{"0_Comment Submission": "Question...found a new plug on whisper and he wants to use money gram for first timer. Scam?", "1_Text": "Scam city don’t even give it a second thought", "2_Subreddit": "opiates"}], "dwpg0to": [{"0_Comment Submission": "About to go cop with the money I hustled today", "1_Text": "Sad definition of hustle frankly", "2_Subreddit": "opiates"}], "dwru6q1": [{"0_Comment Submission": "In love with a user", "1_Text": "Hahahaha bingo! This seeems like it’s going to end in OPs favor for sure! How long until she sets up OP and has her deadbeat bf stick him up", "2_Subreddit": "opiates"}], "dwsymxt": [{"0_Comment Submission": "opiates n kpop", "1_Text": "Hahahah y’all a buncha weird motha fuckers. Getting high and watching KPOP?! I’ve really heard it all. Are you at least Korean?", "2_Subreddit": "opiates"}], "dwt5b6c": [{"0_Comment Submission": "Did Anyone Get Their Tax Refund Money yet? I did at 4 Am. At 4:05 i called the dboy. Didnt spend a lot, trying to cut down and save $", "1_Text": "It’s not like they just take your return if you have loans. Those loans have to be unpaid.......", "2_Subreddit": "opiates"}], "dwt5bim": [{"0_Comment Submission": "Did Anyone Get Their Tax Refund Money yet? I did at 4 Am. At 4:05 i called the dboy. Didnt spend a lot, trying to cut down and save $", "1_Text": "It’s not like they just take your return if you have loans. Those loans have to be unpaid.......", "2_Subreddit": "opiates"}], "dwt5hvp": [{"0_Comment Submission": "In love with a user", "1_Text": "“Power of the pussy” - me", "2_Subreddit": "opiates"}], "dwt752t": [{"0_Comment Submission": "Don't be like me and get too excited after copping", "1_Text": "My god people are unbelievably stupid. Imagine being so stupid you eat your entire pickup like a snack size bag of fruit snacks then get held in the psyche ward Bc you pretty much tried to kill yourself? I’m sure you’re like that 7 days spent in a hospital bill.......", "2_Subreddit": "opiates"}], "dwt83ku": [{"0_Comment Submission": "Just got my nipples pierced again.", "1_Text": "Dump em out then. Pics or it didn’t happen. I know you didn’t get them pierced so you could look at them by yourself", "2_Subreddit": "opiates"}], "dwt8f5s": [{"0_Comment Submission": "A SFW Boof Time!", "1_Text": "Are you going to show us your bicycle wheel? I hope it’s bleached", "2_Subreddit": "opiates"}], "dwt8lfj": [{"0_Comment Submission": "Bring it on, dope. You don’t stand a chance", "1_Text": "A real man would boot the rockstar. Y’all talk  about a rush!!!!!", "2_Subreddit": "opiates"}], "dwts53e": [{"0_Comment Submission": "Kind of annoyed", "1_Text": "Fuck right off", "2_Subreddit": "opiates"}], "dwv3noc": [{"0_Comment Submission": "Ok experts. Which one is real and which one is fake?? One is from a sealed bottle and one was bought online that was marketed on a site as “movie props” it’s simply a sugar pill..", "1_Text": "One on the right is fake", "2_Subreddit": "opiates"}], "dwvv9j7": [{"0_Comment Submission": "Anybody else freezing on subs?", "1_Text": "You literally jus said you were ALL GOOD on the following, which are all death for anyone in WD: mental anguish, ability to sleep, energy to move, hot flashes. \n\nAND YOURE COMPLAINING ABOUT BEING COLD?! You’re coming off dope pain free and you’re complaining bc you need to wear a jacket?! Unreal -get a fucking clue", "2_Subreddit": "opiates"}]}], "1_submissions": [{"5uih46": [{"0_Title": "Hello folks", "1_Text": "Those are some 100% guaranteed FAKE oxycodone brother. Proceed with caution", "2_Subreddit": "kratom"}]}]}]}