{"Joe11290": [{"0_comments": [{"dweenkm": [{"0_Comment Submission": "This is me making fun of those memes where people label their money for specific shit and try to show it off but also I’m sure some of you can actually relate to this so", "1_Text": "I don't even spend 6-7 bucks on cigs anymore,  i buy tobacco n tubes at 10$ per 2 cartons it comes out to. I do then have to make each cigarette, but at like 50 cents per pack of rollups its definitely worth it. Taste almost as good too with the right tobacco", "2_Subreddit": "opiates"}], "dweh6a6": [{"0_Comment Submission": "question about pawn shops.", "1_Text": "If the item has a serial number and the store had them in their system and reported it stolen, it would get found out and youll have a warrant then.  I don't think it matters if ur license address is from another state, they won't come raid ur house over it or even go to ur address even if the address was local.\n\nSomething expensive like a ps4, snowblower, etc would be bad news to steal then pawn. Ur better option would be to post it on offerup or letgo and sell it on there to someone that will just use it. Youll get more money on offerup and no id is needed to come back to you", "2_Subreddit": "opiates"}], "dwehjfr": [{"0_Comment Submission": "Can anyone explain to me what “scripts” are?", "1_Text": "Stay far far away from that guy.  Probly some idiot that snagged a script pad from his doctors office. The doctor will know its missing and has to report it, theyre like checks not just a pad of paper, every page has to be accounted for nowadays.\n\nYoud need the doctors dea# and even then most pharmacies wont even fill from a doctor not close by. But the script numbers would be red flagged as stolen when the pharmacy typed it in their system.\n\nI had a script of 60 sub strips a few years ago and his office was 45 min highway drive away. I went n got my new script one time and didnt have time to fill it right down the street that day so i came back to my area with it. Tried to stop at a walgreens and they denied me even when i offered to call the docs office.", "2_Subreddit": "opiates"}], "dwehxib": [{"0_Comment Submission": "Why does black tar always have a strong vinegar odor to it?", "1_Text": "Ecp dope doesnt have that vinegar smell much anymore cause its mostly all fentanyl analogues and rare to actually be even part heroin anymore.\n\nTar is still good old heroin and that's why they still use acetic acid to turn morphine into diACETYLmorphine (heroin).", "2_Subreddit": "opiates"}], "dwes0b7": [{"0_Comment Submission": "Cant believe it didn't hold", "1_Text": "This most likely would have worked and held it long enough to drive to a tire shop,  if the plug was used on the inside.  These plug/patches are meant to be put on while the tire is off the rim, not just slap it over the leak on the outside of the tire.\n\nReason sidewall punctures aren't fixed is cause of safety issue, and cause the sidewall flexes going over bumps which the patch can't seal for very long", "2_Subreddit": "Justrolledintotheshop"}], "dwge7kh": [{"0_Comment Submission": "What if you could shorten your w/ds to 5 minutes but during that 5 minutes you feel the cumulative pain you would've during the regular 5-7 days so it would be extremely painful but much shorter?", "1_Text": "They actually do do this already,  not in 5 mins but they do it in like 24 hours or somethin like that. \n\nThey put u under and run narcan thru ur body while ur unconscious, then when u wake up u don't have to go thru it. Been doing it at least for 10 years now,  ive never done it but ive read it online. Rapid detox or somethin like that", "2_Subreddit": "opiates"}], "dwk9q6v": [{"0_Comment Submission": "This is me making fun of those memes where people label their money for specific shit and try to show it off but also I’m sure some of you can actually relate to this so", "1_Text": "Only took me about an hour to master a stick shift, i bought a new car at 16 years old without knowing how to drive one. It was like 3k cheaper to get stick shift over an automatic.\n\nAll it is is getting used to going into first gear, 2-3-4-5 gears basically go into gear on their own", "2_Subreddit": "opiates"}], "dwkdyn1": [{"0_Comment Submission": "Is there a way to get higher off subutex?", "1_Text": "I iv'ed mine, up to 1mg in the morning (7 or 8am) then after work up to 1mg (7 or 8 pm)\n\nIv is the only way to shorten the half life from 30+ hours down to 4-7 hours. This means after 12 hours most of the bupe is eliminatef from ur body. U only \"get high\" when u go from no drugs in u to a lot of the drug very quickly. Thats why the first use is always the \"best\" when ur sick then do a shot. And if u do multiple shots u dont feel them much.\n\nI kept it to 1mg or less, 2 shots per day, and was able to get a little glow from bupe for the 2 years i was on it. By time i got home from work i was getting sick again.\n\nWhen u sniff or sublingual bupe, the half life is so long that its still alot in ur system when u take ur daily dose under ur tongue.  Bupe is garbage, not worth anything more than what its supposed to do", "2_Subreddit": "opiates"}], "dwkgfk9": [{"0_Comment Submission": "This is me making fun of those memes where people label their money for specific shit and try to show it off but also I’m sure some of you can actually relate to this so", "1_Text": "Yes.  Higher rpms = more fuel to explode inside the engine.   That's why the car has more power at 6000 rpms then at 2000 rpms if u floor it.", "2_Subreddit": "opiates"}], "dwns08o": [{"0_Comment Submission": "Grey dope", "1_Text": "Color or consistency (how it looks)  doesn't mean a damn thing.  It Can look like anything and be real good ol H, or some fentalogue. You Can somewhat tell by how it feels when you iv it if u know what shit should feel like. \n\nEither way, most only will get ya high for a couple hours,  maybe 3-4hrs if its real H/morphine dope.  I have had shit that kept me nodding high for 8 or so hours from a shot years ago, so it all depends on what's actually in it", "2_Subreddit": "opiates"}], "dwrti4z": [{"0_Comment Submission": "What is the heroin capital of the US?", "1_Text": "ohio is definitely a top- most addicted state but id still say chicago then detroit cause they're hub cities where the main loads go before distributed around the usa.\n\nCuyahoga had the most fatal overdoses last year or 2016. There was like 600 od's just in my county. Was like 3 a day just in this county,  not including probly at least 20 times as many non fatal ods.\n\nThen akron is where the carfentanyl first showed up when 30 of the dboys customers oded in one night. \n\nIts bad in every major city,  but chicago is known for cartel amounts of ecp. Bth isnt as much known as a epidemic cause its not fent too much and users aren't dying from stupid small amounts like ecp", "2_Subreddit": "opiates"}], "dwryb6y": [{"0_Comment Submission": "2 Dboys owe me extra but I don't want it right now-fuck me!", "1_Text": "Or sell it, but if its a whole day trip that ain't even worth the hassle. \n\nThey arent gonna save it for two weeks until ur ready finally,  its only a couple points anyway.  Tars only like 60 a gram isnt it? At 10 bucks worth of shit,  this isnt even worth my time typing a comment bro", "2_Subreddit": "opiates"}], "dwryme6": [{"0_Comment Submission": "When you’re about to do the scrapies and realize you didn’t pull the foil back all the way and there’s another hit 😁", "1_Text": "Folded paper like lotto tickets works perfectly fine as long as they have enough of a brain to fold it up properly. The shiny magazine type paper has a coating that doesn't absorb moisture like normal paper.\n\nIve gotten shit in reciepts that have a huge tear in the middle,  bags with holes in it, even a dude that handed me the scale in his car with little crumbs for half of it, and nothing in the car to put it in but my hand for it to melt or fall out on the walk back up the street.", "2_Subreddit": "opiates"}], "dwuc8oq": [{"0_Comment Submission": "got a new stamp that made me feel like I just smoked a bowl of weed..?", "1_Text": "Always do a tester with new shit now that this trippy fake dope has been going around.   I got 5 different batches of it and a few times was so bad i thought i was gonna die or at least get taken to the hospital if anyone tried to interact with me. \n\nIf id done much more i think i would've died a few of those times.  It was at least as bad as cotton fever or precipitated withdrawals from shooting a quarter of a sub.", "2_Subreddit": "opiates"}], "dwucf6n": [{"0_Comment Submission": "got a new stamp that made me feel like I just smoked a bowl of weed..?", "1_Text": "You say your friend got tested in the hospital and they \"found all that weird stuff in him\"\n\nSo what was the end result of the tests? What substance was in the dope that made him trip like that?  \n\nIve had that bad trippy fake dope and am scarred for life by it to where im scared of every new dope i get that it could be that bad shit again.  Ive been really wanting to know what was in the\"dope\" id gotten those times.", "2_Subreddit": "opiates"}], "dwucig4": [{"0_Comment Submission": "got a new stamp that made me feel like I just smoked a bowl of weed..?", "1_Text": "What did he test positive for in the ICU? It might have been some research chemical thats not detectable yet too, so they might not have even been able to find what the substance was", "2_Subreddit": "opiates"}], "dwucoif": [{"0_Comment Submission": "got a new stamp that made me feel like I just smoked a bowl of weed..?", "1_Text": "Ive had tan,dark grey,brownish/reddish, purpleish, black, basically every color chunk that ended up making me trip bad for up to 4 hours bad and some for 30 mins bad until it became tolerable.\n\nShit is one of the worst experiences ive encountered when u iv it. Idk if sniffing it is more mellow like a weed high, cause iv'ing it felt like i was on pcp or acid almost while still dopesick and freaking out burning up, heart racing, sweat pouring, extremely paranoid over everything.  No way was there even any dope in it and no way was it enjoyable at all in any way", "2_Subreddit": "opiates"}], "dwucw2i": [{"0_Comment Submission": "got a new stamp that made me feel like I just smoked a bowl of weed..?", "1_Text": "Shit, i wouldnt have even risked trying any other bags of it even if i had 20 more bags of it and no money to cop somewhere else. The feeling was that bad for me that id rather toss the rest of that batch and stay sick till i could get new shit.\n\nI just got it 2 weeks ago when my daily dboy got a new batch. I called him as soon as i could after i shot it and he imstantly brought and switched out with some of the old shit and told me he knew exactly what he got when i told him it made me trip. So they know what it is, his plug sold him it and i could tell my dboy had gotten the bad shit before and been through his customers freaking out about it.", "2_Subreddit": "opiates"}], "dwudmtq": [{"0_Comment Submission": "I’m sick and tired of this, and nobody wants to help me. I’m a grown ass man and I’m crying right now.", "1_Text": "Well, on a positive note, what i just read from you sounded to me like you might actually have a chance at some decent clean time this next time you get clean.  U gotta really be fed up with it all before you'll ever stay away from the dope and needle. \n\nImo, dont get on methadone man,  that shit is called liquid handcuffs for a reason. People usually don't ever taper off 'done and stay clean. Its worse than any dope/pill habit by far, and withdrawals last weeks or over a month since its duration of action is like a day or two as opposed to 4 hours for dope.\n\nIf u start mdone, youll never get clean unless u relapse on heroin for a month so the mdone gets outta your system then you just detox off the H for a few days.  Complete abstinence from opiates like subs even is the only way youll get feeling normal again", "2_Subreddit": "opiates"}], "dwyeybv": [{"0_Comment Submission": "I’m going to delete this in ten minutes bc it’s a shit post I’m ashamed but if I put heroin in a blunt and smoke it will I get high or nah", "1_Text": "No, won't be very effective way to vaporize the opiate.  I mean,  if ur 100% opiate naive with no tolerance, itll probly do something for you but if ur actually a heroin/opiate user, youd need to put too much into it and at that point id think it wouldn't burn right or would go out from the dope melting.\n\nRun the dope on foil and smoke weed in the blunt. If u can't be patient enough to use two drugs separately,  maybe just stick to smoking a blunt", "2_Subreddit": "opiates"}], "dwygjld": [{"0_Comment Submission": "i feel like maybe y’all will find this as funny as i did", "1_Text": "Bro im bout to pull up (as he gets on the plane from colombia)\n\nHour later- \"dude i gotta move somewhere else these people are lookin out the window at my white ass like im the first white guy they've seen\" ( im boutta pull up man ur cool there) \n\nAnother hour cop rolls by - \" dude cop just passed n saw me sittin here\"  ( im right around the corner, just be patient)\n\n As soon as you change spot to sit he calls like wtf u at i gotta go and acts like a few streets over is gonna ruin all his plans for the rest of the day.", "2_Subreddit": "opiates"}], "dwygl0l": [{"0_Comment Submission": "i feel like maybe y’all will find this as funny as i did", "1_Text": "Or the time u call n say ur there 5 mins before ur there cause ur sick of waiting, hes there in 30 secs and wont wait 3 minutes for you and your 200 dollars", "2_Subreddit": "opiates"}], "dwyhrga": [{"0_Comment Submission": "Mosquito finding a blood vessel", "1_Text": "Actually pretty crazy how evolution got them a bendable, pokable straw to do this.  \n\nMosquitos are the ultimate proffessional injectors/blood drawers for sure. That blood vessel is under a microscope too, just imagine how tiny that thing really is to feel and poke into it but not through and through it out the other side.", "2_Subreddit": "opiates"}], "dwyi7po": [{"0_Comment Submission": "Fucking tweaker robbed my girlfriend", "1_Text": "Exactly what i was thinking as i read it. Any opiate addict thats dopesick or in the junky limbo on their way to dopesickness should know better than to touch an upper without having dope in hand\n\nEven if u just bought dope, unless its either the same shit youve already had and know its good, or you did a tester/ get well shot and know its real. Coke/meth/stims just make wd's 10x more pronounced when sick and dont make u feel any better.  I wont even touch my coke unless i got known boy to dova speedball or i try the boy first to get well, then ill do the girl.", "2_Subreddit": "opiates"}], "dwyjs27": [{"0_Comment Submission": "The boosting hussle", "1_Text": "Suprised to hear jc penney still lets you do that much,  its been like 5 years since its been done around here that i know of personally.  I had a winter coat last year that i had to do a no receipt return with,  and i when i got that first 80 dollar card that time the reciept said i could no longer do any more no reciept returns after that first one in years.\n\nI will say that ive personally seen that their cards have a 500 limit and returns over 500 will be one full 500 card and the rest on a second card.  That shit was crazy stupid, i cant believe they did it for him. When that dude finally got blocked he called the number on the reciept and it said hed returned some stupid dumb number like 20,000 dollars of merchandise all himself.", "2_Subreddit": "opiates"}]}], "1_submissions": [{"85ggxh": [{"0_Title": "\"Dope\" that makes you trip when i shot it", "1_Text": "I don't even spend 6-7 bucks on cigs anymore,  i buy tobacco n tubes at 10$ per 2 cartons it comes out to. I do then have to make each cigarette, but at like 50 cents per pack of rollups its definitely worth it. Taste almost as good too with the right tobacco", "2_Subreddit": "opiates"}], "876weh": [{"0_Title": "Drug laced with bug spray makes users act like zombies", "1_Text": "I don't even spend 6-7 bucks on cigs anymore,  i buy tobacco n tubes at 10$ per 2 cartons it comes out to. I do then have to make each cigarette, but at like 50 cents per pack of rollups its definitely worth it. Taste almost as good too with the right tobacco", "2_Subreddit": "opiates"}]}]}]}