{"OHGreadmore": [{"0_comments": [{"dwcawto": [{"0_Comment Submission": "Microdosing acid?", "1_Text": "Look up volumetric dosing. It's the only way to accurately microdose. It's going to be trial and error the first few times since you have no idea how many ug your tabs actually are.\n\n\nI tried it and it didn't work for me. I either didn't feel it at all, or if I felt it I found myself wanting to take more and get high.", "2_Subreddit": "Drugs"}], "dwe4ffv": [{"0_Comment Submission": "Confessions of a coke head", "1_Text": "He's a player but only because he be playing himself.", "2_Subreddit": "Drugs"}], "dwk55y1": [{"0_Comment Submission": "On a scale of 1 to fucked how are all of you feeling tonight, I’m on about a 9 I think", "1_Text": "1/10. Was sober for 21 days and decided I had enough. Had some wine with dinner and Scotch afterwards. I have a little bit of hard laying around but I won't touch it. Going to eat a sliver of acid tomorrow morning and goto work.", "2_Subreddit": "cocaine"}], "dwk59yp": [{"0_Comment Submission": "Smells of vinegar?", "1_Text": "Heroin smells like vinegar.", "2_Subreddit": "cocaine"}], "dwlasm7": [{"0_Comment Submission": "Genetic testing has been enlightening", "1_Text": "Not legal....***yet***", "2_Subreddit": "Drugs"}], "dwvjvez": [{"0_Comment Submission": "All my friends have passed out", "1_Text": "I remember one night when we started running low on powder and it was 6am already. I knew if I didn't act fast the party would end. I was pretty drunk but the coke was keeping me soberish. Drove the hour round trip to pick up another ball and by the time I got back to the crib everyone was out.\n\n\nYou snooze you lose. No one got wake up bumps that's for sure.", "2_Subreddit": "cocaine"}], "dwx9x5y": [{"0_Comment Submission": "I have never done any opiates. I've been browsing this sub for ~2 hours now.", "1_Text": "This sub peaked my curiosity and I ended up trying heroin a few times. I never liked it. The first time I got a half gram. Didn't finish it, ended up just pitching it. Tried it again, this time with someone else's stuff. Didn't like it and gave it away.\n\n\nI gave it one more try a month or two ago and actually managed to finish a gram. I still didn't like it. Safe to say I won't be going back.", "2_Subreddit": "opiates"}]}], "1_submissions": [{}]}]}