{"CAP0NE666": [{"0_comments": [{"dwiakuq": [{"0_Comment Submission": "Well, we have all been in this predicament.....", "1_Text": "Just giving advice thanks bro much love .... because you came in here helping out so much.", "2_Subreddit": "opiates"}], "dwihji6": [{"0_Comment Submission": "Meet OG_Trapstar. Relapsed and blew entire savings on blues. Don't be like OG_Trapstar.", "1_Text": "Well I hope you get payed tomorrow because with your habit 90mg will at at the most hold you until tomorrow afternoon. Try to find subs always have at least one sub before you get physically addicted. They save your ass and if you can get any benzos on top of subs your golden it's what I use to do", "2_Subreddit": "opiates"}], "dwihqqh": [{"0_Comment Submission": "Anyone ever get red sprinkles in their product ?", "1_Text": "Yup", "2_Subreddit": "opiates"}], "dwir9c9": [{"0_Comment Submission": "Best beer to taper with?", "1_Text": "Michelob ultra light", "2_Subreddit": "dryalcoholics"}], "dwkcr8z": [{"0_Comment Submission": "Forgot to post these when I got them. Only get 56 a month and that was 2 weeks ago so not too bad on my part...", "1_Text": "Ya this works really good. I use to do this when I first started using original OC, ER Morphines, and Dilaudid.", "2_Subreddit": "opiates"}], "dwkg218": [{"0_Comment Submission": "Its that time of month again! My favorite time!", "1_Text": "4mg", "2_Subreddit": "opiates"}], "dwl6ju5": [{"0_Comment Submission": "Sober Saturday!", "1_Text": "Yesterday I only had five 5% beers. I was happy to open the fridge and seen there was one left that never happens. Small success today I'm going to try and do the same. I'm trying to go completely dry but I need this small taper. I need to completely stay away from liquor and beers over 5%. High gravity beer, ice beer, and liquor are always my downfall into physical and bad mental addiction.", "2_Subreddit": "dryalcoholics"}], "dwl6obp": [{"0_Comment Submission": "Does anyone else really not get bad hangovers?", "1_Text": "Ya I don't touch any drinks with sugar anymore, they destroy my body.", "2_Subreddit": "dryalcoholics"}], "dwl6u4x": [{"0_Comment Submission": "Does anyone else really not get bad hangovers?", "1_Text": "Exactly me one I have about 4 to 5 drinks in me it gets harder to stop. I try to only buy what I need for the day so I don't over indulge. I can't buy cases of beer or fifths of liquor. I try to only buy a 6 pack at a time.", "2_Subreddit": "dryalcoholics"}], "dwm1zt4": [{"0_Comment Submission": "$180 for a gram is fuckin killing me.", "1_Text": "Pay no more than 100 a g of str8 diesel rock. And if you don't get good heroin you might as well quit especiaslly if your paying 180 a g and your saying your sick.", "2_Subreddit": "opiates"}], "dwm2vdc": [{"0_Comment Submission": "Landlord and AC (unlivable pretty much) input greatly appreciated! (FL)", "1_Text": "No and also you shouldn't talk about drugs... your post history......", "2_Subreddit": "legaladvice"}], "dwm33tf": [{"0_Comment Submission": "Runny nose wasting dope??", "1_Text": "Bang or boof. You'll never look back, and save money and get higher.", "2_Subreddit": "opiates"}], "dwm3781": [{"0_Comment Submission": "Heroin and MDMA. happy full moon and easter everybody. Stay safe. Love you", "1_Text": "Lol you called his was out. Everyone this picture is 3 years old.", "2_Subreddit": "opiates"}], "dwm37oi": [{"0_Comment Submission": "Heroin and MDMA. happy full moon and easter everybody. Stay safe. Love you", "1_Text": "Lol you called his ass out. Everyone this picture is 3 years old.", "2_Subreddit": "opiates"}], "dwmv9bt": [{"0_Comment Submission": "Lower doses of red veins more euphoric?", "1_Text": "4 grams of most red strains for me are easily the most euphoric.i really don't get anymore benefits out of taking more than 4 grams of any strain. 3.5 4 grams seems to be my sweet spot if it's good kratom. White strains though I can almost sometimes get more benefits off a low dose of 2 grams", "2_Subreddit": "kratom"}], "dwnnd3u": [{"0_Comment Submission": "Policy Change regarding human consumption", "1_Text": "Someone needs to buy a domain and open a website like bluelight but better. LIke how reddit drug subs were before the bans, but better.", "2_Subreddit": "opiates"}], "dwudtr0": [{"0_Comment Submission": "Fuck my life (and my veins)", "1_Text": "Yes you can boof a bloody shot", "2_Subreddit": "opiates"}], "dwutr33": [{"0_Comment Submission": "My dboy who sold me these bricks invited me into his trap house to party. I politely declined", "1_Text": "More than likely", "2_Subreddit": "opiates"}], "dwvr72u": [{"0_Comment Submission": "I’m leaving Saturday", "1_Text": "Usually you go to detox first for 5 to 7 days and they give you enough meds to be comfortable.", "2_Subreddit": "opiates"}], "dww211i": [{"0_Comment Submission": "Who else remembers the first time they played Halo?", "1_Text": "Halo 1 at my buddy's down the street", "2_Subreddit": "halo"}], "dww25if": [{"0_Comment Submission": "If you are a normal casual player, dont go near the Halo 2 BR playlist. Its full of tryhard teams absolutely wrecking everyone.", "1_Text": "I agree I've been messing around not trying and still going like 30-2 and losing games sooo...", "2_Subreddit": "halo"}], "dwwied4": [{"0_Comment Submission": "I need to quit, at least for awhile. What has worked for you?", "1_Text": "Weed and beer.", "2_Subreddit": "opiates"}], "dwx6j6q": [{"0_Comment Submission": ":)", "1_Text": "Windy city blows", "2_Subreddit": "opiates"}], "dwxiwna": [{"0_Comment Submission": "PSA: Capsules don't seem to work", "1_Text": "Usually the acid in your stomach should be more than enough. I've never had problems with not feeling caps. OP Are you taking caps on a full stomach", "2_Subreddit": "kratom"}], "dwxizuy": [{"0_Comment Submission": "How bad is the nausea effect?", "1_Text": "I've never been nauseous from kratom AMD I don't have that great of a stomach.", "2_Subreddit": "kratom"}]}], "1_submissions": [{"7zhopa": [{"0_Title": "Trying to vagabond somewhere warm and nice", "1_Text": "Just giving advice thanks bro much love .... because you came in here helping out so much.", "2_Subreddit": "vagabond"}]}]}]}