{"_navistfu": [{"0_comments": [{"dw2am8g": [{"0_Comment Submission": "Headed to rehab for benzos guys", "1_Text": "Goodluck you can do this!", "2_Subreddit": "Drugs"}], "dw36zlf": [{"0_Comment Submission": "Got a tattoo of what I think the Master Sword would look like if Link never resurrected and claimed it", "1_Text": "This is so cool!!", "2_Subreddit": "zelda"}], "dw8ug9r": [{"0_Comment Submission": "I dunno what I’m doing.", "1_Text": "Good vibes to you as well! Hope all is well (: have a good rest of your night", "2_Subreddit": "Drugs"}], "dw8wr0e": [{"0_Comment Submission": "Am I throwing away 4 months accrued sobriety time...", "1_Text": "Im in just about the same predicament. Od’d in dec then moved back to the middle of nowhere with my mom and siblings. I was 80 something days clean. I took some of my dads painkillers when i was over by his house this past weekend, couldnt help myself but lurk around the ol medicine cabinet. Found half a schoolbus in my wallet and my sis bought a dab pen. I was debating taking the pills and smoking. And then i did. I felt guilty as fuckk the first night. I was layin in my bed stoned and just couldnt stop thinkin about how im gona have to tell everyone. But forsure that was the one and only time i was gona take pills and smoke. Pft. That was on sunday. Its about to be sunday again. The next day i drank some codeine, took my half xan and smoked. And have been smoking everyday since then. Its your addict brain. 4 months is a long mf time dude! Be proud!! Im proud of you! You can do this!!", "2_Subreddit": "opiates"}], "dwclv1h": [{"0_Comment Submission": "Psychedelics during active addiction?", "1_Text": "Yeah even if its a bad trip usually it just means you have to see and learn some shit about yourself, face it and then youll be ok. I used to trip a lot a couple years ago and always had a good time. Then i got into pills and eventually dope. When i would trip while addicted my trips were filled with anxiety but only if i smoked weed while peaking. So my advice would be to try it out but have some xans or somethin else to take you down if you feel its too much. Hope everything turns out well for you!!", "2_Subreddit": "opiates"}], "dwcm90k": [{"0_Comment Submission": "What are some of the most shame filled moments in your gaming history?", "1_Text": "I was drunk playing windwaker and was sailing for about 10 minutes annoyed that it was taking so fucking long and then i realized i didnt have the sail on my boat 🙃", "2_Subreddit": "gaming"}], "dwcoemr": [{"0_Comment Submission": "I took 4 tabs... third trip.", "1_Text": "Good vibes man", "2_Subreddit": "LSD"}], "dwe19pc": [{"0_Comment Submission": "Bands like The Secret, Nails and Nasum?", "1_Text": "I was listening to nasums inhale exhale earlier and on recommended was brutal truth extreme conditions demand extreme responses. It was released in 1992 i believe. I never heard of them/it till today and although i havent finished the whole album yet (got busy) it was decent where i left off. See if you like that?", "2_Subreddit": "grindcore"}], "dwe1kr9": [{"0_Comment Submission": "Bands like The Secret, Nails and Nasum?", "1_Text": "Oh yeah! Im a fan of rotten sound i saw them a couple months back (: do you know pig destroyer? Theyre pretty good too book burner is their most known album i guess but i like painter of dead girls better", "2_Subreddit": "grindcore"}], "dwio39r": [{"0_Comment Submission": "Threw away all my drugs", "1_Text": "I feel like all the drugs ive done have ‘dumbed me down’ too. I admire you for getting rid of your drugs. Hope it goes well for you!!", "2_Subreddit": "Drugs"}], "dwiqd61": [{"0_Comment Submission": "Getting off Xanax", "1_Text": "Proud of you!! Longg mf time", "2_Subreddit": "benzodiazepines"}], "dwiqfpd": [{"0_Comment Submission": "I’m currently having a bad trip", "1_Text": "https://youtu.be/hdmSovWFhig", "2_Subreddit": "LSD"}], "dwiqipm": [{"0_Comment Submission": "I’m currently having a bad trip", "1_Text": "https://youtu.be/1u_Jy46ILYw", "2_Subreddit": "LSD"}], "dwlfkac": [{"0_Comment Submission": "Watched a Bee die for an hour of my trip", "1_Text": ":( why must the good die young :(", "2_Subreddit": "LSD"}], "dwlxg89": [{"0_Comment Submission": "Need help making a bowl", "1_Text": "Why dont you just roll a b?", "2_Subreddit": "trees"}], "dwn3qhr": [{"0_Comment Submission": "How do I use whisper?", "1_Text": "What even is that", "2_Subreddit": "opiates"}], "dwn4em9": [{"0_Comment Submission": "Thoughts on patreon as an illustrator/fine artist?", "1_Text": "Did you post on your instagram that you have one? I wonder why you didnt get any patrons..?", "2_Subreddit": "CasualConversation"}], "dwnjud4": [{"0_Comment Submission": "Thoughts on patreon as an illustrator/fine artist?", "1_Text": "Thank you!! Ill look into ko-fi and gumroad!", "2_Subreddit": "CasualConversation"}], "dwnmfb7": [{"0_Comment Submission": "Should I buy a 3DS..", "1_Text": "I have nl and i love it. But i want to get the switch for botw but if a new animal crossing comes id def get it for that too. Id honestly just figure out which system you want more games for a go from that.", "2_Subreddit": "AnimalCrossing"}], "dwnmgx7": [{"0_Comment Submission": "Just scraped out my grinder. Had a cone of mostly kief, but my clumsy ass knocked the bong and most the kief out onto the filthy carpet. There's no retrieving it. Rip 1000 odd dollars of ground up weed kief. You'll be sorely missed", "1_Text": ":’(", "2_Subreddit": "trees"}], "dwnmljt": [{"0_Comment Submission": "Life’s good , eating good , living good", "1_Text": "Proud o you!! Keep it goin, youre worth all good things!!", "2_Subreddit": "opiates"}], "dwntv73": [{"0_Comment Submission": "Anyone want to talk about music? Maybe I can help you discover new bands to like.", "1_Text": "Send me some tunes. I listen to the same kinda music you do", "2_Subreddit": "CasualConversation"}], "dwnu3k2": [{"0_Comment Submission": "[CC][WIP]Trying to learn pixel art, first small tile set", "1_Text": "This is adorable and i love it", "2_Subreddit": "PixelArt"}], "dwo6jyk": [{"0_Comment Submission": "Dear 420 redditors, I recently stopped smoking and noticed that i cant sleep for shit. I have ganja insomnia. How do I overcome this faster. I need my sleep", "1_Text": "Drink chamomile tea before you go to bed", "2_Subreddit": "trees"}], "dwt73p3": [{"0_Comment Submission": "always gotta eat your greens", "1_Text": "Wish i had me some hulks right abt now", "2_Subreddit": "benzodiazepines"}]}], "1_submissions": [{"87fxnc": [{"0_Title": "Boring title", "1_Text": "Goodluck you can do this!", "2_Subreddit": "LSD"}], "88tht7": [{"0_Title": "Thoughts on patreon as an illustrator/fine artist?", "1_Text": "Goodluck you can do this!", "2_Subreddit": "CasualConversation"}]}]}]}