{"heylookatthatgirl": [{"0_comments": [{"dl0040o": [{"0_Comment Submission": "Got cut off today, wasn't even mad.", "1_Text": "why you heff to be mad", "2_Subreddit": "funny"}], "douwc7c": [{"0_Comment Submission": "[Serious] Reddit, have you ever come across a post by someone else that was about you? What was it?", "1_Text": "It looks like some sort of stomach flattening gone wrong? I'm no doctor just a Botched enthusiast", "2_Subreddit": "AskReddit"}], "dq1k4xa": [{"0_Comment Submission": "Anyone up?", "1_Text": "Always up late as shit, what's good?", "2_Subreddit": "cocaine"}], "dq8aubt": [{"0_Comment Submission": "Seeking advice on IOPs", "1_Text": "I agree wholeheartedly with the first statement. Definitely do residential treatment to get sober and learn how to be sober for more than 30 days.\n\nHowever, I disagree with the NA/AA part of this. I found that IOP was incredibly helpful for my recovery. It's a lot more personal than meetings. I felt like I got a lot more out of it than any meeting I ever went to. As long as you put the effort in and are going to a relatively good program, it's a wonderful transition from residential. I always recommend moving from residential to IOP to meetings. YMMV but I have found this essential for my recovery. And also, many IOPs do accept insurance so it won't be ungodly expensive.", "2_Subreddit": "OpiatesRecovery"}], "dqeakdk": [{"0_Comment Submission": "Some love for the smokers who smoke outside. Its goddam cold", "1_Text": "We're still just barely dipping into the 50°-60°s at night. Still 80° or above during the day. Gotta love AZ!", "2_Subreddit": "trees"}], "dqecwz7": [{"0_Comment Submission": "Sorry White Boys Only A Black Man Can Handle This", "1_Text": "Aren't these comments the same from a different post?\n[This](https://pics.me.me/sorry-black-boys-only-white-men-can-handle-this-jamz-1248704.png) one IIRC", "2_Subreddit": "ImGoingToHellForThis"}], "drdcrcv": [{"0_Comment Submission": "Rehabs/detox in SoCal?", "1_Text": "Luminance recovery is a really good one, I went out of state for them. One of the few rehabs that lets you earn your phone. Their program is really solid and their staff is absolutely amazing.", "2_Subreddit": "OpiatesRecovery"}], "drg8zg0": [{"0_Comment Submission": "Can Tab Clothing", "1_Text": "Phoenix resident, yes, he's here! I'm glad I scrolled far enough to see if anyone else recognized him. I see him on the bus from time to time and I've got a picture snapped of him.", "2_Subreddit": "WTF"}], "drg9219": [{"0_Comment Submission": "Can Tab Clothing", "1_Text": "Having seen him and seen him smoke, he's doing spice lol.", "2_Subreddit": "WTF"}], "drgaoad": [{"0_Comment Submission": "Can Tab Clothing", "1_Text": "Yessir", "2_Subreddit": "WTF"}], "ds215zs": [{"0_Comment Submission": "Changing nose jewelry", "1_Text": "When in doubt, go to a piercer. They can always change it free of charge and painlessly. \n\nFor now, I'd leave your stud in for a little bit to let the piercing calm down. I wouldn't soak it- just run it under some warm water in the shower. You don't want to dry it out and irritate it further.\n\nIf you're determined to change it out, latex gloves can help you get a better grip on it. Other than that I wouldn't use any tools- you might end up damaging the jewelry. I personally don't trust myself to do anything with my piercings because I'm clumsy.", "2_Subreddit": "piercing"}], "ds21h12": [{"0_Comment Submission": "Want to remove my poorly healing daith", "1_Text": "This x100. My helix piercings didn't stop crusting and leaking for two years.  They are finally healed and no longer give me trouble. I'm far too stubborn to take them out because I love them so much, I just assumed I'd always have to deal with them being gross. I'm glad I stuck it out because now they're the easiest piercings I have.", "2_Subreddit": "piercing"}], "dufdi15": [{"0_Comment Submission": "I need to do an outpatient detox. Where do I look?", "1_Text": "That's a good place to start, I'll definitely call in the morning. \n\nI don't, how do I get in contact with one?", "2_Subreddit": "OpiatesRecovery"}], "dw3p7my": [{"0_Comment Submission": "Help, sleep training older, breastfed twins", "1_Text": "Are you bringing them to your room when they won't sleep or cry for too long?", "2_Subreddit": "parentsofmultiples"}], "dw3u920": [{"0_Comment Submission": "Aussie lady battles her way through tumbleweeds to enter her home", "1_Text": "you'll forget cuz you're dead", "2_Subreddit": "WTF"}], "dw7boqs": [{"0_Comment Submission": "My MIL has already overstepped bounds since I became pregnant and is now insistent that my baby stay the night at her house regularly. I need advice, y’all", "1_Text": "My heart hurts so badly over her stealing your ultrasound picture. That is precious and it's YOURS. I would go back with copies of the others and tell her that you made her copies so you can have your original back. That's some fucking bullshit that she thinks she's entitled to that.", "2_Subreddit": "JUSTNOMIL"}], "dwiwp6f": [{"0_Comment Submission": "Dying to tell the world...", "1_Text": "Thank you, there are so many acronyms in this sub lmao", "2_Subreddit": "BabyBumps"}], "dwix7sy": [{"0_Comment Submission": "Mental hospital does a full body cavity strip search on a sexual assault survivor, then tells her during \"counseling\" that her dad is in hell for committing suicide. No clever title here, this is just awful.", "1_Text": "Yea, I've been inpatient a total of 6 times, all at the same hospital. My experiences were all positive, minus the boredom. If I ever went in again I'd probably head to a different hospital though. I've gotten too familiar with mine lol.", "2_Subreddit": "bestoflegaladvice"}], "dwmdyqj": [{"0_Comment Submission": "Paediatricians, what’s the strangest behaviour you’ve seen in a kid?", "1_Text": "She stuck her finger down your throat?? That's not how you do that. That's terrifying. I'd be afraid of solids too.", "2_Subreddit": "AskReddit"}], "dwme9sb": [{"0_Comment Submission": "Guy murdered a 4 year old kid, getting manhandled by police as judge speaks to him", "1_Text": "A punch in the face to put your ego in check.", "2_Subreddit": "PublicFreakout"}], "dwpgbsb": [{"0_Comment Submission": "So apparently all emergency departments don't treat addicts like garbage.", "1_Text": "That gave me such a justice boner. I hate people being rude to those in the service industries, especially doctors/nurses.", "2_Subreddit": "opiates"}], "dww9oc5": [{"0_Comment Submission": "The cruel, evil, and manipulative things her faaamily did the week my sons were born and when I lost my soulmate.", "1_Text": "I cried through this whole post. I can't even imagine the pain you're in. To withhold information about your fiancee and to steal your children from you is absolutely unforgivable. I know it's wrong but I wish nothing but horrible things upon those people. I'm hoping you choose to go NC with them. They are toxic, selfish, evil people with no regards to how the FATHER of the children feel. I wish you the best of luck with this.", "2_Subreddit": "JUSTNOMIL"}], "dwwl2ch": [{"0_Comment Submission": "So much entitlement", "1_Text": "I guess looking at it now, yea, it is. I was coming at it from the angle of someone who actually wants to see the baby. They would have to go out of their way to drive to her house using their gas and up to her convenience. It's selfish to whatever friend wants to see the baby (which she complains of having no friends after having a baby a LOT). I don't mind it because I don't ever want to see her crotch goblin.", "2_Subreddit": "childfree"}], "dwykbge": [{"0_Comment Submission": "A dramatic update from an LAOP who actually listened to advice", "1_Text": "It's been 5 hours.. what happened OP??", "2_Subreddit": "bestoflegaladvice"}], "dwykih8": [{"0_Comment Submission": "I tried to follow a Bob Ross video on a smaller canvas.", "1_Text": "^^^^^I've ^^^^got ^^^you! ^^back ^to normal!", "2_Subreddit": "pics"}]}], "1_submissions": [{"42fazn": [{"0_Title": "Constantly swollen tragus?", "1_Text": "why you heff to be mad", "2_Subreddit": "piercing"}], "42lvag": [{"0_Title": "Woke up to my piercing like this. What should I do?", "1_Text": "why you heff to be mad", "2_Subreddit": "piercing"}], "43xna8": [{"0_Title": "Starter kit?", "1_Text": "why you heff to be mad", "2_Subreddit": "Stretched"}], "4epvcq": [{"0_Title": "What happens if you tell your psychiatrist you're suicidal?", "1_Text": "why you heff to be mad", "2_Subreddit": "SuicideWatch"}], "4fln11": [{"0_Title": "Arizona wrongful termination?", "1_Text": "why you heff to be mad", "2_Subreddit": "legaladvice"}], "4hbg6k": [{"0_Title": "1.5 year old rabbit with younger bunny?", "1_Text": "why you heff to be mad", "2_Subreddit": "Rabbits"}], "4ibfr9": [{"0_Title": "Leaving plugs out for a couple hours?", "1_Text": "why you heff to be mad", "2_Subreddit": "Stretched"}], "4kygqm": [{"0_Title": "How do you arrange a hospital stay?", "1_Text": "why you heff to be mad", "2_Subreddit": "SuicideWatch"}], "4l460o": [{"0_Title": "I need a better solution to the cage I currently have.", "1_Text": "why you heff to be mad", "2_Subreddit": "Rabbits"}], "4lexu4": [{"0_Title": "Not sure how I feel about my new nose piercing", "1_Text": "why you heff to be mad", "2_Subreddit": "piercing"}], "4majvr": [{"0_Title": "Sitting in the waiting room of the psychiatric hospital", "1_Text": "why you heff to be mad", "2_Subreddit": "SuicideWatch"}], "4njwq8": [{"0_Title": "[Help] How do I prepare for a dog if I don't know what kind of dog I'm getting yet?", "1_Text": "why you heff to be mad", "2_Subreddit": "dogs"}], "4o5jug": [{"0_Title": "[Help] My dog did not do good meeting a new dog today.", "1_Text": "why you heff to be mad", "2_Subreddit": "dogs"}], "4o8uey": [{"0_Title": "How do I keep my dog off my bed?", "1_Text": "why you heff to be mad", "2_Subreddit": "Dogtraining"}], "4pw7so": [{"0_Title": "I seem to be doing everything right, yet my piercings are always acting up.", "1_Text": "why you heff to be mad", "2_Subreddit": "Legitpiercing"}], "4rznmv": [{"0_Title": "Is it worth it to fly out to an artist for a large piece?", "1_Text": "why you heff to be mad", "2_Subreddit": "tattoos"}], "4tkcbv": [{"0_Title": "Things were better when I felt worse.", "1_Text": "why you heff to be mad", "2_Subreddit": "depression"}], "52afjj": [{"0_Title": "Tell me if I'm doing the right thing.", "1_Text": "why you heff to be mad", "2_Subreddit": "Rabbits"}], "52v4ci": [{"0_Title": "How many medications until I feel better.", "1_Text": "why you heff to be mad", "2_Subreddit": "depression"}], "53x6n0": [{"0_Title": "How do I find a residential treatment center to give up my life at for 30 days?", "1_Text": "why you heff to be mad", "2_Subreddit": "depression"}], "56f3by": [{"0_Title": "Pineapple by Tyler Nealeigh at Black Lotus Tattoo in Gilbert, Arizona", "1_Text": "why you heff to be mad", "2_Subreddit": "tattoos"}], "5inkhg": [{"0_Title": "I really don't see the point anymore", "1_Text": "why you heff to be mad", "2_Subreddit": "SuicideWatch"}], "5nbdbu": [{"0_Title": "First time today", "1_Text": "why you heff to be mad", "2_Subreddit": "opiates"}], "7y64c2": [{"0_Title": "I need to do an outpatient detox. Where do I look?", "1_Text": "why you heff to be mad", "2_Subreddit": "OpiatesRecovery"}], "8a5eix": [{"0_Title": "So much entitlement", "1_Text": "why you heff to be mad", "2_Subreddit": "childfree"}]}]}]}