{"Dandannoodle24": [{"0_comments": [{"dwjt0ul": [{"0_Comment Submission": "If you had a year to go all around the world, when would you go where?", "1_Text": "Japan in the fall is quite charming.", "2_Subreddit": "solotravel"}], "dwjtfvw": [{"0_Comment Submission": "What's the best mentality to have in life?", "1_Text": "Tomorrow is not promised.", "2_Subreddit": "AskReddit"}], "dwjv6a0": [{"0_Comment Submission": "Fuck my life", "1_Text": "Thank you for reminding me why I’m sober today.", "2_Subreddit": "opiates"}], "dwkd32r": [{"0_Comment Submission": "PRAISE JJ! Can’t even believe it HA!", "1_Text": "Every active users dream. Every recovering users nightmare.", "2_Subreddit": "opiates"}], "dwkq6ex": [{"0_Comment Submission": "PRAISE JJ! Can’t even believe it HA!", "1_Text": "6 months here. I miss dipping out sometimes but I don’t miss the misery. I’m genuinely happy today. God willing, I would close my eyes and drop that pill in the toilet where it’s safer.", "2_Subreddit": "opiates"}], "dwkq9tx": [{"0_Comment Submission": "PRAISE JJ! Can’t even believe it HA!", "1_Text": "Me checking my pockets over and over and over as if a pill was going to MAGICALLY appear. SMH", "2_Subreddit": "opiates"}], "dwkxg6k": [{"0_Comment Submission": "Flipping off", "1_Text": "I’m guessing this is Sonkran? Thailand’s water festival. Usually takes place around now...Anyone?", "2_Subreddit": "instant_regret"}], "dwky5h8": [{"0_Comment Submission": "Rain is super soothing", "1_Text": "This is beautiful. Where is this?", "2_Subreddit": "CozyPlaces"}], "dwm9il6": [{"0_Comment Submission": "I got drunk a few days ago and realized that I bought a flight to Malaysia. What should I do?", "1_Text": "I did that exact thing once. Only my place of origin was in NYC. A little bit more of a trip.  I’d say go since you’re already on that side of the world. For me, it wasn’t nearly as beautiful as Thailand but it had its quirks which made it memorable. \nAlso, if you’re looking to party, remember that drinking is seldom done there.", "2_Subreddit": "solotravel"}], "dwm9kwi": [{"0_Comment Submission": "Warby Parker's April Fools is pretty tasty this year", "1_Text": "Brilliant marketing. I want a new pair of glasses now. And onion rings.", "2_Subreddit": "malefashionadvice"}], "dwmpq3y": [{"0_Comment Submission": "[Misc] Remember to let your OST C20 serum sit for a day before opening the cap! I lost half a bottle because of the fizz :(", "1_Text": "I’m new here and never heard of this product. Your post has me interested now! Do you find that it works?", "2_Subreddit": "SkincareAddiction"}], "dwmpuys": [{"0_Comment Submission": "I'm [26/M] my Girlfriend [20/F] of a nearly 4 year relationship makes everything a personal attack even when its nothing to do with her. Forces me to apologize or she starts threating to kill her self.", "1_Text": "In all seriousness, do you think she may have a substance abuse problem?", "2_Subreddit": "relationship_advice"}], "dwn3uol": [{"0_Comment Submission": "[Misc] Remember to let your OST C20 serum sit for a day before opening the cap! I lost half a bottle because of the fizz :(", "1_Text": "Unless it explodes :( thanks for teaching me a few things today! I’m excited to try this!", "2_Subreddit": "SkincareAddiction"}], "dwovuy7": [{"0_Comment Submission": "Giant Squid makes an appearance in Tokyo Bay", "1_Text": "Does anyone have a size comparison to offer up? For example: the blue whale is the length of a football field. Someone blow my mind!", "2_Subreddit": "TheDepthsBelow"}], "dwqscp9": [{"0_Comment Submission": "It's tradition in my office to arrive at work to find your desk decorated on your birthday. Coworkers outdid themselves for me this year!!", "1_Text": "This is adorable! Where’d they get the ‘I ❤️T.S’ sticker?!", "2_Subreddit": "TaylorSwift"}], "dwt3me3": [{"0_Comment Submission": "What’s your most favorite song off of Reputation and why?", "1_Text": "I want to wear is initial on a chain round my neck, chain round my neck 😍", "2_Subreddit": "TaylorSwift"}], "dwt3oxn": [{"0_Comment Submission": "What’s your most favorite song off of Reputation and why?", "1_Text": "Thank you so much!! Haha yes!! Clean is by far the most important song to me of Tay’s. Your reference to it literally made me smile huge!", "2_Subreddit": "TaylorSwift"}], "dwt9myu": [{"0_Comment Submission": "What’s your most favorite song off of Reputation and why?", "1_Text": "I love the breathy....”some-times-I-won-der-when-you-sleeeeep. Are-you-ev-er-dream-omg-of-meeee” 😻 It’s my favorite part to sing along to!", "2_Subreddit": "TaylorSwift"}], "dwte0ft": [{"0_Comment Submission": "Viking seafarers may have navigated with legendary crystals, called sunstones.", "1_Text": "I’m wondering if the Vikings believed that the crystals were magic or if they were scientific tools.... any thoughts?", "2_Subreddit": "science"}], "dwtiyr9": [{"0_Comment Submission": "And they say they are hard to get .. 🧐", "1_Text": "My heart just skipped several beats. Being that I’m clean I may have to leave this subreddit. But wowwwww. Be safe.", "2_Subreddit": "opiates"}], "dwtjoao": [{"0_Comment Submission": "And they say they are hard to get .. 🧐", "1_Text": "Thanks man. 6 months. Life is good. Took a few tumbles but needed every one of them.", "2_Subreddit": "opiates"}], "dwtk3rd": [{"0_Comment Submission": "Incredible staircase in the gymnasium of an abandoned university mens residence (OC) 861 × 1200", "1_Text": "This is beautiful. I’ve been imagining what it’d be like to rip that out and put it in my imaginary house. Thanks for the inspo!", "2_Subreddit": "urbanexploration"}], "dwtq4wj": [{"0_Comment Submission": "And they say they are hard to get .. 🧐", "1_Text": "Omg. It IS pill porn! And to answer that, yes. 100%, Yes.  It sometimes helps remind me why I’m sober. Like I can look at that picture and literally see my life spiraling down an unfathomable shithole within 24 hours if I had my hands on that stash. Plus. You guys are my people whether I’m on the wagon or not on the wagon.", "2_Subreddit": "opiates"}], "dwtydjg": [{"0_Comment Submission": "-90-", "1_Text": "That’s an amazing! Congratulations! I’ve finally find relief and freedom by working the Steps with a sponsor too. They do for me what drugs USED to do for me which was set me free and make me feel comfortable. The best part is that the results I get from the steps aren’t an illusion like the results from the drugs were.", "2_Subreddit": "REDDITORSINRECOVERY"}], "dwv8ms8": [{"0_Comment Submission": "Been craving IV cocaine something fierce.", "1_Text": "I’ve discovered that I can crave all I want as long as I don’t act on it. Good that you’re talking about the cravings. Kind of helps right size them. For me at least. Up votes for everyone!", "2_Subreddit": "opiates"}]}], "1_submissions": [{"5eip6b": [{"0_Title": "I'm looking to volunteer on thanksgiving...", "1_Text": "Japan in the fall is quite charming.", "2_Subreddit": "philadelphia"}], "5gmjim": [{"0_Title": "9months clean and CANT stop thinking", "1_Text": "Japan in the fall is quite charming.", "2_Subreddit": "REDDITORSINRECOVERY"}], "7jvhe2": [{"0_Title": "Circa Centre appears to be balancing on a base angle", "1_Text": "Japan in the fall is quite charming.", "2_Subreddit": "philadelphia"}], "7l21t7": [{"0_Title": "Was excited to try a charcoal peel-off but never again!", "1_Text": "Japan in the fall is quite charming.", "2_Subreddit": "SkincareAddiction"}], "7njuiw": [{"0_Title": "What’s your rehab roommate from hell story?", "1_Text": "Japan in the fall is quite charming.", "2_Subreddit": "REDDITORSINRECOVERY"}], "89qldb": [{"0_Title": "What’s your most favorite song off of Reputation and why?", "1_Text": "Japan in the fall is quite charming.", "2_Subreddit": "TaylorSwift"}]}]}]}