{"camsnow": [{"0_comments": [{"dvjksu2": [{"0_Comment Submission": "White House spokesman does not deny that Carl Icahn was tipped off", "1_Text": "apparently anything criminal done by trump or his associates isn't criminal or it's just \"fake\" news. like seriously, we have started stumbling towards the end of democracy. a president who is only in this job to enrich himself and associates all while allowing threats to our national security to continue unimpeded. Russia has only received praise from him after it's been proven they acted to harm our elections and have threatened to basically nuke us into oblivion. all while North Korea receives not only threats, but sanctions for the same threats but no real means to act on them(they messed up by not lining trumps pockets and taping him taking a golden shower I guess). I just wish this would be the time congress or the agencies designed to take out this kinda law breaking corruption and treason, would act. logic appears to be dead in washington(and amongst republicans).", "2_Subreddit": "politics"}], "dvr4n34": [{"0_Comment Submission": "Viability of Ziplock Bag Tek", "1_Text": "oven bags for baking. they work. you will need an impulse sealer though to actually close it. although some have done other methods to make it work without.", "2_Subreddit": "shroomers"}], "dvr59hc": [{"0_Comment Submission": "Mueller Subpoenas Trump Organization, Demanding Documents About Russia", "1_Text": "remember, anything he thinks, he KNOWS! that's why his warped view of the world only seems to get more and more warped. he's slowly losing his mind, and only trusts and relies on himself to piece together facts and opinions on matters of national importance(although he does hear things on fox, and then somehow thinks it's pure fact written in stone. so maybe he does listen to a few others, but not like he listens to inner donald). mueller may be the one person who can save our nation at this point from further damage and possible massive conflict.", "2_Subreddit": "politics"}], "dvrciun": [{"0_Comment Submission": "Mueller Subpoenas Trump Organization, Demanding Documents About Russia", "1_Text": "hahaha", "2_Subreddit": "politics"}], "dvunb9p": [{"0_Comment Submission": "You see some crazy shit working on the Mississippi River", "1_Text": "apparently not, looks like this is a photoshopped photo taken from another site to begin with. apparently OP has no clue about the photo other than where they took it from.", "2_Subreddit": "pics"}], "dvvarf3": [{"0_Comment Submission": "So I just noticed this is my backyard.....", "1_Text": "Perfect timing for it to have an amazing grow season! Like should end up nice and huge if kept in good condition.", "2_Subreddit": "microgrowery"}], "dvwluwc": [{"0_Comment Submission": "So I just noticed this is my backyard.....", "1_Text": "exactly! like it seriously popped and started as early as you could want for optimum growth and yield!", "2_Subreddit": "microgrowery"}], "dw2sjc0": [{"0_Comment Submission": "Attorney General tells prosecutors to seek death penalty in drug cases", "1_Text": "Nope, better to execute people in impoverished areas without a ton of job availability. Obviously they were such evil people they sought out drug dealing and forced all those drugs on people. The Drs and big pharma companies who created all the addicts were only helping. So they need more tax breaks and bonuses to their top execs. \n\nMan, fuck this piece of shit administration thinking that that attitude will do a single fucking thing! All it'll do is cause more drug dealers to be willing to kill cops knowing they will die if they are convicted. Like this will not end well at all. But what do you expect when some of the biggest morons in history are in charge? We need logical drug policies, like policies proven to work in multiple other countries that we seem to ignore. Instead we look at a country that has taken a step backwards and say \"That's what we gotta do!\"\nAgain, FUCK THIS ADMINISTRATION!", "2_Subreddit": "news"}], "dw2vk0f": [{"0_Comment Submission": "Band groupies that had sex with their idols, how did it affect the way you saw them afterwards?", "1_Text": "Apparently not for Chris :( hahaha", "2_Subreddit": "AskReddit"}], "dwalagv": [{"0_Comment Submission": "TIL that Mark Zuckerberg bought 700 acres of beachfront land in Hawaii. He built a wall around the property and then tried to force hundreds of Native Hawaiians to forfeit their gathering rights to the land by suing them", "1_Text": "To be fair, he wouldn't be memorable at all except all the shitty things he keeps getting caught up in.", "2_Subreddit": "todayilearned"}], "dwcl9gl": [{"0_Comment Submission": "Some crazy stuff at the Pita Pit.", "1_Text": "Along with some major health department issues facing that place after they are reported or whatever. Like that sucks for who ever owns it as she just cost them quite a bit of business over a shitty(possibly, dunno the whole situation, but both seemed a little hot headed to say the least) customer.", "2_Subreddit": "WTF"}], "dwehdb9": [{"0_Comment Submission": "Conservatives are now comparing a Parkland survivor to Hitler", "1_Text": "exactly. think they are comparing the wrong people to Hitler. seeing as trump seems more close to Hitler than any american president in our history. and before we bring up others allowed slavery and such, remember this guy would probably bring it back in a heartbeat even though it is now totally socially unacceptable pretty much everywhere. I mean, he certainly has no problems hiding his racism, xenophobia, homophobia, insane delusions, and major anger issues with lack of impulse control. pretty much sounds like Hitler.", "2_Subreddit": "politics"}], "dwgaxbg": [{"0_Comment Submission": "Congress is quietly letting Trump bulldoze a butterfly refuge to build a border wall", "1_Text": "Thank you! Our ecosystem has evolved a certain way. This process is MAJOR when it comes to producing certain foods and the reproduction of a large number of plant varieties. We have NO alternatives to this if we screw it up. We need to start using these lumps of fat in our head as the brains they evolved to become. Even though nowadays it seems a lot of people can't even begin to start thinking right.", "2_Subreddit": "politics"}], "dwho1n9": [{"0_Comment Submission": "So many Koi Fry!", "1_Text": "man, wish I had a system set up. or hell, even if I had the room I would gladly get one going and take some little koi off your hands! hopefully as they put on some size, they all end up kinda getting down into one area(a sump pond or tank) that would be more preferable for fish to be in haha", "2_Subreddit": "aquaponics"}], "dwmouyg": [{"0_Comment Submission": "Someone brought me a dead gsc sprout they had. Revival of the fittest", "1_Text": "good job! now, just let it veg as much as it needs and it should end up nice and healthy! I have done the same thing with dying/verge of dying plants and it is quite exhilarating to see them come back and knowing the plant can have even more of a future if you clone after healthy! not to mention it's a survivor and an underdog, you gotta root for that! haha", "2_Subreddit": "microgrowery"}], "dwnb27b": [{"0_Comment Submission": "Petition to Break Up Sinclair Broadcasting Group Monopoly", "1_Text": "If you are having trouble signing the petition through the mobile site the reddit app sends you to, Google white house petition sinclair broadcasting. This may be an issue only I had, but incase anyone else has it, make sure you still do something about this.", "2_Subreddit": "SandersForPresident"}], "dwoayeu": [{"0_Comment Submission": "Easter colors !!! 😂 60mg Oxy in the blue, 90mg Morphine in the pink.... Happy Easter Nods my friends 🤙🏻", "1_Text": "Oh ok good! Was gonna say looking pretty rough for something you wanna flush into the blood. But through the butt, it's all good if that's what you are going for!", "2_Subreddit": "opiates"}], "dwobl5h": [{"0_Comment Submission": "There was no wave of compassion when addicts were hooked on crack", "1_Text": "Plus the argument that if its prescribed you can't be an addict. Like it's been big pharma pushing opiates harder than your local D-Boy. Don't believe me, go into any pain place and wait an hour, bet you'll see one of the pharma reps letting themselves back into the office to drop off pamphlets promoting discounts for the drugs, as well as samples of certain drugs. Like your socioeconomic status plays majorly into perceived judgements about your addiction and lifestyle, but big pharma has kept opiates from truly becoming known for what they are. They are life savers for those in crippling pain, but to others they are a life sentence or a death sentence. And honestly cannabis has a lot of similar pain killing effects, only because it's not making big pharma top dollar, no reason to mention it has helped millions with pain conditions or addictions now get off opiates or at least taper down doses.", "2_Subreddit": "politics"}], "dwomcx3": [{"0_Comment Submission": "There was no wave of compassion when addicts were hooked on crack", "1_Text": "well, those are super low dose for controlling pain, as is to control pain with cannabis usually more than 10mg is needed for anyone able to be comfortable with thc's effects. and marinol only goes to 10mg max to be taken only a few times a day. that's nowhere near capable of dulling pain like major opiates(think of how they write morphine, 10mg usually starting every 4 hours via IV push. talk about potent). more like a tylonel 3 at best. it was their attempt to just profit off the drug, not make it effective and actually hurt the money making drugs like physically hooking opiates.", "2_Subreddit": "politics"}], "dwomntw": [{"0_Comment Submission": "Kremlin Says Donald Trump Has Invited Vladimir Putin to the White House", "1_Text": "more like, \"get out of daddy's chair, donald, I have more work to do!\" hahaha", "2_Subreddit": "politics"}], "dwonqiz": [{"0_Comment Submission": "IamA Legal Working Girl (Prostitute), Courtesan of the Year, and admin of the BrothelLife forum. AMA!", "1_Text": "honestly man, the first time will probably be so not what you build up and expect, it's easy enough to just wait till you've dated someone long enough that it happens. like losing your virginity doesn't change your dating game at all, so not like as soon as it's done life will all fall in place as far as sex. so just find someone you can enjoy the act with where judgements are reserved and save yourself hundreds and a possible STD if the place/escort isn't following strict health practices. plus after sex with an escort, it's paid for and over. with a partner at least you can keep practicing for future endeavors for free.", "2_Subreddit": "IAmA"}], "dwq0sov": [{"0_Comment Submission": "Will my continuous flow system work? I plan to pump water up to the right-hand side of the media bed. However, I'm worried that the water will be too stagnant at the bottom of the bed since my drainage pipe only catches overflow at the surface. Any thoughts/advice are appreciated!", "1_Text": "so, they are fairly straight forward to make. pvc leftovers could work if you have certain pieces. just check on it every so often to ensure it's siphoning as it should. but even worse case it would be what you already have if it stopped functioning correctly. look into making one with an air break and you should have quite an effective design to keep water and roots oxygenated.", "2_Subreddit": "aquaponics"}], "dwt6nv3": [{"0_Comment Submission": "Panaeolus cyanescens - liquid culture to fruits grow tek", "1_Text": "It's a good tek for sure! Was posted several years ago on shroomery and has been a kinda straight forward pan cyan guide. This guy is pretty legit with his teks and experience and I would say if you followed this as closely as possible you should have decent luck at culitvating these guys.", "2_Subreddit": "shroomers"}], "dwwlb9c": [{"0_Comment Submission": "I Went to a dispensary for the first time today and bought this!", "1_Text": "well, they recommend dosing in 10mg amounts for novice users. I have personally seen it be too much for some at that level, and barely noticeable to others at that level. it all depends on the person, the type of edible/dose, and a even possible terpene concentrations in certain ones. but to start, 5-10mg isn't going to ruin anyones day most likely, and hopefully will do the opposite. but this drink would likely throw anyone who hasn't smoked in years all the way to a 8-10 I am sure.", "2_Subreddit": "trees"}], "dwwnn83": [{"0_Comment Submission": "Russia warns UK it is 'playing with fire and will be sorry' over Salisbury spy poisoning.", "1_Text": "and the rampant corruption keeps all the resources flowing into the oligarchs accounts versus any sort of actual state funding that could keep it surviving. just funding for cold war spy tactics and political influence to make it easier to rob the wealth of their own fellow russians. not like the US is that much better, but at least we do see active attempts to keep those things in check enough to keep our nation afloat. or at least we have when certain powers weren't a majority. but when it gets so bad that the president of a country is also the biggest oligarch, that's not going to end well at all. hence why we should be so worried here with a wannabe oligarch in charge.", "2_Subreddit": "worldnews"}]}], "1_submissions": [{"50dtqj": [{"0_Title": "pint jar full of abv", "1_Text": "apparently anything criminal done by trump or his associates isn't criminal or it's just \"fake\" news. like seriously, we have started stumbling towards the end of democracy. a president who is only in this job to enrich himself and associates all while allowing threats to our national security to continue unimpeded. Russia has only received praise from him after it's been proven they acted to harm our elections and have threatened to basically nuke us into oblivion. all while North Korea receives not only threats, but sanctions for the same threats but no real means to act on them(they messed up by not lining trumps pockets and taping him taking a golden shower I guess). I just wish this would be the time congress or the agencies designed to take out this kinda law breaking corruption and treason, would act. logic appears to be dead in washington(and amongst republicans).", "2_Subreddit": "abv"}], "54sbpa": [{"0_Title": "my little Amish Paste Tomato Plants at 3 weeks", "1_Text": "apparently anything criminal done by trump or his associates isn't criminal or it's just \"fake\" news. like seriously, we have started stumbling towards the end of democracy. a president who is only in this job to enrich himself and associates all while allowing threats to our national security to continue unimpeded. Russia has only received praise from him after it's been proven they acted to harm our elections and have threatened to basically nuke us into oblivion. all while North Korea receives not only threats, but sanctions for the same threats but no real means to act on them(they messed up by not lining trumps pockets and taping him taking a golden shower I guess). I just wish this would be the time congress or the agencies designed to take out this kinda law breaking corruption and treason, would act. logic appears to be dead in washington(and amongst republicans).", "2_Subreddit": "gardening"}], "55zemf": [{"0_Title": "Someone shared a world record high dive of 172ft, thought I'd post a higher record(177ft). Not to one up them, just for interest.", "1_Text": "apparently anything criminal done by trump or his associates isn't criminal or it's just \"fake\" news. like seriously, we have started stumbling towards the end of democracy. a president who is only in this job to enrich himself and associates all while allowing threats to our national security to continue unimpeded. Russia has only received praise from him after it's been proven they acted to harm our elections and have threatened to basically nuke us into oblivion. all while North Korea receives not only threats, but sanctions for the same threats but no real means to act on them(they messed up by not lining trumps pockets and taping him taking a golden shower I guess). I just wish this would be the time congress or the agencies designed to take out this kinda law breaking corruption and treason, would act. logic appears to be dead in washington(and amongst republicans).", "2_Subreddit": "SweatyPalms"}], "570oog": [{"0_Title": "rats not giving film...", "1_Text": "apparently anything criminal done by trump or his associates isn't criminal or it's just \"fake\" news. like seriously, we have started stumbling towards the end of democracy. a president who is only in this job to enrich himself and associates all while allowing threats to our national security to continue unimpeded. Russia has only received praise from him after it's been proven they acted to harm our elections and have threatened to basically nuke us into oblivion. all while North Korea receives not only threats, but sanctions for the same threats but no real means to act on them(they messed up by not lining trumps pockets and taping him taking a golden shower I guess). I just wish this would be the time congress or the agencies designed to take out this kinda law breaking corruption and treason, would act. logic appears to be dead in washington(and amongst republicans).", "2_Subreddit": "tappedout"}], "57w4ne": [{"0_Title": "For those with questions about deficiencies, pests, stresses, or diseases....", "1_Text": "apparently anything criminal done by trump or his associates isn't criminal or it's just \"fake\" news. like seriously, we have started stumbling towards the end of democracy. a president who is only in this job to enrich himself and associates all while allowing threats to our national security to continue unimpeded. Russia has only received praise from him after it's been proven they acted to harm our elections and have threatened to basically nuke us into oblivion. all while North Korea receives not only threats, but sanctions for the same threats but no real means to act on them(they messed up by not lining trumps pockets and taping him taking a golden shower I guess). I just wish this would be the time congress or the agencies designed to take out this kinda law breaking corruption and treason, would act. logic appears to be dead in washington(and amongst republicans).", "2_Subreddit": "microgrowery"}], "583k9v": [{"0_Title": "My Story...", "1_Text": "apparently anything criminal done by trump or his associates isn't criminal or it's just \"fake\" news. like seriously, we have started stumbling towards the end of democracy. a president who is only in this job to enrich himself and associates all while allowing threats to our national security to continue unimpeded. Russia has only received praise from him after it's been proven they acted to harm our elections and have threatened to basically nuke us into oblivion. all while North Korea receives not only threats, but sanctions for the same threats but no real means to act on them(they messed up by not lining trumps pockets and taping him taking a golden shower I guess). I just wish this would be the time congress or the agencies designed to take out this kinda law breaking corruption and treason, would act. logic appears to be dead in washington(and amongst republicans).", "2_Subreddit": "opiates"}], "5dya7y": [{"0_Title": "help from anyone with abv oil/butter making experience...", "1_Text": "apparently anything criminal done by trump or his associates isn't criminal or it's just \"fake\" news. like seriously, we have started stumbling towards the end of democracy. a president who is only in this job to enrich himself and associates all while allowing threats to our national security to continue unimpeded. Russia has only received praise from him after it's been proven they acted to harm our elections and have threatened to basically nuke us into oblivion. all while North Korea receives not only threats, but sanctions for the same threats but no real means to act on them(they messed up by not lining trumps pockets and taping him taking a golden shower I guess). I just wish this would be the time congress or the agencies designed to take out this kinda law breaking corruption and treason, would act. logic appears to be dead in washington(and amongst republicans).", "2_Subreddit": "abv"}], "5kc8z6": [{"0_Title": "been trying to get tails to run, after I burnt the disc and booted it, I get this...any help or advice? I'd appreciate it.", "1_Text": "apparently anything criminal done by trump or his associates isn't criminal or it's just \"fake\" news. like seriously, we have started stumbling towards the end of democracy. a president who is only in this job to enrich himself and associates all while allowing threats to our national security to continue unimpeded. Russia has only received praise from him after it's been proven they acted to harm our elections and have threatened to basically nuke us into oblivion. all while North Korea receives not only threats, but sanctions for the same threats but no real means to act on them(they messed up by not lining trumps pockets and taping him taking a golden shower I guess). I just wish this would be the time congress or the agencies designed to take out this kinda law breaking corruption and treason, would act. logic appears to be dead in washington(and amongst republicans).", "2_Subreddit": "tails"}], "5xt9gv": [{"0_Title": "MGSV TPP grade 9 sneaking suit(not a review, need advice/help)", "1_Text": "apparently anything criminal done by trump or his associates isn't criminal or it's just \"fake\" news. like seriously, we have started stumbling towards the end of democracy. a president who is only in this job to enrich himself and associates all while allowing threats to our national security to continue unimpeded. Russia has only received praise from him after it's been proven they acted to harm our elections and have threatened to basically nuke us into oblivion. all while North Korea receives not only threats, but sanctions for the same threats but no real means to act on them(they messed up by not lining trumps pockets and taping him taking a golden shower I guess). I just wish this would be the time congress or the agencies designed to take out this kinda law breaking corruption and treason, would act. logic appears to be dead in washington(and amongst republicans).", "2_Subreddit": "metalgearsolid"}], "61140i": [{"0_Title": "question about festival plaza...", "1_Text": "apparently anything criminal done by trump or his associates isn't criminal or it's just \"fake\" news. like seriously, we have started stumbling towards the end of democracy. a president who is only in this job to enrich himself and associates all while allowing threats to our national security to continue unimpeded. Russia has only received praise from him after it's been proven they acted to harm our elections and have threatened to basically nuke us into oblivion. all while North Korea receives not only threats, but sanctions for the same threats but no real means to act on them(they messed up by not lining trumps pockets and taping him taking a golden shower I guess). I just wish this would be the time congress or the agencies designed to take out this kinda law breaking corruption and treason, would act. logic appears to be dead in washington(and amongst republicans).", "2_Subreddit": "PokeMoonSun"}], "61r333": [{"0_Title": "Hello, odd question, but does anyone know of a Dr who does chest reconstruction...", "1_Text": "apparently anything criminal done by trump or his associates isn't criminal or it's just \"fake\" news. like seriously, we have started stumbling towards the end of democracy. a president who is only in this job to enrich himself and associates all while allowing threats to our national security to continue unimpeded. Russia has only received praise from him after it's been proven they acted to harm our elections and have threatened to basically nuke us into oblivion. all while North Korea receives not only threats, but sanctions for the same threats but no real means to act on them(they messed up by not lining trumps pockets and taping him taking a golden shower I guess). I just wish this would be the time congress or the agencies designed to take out this kinda law breaking corruption and treason, would act. logic appears to be dead in washington(and amongst republicans).", "2_Subreddit": "Austin"}], "63lmku": [{"0_Title": "LF: Vanillite(or any evoulution of it)", "1_Text": "apparently anything criminal done by trump or his associates isn't criminal or it's just \"fake\" news. like seriously, we have started stumbling towards the end of democracy. a president who is only in this job to enrich himself and associates all while allowing threats to our national security to continue unimpeded. Russia has only received praise from him after it's been proven they acted to harm our elections and have threatened to basically nuke us into oblivion. all while North Korea receives not only threats, but sanctions for the same threats but no real means to act on them(they messed up by not lining trumps pockets and taping him taking a golden shower I guess). I just wish this would be the time congress or the agencies designed to take out this kinda law breaking corruption and treason, would act. logic appears to be dead in washington(and amongst republicans).", "2_Subreddit": "PokeMoonSun"}], "64sifr": [{"0_Title": "pokemon with pickup sun and moon", "1_Text": "apparently anything criminal done by trump or his associates isn't criminal or it's just \"fake\" news. like seriously, we have started stumbling towards the end of democracy. a president who is only in this job to enrich himself and associates all while allowing threats to our national security to continue unimpeded. Russia has only received praise from him after it's been proven they acted to harm our elections and have threatened to basically nuke us into oblivion. all while North Korea receives not only threats, but sanctions for the same threats but no real means to act on them(they messed up by not lining trumps pockets and taping him taking a golden shower I guess). I just wish this would be the time congress or the agencies designed to take out this kinda law breaking corruption and treason, would act. logic appears to be dead in washington(and amongst republicans).", "2_Subreddit": "PokeMoonSun"}], "69hhde": [{"0_Title": "questions about transferring pokemon from pokebank to games...", "1_Text": "apparently anything criminal done by trump or his associates isn't criminal or it's just \"fake\" news. like seriously, we have started stumbling towards the end of democracy. a president who is only in this job to enrich himself and associates all while allowing threats to our national security to continue unimpeded. Russia has only received praise from him after it's been proven they acted to harm our elections and have threatened to basically nuke us into oblivion. all while North Korea receives not only threats, but sanctions for the same threats but no real means to act on them(they messed up by not lining trumps pockets and taping him taking a golden shower I guess). I just wish this would be the time congress or the agencies designed to take out this kinda law breaking corruption and treason, would act. logic appears to be dead in washington(and amongst republicans).", "2_Subreddit": "PokeMoonSun"}], "6c0ll5": [{"0_Title": "anyone else have an issue saving after shiny hunting?", "1_Text": "apparently anything criminal done by trump or his associates isn't criminal or it's just \"fake\" news. like seriously, we have started stumbling towards the end of democracy. a president who is only in this job to enrich himself and associates all while allowing threats to our national security to continue unimpeded. Russia has only received praise from him after it's been proven they acted to harm our elections and have threatened to basically nuke us into oblivion. all while North Korea receives not only threats, but sanctions for the same threats but no real means to act on them(they messed up by not lining trumps pockets and taping him taking a golden shower I guess). I just wish this would be the time congress or the agencies designed to take out this kinda law breaking corruption and treason, would act. logic appears to be dead in washington(and amongst republicans).", "2_Subreddit": "PokeMoonSun"}], "6dbnxw": [{"0_Title": "quick question about event megastones....", "1_Text": "apparently anything criminal done by trump or his associates isn't criminal or it's just \"fake\" news. like seriously, we have started stumbling towards the end of democracy. a president who is only in this job to enrich himself and associates all while allowing threats to our national security to continue unimpeded. Russia has only received praise from him after it's been proven they acted to harm our elections and have threatened to basically nuke us into oblivion. all while North Korea receives not only threats, but sanctions for the same threats but no real means to act on them(they messed up by not lining trumps pockets and taping him taking a golden shower I guess). I just wish this would be the time congress or the agencies designed to take out this kinda law breaking corruption and treason, would act. logic appears to be dead in washington(and amongst republicans).", "2_Subreddit": "PokeMoonSun"}], "6ed6gr": [{"0_Title": "For those looking for an easy way to get Scrappy Pancham or Pangoro, here is a way easier way than a smearlge....", "1_Text": "apparently anything criminal done by trump or his associates isn't criminal or it's just \"fake\" news. like seriously, we have started stumbling towards the end of democracy. a president who is only in this job to enrich himself and associates all while allowing threats to our national security to continue unimpeded. Russia has only received praise from him after it's been proven they acted to harm our elections and have threatened to basically nuke us into oblivion. all while North Korea receives not only threats, but sanctions for the same threats but no real means to act on them(they messed up by not lining trumps pockets and taping him taking a golden shower I guess). I just wish this would be the time congress or the agencies designed to take out this kinda law breaking corruption and treason, would act. logic appears to be dead in washington(and amongst republicans).", "2_Subreddit": "PokeMoonSun"}], "6edhck": [{"0_Title": "Question about making powdered inoculates....", "1_Text": "apparently anything criminal done by trump or his associates isn't criminal or it's just \"fake\" news. like seriously, we have started stumbling towards the end of democracy. a president who is only in this job to enrich himself and associates all while allowing threats to our national security to continue unimpeded. Russia has only received praise from him after it's been proven they acted to harm our elections and have threatened to basically nuke us into oblivion. all while North Korea receives not only threats, but sanctions for the same threats but no real means to act on them(they messed up by not lining trumps pockets and taping him taking a golden shower I guess). I just wish this would be the time congress or the agencies designed to take out this kinda law breaking corruption and treason, would act. logic appears to be dead in washington(and amongst republicans).", "2_Subreddit": "Soil"}], "6kcsmd": [{"0_Title": "2012 Jeep Wrangler Brake Lights not working", "1_Text": "apparently anything criminal done by trump or his associates isn't criminal or it's just \"fake\" news. like seriously, we have started stumbling towards the end of democracy. a president who is only in this job to enrich himself and associates all while allowing threats to our national security to continue unimpeded. Russia has only received praise from him after it's been proven they acted to harm our elections and have threatened to basically nuke us into oblivion. all while North Korea receives not only threats, but sanctions for the same threats but no real means to act on them(they messed up by not lining trumps pockets and taping him taking a golden shower I guess). I just wish this would be the time congress or the agencies designed to take out this kinda law breaking corruption and treason, would act. logic appears to be dead in washington(and amongst republicans).", "2_Subreddit": "Jeep"}], "6lxv2e": [{"0_Title": "What may be next?", "1_Text": "apparently anything criminal done by trump or his associates isn't criminal or it's just \"fake\" news. like seriously, we have started stumbling towards the end of democracy. a president who is only in this job to enrich himself and associates all while allowing threats to our national security to continue unimpeded. Russia has only received praise from him after it's been proven they acted to harm our elections and have threatened to basically nuke us into oblivion. all while North Korea receives not only threats, but sanctions for the same threats but no real means to act on them(they messed up by not lining trumps pockets and taping him taking a golden shower I guess). I just wish this would be the time congress or the agencies designed to take out this kinda law breaking corruption and treason, would act. logic appears to be dead in washington(and amongst republicans).", "2_Subreddit": "weightgain"}], "6ngbat": [{"0_Title": "question about sterile spore syringes...", "1_Text": "apparently anything criminal done by trump or his associates isn't criminal or it's just \"fake\" news. like seriously, we have started stumbling towards the end of democracy. a president who is only in this job to enrich himself and associates all while allowing threats to our national security to continue unimpeded. Russia has only received praise from him after it's been proven they acted to harm our elections and have threatened to basically nuke us into oblivion. all while North Korea receives not only threats, but sanctions for the same threats but no real means to act on them(they messed up by not lining trumps pockets and taping him taking a golden shower I guess). I just wish this would be the time congress or the agencies designed to take out this kinda law breaking corruption and treason, would act. logic appears to be dead in washington(and amongst republicans).", "2_Subreddit": "shroomers"}], "6pktue": [{"0_Title": "Toyota Corolla help", "1_Text": "apparently anything criminal done by trump or his associates isn't criminal or it's just \"fake\" news. like seriously, we have started stumbling towards the end of democracy. a president who is only in this job to enrich himself and associates all while allowing threats to our national security to continue unimpeded. Russia has only received praise from him after it's been proven they acted to harm our elections and have threatened to basically nuke us into oblivion. all while North Korea receives not only threats, but sanctions for the same threats but no real means to act on them(they messed up by not lining trumps pockets and taping him taking a golden shower I guess). I just wish this would be the time congress or the agencies designed to take out this kinda law breaking corruption and treason, would act. logic appears to be dead in washington(and amongst republicans).", "2_Subreddit": "Toyota"}], "6rmnjc": [{"0_Title": "2003 Toyota Corolla Horn not working....", "1_Text": "apparently anything criminal done by trump or his associates isn't criminal or it's just \"fake\" news. like seriously, we have started stumbling towards the end of democracy. a president who is only in this job to enrich himself and associates all while allowing threats to our national security to continue unimpeded. Russia has only received praise from him after it's been proven they acted to harm our elections and have threatened to basically nuke us into oblivion. all while North Korea receives not only threats, but sanctions for the same threats but no real means to act on them(they messed up by not lining trumps pockets and taping him taking a golden shower I guess). I just wish this would be the time congress or the agencies designed to take out this kinda law breaking corruption and treason, would act. logic appears to be dead in washington(and amongst republicans).", "2_Subreddit": "COROLLA"}], "77h9l6": [{"0_Title": "2003 Toyota Corolla starter replacement...", "1_Text": "apparently anything criminal done by trump or his associates isn't criminal or it's just \"fake\" news. like seriously, we have started stumbling towards the end of democracy. a president who is only in this job to enrich himself and associates all while allowing threats to our national security to continue unimpeded. Russia has only received praise from him after it's been proven they acted to harm our elections and have threatened to basically nuke us into oblivion. all while North Korea receives not only threats, but sanctions for the same threats but no real means to act on them(they messed up by not lining trumps pockets and taping him taking a golden shower I guess). I just wish this would be the time congress or the agencies designed to take out this kinda law breaking corruption and treason, would act. logic appears to be dead in washington(and amongst republicans).", "2_Subreddit": "COROLLA"}], "7tx7ed": [{"0_Title": "2003 Corolla running hot yet no heat from heater....", "1_Text": "apparently anything criminal done by trump or his associates isn't criminal or it's just \"fake\" news. like seriously, we have started stumbling towards the end of democracy. a president who is only in this job to enrich himself and associates all while allowing threats to our national security to continue unimpeded. Russia has only received praise from him after it's been proven they acted to harm our elections and have threatened to basically nuke us into oblivion. all while North Korea receives not only threats, but sanctions for the same threats but no real means to act on them(they messed up by not lining trumps pockets and taping him taking a golden shower I guess). I just wish this would be the time congress or the agencies designed to take out this kinda law breaking corruption and treason, would act. logic appears to be dead in washington(and amongst republicans).", "2_Subreddit": "COROLLA"}]}]}]}