{"kushcoma7": [{"0_comments": [{"dug613v": [{"0_Comment Submission": "CBD for myself and sick parent", "1_Text": "Hello there! Sorry to hear about your Mum, mine has similar issues related with spine and other bones/muscles. She is prescribed Fentanyl for pain and Hydromorphone for breakthrough pain. After years of oxycodone use, she needed to take a ludicrous amount of pills to counter effect all of the side effects of the painkillers. Here in the Great White North, we have legal Medicinal CBD which I was prescribed first for adhd/anxiety issues. I introduced my mum to cbd alongside her painkiller dose and she found she was able to eliminate the vast majority of her other medication that balanced out the negatives of the opioids. As we all know, each of the balancing medications have a host of side effects of their own and now she has been shed of many pill shaped burdens. I believe you can find success with CBD if used alongside her painkiller that she is using. It not only helps balance the negatives of opioids but also reduces the withdrawal symptoms especially nausea, restless leg, and insomnia. CBD can lesson certain types of pain especially nerve and joint pain, but for bone pain I don’t believe it can replace the gold standard of pain relief opioids offer. But I personally have seen the positive benefits of using both CBD and opioids together. Good luck to you and your mum!", "2_Subreddit": "CBD"}], "duni75e": [{"0_Comment Submission": "CBD, ADD + side effects", "1_Text": "Hey there, fellow Adult ADHD here. I too use cannabis for my symptoms and I have it prescribed. My doctor taught me about CBD and I have been a advocate since! I feel that my symptoms are lessened dramatically by using CBD and I get no high or red eyes from it at all. Actually it feels the opposite of a high and more like Sober+. Being able to think clearly and not be constantly sabotaged by my mind is worth the cost of CBD. I honestly have yet to find a negative symptom from using it. Hope you find some relief!", "2_Subreddit": "CBD"}], "duthrj3": [{"0_Comment Submission": "How do you all deal with the lingering existential crisis?", "1_Text": "Opiates", "2_Subreddit": "antinatalism"}], "dutju8p": [{"0_Comment Submission": "A post for those “chipping”", "1_Text": "Hey there I am an active “chipper” of H. Been using once a week for 4 months now. Been chipping pills for 4 years until they became unavailable and expensive or in my area fake and dangerous. A way that I personally have found I can deal with my cravings throughout the week is with CBD. Before being prescribed cannabis a year and a half ago I would find myself in the same trap as everyone else; buy as much as can afford, run until it’s all gone and then get sick. Once I started using CBD regularly I noticed a number of conditions including my cravings for opiates have become manageable. It’s still not easy as I still do crave but there is a huge difference in my abilities to chip while using CBD. I know many people are touting its abilities and many are skeptical but I have felt and seen the benefits it can provide. This includes withdrawals as well believe it or not. I really try to be disciplined when it comes to my use but for times I slip up and have a week run, the CBD shatters my insomnia, nausea, sweats and that muscle spasm skin crawling feeling.", "2_Subreddit": "opiates"}], "dutnod0": [{"0_Comment Submission": "A post for those “chipping”", "1_Text": "Yes I like to use 1:1 strains like CBD Kush and Cannatonic. THC is good for the content high feeling and keeping up an appetite.", "2_Subreddit": "opiates"}], "dutwymm": [{"0_Comment Submission": "A post for those “chipping”", "1_Text": "That’s awesome! I’m glad you are able to find some sort of balance with opiates and cannabis as well", "2_Subreddit": "opiates"}], "duukivd": [{"0_Comment Submission": "A post for those “chipping”", "1_Text": "Yeah you are welcome, hopefully it helps for you as well. I use a CBD oil tincture usually, that way it lasts throughout the day. Either 1:1 THC:CBD or CBD only drops work for me, about 2/3mls under the tongue or mixed into a drink.", "2_Subreddit": "opiates"}], "duxxh08": [{"0_Comment Submission": "Oh I forgot to tell you guys this happened...", "1_Text": "Hell yeah those bottles looked tasty dude nothin wrong with that. R.I.P Pimp C", "2_Subreddit": "opiates"}], "dv4tblz": [{"0_Comment Submission": "Lost", "1_Text": "This is true especially with unknown  dope/fent amounts in what ur buying. The stuff that’s out there will not be what you were used to 11 years ago. Will either be disappointing or fatal. Don’t take the risk man. Just learn from the script that no time away is long enough from them.", "2_Subreddit": "opiates"}], "dv6cvpl": [{"0_Comment Submission": "I'm a heroin addict and for the past month I've been working as a confidential informant with the police. How it works, what to look for, AMA, call me an asshole", "1_Text": "We already know what to avoid and it’s rat goof snakes like you.", "2_Subreddit": "opiates"}], "dv8ksch": [{"0_Comment Submission": "Found classic games, floppy disks and an old 128MB DDR 266MHz ram", "1_Text": "Generals Zero Hour is the best! Too bad EA isn’t making Generals a trilogy 😫", "2_Subreddit": "90s"}], "dv8l2nn": [{"0_Comment Submission": "Does CBD help any of you guys with ADHD?", "1_Text": "Yes for me it does; especially impulsivity. I took a break from using it for about a week and bought a 03 Range Rover from an auction. Let’s just say I make sure I don’t go a day without CBD now haha", "2_Subreddit": "CBD"}], "dvaynam": [{"0_Comment Submission": "Took 20 mg oxycodone after a 1 year break from opiates, is it normal too feel really agitated after the peak wears off?", "1_Text": "Yeah Oxy always made me way more agitated than h or morphine. My friends would call it “perc pissed” when I would start snapping haha", "2_Subreddit": "opiates"}], "dvdkk7v": [{"0_Comment Submission": "First drug use", "1_Text": "Huffing solvents (glue, white out, paint, aerosols) at age 9. Got caught on Xmas eve and beat with a coat hanger. Learned to hide better after that hahha", "2_Subreddit": "opiates"}], "dvts5sk": [{"0_Comment Submission": "How to dab BTH guide in the comments. I get a lot of messages from you guys asking how to do it and I’ve been meaning to post this. Have a noddy ass Friday everyone💨", "1_Text": "Thanks so much for this how to! Very informative and clear. I just wish I was able to try this with BTH; none of that in my area unfortunately. I do have some fire opium rn that I’ve been mixing with green in a pipe. Do you think your same technique can be applied to O?", "2_Subreddit": "opiates"}], "dvtso3r": [{"0_Comment Submission": "My husband brought home a cat", "1_Text": "Wow that’s awful! I do feel for you. Make sure you stand firm with what you believe . You need to live with that cat for the rest of its life if you do not. Pull out all the stops. I’ve had a similar experience with a family member bringing unwanted pets into the household and it will be 10+ years of misery for you if you let it stay! It needs to be gone today!! Not tomorrow or next week because it never comes. Be tough!", "2_Subreddit": "petfree"}], "dvtti85": [{"0_Comment Submission": "How to dab BTH guide in the comments. I get a lot of messages from you guys asking how to do it and I’ve been meaning to post this. Have a noddy ass Friday everyone💨", "1_Text": "Totally; we appreciate the effort. I really want to try it now! But my dab rig is an e-nail and I don’t think I can get the temp right to what it would need. The hunt begins for torch and titanium lol", "2_Subreddit": "opiates"}], "dvtuhxa": [{"0_Comment Submission": "How to dab BTH guide in the comments. I get a lot of messages from you guys asking how to do it and I’ve been meaning to post this. Have a noddy ass Friday everyone💨", "1_Text": "Holy fuck just tried it out and worked great, vaped all the way through and got the fattest toke I’ve had since I’ve copped it! Thanks again for the ez nods mate 😎", "2_Subreddit": "opiates"}], "dvtvvas": [{"0_Comment Submission": "How to dab BTH guide in the comments. I get a lot of messages from you guys asking how to do it and I’ve been meaning to post this. Have a noddy ass Friday everyone💨", "1_Text": "Haha fuck I wish I was hitting the BTH then! The O is nice and chill and hits all my receptors but I don’t get that overwhelming feeling; it’s more of a creeper. I hope one day I get to dab some tar and feel that rush.", "2_Subreddit": "opiates"}], "dvtwotu": [{"0_Comment Submission": "How to dab BTH guide in the comments. I get a lot of messages from you guys asking how to do it and I’ve been meaning to post this. Have a noddy ass Friday everyone💨", "1_Text": "From my understanding, opium is the sap yielded from the poppy pod that contains all the active opiate alkaloids (morphine, codeine, thebaine, etc) and H is a semi-synthetic chemical derived from morphine. The effects of both heroin and morphine are quite different from natural opium, because of the mix of chemicals found in natural opium. So there would be more of a rush with the H you’re dabbing but the O is well rounded I find.", "2_Subreddit": "opiates"}], "dvu0g4b": [{"0_Comment Submission": "How to dab BTH guide in the comments. I get a lot of messages from you guys asking how to do it and I’ve been meaning to post this. Have a noddy ass Friday everyone💨", "1_Text": "Yeah I have some really nice #4 right now. I just started 5 months ago. I really like it obv lol but I’m trying to be responsible and use it only once a week. 🤞", "2_Subreddit": "opiates"}], "dvu0ure": [{"0_Comment Submission": "How to dab BTH guide in the comments. I get a lot of messages from you guys asking how to do it and I’ve been meaning to post this. Have a noddy ass Friday everyone💨", "1_Text": "Hmm maybe haha Although I don’t think I’d want to volunteer to try first. I’d hate to waste any.. every speck counts lol", "2_Subreddit": "opiates"}], "dvumqfy": [{"0_Comment Submission": "How to dab BTH guide in the comments. I get a lot of messages from you guys asking how to do it and I’ve been meaning to post this. Have a noddy ass Friday everyone💨", "1_Text": "You are absolutely right. Corrected.", "2_Subreddit": "opiates"}], "dw4t0fd": [{"0_Comment Submission": "What am I doing wrong? No effects from kratom at all.", "1_Text": "Sounds like your mu-opioid receptors are fucked. You’re either really lucky or unlucky depending how you look at it. Hopefully you never need more than a NSAID for pain relief in the future.", "2_Subreddit": "kratom"}], "dwo8nfk": [{"0_Comment Submission": "Opium", "1_Text": "I find that, for me, eating opium is stronger and better than smoking. I take a chunk about the size of 1/4th of a fingernail and parachute it in tp. It’s hard to gauge an exact dosage since there are different opiates in play other than morphine and they have a synergistic effect. I’d say go small and take more after an hour sort of like a cannabis edible. Don’t forget grapefruit juice it helps a lot.", "2_Subreddit": "opiates"}]}], "1_submissions": [{}]}]}