{"acadiandriftwoood": [{"0_comments": [{"dwn497t": [{"0_Comment Submission": "Hydro5s", "1_Text": "No. There is a potential that injecting it will cause pulmonary edema. A bad idea all around. Just eat them.", "2_Subreddit": "opiates"}], "dwn4meq": [{"0_Comment Submission": "105 Days Clean", "1_Text": "Good luck! Glad to hear you've made the decision to go in clean. How long is your sentence?", "2_Subreddit": "opiates"}], "dwn5yzk": [{"0_Comment Submission": "105 Days Clean", "1_Text": "With good behavior you should be able to achieve that, you got this!", "2_Subreddit": "opiates"}], "dwokc17": [{"0_Comment Submission": "Paid 20 and was handed this 🔌", "1_Text": "I wouldn't entirely call mitrazapine trash. It serves a purpose. It helped me sleep and has a decent anxiolytic effect.", "2_Subreddit": "benzodiazepines"}], "dwr2ob0": [{"0_Comment Submission": "dread", "1_Text": "Yeah I am currently using Dread through Tor. So far, it seems fine besides a lack of vendors over there.", "2_Subreddit": "TheRealEtizolam"}], "dwsm8wn": [{"0_Comment Submission": "For anyone wanting the MTE experience and looking for vendors..", "1_Text": "Whoops, I will add that to this post! Thanks", "2_Subreddit": "Etizolam_2"}], "dwsnn5b": [{"0_Comment Submission": "For anyone wanting the MTE experience and looking for vendors..", "1_Text": "Here is the invite: https://discord.gg/TM4emXF  \n\nI will add to the post as well, thanks for the comment to remind me!", "2_Subreddit": "Etizolam_2"}], "dwsuzg3": [{"0_Comment Submission": "For anyone wanting the MTE experience and looking for vendors..", "1_Text": "I do think it is a good platform for vendor discussions. I can see why people are hesitant, but it will take some time for people to pivot to both Dread and Discord, understandably.", "2_Subreddit": "TheRealEtizolam"}], "dwthnat": [{"0_Comment Submission": "For anyone wanting the MTE experience and looking for vendors..", "1_Text": "Understandable. I wouldn't really classify it as a \"darknet site,\" however. If you don't want to do Dread, you might find what you're looking for on Discord. It's just a chat app that you can access in your regular internet browser. Right now there's people there doing exactly what you said you wanted to do.", "2_Subreddit": "Etizolam_2"}], "dwtsrua": [{"0_Comment Submission": "For anyone wanting the MTE experience and looking for vendors..", "1_Text": "I guess I meant the RCBenzos part of Dread. But yeah, rest of Dread does have that.", "2_Subreddit": "Etizolam_2"}], "dwtvmqv": [{"0_Comment Submission": "Welp fuck rehab", "1_Text": "Yeah you won't get percs and valium for a broken wrist. I'm guessing you'll get percs, vicodin or tramodol. A small supply at that depending on what type of doctor/where you go.", "2_Subreddit": "Etizolam_2"}], "dwu0bev": [{"0_Comment Submission": "For anyone wanting the MTE experience and looking for vendors..", "1_Text": "Thanks for shining some insight without fear mongering. My knowledge of Dread is limited, so it's good to find out as much as I can about it. Looks like most Reddit users are finding the Discord channel to be the most useful right now.", "2_Subreddit": "Etizolam_2"}], "dwu1ubn": [{"0_Comment Submission": "Heroin while working out", "1_Text": "Not sure about lifting weights, but back in college I would wake up around 6 a.m., snort a couple lines and go for a run then hit the sauna/steam room. I enjoyed it. I wasn't nodding but I was feeling good. \n\nNodding while lifting weights would be a bad idea though for sure lol.", "2_Subreddit": "opiates"}], "dwu33vq": [{"0_Comment Submission": "Do detox drinks help pass urine testing for clonazepam?", "1_Text": "With the shatter and the clonazepam you are really cutting it close. Without knowing too much about what kind of test you will be taking, I do not think you will pass with the urine you have right now, you might need to substitute.\n\nI've done quite a bit of research on drug tests and how long it takes for most substances to leave your system. Here is what is important: Your metabolism/body weight, what type of test it is going to be (i.e: is it a dipstick test or lab test), how often were you smoking shatter (shatter already has an extremely high THC content, but if you were incessantly smoking it multiple times a day - that poses a big problem), what your diet is like, do you exercise, do you use any other substances that would boost your metabolism like coffee or amphetamines, etc, etc. \n\nUsually a place of employment will email or give you a printed sheet for the lab they want you to go to. What lab you go to is also important to know. Also, this sheet may have the specific drug test listed. If that is the case, you will know exactly what is being tested for with a simple Google search as many labs proudly display their drug testing methods on their websites.\n\nThere are so many factors that determine whether you can pass a drug test. With a little more information we can help you out. I would not worry at all because an employment drug screening is usually much easier to substitute for than something like probation and parole. I have taken urine tests for 4 different jobs (all were lab tests) and none watched me urinate, and 3 of them allowed me to close the door while urinating. Avoiding substitution is ideal, but there are ways to get around lab tests.\n\nAlso: To answer your question in the title about detox drinks: yes they work and no they don't. It depends on the type of the test. The long-short on detox drinks is that they do not actually \"detox\" your body, they simply contain masking agents. Usually, they are chock-full of vitamins like B12 and they will dilute your urine.", "2_Subreddit": "benzodiazepines"}], "dwu3jyk": [{"0_Comment Submission": "Heroin while working out", "1_Text": "I'd recommend trying it out! I always thought it was pretty fun to do, but I always do my best to get out and be as active as possibly no matter what substance I take, I am not the type to do drugs and sit on the couch - unless I am totally planning to nod and chill out that's a different story lol.", "2_Subreddit": "opiates"}], "dwu40sw": [{"0_Comment Submission": "oxys xanax and vodka will I die", "1_Text": "Please don't take any oxy. You are definitely at risk for respiratory failure if you do so. Save it for the morning when you are hungover.", "2_Subreddit": "opiates"}], "dwupvbi": [{"0_Comment Submission": "Do detox drinks help pass urine testing for clonazepam?", "1_Text": "Yes, THC is stored in fat and binds to hair follicles. It is also present within saliva and blood within ~72 hours of use. Keep doing what you are doing and if you can, try to figure out what lab they are using and what test, if you find that out I can give you a much more definite answer. Try not to exercise ~48 hours before the test, but right now do as much physical activity as possible and drink lots of fluids. Make sure you don't overdo it, you don't want to die from over consumption of water.\n\nI don't think, legally, they could deny you the position if you have a prescription for Clonazepam. However, I also don't know what type of position it is, so they may very well have the ability to deny anyone who is prescribed narcotics, benzodiazepines or anti-psychotics due to liability issues (i.e. factory/warehouse job, social services or any job that requires you to drive a company vehicle). \n\nSince you are 145 pounds and it has already been 9 days since your last use, you may very well be in the clear by the time you take the test. For me, the max it takes me to have marijuana leave my system is ~14 days, but even if I am smoking marijuana flower 1-2 times a day over a month, it usually takes about 10 days. I am a tall male ~200 lbs. \n\nIt is common for people to say that 21-30 days is the ABSOLUTE time window for marijuana to leave your system. I think that is erring on the side of caution, and next time you have to take a drug test, I would definitely say to use that time window instead of 14 days. However, from most of the research I have done, that is usually sufficient.\n\nFrom the National Drug Court Institute: \"A closer evaluation of the study by Smith-Kielland, Skuterud, & Morland indicates that even with the factors\nidentified as limiting its relevance, the average time to the first negative urine sample at a cannabinoid cutoff of 20 ng/mL was just 3.8 days for infrequent users and only 11.3 days for frequent users.\" (https://www.ndci.org/sites/default/files/ndci/THC_Detection_Window_0.pdf)\n\nIf I had to guess with your body weight, for clonazepam you should be testing negative between 2-7 days. For marijuana, I would give you a window of 12 to 30 days, 12 being the very least and 30 being the very most. This means that even if you were to test on Monday you have a good shot of passing.\n\nHopefully this brings you some piece of mind, however remember I am not a doctor or scientist, I simply have a lot of experience in dealing with drug tests of many varieties and my primary focus has been eliminating all substances from my body rather than masking and trying to beat drug tests. In the future, always be prepared for drug tests so you don't have to worry about substitution and cheating.", "2_Subreddit": "benzodiazepines"}], "dwurg5y": [{"0_Comment Submission": "How many of you succeeded at staying clean after being forced into a rehab?", "1_Text": "I was forced to go to rehab once when I wasn't ready to get clean. I think the best thing I got from it was a new perspective of myself. You will be surprised what you will get from a good treatment center.\n\nYou can't force someone to get sober, but if you are left with a Sophie's Choice situation, make the best of it. Try to have a conversation with your wife with where you are at with your substance abuse. Be honest with her. \n\nFor me, after 3 or 4 days of forced sobriety I was in a completely different headspace and I gained quite a bit of clarity. Did I want to use still? Sure. But I toughed it out and utilized the resources at my disposal to make the best of a shit situation. I did 30 days and was released to sober living where I was able to stay sober for over a year. \n\nNow I am at a point where I know down the road I will have to completely stop using, but life circumstances have led me back to using on and off. That forced stint in rehab and other recovery-based programs gave me a lot of insight into how I can better myself, and helped me to learn how to properly face my demons no matter where I am at in life.\n\nSit down with your wife, be honest with her without getting too emotional and having it spiral into an argument, and try to find a good treatment center that will allow you to really focus on what made you lose it years ago with that life event that made you use heavily. A good therapist/drug counselor will help you to process these events. \n\nI can't tell you that you have to be sober, and no one else can if you don't want to be, but if you are at risk of losing your wife and family, this might be a good time to look at yourself and figure out what truly means the most to you. I wish you the best of luck, friend.", "2_Subreddit": "opiates"}], "dwuul8u": [{"0_Comment Submission": "My dboy who sold me these bricks invited me into his trap house to party. I politely declined", "1_Text": "Ayyy you gotta come thru the trap house to chop it up once in a while.", "2_Subreddit": "opiates"}], "dwuwu8u": [{"0_Comment Submission": "Do detox drinks help pass urine testing for clonazepam?", "1_Text": "Also, wanted to make this a separate comment so it stands out:\n\nI just pulled up the sheet I was emailed for my last job regarding a drug test. It is an order for a drug test and it says: \"Order must be completed by Time/Date.\" At the bottom it has instructions for the lab, and says \"Reason for test: Pre-employment\" and \"Service: 1 eCup.\"\n \nAn eCup is an instant drug test that is done by the company eScreen. A lot of private labs use this and a lot of companies/corporations will opt for this type of drug test because it is very cheap for them. It was a 5 panel drug test. I went in to the lab, gave a urine sample, and an initial test was run by the technician. He ran it through a machine, it took about 20 seconds or so, he looked at me and said: \"Alright, you're good to go.\" My guess is it was the initial test for those 5 substances (Cocaine, Meth, PCP, Amphetamines and Opiates/Opioids), then it was sent off to their other lab for confirmation. I was clean of all substances for months, so I knew I passed, but they got back to me in two days to let me know I passed the drug test and was offered the position.", "2_Subreddit": "benzodiazepines"}], "dwvgn78": [{"0_Comment Submission": "Another day hoping to feel something from 250mg of tramadol and 12 grams of Kratom because dry as Shit. Anyways my latest Amazon order of books .. any other readers here ? I got some ps1 games too", "1_Text": "My man, you have some good taste. I have every one of these books besides Tracey's and Red Country. Hell's Angels is great, Junky is a classic and Ernst Junger is a badass.", "2_Subreddit": "opiates"}], "dwvksxh": [{"0_Comment Submission": "Learned this the hard way", "1_Text": "After 10 days in Rehab a 5 quickly turns into a \"Rehab 8.\" After 20 days it gets even worse...", "2_Subreddit": "opiates"}], "dwwsixe": [{"0_Comment Submission": "Clam solution yellow?", "1_Text": "Most cLam powder I've seen is yellowish/off white. Also, many cLam pellets I've had were yellow. You are good. That's a reputable vendor you ordered from.", "2_Subreddit": "Etizolam_2"}], "dwwt3k9": [{"0_Comment Submission": "Update; My dboy accepted the ones.", "1_Text": "Fun fact: If I ever have a bunch of ones I always go to a gas station real quick and ask for bigger bills in exchange for the ones. As long as they aren't busy, they don't give a damn. Banks will do this too.", "2_Subreddit": "opiates"}], "dwxe68f": [{"0_Comment Submission": "My plug drives a bus.", "1_Text": "Ayy at least he waited until he was done with his route and dropping off all the kids..", "2_Subreddit": "opiates"}]}], "1_submissions": [{"89162c": [{"0_Title": "Poppy seed shelf life", "1_Text": "No. There is a potential that injecting it will cause pulmonary edema. A bad idea all around. Just eat them.", "2_Subreddit": "opiates"}], "89pwr6": [{"0_Title": "For anyone wanting the MTE experience and looking for vendors..", "1_Text": "No. There is a potential that injecting it will cause pulmonary edema. A bad idea all around. Just eat them.", "2_Subreddit": "Etizolam_2"}], "89pzy7": [{"0_Title": "For anyone wanting the MTE experience and looking for vendors..", "1_Text": "No. There is a potential that injecting it will cause pulmonary edema. A bad idea all around. Just eat them.", "2_Subreddit": "TheRealEtizolam"}]}]}]}