{"Mbluna": [{"0_comments": [{"dwx2ijm": [{"0_Comment Submission": "Just got a chance to watch the second tell all and a few things jumped out at me", "1_Text": "You said it way better than I ever could have, I knew what I wanted to say but couldn’t get it into words. I had dental surgery Wednesday afternoon and I was using reddit and my trash TV obsession to distract me.", "2_Subreddit": "TLCsisterwives"}], "dwx2o0m": [{"0_Comment Submission": "Just got a chance to watch the second tell all and a few things jumped out at me", "1_Text": "Thankfully I’ve never wasted my money on any of those bc the ones I’ve seen are a bit pricey as well as plain ugly. The color patterns from what I’ve seen of Meri’s are a bit much to say the least. Then reading how the company supposedly cheated sellers out of money no thanks!", "2_Subreddit": "TLCsisterwives"}], "dwx94ux": [{"0_Comment Submission": "Just got a chance to watch the second tell all and a few things jumped out at me", "1_Text": "100% agree I’ve always said what I mean and mean what I say, with age my delivery is better, my husband may not agree on my delivery haha. Christine’s reaction was just wrong, I get there were cameras rolling and all but it’s not like it’s the first she’s been in front of a camera she needed to stop and think. I often say the first that pops into my mind but I’ve been trying to do better bc some folks don’t like cold hard facts. I’d much prefer the cold hard facts myself. I feel badly for Mykelti bc she will forever have that memory of her mother being less than thrilled about her choice of a partner. Then Christine, Robin and Kodi all make it worse by their over the top sucking up to Tony. I’m happy to see that Christine was self aware enough to be nervous meeting Tony’s family bc she knows she was wrong. Being the type to say the first thing that pops in my mind I’ve had to eat lots of my words over the years and it sucks. That said I’m a big enough person that I can admit i reacted harshly or unfairly and go directly to the person I offended, I don’t play these suck up games the dam Browns play. Seems to me all of that sucking up just pours salt on the open wounds, but then again I think Tony sort of enjoys all of the extra attention.", "2_Subreddit": "TLCsisterwives"}], "dwxa8lu": [{"0_Comment Submission": "Just got a chance to watch the second tell all and a few things jumped out at me", "1_Text": "Hell yeah loves it! I also think Tony is pushing the limits on the things he says just to get a rise out of everyone and or bc he knows bc of their past behavior towards him he can get away with just about anything.", "2_Subreddit": "TLCsisterwives"}], "dwxabhn": [{"0_Comment Submission": "PICKLES", "1_Text": "I took a look at her blog yesterday and found it too busy to search or even read so I left without reading anything.", "2_Subreddit": "DuggarsSnark"}], "dwxalmh": [{"0_Comment Submission": "Local insurance for motorcycle and cars?", "1_Text": "Know anyone who served in the military? If so they could sponsor for USSA insurance it’s by far the best rates we’ve ever had and I had horrible speeding tickets in years past.", "2_Subreddit": "Charlotte"}], "dwxb4ta": [{"0_Comment Submission": "What is Jill doing?", "1_Text": "I’ve been on business trips with my husband and we took our kids before they were school,age a few times if it was near a fun place. That said I don’t see Jill doing anything at all fun bc 1) she’s a Duggar and they are cheap 2) Derrick has no Jon so no extra $$$ to do anything fun 3) Jill is Co dependent on Derrick therefore she can’t do anything without him except to for his crazy ass to return 4) Duggars are social enough among each other and other fundies but no out in the wild with non fundies. Heaven forbid she catch a glimpse of a scantly clad dude in running shorts and no shirt, she can’t risk that so she resorts to #4.", "2_Subreddit": "CountingOn"}], "dwxbcoc": [{"0_Comment Submission": "Just got a chance to watch the second tell all and a few things jumped out at me", "1_Text": "Oh yeah and when they were in the bathroom looking at wedding venues and he said he felt like he needed a tampon. It was crude but I laughed bc I knew it made everyone uncomfortable but they’d let him slide.", "2_Subreddit": "TLCsisterwives"}], "dwxbgea": [{"0_Comment Submission": "going to end up homeless soon..any tips?", "1_Text": "Same fast food place you’d get your free WiFi from.", "2_Subreddit": "opiates"}], "dwxch57": [{"0_Comment Submission": "Do you think the Duggars do period sex?", "1_Text": "These people are batshit crazy! Notice it says evening before worship but doesn’t mention the morning of.", "2_Subreddit": "DuggarsSnark"}], "dwxckne": [{"0_Comment Submission": "Just got a chance to watch the second tell all and a few things jumped out at me", "1_Text": "Ha glad I’m not alone! I also backed it up a few times to be sure I could see the look on everyone’s face after he said. Kody May have won that one, the look on his face was priceless!", "2_Subreddit": "TLCsisterwives"}], "dwxco0n": [{"0_Comment Submission": "Do you think the Duggars do period sex?", "1_Text": "Ok let’s go there........do you think any of them give or receive oral? I’d say no, come on folks I can’t be the only one to wonder!", "2_Subreddit": "DuggarsSnark"}], "dwxcwtp": [{"0_Comment Submission": "Here's how Meri can get Kody back", "1_Text": "I also think she wants whatever financial stability the family can provide. I’d like to know how she or the entire clan for that matter could afford the B&B considering they’ve got 4 other mortgages?", "2_Subreddit": "TLCsisterwives"}], "dwxi90q": [{"0_Comment Submission": "Do you think the Duggars do period sex?", "1_Text": "You really think the guys receive? I’d think it would be to nonfundie for all of them except maybe Jeremy. I also wonder if Jeremy was a virgin? He’s traveled and was in professional soccer I know he’s drank in the past, so many questions if only a Duggar would defect and come join our sub!", "2_Subreddit": "DuggarsSnark"}], "dwxizpu": [{"0_Comment Submission": "Do you think the Duggars do period sex?", "1_Text": "Yeah I agree Jeremy likely wasn’t, I know they had chaperons and didn’t kiss but we never heard the nonstop “we’er saving ourselves for marriage” of course we know Jinger was a virgin. I also wonder what Jim Bob said about Jeremy not being a virgin bc you know Jim Bob sticks his noisy self in his kids personal business on every level. I suppose I could see the guys wanting BJ’s but I have a hard time believing the females would be willing to oblige, I could be wrong hell they may all be dam freaks in the sheets. Hell I sure hope all of them are freaks in the sheets I mean hell they don’t get to do a bunch of normal fun stuff to begin with. You know what? From now on my personal hope/desire for the Duggars are that they are all lil freaks in the sheets!! YES please let it happen, ok I’ve way to invested in the fundies sex lives I think I’ll do something wholesome and walk my dog.", "2_Subreddit": "DuggarsSnark"}], "dwxjamo": [{"0_Comment Submission": "What sort of drug education do you think the Duggar kids got?", "1_Text": "“Drugs are bad, people who do drugs are bad stay away all drugs are of the devil”! I have a feeling Jill would take 10 mile walking detour to avoid even walking past a dispensary.", "2_Subreddit": "DuggarsSnark"}], "dwxjk80": [{"0_Comment Submission": "What are the odds Butch stays sober?", "1_Text": "If Butch is old I’m fucking as fuck.", "2_Subreddit": "TeenMomOGandTeenMom2"}], "dwxjmju": [{"0_Comment Submission": "What are the odds Butch stays sober?", "1_Text": "Especially if he continues to live with his daughter who clearly uses.", "2_Subreddit": "TeenMomOGandTeenMom2"}], "dwxjqoq": [{"0_Comment Submission": "What sort of drug education do you think the Duggar kids got?", "1_Text": "True. By the time she walked that far Derrick would be finished is grifter training and could go fetch Jill and her litter in the making.", "2_Subreddit": "DuggarsSnark"}], "dwxmtcu": [{"0_Comment Submission": "What are the odds Butch stays sober?", "1_Text": "Yes!! But I’m still old as fuck but refuse to act  my age!", "2_Subreddit": "TeenMomOGandTeenMom2"}], "dwxn2k1": [{"0_Comment Submission": "Do you think the Duggars do period sex?", "1_Text": "Yes there has to be someone out there!! I only pretend to be a PI on Reddit so I can’t make any promises but let’s see what we can dig up on his past girlfriends. I know there were some “controversial” (at least for the Duggar clan) photos of him that were out and about when the6 first began courting, I’ll see what I can find. Anyone who is more proficient than I———which I’m certain everyone is as i don’t even have Facebook; feel free to jump in and help. \n\nEdit to add: I found this lil gem \nJeremy Vuolo was arrested after a night out drinking before he met and married Jinger Duggar, and according to the arrest record, he allegedly assaulted a police officer.\nHere’s the link https://thestir.cafemom.com/celebrities/208286/jeremy_vuolo_arrest_record_assault\n\nOh snap he has/had a tat!! The picture link has been removed from this article\nhttp://www.intouchweekly.com/posts/jeremy-vuolo-tattoo-130123", "2_Subreddit": "DuggarsSnark"}], "dwxnz58": [{"0_Comment Submission": "Do you think the Duggars do period sex?", "1_Text": "Oh yeah he has an arrest record I think for assault on a cop maybe? I linked another article where it talks about him partying. Very interesting Jim Bob approved of Jeremy and gave permission to court Jinger over coffee and chocolate muffins.", "2_Subreddit": "DuggarsSnark"}], "dwxouyh": [{"0_Comment Submission": "Do you think the Duggars do period sex?", "1_Text": "Was the book called His Needs, Her Needs? I think I’ve heard that book mentioned by the Duggars. I might to go look for info about that book. \n\nEdit to add:\nYikes Josh clearly didn’t read this book!! Here’s the first line describing it on Amazon\nHis Needs, Her Needs: Building an Affair-Proof Marriage and millions of other books are available for Amazon Kindle.", "2_Subreddit": "DuggarsSnark"}], "dwxwa3c": [{"0_Comment Submission": "What are the odds Butch stays sober?", "1_Text": "Yep it’s pretty sad and considering we all knew the rehab was going to comp Butch’s’ stay wonder why Amber wasn’t offered any help? I know she denies using drugs but duh it’s crystal clear she’s lying.", "2_Subreddit": "TeenMomOGandTeenMom2"}], "dwxwlwf": [{"0_Comment Submission": "Couponing", "1_Text": "Bc they buy from places such as Aldi who doesn’t take coupons. When the show was on as a documentary they showed them shopping at Aldi and all they bought was pre processed crap food. Everything they bought pretty was in cans including fruit and then huge jars of discount pickles.", "2_Subreddit": "DuggarsSnark"}]}], "1_submissions": [{"7t7617": [{"0_Title": "Sophie the day she came to live with us top and her last summer!", "1_Text": "You said it way better than I ever could have, I knew what I wanted to say but couldn’t get it into words. I had dental surgery Wednesday afternoon and I was using reddit and my trash TV obsession to distract me.", "2_Subreddit": "DogBreeds"}], "8637ab": [{"0_Title": "Joe and Kendra tubing moment.", "1_Text": "You said it way better than I ever could have, I knew what I wanted to say but couldn’t get it into words. I had dental surgery Wednesday afternoon and I was using reddit and my trash TV obsession to distract me.", "2_Subreddit": "CountingOn"}], "87u0jo": [{"0_Title": "Farrah has settled with Viacom??", "1_Text": "You said it way better than I ever could have, I knew what I wanted to say but couldn’t get it into words. I had dental surgery Wednesday afternoon and I was using reddit and my trash TV obsession to distract me.", "2_Subreddit": "TeenMomOGandTeenMom2"}]}]}]}