{"LutterIsland": [{"0_comments": [{"dwrc2wb": [{"0_Comment Submission": "I know I relapsed the other day, but I can do this, guys!", "1_Text": "Maybe you should unsub from any drug related subs other than recovery ones. Outta sight outta mind...jk once an addict its on your mind all the time. Good luck, 90 meetings in 90 days", "2_Subreddit": "opiates"}], "dwrcair": [{"0_Comment Submission": "Today’s pick up", "1_Text": "dope in metro areas suck dick. better stuff lies outside 'downtowns' and shit", "2_Subreddit": "opiates"}], "dwrcf0q": [{"0_Comment Submission": "I know what my problem is-- I want to use heroin forever.", "1_Text": "I feel for you. Remember, before you got into this shit you felt normal just waking up everyday and had cash in your pocket or in your bank.", "2_Subreddit": "opiates"}], "dwrci7h": [{"0_Comment Submission": "30 days off of heroin", "1_Text": "congrats brother. stay at it", "2_Subreddit": "opiates"}], "dwrclp0": [{"0_Comment Submission": "Am I a fool for falling back in the trap?", "1_Text": "Big book bro", "2_Subreddit": "opiates"}], "dwrcp9k": [{"0_Comment Submission": "Best rc benzo for high tolerance?", "1_Text": "Clam and flam", "2_Subreddit": "researchchemicals"}], "dwrd7wd": [{"0_Comment Submission": "What happened to roxies?", "1_Text": "Tramadol is a doctors preference now I guess. I think ODSMT should be prescribed instead.", "2_Subreddit": "opiates"}], "dwrdf4a": [{"0_Comment Submission": "What happened to roxies?", "1_Text": "amen", "2_Subreddit": "opiates"}], "dwrdr6g": [{"0_Comment Submission": "TIL...", "1_Text": "\"Dude I move weight like a motherfucker hmu anytime g\" \n\nI'd be a millionaire.", "2_Subreddit": "Etizolam_2"}], "dwrecoi": [{"0_Comment Submission": "Admin Rick", "1_Text": "you make all these posts about madcapz being dedicatedresearcher then why the fuck would he say send the cops to his house if he's is madcapz. go buy a double ended dildo and have anal with your mother", "2_Subreddit": "Etizolam_2"}], "dwrelxy": [{"0_Comment Submission": "WARNING on gohard", "1_Text": "Sure you dont.", "2_Subreddit": "Etizolam_2"}], "dwreo13": [{"0_Comment Submission": "What happened to roxies?", "1_Text": "That goes without saying", "2_Subreddit": "opiates"}], "dwrfdfx": [{"0_Comment Submission": "Admin Rick", "1_Text": "Oh Im madcapz too now? ROFL Stick to writing your diary posts like a cute little prison faggot you are. Make sure in your next one you slip in \"oh my gawd my cellmates cock was so big i came all over my bunk every night\"", "2_Subreddit": "Etizolam_2"}], "dwrg2b9": [{"0_Comment Submission": "Admin Rick", "1_Text": "Im not upset I just see you saying EVERYONE is madcapz as a fucking joke...do some actual research other than the ones that have already been confirmed as madcapz.\n\nby the way, who gave you permission to take that dildo out of you and your moms assholes?", "2_Subreddit": "Etizolam_2"}], "dwuc5ws": [{"0_Comment Submission": "Getting opiates filled.", "1_Text": "Man the fuck up. It's clear you're just trying to get these scripts to get high judging off your post history. A broken bone hurts, yes...I've broke my shin once playing rugby, and in another instance I tore whatever ligament that holds your shoulder in its socket and dislocated it probably 20 times before I had surgery. And just 2 weeks ago I ripped that same muscle again. Just this morning I woke up with my shoulder dislocated and popped it back in. \n\nI never asked for scripts. I fucking got a 2 week supply of hydro and that was it. I didn't ask for it. \n\nYou've admitted you have addiction issues here, and that you recently \"OD\"d on clonazolam in your post history. Kids like you are the reason why docs are so hesitant to write scripts for people in real pain that actually NEED meds", "2_Subreddit": "opiates"}], "dwucptl": [{"0_Comment Submission": "Getting opiates filled.", "1_Text": "https://www.reddit.com/r/Etizolam_2/comments/89s6us/welp_fuck_rehab/\n\n>[–]Jonm2018[S] 0 points 11 hours ago \n>Not quite yet. I'm omw to get heroin again. And my dad just bought 2 fifths. So I'm gonna have to drink with him to avoid the police being called. I hate drinking.\n\n\nYou're gonna fucking OD again mixing heroin and whatever benzo script you get.  What a great dad btw. buying his son heroin", "2_Subreddit": "opiates"}], "dwuctvj": [{"0_Comment Submission": "Queentilla onion site review", "1_Text": "holy fuck do you not know how to hit the 'enter' tab twice to make paragraphs? Ill teach  you....you hit the enter tab twice and it makes a new paragraph.", "2_Subreddit": "TheRealEtizolam"}], "dwud15a": [{"0_Comment Submission": "Getting opiates filled.", "1_Text": "You're right, Im man enough to admit a reading comprehension mistake. I just assumed  your dad took you to get H since you mentioned he had just bought two bottles for you guys to drink. But seriously, the #1 cause of ODs are from mixing benzos and opi's and unless you have Narcan laying around you better hope you dont close your eyes.", "2_Subreddit": "opiates"}], "dwudn6x": [{"0_Comment Submission": "Queentilla onion site review", "1_Text": "K, got ya", "2_Subreddit": "TheRealEtizolam"}], "dwudt85": [{"0_Comment Submission": "Getting opiates filled.", "1_Text": "You ever seen trainspotting? I fucking hate that baby scene. Instead of buying dope why dont you, like I saia,d DEAL with the pain so you can put that money towards making sure you and your boy are squared away financially until you're able to get back to work. Wouldn't that be what a responsible parent does? \n\nIf you cant do that, put him up for adoption to a family that can provide a better home environment then you can - blunt, but real. Unless you really do plan on getting clean and holding a job down.", "2_Subreddit": "opiates"}], "dwuerhy": [{"0_Comment Submission": "Getting opiates filled.", "1_Text": "The broken shin was in my HS days, where plenty of bones are broken and we dont get all doped up asking for multiple scripts. Handle the fucking pain. I started working construction as a laborer when I was 17 and worked in construction til I was 24 so dont think I dont know what hard manual labor is. I aint a junkie. I got clean over 2 years ago. And guess what, to this day I STILL TO GO MEETINGS. \n\nYou, instead,  go score dope when theres other alternative out there like Kratom from a head shop (even though head shop kratom sucks). A good amount of some red would have done you well. Just admit it dude...you want to get high. Plain and simple. I see right through you.", "2_Subreddit": "opiates"}], "dwuf0ch": [{"0_Comment Submission": "RC Party!", "1_Text": "Gimme some of that candy!", "2_Subreddit": "DrugStashes"}], "dwuf21r": [{"0_Comment Submission": "Getting opiates filled.", "1_Text": "Did I say I do Kratom? I said yoou could have gotten some kratom. Reading comprehension. But whatever, go get your scripts , score your dope and close your eyes bud. Life is cruel.", "2_Subreddit": "opiates"}], "dwwcxmo": [{"0_Comment Submission": "Queentilla onion site review", "1_Text": "Queentilla supposedly threatened she was going to report another well known overseas vendor to her sister who's a \"fed\"\n\nThe queen of chinchillas.", "2_Subreddit": "TheRealEtizolam"}], "dwy9l44": [{"0_Comment Submission": "Nice", "1_Text": "Wont read a sidebar cuz he a straight mofo but he's willing to read people's comments, gangsta", "2_Subreddit": "TheRealEtizolam"}]}], "1_submissions": [{"89dnbh": [{"0_Title": "Yellow viper", "1_Text": "Maybe you should unsub from any drug related subs other than recovery ones. Outta sight outta mind...jk once an addict its on your mind all the time. Good luck, 90 meetings in 90 days", "2_Subreddit": "snakes"}], "89jkqr": [{"0_Title": "What happened to roxies?", "1_Text": "Maybe you should unsub from any drug related subs other than recovery ones. Outta sight outta mind...jk once an addict its on your mind all the time. Good luck, 90 meetings in 90 days", "2_Subreddit": "opiates"}]}]}]}