{"Gostyaaa": [{"0_comments": [{"drmhvu0": [{"0_Comment Submission": "What to do about tough dboy situation...", "1_Text": "Totally agree with only paying back what I actually owe except in this particular case I don't know if there's any point. For example let's say I throw him $100 to be generous considering we had originally talked about a 300 bag. At minimum he is going to be upset about the other 40 he thinks I owe as well and worst case the 50 he tacked on as well. So I'm basically out 100 with no gain from it since he feels like I didn't pay him back fully. Next thing I know he's bruising another knuckle on my face lol. (He has shown me his knuckles many times and clearly has to rough up his sellers quite a bit to keep them in line - or maybe it's because he performs similar \"fronts\" with them and they have no way to make enough to pay it back. I could see that happening like here buddy take this bag oh btw it's a half-zip you owe me!!!11!)", "2_Subreddit": "opiates"}], "drncen6": [{"0_Comment Submission": "What to do about tough dboy situation...", "1_Text": "Sure I can give you guys an update in a while when I decide. Today was surprisingly pretty quiet he never actually tried calling again after our initial conversation in the morning. Which is suuuuuuper strange honestly since his girl was supposedly stranded in an airport and needed money.", "2_Subreddit": "opiates"}], "drngcs1": [{"0_Comment Submission": "What to do about tough dboy situation...", "1_Text": "Haha omg dude chill out did you read the context of the situation? When he changed the price from 50 to 150 it was literally as he was jumping in his vehicle and driving away basically shouting it out the window. I totally understand standing up for myself, you don't see me transferring oodles of money because I'm scared of him... if I give him any money at all it'll be because I value him as a connect, but at this point I'm leaning away from it just because of how unstable he has been lately. I think he must have a serious habit himself if he actually needed my money that bad.", "2_Subreddit": "opiates"}], "drnghb8": [{"0_Comment Submission": "What to do about tough dboy situation...", "1_Text": "Luckily I had the foresight not to take the coat right away. I was about to go to Star Wars after picking up and didn't want to deal with the security clip right away. So at least it's not like I'm stealing the coat from (though he stole it in the first place lol...) and yes he asked me to front for the coat when I was originally supposed to pay him back. I was just thinking No way my dude you must be delusional...", "2_Subreddit": "opiates"}], "drngjb4": [{"0_Comment Submission": "What to do about tough dboy situation...", "1_Text": "Love the name btw. Do you read the Stormlight Archive at all? Definitely very reminiscent of the WoT and I love Brandon Sanderson.", "2_Subreddit": "opiates"}], "drngusy": [{"0_Comment Submission": "What to do about tough dboy situation...", "1_Text": "Sorry didn't see this post before I made my other reply to you. To be fair I think he mostly purchases fenced stuff now and resells it to some established contacts he has as he used to do it a LOT (judging by his rap sheet). However, even without that there is definitely something off. He definitely moves significant amounts of product (he showed me his stash once), but doesn't seem to have the corresponding amount of cash that he should (unless he was just faking an urgent situation to get me to pay him back faster or something). My suspicions are that he has a massive possible poly-drug habit himself along with his girl. But yes probably will drop him as I could definitely do without the instability in a lifestyle already filled with chaos.", "2_Subreddit": "opiates"}], "drt03lw": [{"0_Comment Submission": "Christmas withdrawals", "1_Text": "I know there was fent for sure as the dealer warns every customer to do test shots and says outright that there is. Honestly I love it... so much more bang for your buck.... Sigh", "2_Subreddit": "opiates"}], "ds980tm": [{"0_Comment Submission": "The sixth sense for opiates", "1_Text": "Homeless people almost ALWAYS have a connect or know someone that does. Just don't let them run off with your phone or your money. And they're a dime a dozen, if one seems to be unstable you can leave and find one that is friendly. They are usually really grounded people that are just at a bad patch in their lives that are happy for any help you can give them (offer to throw them some of your stuff or a $10 or something). In Craigslist try casual encounters with key words like \"snow\" to find coke sellers, they usually know someone with down. Again, exercise caution. Don't transfer them money ahead of time or meet with them if something seems off. Good luck!", "2_Subreddit": "opiates"}], "ds98636": [{"0_Comment Submission": "The sixth sense for opiates", "1_Text": "Thank you my friend :) in fairness I have found that hard drugs are much easier to find than psyches. Good luck in your quest as well!", "2_Subreddit": "opiates"}], "ds987n9": [{"0_Comment Submission": "The sixth sense for opiates", "1_Text": "Hahahaha that would be the dream! \"Everyone was a dboy the whole time!!\"", "2_Subreddit": "opiates"}], "ds98woi": [{"0_Comment Submission": "The sixth sense for opiates", "1_Text": "Imo snow is by far the easiest to find on CL (though that could be geographical). I just found a coke guy first and he had dillys.", "2_Subreddit": "opiates"}], "ds98xeo": [{"0_Comment Submission": "The sixth sense for opiates", "1_Text": "Though I suppose you could try like DQ dilly bars haha...", "2_Subreddit": "opiates"}], "ds99426": [{"0_Comment Submission": "The sixth sense for opiates", "1_Text": "Haha and none of them will front you", "2_Subreddit": "opiates"}], "dt20iwz": [{"0_Comment Submission": "(Not my picture; best I could get) A photo a dealer sent me— the 5 looks off to me on the left. Who can help out? Are they the real deal?", "1_Text": "The imprint on the right one looks diagonal!! If I was on a computer I would draw a straight line to show, but seriously just use the tool in like paint to check. Maybe it's my eyes playing tricks but I would say fake.", "2_Subreddit": "opiates"}], "dug2wtd": [{"0_Comment Submission": "Regarding fentanyl warning posts", "1_Text": "Test kits are notorious for false positives. The truth is you just can't be sure, and maybe that's just a risk of the game these days. The rules are shouted over every news channel I doubt anyone is unaware of the existence of fent.", "2_Subreddit": "opiates"}], "dv465q5": [{"0_Comment Submission": "So after two years clean offa H, I relapsed", "1_Text": "I'm going to be the devil's advocate here... if everything is so awesome and sparkly in your new life then why did you relapse?\n\nJust be careful as it's easy to chip when everything is going well in your life the hard part is when you face a struggle and you want to escape from it into an opiate's waiting embrace.", "2_Subreddit": "HeroinHeroines"}], "dvsqg5u": [{"0_Comment Submission": "Dboy waited around for ME today!", "1_Text": "If you are really \"trying to be a good mommy\"  today then you should take your dog to the vet.\n\nJust like humans where if symptoms present for multiple consecutive days they should have a checkup. Not to mention a vet will prescribe medicine at a dose that is correct for the mass of your dog.", "2_Subreddit": "opiates"}], "dwhr965": [{"0_Comment Submission": "Happy Birthday to me...", "1_Text": "Haha oh man I wish I was a girl. You see so many girls saying they would never sleep with their dealers for drugs, but I would be alllll overrrr that.", "2_Subreddit": "opiates"}], "dwpqmse": [{"0_Comment Submission": "How to tell my dealer I'm pregnant?", "1_Text": "Most people are sugar coating it so let me tell you something straight out. Do not bring a baby into this world. I have been on the subreddit under different accounts for years and can still remember when you were still staying with your mom and encouraging her antics despite everyone telling you to leave.\n\n\n\nMore recently you have totally lost all your animals to the outdoors and managed to scam someone on reddit for some money to spend on a safe place (I assume because you're a girl and \"cutesy\" and definitely not addicted like everyone else here) You did spend all the money on a safe place right?? Because I seem to remember numerous spun out posts immediately after. To your credit (I think) you managed to find all your animals, but the way you talk about them sometimes makes it sound like you think they have the capacity of human children which I think is why you want this kid so bad. You want something to love you more than anything, and while your animals can provide affection they will still choose food and shelter over you.\n\n\n\nMore recently you have claimed that you are not addicted and even sober! ...I don't think switching back and forth been meth and heroin satisfies either of those definitions. You are homeless and sucking your dealer's dick and yet you refuse to acknowledge how bad your situation is. And THAT is why you should not have a baby because you need to learn how to take care of yourself (and your animals) first. Can you even provide for yourself, 2 dogs, 3 cats, and a baby?! And don't count on that dboy of a baby daddy to chip in - I guarantee he has other side hoes just like you so don't dare to believe for a second that you are special to him and that he will leave the life to start a family with you.\n\n\n\nLately you remind me of that Northwest Vae guy and I cannot for the life of me understand how you have managed to manipulate so many people with the cutesy persona that you project. Parts of this probably sound harsh and I'm sorry, but if you really want a kid and actually do have some genetic condition well there is always adoption. But you need to turn your life around before that is an option.", "2_Subreddit": "opiates"}], "dwpvqt7": [{"0_Comment Submission": "How to tell my dealer I'm pregnant?", "1_Text": "Well you certainly have always had plenty of money to spend on drugs in the weeks since you were homeless, so maybe you didn't use their money maliciously but at a minimum you asked for more than you needed.\n\n\n\nThe next few points you kind of just assumed yourself. I never said that you slept with your dealer for drugs though I'm sure you haven't turned down or complained about any of the free perks that come with it.\n\n\n\nI also don't think you're a moron nor are you a mastermind. You're simply average. I do however think that most junkies are naturally skilled at manipulation. This whole thread was just a giant cry for attention - your only clue that you might be pregnant is a late period even though you noticed spotting, or neglecting that are aware that your recent heavy usage of meth (and long term usage of heroin) could certainly interrupt your cycles. Even after getting negative on a test, and noticing period spotting you continue as if those don't mean anything.", "2_Subreddit": "opiates"}], "dwpwe4h": [{"0_Comment Submission": "How to tell my dealer I'm pregnant?", "1_Text": "There you go twisting words and the situation around again to try and elicit emotions or a reaction from me. This is your lowest low now? I thought you both liked the potential baby daddy and wanted a kid - those both sound like positives to me. But oh wait maybe I should feel bad for poooooor Berry because she wants me to.", "2_Subreddit": "opiates"}], "dwpxskl": [{"0_Comment Submission": "How to tell my dealer I'm pregnant?", "1_Text": "Anyway sorry I lashed out a bit. I know in your heart you'd rather have the white picket fence with a big house your pets can wonder around in freely, along with a loving husband that supports having a child with you when you're ready.\n\n\n\nThat's why it frustrates me that you're so willing to start a \"family\" with some degenerate dboy that is probably going to leave you, while you're still battling an addiction, and while you're only a few steps from going back to homelessness. Don't bring a baby into this situation. Get your life together and then bring a baby into the life I described above. Pull a Tracey.", "2_Subreddit": "opiates"}]}], "1_submissions": [{"7li8jm": [{"0_Title": "What to do about tough dboy situation...", "1_Text": "Totally agree with only paying back what I actually owe except in this particular case I don't know if there's any point. For example let's say I throw him $100 to be generous considering we had originally talked about a 300 bag. At minimum he is going to be upset about the other 40 he thinks I owe as well and worst case the 50 he tacked on as well. So I'm basically out 100 with no gain from it since he feels like I didn't pay him back fully. Next thing I know he's bruising another knuckle on my face lol. (He has shown me his knuckles many times and clearly has to rough up his sellers quite a bit to keep them in line - or maybe it's because he performs similar \"fronts\" with them and they have no way to make enough to pay it back. I could see that happening like here buddy take this bag oh btw it's a half-zip you owe me!!!11!)", "2_Subreddit": "opiates"}], "7mciaf": [{"0_Title": "Christmas withdrawals", "1_Text": "Totally agree with only paying back what I actually owe except in this particular case I don't know if there's any point. For example let's say I throw him $100 to be generous considering we had originally talked about a 300 bag. At minimum he is going to be upset about the other 40 he thinks I owe as well and worst case the 50 he tacked on as well. So I'm basically out 100 with no gain from it since he feels like I didn't pay him back fully. Next thing I know he's bruising another knuckle on my face lol. (He has shown me his knuckles many times and clearly has to rough up his sellers quite a bit to keep them in line - or maybe it's because he performs similar \"fronts\" with them and they have no way to make enough to pay it back. I could see that happening like here buddy take this bag oh btw it's a half-zip you owe me!!!11!)", "2_Subreddit": "opiates"}], "7ocnpv": [{"0_Title": "The sixth sense for opiates", "1_Text": "Totally agree with only paying back what I actually owe except in this particular case I don't know if there's any point. For example let's say I throw him $100 to be generous considering we had originally talked about a 300 bag. At minimum he is going to be upset about the other 40 he thinks I owe as well and worst case the 50 he tacked on as well. So I'm basically out 100 with no gain from it since he feels like I didn't pay him back fully. Next thing I know he's bruising another knuckle on my face lol. (He has shown me his knuckles many times and clearly has to rough up his sellers quite a bit to keep them in line - or maybe it's because he performs similar \"fronts\" with them and they have no way to make enough to pay it back. I could see that happening like here buddy take this bag oh btw it's a half-zip you owe me!!!11!)", "2_Subreddit": "opiates"}], "7xumfr": [{"0_Title": "The worst part about addiction for me...", "1_Text": "Totally agree with only paying back what I actually owe except in this particular case I don't know if there's any point. For example let's say I throw him $100 to be generous considering we had originally talked about a 300 bag. At minimum he is going to be upset about the other 40 he thinks I owe as well and worst case the 50 he tacked on as well. So I'm basically out 100 with no gain from it since he feels like I didn't pay him back fully. Next thing I know he's bruising another knuckle on my face lol. (He has shown me his knuckles many times and clearly has to rough up his sellers quite a bit to keep them in line - or maybe it's because he performs similar \"fronts\" with them and they have no way to make enough to pay it back. I could see that happening like here buddy take this bag oh btw it's a half-zip you owe me!!!11!)", "2_Subreddit": "opiates"}], "7y3x5w": [{"0_Title": "Why do so many people smoke ECP?", "1_Text": "Totally agree with only paying back what I actually owe except in this particular case I don't know if there's any point. For example let's say I throw him $100 to be generous considering we had originally talked about a 300 bag. At minimum he is going to be upset about the other 40 he thinks I owe as well and worst case the 50 he tacked on as well. So I'm basically out 100 with no gain from it since he feels like I didn't pay him back fully. Next thing I know he's bruising another knuckle on my face lol. (He has shown me his knuckles many times and clearly has to rough up his sellers quite a bit to keep them in line - or maybe it's because he performs similar \"fronts\" with them and they have no way to make enough to pay it back. I could see that happening like here buddy take this bag oh btw it's a half-zip you owe me!!!11!)", "2_Subreddit": "opiates"}], "7yf6rt": [{"0_Title": "Regarding fentanyl warning posts", "1_Text": "Totally agree with only paying back what I actually owe except in this particular case I don't know if there's any point. For example let's say I throw him $100 to be generous considering we had originally talked about a 300 bag. At minimum he is going to be upset about the other 40 he thinks I owe as well and worst case the 50 he tacked on as well. So I'm basically out 100 with no gain from it since he feels like I didn't pay him back fully. Next thing I know he's bruising another knuckle on my face lol. (He has shown me his knuckles many times and clearly has to rough up his sellers quite a bit to keep them in line - or maybe it's because he performs similar \"fronts\" with them and they have no way to make enough to pay it back. I could see that happening like here buddy take this bag oh btw it's a half-zip you owe me!!!11!)", "2_Subreddit": "opiates"}]}]}]}