{"ErisDoe": [{"0_comments": [{"d7sfz0b": [{"0_Comment Submission": "Dude who I used to be friends with and haven't spoken to in months sends me a dick pic", "1_Text": "I am late, but I know a woman who saves unsolicited dick pics. When some guy sends her a new unsolicited dick pic, she sends them a random saved one in return. Usually stops it.", "2_Subreddit": "OopsDidntMeanTo"}], "d7vr4n7": [{"0_Comment Submission": "LPT Request: how to get rid of the shitty feeling after a nap", "1_Text": "Once I figured out how to use melatonin properly, as in the right dose and the right amount of time before bed, I was able to fall asleep pretty quickly most nights. Before that, my entire life I would take an hour to fall asleep, at least. I also cut out all caffeine in the late afternoon and evening. But I can now go from reading on a tablet to laying in bed, to falling right asleep. It does not leave me groggy in th morning at all, either.", "2_Subreddit": "LifeProTips"}], "d83ojqb": [{"0_Comment Submission": "Items found while dog walking. Details in comments.", "1_Text": "Sorry for the late response. Well, Vodou can be said to be morality based, but it is the morality that comes from people who often have to struggle just to eat. So whereas in neo-Paganism you will find a lot of looking down upon things like works to get a partner back, in Vodou that would not be as frowned upon, not at all. So there is that. You can't really get a good understanding of it by looking at it through an American lense, for example. You have to understand it in context. It is Haitian.\n\nIt is a religion. In the religion there is one God, and that God is far removed so the loa, the spirits, are intermediaries. Some spirits are very \"cool\", and these tend to be older and come from Africa. They are more forgiving. Some loa are \"hot\". These are harder to deal with and more dangerous, but any of them can be dangerous. Some of them are so hot that they would be what one might call \"evil\". But this get very complicated because there are thousands of loa and a particular loa may have a version in different families, such as Radha (cooler) and Petro (hotter). \n\nThere are con artists in Vodou, as in most religions and spiritual paths. \n\nAt is very basic level, Vodou is service to the spirits, the loa. Some just do that, and for an initiate this is often enough. If one serves the loa they can be asked for assistance. But it is also a healing practice. It is also about the Earth and the connection with the Earth. Often the healing involves a vast knowledge of the properties of various plants. Then there are those who do work within Vodou beyond healing. Some will generally only do helpful work, and that can be for various reasons. Remember, you can't really apply a non-Haitian values system to Vodou, at least to most initiates. Then some who do work within Vodou will do what you might call \"darker\" work. And that can get very \"dark\". \n\nSome who engage in the work are initiates, and some are not. But Vodou involves working with spirits, so how they \"get\" spirits to work with might be considered \"dark\" if they are not given to them through Kanzo/initiation.\n\nI feel like I am not giving you a good answer, or at least not a simple one. It is pretty late and I am tired so that is not helping.  The short answer would be that yes, it can have different sides such as a \"darker\" side. There are different aspects of it as well. It is hard to answer about what is common though, because there is no central authority, and every Vodou House will do things at least a little differently, and some do things very differently from each other. Some houses are more hot than others and work with loa that are more hot. But in general, at least in Haiti, I see mostly people using it to improve their lives. Mostly. Some also won't hesitate to use it to hurt others as well. And given how common Vodou is in Haiti, it is a fair risk, if you are concerned about such things.\n\nNew Orleans Voodoo is something different.", "2_Subreddit": "creepy"}], "d83omrj": [{"0_Comment Submission": "Items found while dog walking. Details in comments.", "1_Text": "Oh, and the djevo is the initiatory chamber. If someone says they have passed the djevo, that means they have undergone initiation. It is lengthy and intense.", "2_Subreddit": "creepy"}], "d96bmpw": [{"0_Comment Submission": "If I had a dollar for every time a person over 40 said my generation sucks, I'd have enough money to buy a house in the economy they ruined.", "1_Text": "Yes. Still paying student loans. I thought about it recently and had to go lay down. My father was a blue collar factory worker. My mom was a utility company service rep. I am a lawyer. They bought their first house and retirement condo with cash. I go nowhere and buy almost nothing and could never do that. I think it is because my mom started to work before the economy adjusted to dual-income families. Either way, it is a bit depressing when I think about it.", "2_Subreddit": "Showerthoughts"}], "dcwqodw": [{"0_Comment Submission": "Black men assault White man for voting Trump", "1_Text": "Late, but that's called the \"academic definition\" of racism. If I recall correctly it popped up for the first time in the 1970's but didn't really go far. I was a poli sci major in undergrad and heard a lot of liberal theories but that was not one of them. Then it came back around within the last 10 years or so. The dictionary still defines racism in the normal way. The dictionary definitions change sometimes, I have noticed, but this hadn't changed when I last looked a couple of years ago. \n\nAn interesting example is a group of Black Americans terrorizing a group of white people in a cafe and they trash the place a bit. Then at one point they yell about how it is not racist because back people can't be racist.", "2_Subreddit": "PublicFreakout"}], "df48yob": [{"0_Comment Submission": "Can you change your temperament with jumping?", "1_Text": "Respectfully to all perspectives expressed here, The Redditor who created the posts about the glasses method and who is a mod here I think, whose username includes \"George\", states that belief is not a requirement in a post that is not all that far above this one. He states that \"belief\" was deliberately not included in the 2 Glasses or the Owls. You may wish to look for his comment on the above post in which he discussed this.", "2_Subreddit": "DimensionalJumping"}], "dfedaum": [{"0_Comment Submission": "Have you ever (correctly) had a gut-feeling to dislike someone who, on the surface, was a cool person that everybody else liked? What's that story?", "1_Text": "Who are these shy and demure-seeming \"Anglo Saxon\" women who are cheating every chance they get? That is really ignorant.", "2_Subreddit": "AskReddit"}], "di5nlv4": [{"0_Comment Submission": "I don't believe but willing to try because a friend.", "1_Text": "Reminds me of Marble Hornets with the static. Him bringing Freya on when she first posted to NoSleep about her account and NoSleep is fiction totally blew it for me.", "2_Subreddit": "BlackEyedKidsStories"}], "dj8543q": [{"0_Comment Submission": "I don't believe but willing to try because a friend.", "1_Text": "Her user name is Freyaforkelsey. I will see if I can pull the story.", "2_Subreddit": "BlackEyedKidsStories"}], "dj85c06": [{"0_Comment Submission": "I don't believe but willing to try because a friend.", "1_Text": "https://www.reddit.com/r/nosleep/comments/623k84/mysterious_case_of_woman_22_abducted_from_rave_in\n\nHere is her Nosleep story.", "2_Subreddit": "BlackEyedKidsStories"}], "dwoovsr": [{"0_Comment Submission": "Has anyone heard of the Bernese method of induction?", "1_Text": "I know this is old. But so many are afraid of suboxone. A bad experience with precipitated withdrawal can give someone the equivalent of post-traumatic stress especially if it sticks around for hours and hours and hours. Because you don't see it coming and then all the sudden you are in a hell you never imagined.\n\nI had thought something like this would work. But I didn't know how and I tried to get started with it a couple of times and then just went back to using dope. So I googled it and found that same study. There is a table in it showing dosing. \n\nMy partner got a hold of some really bad stuff and ended up in ICU. Tested to have all kinds of weird shit in it. Benzo. Opiate. Even suspected flakka or k2. So be careful out there. But the hospital stay cleaned him up. I need to get clean now too. I do not want to drag him down and I know realistically because we've been living this way for years that if I don't get myself together it's only a matter of time before he's right back here with me. So I'm trying this again.\n\nThis is where I am. I started with a 2 mg strip of suboxone/naloxone and cut it into tiny tiny pieces. Took .25 mg in the morning the first day. .50 the second day. .75 the third. Then 1. Then 1.5. Then got stuck at 1.75 where I couldn't quite get the two for a couple of days without triggering the edge of precipitated withdrawal. I was using the whole time scramble caps sniffed.\n\nI got up to 2. Now I am up to about 2.5 mg. (I am using the 8 mg strips because I get less of that nasty taste, although I did cut up a 2 mg strip to add the .25's.) And I realized I misread the table for the first study which most closely matches my situation. It's supposed to be taken in 12 hour intervals, the suboxone, I think. So today I'm going to start the evening dose and titrate that up. Correct me if I am wrong. But based on the text, which states 12 hour intervals, and the table, which seems to indicate two doses after a couple of days I think I am correct.\n\nA few tips. Take it in really tiny bits because then if you trigger something you can feel it, and if you've been through precipitated withdrawal before you know what it feels like. And you can feel just the edge of it and get a handle on it before it gets worse. Don't put yourself through hours of Hell by jumping to one whole milligram to start, I wouldn't suggest. They don't do that in the study.\n\nIf you can start with the 2 milligram strip which are available that's really helpful. Obviously I have a lot of available to me I'm lucky. I find they sell for cheaper and they're really good when you're tapering up or tapering down.\n\nAlso I found this out the hard way and put myself through a few hours of hell. Do not take dope within an hour of taking Suboxone. It can trigger precipitated withdrawal because the Suboxone isn't settled in yet. I think what happens is the dope goes in more quickly than the Suboxone so the dope goes in the receptors and then it gets thrown out pretty quickly by the opiate in Suboxone  and that's what does it.  It was not just upping my dose of Suboxone too quickly because I had been at that dose for a few days when I did that. So that wouldn't have happened. It'll come on slow and take about an hour and then you'll be in Hell pacing the floor pouring sweat hurling and s******* your guts out. I'd say ideally wait 2 hours at least. I know people might want to argue with me on this but I lived it so I know. I had to miss work and everything, it was sheer hell and I was so shocked. Thinking I was so safe. This was on one of my earlier attempts at this. Learn from the hell I put myself through. Benefit from  me using my body as a science experiment. Wait at least an hour. Preferably 2. \n\nAlthough dope can rescue you from PW. That is why you titrate so slowly, because the PW will be minimal and something you can tolerate for an hour or two. In my case I get the edge of that warm flush that means I am close to Hell. Just the edge. And a bit anxious. \n\nEdit - Want to also add to make sure you also titrate down your dose of your opiate drug of choice too, or else you could just give yourself a worse habit. That's the deciding point right there. It's easy to start this method because you still have the comfort of using but you get to that point you've got to cut down. And then at that point you've got to stop. Or you'll just make things worse.\n\nIf anybody has been successful with this and switched over I would really love to hear your story. I think it could help a lot of people get clean. If that's what they want. No judgement.\n\nEdited for typos and clarification\n\nAnd to add\n\nTl;Dr This is working for me so far, no PW, I gave my dosing schedule and do not take dope right after suboxone or you can trigger PW.", "2_Subreddit": "suboxone"}], "dwoquej": [{"0_Comment Submission": "Has anyone heard of the Bernese method of induction?", "1_Text": "For reference my habit was 1 g a day at most. The chick in the case study was at 4 grams a day if I recall.", "2_Subreddit": "suboxone"}], "dwp37ma": [{"0_Comment Submission": "Me in withdrawal (me rn)", "1_Text": "I feel you. I really feel you. I hope it gets better soon.", "2_Subreddit": "opiates"}], "dwp3ma9": [{"0_Comment Submission": "Prices in your state", "1_Text": "About a buck a g. And it is getting bad out there. Mid east coast in a heavy dope city. Shit laced hard with synthetics. Good thing is you can go days without getting sick. Bad thing is if you are trying to go to subs it is almost impossible. It is also now starting to be laced, if you go to a sketchy source, with weird shit. Like benzos. Random opiate. And k2 or flakka. Yes, seriously. It is about 5 percent of the stuff out there but if you get it, God help you. It will mean a trip to the ER and ICU on a $20 bag, sniffed. Stay safe. Test bumps.", "2_Subreddit": "opiates"}], "dwp5bbw": [{"0_Comment Submission": "got a new stamp that made me feel like I just smoked a bowl of weed..?", "1_Text": "Yes. It is going around in my area. East coast. Mid east. Noticed it the first time around a year ago. Word is it is cut with k2 or flakka. It is nasty, awful shit. I actually had someone go to the ER and ICU because of this, so be very careful. It is not your imagination. It is real. And the hospital people confirmed there was a bad mix in there - some benzo and a bit of opiate as well as likely something like flakka. Previously it was just the weed high, and I hate weed. This time the guy was hallucinating and could not stop eating, even non-food things. And I have 6 years in so I know what I am talking about.  This happened about 2 weeks ago.", "2_Subreddit": "opiates"}], "dwp5f69": [{"0_Comment Submission": "got a new stamp that made me feel like I just smoked a bowl of weed..?", "1_Text": "I have been trying to warn people that this very very bad shit is out there now to reduce harm. I hope you take this seriously. This stuff is bad and no joke at all. Please do a test bump. I have been there personally and can vouch OP is not imagining things.", "2_Subreddit": "opiates"}], "dwp5u28": [{"0_Comment Submission": "got a new stamp that made me feel like I just smoked a bowl of weed..?", "1_Text": "I remember the first time I got stuck with that I wondered the same thing. Weed has a very specific effect on me and I felt that the kind of curtain come down all of the sudden while I was typing and got that trippy feeling and I was thinking what the hell is this. Is weed in powder form? How did someone even do that?\n\n I hate weed. Hate it. Makes me paranoid every time. I wish I liked it.\n\n And then I wasn't sure because I was paranoid I thought maybe I got that elephant tranquilizer s*** carefentanil. I wasn't sure how long it would last I wasn't sure how bad it was going to get I wasn't sure if I could take a benzo to knock myself out. (And what I found is at that point it was K2 mixed in of some sort. They've moved on to mixing flakka with a benzo to take the speed away. Luckily I have not had that.)  But I was able to take a benzo to knock myself out and sleep it off because I find that experience miserable. It lasted for about 4 hours the first time it happened before I knew that. And I want to add I wouldn't recommend mixing benzo with dope even a little bit of dope because that can kill you too. Just as an aside. I just couldn't take the panic attacks that were rolling in because I already get them and so adding me to it just made it a million times worse. Especially synthetic s***.\n\nI ran into it again a couple times after that. And then someone I know got the other stuff and that was completely off the hook, so they're experimenting even more now. The regular guys that I usually deal with are fine and it is still safe. I have a very good situation, but when we go outside of that it's very high risk around here and I wouldn't f*** with it. I'd say it's about 5% of what I find. And if I was going to say how much of it is like that outside of my regulars maybe 15 or 20%\n\nSorry to keep going on but I have been searching to try to find similar experiences online and I see people getting laughed at when they mentioned what happened to them and accused of not knowing what they're doing. And it is very real. And it is very serious. \n\nOnce they start mixing that stuff you don't know what you're going to get because you're not getting what they're saying it is. And often the guy you deal with doesn't really know but the people above him do. And it's really awful. The next level of that landed someone close to me in the Intensive Care Unit because it was that bad. Is that weird combination just shut him down completely. He almost died. On a $20 bag sniffed. So sorry to go on like this but if I can save anybody from that experience I'm going to keep talking about it because it's very real and it's very dangerous", "2_Subreddit": "opiates"}], "dwp8bdc": [{"0_Comment Submission": "I’m sick and tired of this, and nobody wants to help me. I’m a grown ass man and I’m crying right now.", "1_Text": "Immodium/loperamide does work for a lot of people. Google loperamide to treat opiate withdrawal. Look on forums where actual junkies post experiences. Because you'll see some really negative stuff but you'll see some people who have tried this talking about how this saved them. There's even one forum post out there that you should find pretty easily if you play with that search where they talked about how they were able to taper from loperamide and get clean. I would be very concerned to try it but maybe a little to ease your symptoms would be at least a good thing. The dose for total withdrawal symptom control is a heck of a lot. I took maybe 40 mg. They takes a lot more. They bought the bulk bottle at a big store and used that. \n\nBut it is an anti-diarrheal drug. So you might want to take a stool softener with it. The guy who posted that description (as a heads up to others about a potential tool to help people who cannot tolerate or afford suboxone to get clean) I think said that in his experience the constipation wasn't too bad. Like Oxy, and he took a lot. But then I've tried loperamide it didn't really work for me. But I didn't try it in the super high doses. Maybe 24 2 mg pills, but that is nothing compared to what people take to help with withdrawal. Also make sure you read the risks. Like \"mega colon\".\n\nI'm not recommending that you do it. But it is something that might take away the worst of the withdrawal. Also be aware that the idea behind it is that it doesn't cross the blood-brain barrier but then it kind of does and if you drink grapefruit juice that makes it ctoss the barrier more. Long story short if it's helping you you can probably get precipitated withdrawal from it just like you can with other opiates if you switch to suboxone. So I don't know that that's a good thing. It's also probably going to be restricted soon because of this use. \n\nI am not recommending it. Try looking into it. See if it makes sense to you. At the very least it can help with the diarrhea part. And it might be that you can get total withdrawal ease especially if you mix it with some grapefruit. I would take potassium too to help with the restless legs though.", "2_Subreddit": "opiates"}], "dwp90lr": [{"0_Comment Submission": "Help", "1_Text": "Could you have possibly triggered a mild case of precipitated withdrawal? Does the withdrawal feel worse than usual? It's possible that what you did was trigger a mild precipitated withdrawal by taking the Suboxone too soon, but three-quarters of a strip is about 6 mg if you're talking about an 8 mg strip. That should still block the effects of the dope. But the dope could still break through withdrawal you just might need a lot more. And then you're getting into you overdose territory.\n\nKeep in mind that a lot of dope is cut with synthetic opiates now and they have a longer Half-Life so the time you have to wait to take suboxone is increased over if you were just using dope. And it's not like we get told this when we buy.", "2_Subreddit": "opiates"}], "dwp9ztn": [{"0_Comment Submission": "Help", "1_Text": "Yeah. I am thinking that is what happened. I hope you get to feeling well soon because I really know that feeling where you cut off a finger to not feel that way. Like I said dope can break through Suboxone but you're really risking an overdose and I don't even want to go there as far as saying one way or another. Probably my guess would be that what you did wasn't strong enough to break through it. Now granted, at 6 mg it won't make you high but it can sometimes take at least the worst of withdrawal away. I just think that's so risky.\n\n The good thing is if you look at the \"Bernese method\", although that's not what you did, once you have that Suboxone opiate in you you should be able to take more within 24 hours without making it worse. But probably don't take more than 6 mg in fact you should probably take less than 1 mg to start. I'm not really sure. Because the Bernese method doesn't address this at all but given that you can add more because you already have a level of it in you, per the method and my experience, it would seem likely even though you took more dope. But I would cut it up in tiny pieces. Then take just a little bit at a time and watch yourself carefully . \n\nLike if you still feel sick 24 hours after your last Suboxone, try half a mg and watch how you feel. If you start getting that warm flush or feel a little more nauseous or anything to stop. Because 6 mg is a big initial dose. I mean really big. Even one mg isn't a safe initial test dose IMO despite people always saying it is. I wouldn't start with more than half a milligram and really a quarter of a milligram is better. The doctors behind the case study used an initial .20 dose. Given the hell you can put yourself through if you goof it up. This way you can feel the edge of those initial symptoms, you can feel if you get the edge of it and stop.\n\n\nJust as an aside in the interest of harm reduction. If you ever take Suboxone and don't get relief right away or you're trying to Bernese method of induction, do not take dope within an hour or preferably two hours of using Suboxone. The Suboxone seems to fill the receptors more slowly over the course of an hour or two. The dope tends to go in quickly. I have triggered precipitated withdrawal this way. What I suspect happened was it the joke went right in the receptors that the Suboxone opiate had not filled yet and made them nice and heavy. Then the Suboxone opiate went in and kicked it out and that's what did it. Just as an aside.\n\nMy sources are a publicly available study published in a peer-reviewed journal about what's called the Bernese method. They even have a table in there. And also my own experiences going through this so many times I should be smacked in the head for being so stupid. But I'm doing the Bernese method now and hopefully this is the end of it.", "2_Subreddit": "opiates"}], "dwpa1lc": [{"0_Comment Submission": "Help", "1_Text": "Sorry you said 1/4, so that is 2 mg. That makes more sense because that is way higher than I would ever start with especially with that sort of a turnaround time but it's not so bad that it should have thrown you into a worse situation. I apologize for misreading your initial post", "2_Subreddit": "opiates"}], "dwpbdqa": [{"0_Comment Submission": "got a new stamp that made me feel like I just smoked a bowl of weed..?", "1_Text": "I really do not know what the peoole who cut with all of this weird shit are thinking. I hate that pot feeling.\n\n I am glad you just got that stuff. Whatever my friend got was so freaking bad, and the dude called him to test something, saying some bs like  it could be called raw because it is strong like raw but it is not raw. My friend, genius, hit it all in one go and was legit in ICU. Kept getting hit with Narcan. Maybe 5 times. The first time he came out of it but still did not know who I was. Then he went out again and the Narcan just made him restless in his \"sleep\". They gave him a test and found all that weird stuff in there. And I know he doesn't take benzos for example. Yeah he was positive for that and for some other stuff . He was hallucinating so badly that when they put a cotton ball in his hand  for a sugar test  his eyes got as big as saucers and he tried to eat it . I think he thought it was a marshmallow .  Luckily he believed me when I told him he couldn't eat it and then a nurse came over and reinforced that.\n\n He was so bad they couldn't send him to a regular Hospital unit because his systems kept crashing. They had to send him to intensive care for a day or two and then a few days after that on a regular unit. They treated him for withdrawal with Clonidine and gabapentin and loperamide but they wouldn't give him a lot of that because it's still an opiate. And ibuprofen. I guess the combination of the Narcan kicking some of it out and not being  really conscious for a couple of days helped him and now he's clean. But the point is that it almost killed him. And it was a very small amount. And hehas had a habit for years so his system is not ooiate naive.\n \nBut, this *really* weird stuff is very new. The other stuff turns up here fairly often for about a year or so. Like I said I'm sorry to go on about it so much but when I look to see if other people have this experience people who get this experience are usually told they're imagining things and they just got good shit, and it's not that at all. It's something else and it's potentially bad. \n\nHow long did it last for you? The feeling like it was a pot high?", "2_Subreddit": "opiates"}], "dwpbh0l": [{"0_Comment Submission": "got a new stamp that made me feel like I just smoked a bowl of weed..?", "1_Text": "I really do not know what the peoole who cut with all of this weird shit are thinking. I hate that pot feeling.\n\n I am glad you just got that stuff. Whatever my friend got was so freaking bad, and the dude called him to test something, saying some bs like  it could be called raw because it is strong like raw but it is not raw. My friend, genius, hit it all in one go and was legit in ICU. Kept getting hit with Narcan. Maybe 5 times. The first time he came out of it but still did not know who I was. Then he went out again and the Narcan just made him restless in his \"sleep\". They gave him a test and found all that weird stuff in there. And I know he doesn't take benzos for example. Yeah he was positive for that and for some other stuff . He was hallucinating so badly that when they put a cotton ball in his hand  for a sugar test  his eyes got as big as saucers and he tried to eat it . I think he thought it was a marshmallow .  Luckily he believed me when I told him he couldn't eat it and then a nurse came over and reinforced that.\n\n He was so bad they couldn't send him to a regular hospital unit because his systems kept crashing. They had to send him to intensive care for a day or two and then a few days after that on a regular unit. They treated him for withdrawal with Clonidine and gabapentin and loperamide but they wouldn't give him a lot of that because it's still an opiate. And ibuprofen. I guess the combination of the Narcan kicking some of it out and not being  really conscious for a couple of days helped him and now he's clean. Interestingly, the dope around here is so full of synthetics that withdrawal takes days to kick in. But the point is that it almost killed him. And it was a very small amount. And he has had a habit for years so his system is not opiate naive.\n \n\nUnlike the k2-feel stuff, this *really* weird stuff is very new. The other stuff turns up here fairly often for about a year or so. Like I said I'm sorry to go on about it so much but when I look to see if other people have this experience people who get this experience are usually told they're imagining things and they just got good shit, and it's not that at all. It's something else and it's potentially bad. \n\nHow long did it last for you? The feeling like it was a pot high?", "2_Subreddit": "opiates"}], "dwpd28b": [{"0_Comment Submission": "Best shit for the newbie?", "1_Text": "If you do not have a habit you are not lost. Not yet. Please walk away. Please. I cannot tell you how often I have wished I never started. Please just walk away from it. I really wish someone had slapped me senseless, or I had gotten hit by a car, or almost anything had happened other than what did happen on the day I decided to \"up my game\". \n\nNo one thinks it will happen to them. No one. We all think we will be the ones who just use from time to time and who do not turn into junkies. But every single junkie was wrong about that. Is it really worth it? Really? The high risk of losing everything? Never being able to go on vacation or buy yourself anything nice if you can even maintain a roof over your head? How about having a hard time keeping a job because you're sick in the morning and need to get yourself well? And these outcomes are the best ones, and are if you're pretty functional. How about instead of that, overdosing perhaps repeatedly? Dying or ending a brain-damaged? Catching hep c or hiv? How about people who love you losing a l\npart of their lives when you OD and die, crying over your coffin? \n\nIs the very high risk of any of this worth getting high? You are not smarter than everyone who is an opiate addict. You are not tougher. You are not more resistant to addiction. We *all* thought it would not be us. And you might see some of the upbeat posts, but what you don't see as much of are those times when we are by ourselves feeling like we would do anything to \"fix it\". When we hate ourselves with a passion. When we hurt the people who love us horribly. When we pawn our jewelry or our t.v. set, or worse, pawn someone else's tv set.\n\nYou think you would never do that. But you would. Because withdrawal is a hideous beast. Every nerve ending is on fire. It is agony. Puking and shitting. You cannot sleep. You cannot even sit still. Your body feels like dying but your nerves make you get up and pace the floor. There is no simple cure. You have to get terribly sick just to safely take suboxone. And suboxone is its own nightmare. \n\nBut that will never happen to you, right? It would never happen to me, either. Yet here I am. If your friends are pushing you to do this then get new friends. \n\nLook, got to a marijuana forum. You will not see people responding like this. This is a bad road to go down.", "2_Subreddit": "opiates"}]}], "1_submissions": [{"3nbp3t": [{"0_Title": "The BEKS didn't get me but their dad killt me and my cat is killt", "1_Text": "I am late, but I know a woman who saves unsolicited dick pics. When some guy sends her a new unsolicited dick pic, she sends them a random saved one in return. Usually stops it.", "2_Subreddit": "shittynosleep"}], "4jigqh": [{"0_Title": "Yellow Cheese Eater", "1_Text": "I am late, but I know a woman who saves unsolicited dick pics. When some guy sends her a new unsolicited dick pic, she sends them a random saved one in return. Usually stops it.", "2_Subreddit": "Humanoidencounters"}], "60bqwx": [{"0_Title": "Jumped using 2 glasses into abundance.", "1_Text": "I am late, but I know a woman who saves unsolicited dick pics. When some guy sends her a new unsolicited dick pic, she sends them a random saved one in return. Usually stops it.", "2_Subreddit": "DimensionalJumping"}]}]}]}