{"Mr_Sleepy_Owl": [{"0_comments": [{"dw9uv80": [{"0_Comment Submission": "Benzos in drug tests", "1_Text": "4 days is usually the average for the Alprazolam to leave your system for a urine test.\nI'm pretty sure Etizolam will show up on a urine test.\n\nThere are some good replacements but without a doctor those will be harder to come by. But if you can see a doctor I would try to get something like Gabapentin (Neurontin) or even Lyrica (Pregabalin). Those would be my first choice. If not those maybe even Baclofen would help. Vistaril helps some people too but its like a prescription benadryl essentially.\n\nEdit: If you can only obtain medications illegally, I would highly suggest Kratom. It's legal in most states and you usually receive your order in 2 days. It would be very helpful to where you may feel no withdrawals. Some people have used it to come off of benzos completely.", "2_Subreddit": "benzodiazepines"}], "dw9zdom": [{"0_Comment Submission": "Benzos in drug tests", "1_Text": "I just googled if you can get a prescription without health insurance and this came up.\n\n\"Can You Fill A Prescription Without Insurance? If you find yourself uninsured or under-insured (meaning not all your medications are covered) you can always fill your prescriptions at any pharmacy and pay cash or use a discount drug card to help reduce your prescription medication costs.\"\n\nSo I would still go to the doctor then if you have the money to pay for all the costs.\nThe prescription can be pretty expensive without insurance.", "2_Subreddit": "benzodiazepines"}], "dw9zn1w": [{"0_Comment Submission": "Kratom and Klonopin safety", "1_Text": "They both will synergize well, but you may want to lower your doses if you have never mixed them together at the same time. \n\nBut as long as you know your tolerance to each you should be fine and feeling pretty good as well haha.\n\nBe safe and have fun :)", "2_Subreddit": "benzodiazepines"}], "dw9zt8l": [{"0_Comment Submission": "Teenage Fake Xanax Epidemic - VICE", "1_Text": "Just the title is cringy lol. It just screams ignorance to me.", "2_Subreddit": "benzodiazepines"}], "dwa03ys": [{"0_Comment Submission": "Using Kratom as replacement for Benzos?", "1_Text": "I would definitely suggest ordering some kratom online. It will be much more effective and better all around even if you only use it for a short period to taper off benzos.\n\nKratom will be a big help but I would not stop the benzos cold turkey. I would do a taper to avoid the harsher withdrawals or possibly seizures. It will also be better for your brain and body to do a taper rather than cold turkey.", "2_Subreddit": "kratom"}], "dwa0k4f": [{"0_Comment Submission": "\"Naloxone\" Breaking the Stigma", "1_Text": "If you're addicted to opiates then yes. It will send you into instant precipitated withdrawals. It knocks off all the opiates off the receptors almost instantly.", "2_Subreddit": "opiates"}], "dwdbdmg": [{"0_Comment Submission": "Getting a script - do's and dont's", "1_Text": "> I'm hoping to walk out of there with a xanax script, and something for sleep.\n\nI highly doubt this would happen. My guess is you would get something like an SSRI or SNRI and for sleep maybe Trazadone or Seroquel.\n\nYou usually will have to try the shitty stuff before you get anything with abuse and addiction potential.", "2_Subreddit": "benzodiazepines"}], "dwdnu9m": [{"0_Comment Submission": "What brand of Klonopin are you on?", "1_Text": "Roche", "2_Subreddit": "benzodiazepines"}], "dwe56hf": [{"0_Comment Submission": "Have I been abusing diazepam?", "1_Text": "i would try a small taper for a week or two until you feel comfortable without the benzos.\n\nStopping cold turkey can cause bad and serious side effects like seizures or even death.", "2_Subreddit": "benzodiazepines"}], "dwe58uw": [{"0_Comment Submission": "How can I tell if my xans are pressed?", "1_Text": "If you bought them on the street.", "2_Subreddit": "benzodiazepines"}], "dwe5e93": [{"0_Comment Submission": "Ran out of script early.. withdrawals likely?", "1_Text": "Yeah. It wont be fun.\n\nSometimes you can get a refill a few days early.\n\nI would not keep that up. You're only going to screw yourself in the end.\n\nThis just sounds like the beginning of a benzo addiction to me.", "2_Subreddit": "benzodiazepines"}], "dwe5n3q": [{"0_Comment Submission": "Withdrawals (Alcohol) Help please", "1_Text": "Baclofen is your answer. (Google Baclofen for alcohol withdrawals)\n\nIt's way more easy to get prescribed. It's a muscle relaxer but works amazing for alcohol withdrawals.\n\nI used it to quit a 6 pack of beer a day habit.\n\nI used it only for a week or a little more for the alcohol withdrawals to be gone.\n\nDon't trade one dependency for another.", "2_Subreddit": "benzodiazepines"}], "dwe5y9a": [{"0_Comment Submission": "Ran out of script early.. withdrawals likely?", "1_Text": "Oh okay. Well I have been in your exact situation to be honest.\n\nI ran out of my xanax the first few times a week or two early.\n\nYou will feel some withdrawals but nothing too severe, honestly nothing to worry about yet.\n\nIf you were on the clonazepam longer, It would be worse. But with only a month and a half it should be pretty minor.\n\nYou should be alright until your refill. It shouldn't be anything severe.", "2_Subreddit": "benzodiazepines"}], "dwi0bwa": [{"0_Comment Submission": "8mg orally Suboxone and Kratom", "1_Text": "For me when I was at 2mg suboxone it blocked the effects, so I would say it would.\n\nTry skipping your Suboxone dose and take some Kratom. It should work pretty well still and if you decide you want to take your sub still it should be fine.\n\nI've switched between Kratom and subs and even taken Kratom an hour or less before Suboxone and never got precipitated withdrawals.", "2_Subreddit": "kratom"}], "dwi15y4": [{"0_Comment Submission": "8mg orally Suboxone and Kratom", "1_Text": "24 hours would be best.", "2_Subreddit": "kratom"}], "dwnjjtf": [{"0_Comment Submission": "Happy Easter Speed Balling Br/opiates!!", "1_Text": "We have the same safe. haha", "2_Subreddit": "opiates"}], "dwp4als": [{"0_Comment Submission": "Maryland Sucks shitpost", "1_Text": "Sorry about that.\n\nThank you for letting me know.\nCould you delete the whole post for me?", "2_Subreddit": "opiates"}], "dwr99yz": [{"0_Comment Submission": "Temazepam", "1_Text": "If you plan on taking 15mg instead of 30mg for the next 7 days you should be alright.\n\nIn my opinion, you might experience slightly more insomnia but nothing crazy.\n\nI think you'll be okay.\n\nI've been on 60mg per night for a while and i've actually forgotten to take them a few times.\n\nI just felt a little anxious in the morning or had a little trouble sleeping.", "2_Subreddit": "benzodiazepines"}], "dwr9fj8": [{"0_Comment Submission": "Death from withdrawal", "1_Text": "You can probably be put on the 5th floor of a hospital and they would hopefully treat you with Diazepam or Lorazepam.\n\nIf you say you're afraid of what you might do or what might happen during the withdrawals they might at least take you for a 72 hour hold and keep you alive.", "2_Subreddit": "benzodiazepines"}], "dwrw9z8": [{"0_Comment Submission": "Does gabapentin affect the bioavailability of benzos", "1_Text": "Staggering the Gabapentin will give you a much better bioavailability rather than taking a big dose at once.\nEspecially for opiate withdrawals. I've had to do the same thing before.\n\nI would take 300mg every half hour or 45 mins with some soda. \n\nTaking an Aleve a couple hours before will also help increase the absorption of the Gabapentin.\n\n\nI'm not sure about how much it affects benzos but they seem to synergize well actually.\nI'm not on Gabapentin anymore but it used to go fine with any benzos, I never noticed any type of decrease in the benzos effects.", "2_Subreddit": "benzodiazepines"}], "dwtfhj9": [{"0_Comment Submission": "Does gabapentin affect the bioavailability of benzos", "1_Text": "It works really well for withdrawals, just stagger doses and eat fatty foods and soda.\n\nSince you have a benzo as well I think you can make it to the 48 hour mark fairly easily.\n\nTry to think positive about it. I know it's hard when you don't feel right.\nSometimes you might just be psyching yourself up about how bad things *could* be, rather than how they really are.", "2_Subreddit": "benzodiazepines"}], "dwuzppt": [{"0_Comment Submission": "The come up", "1_Text": "*fr*", "2_Subreddit": "opiates"}], "dwv2yl7": [{"0_Comment Submission": "Quitting lorazepam ~1mg/daily -- what should I expect?", "1_Text": "You could try try to take less Ativan in the mean time.\n\nTry to stick to .5mg if you can. Maybe even .75mg if .5mg feel too significant of a drop.\n\nIf you taper the Ativan I would try to taper down .25mg each week. Which should be pretty painless.\n\nYou could even try taking .5mg every other day instead of 1mg every day to slowly ween down.\n\nIt's more about which way feesl most comfortable for you. 1mg-1.5mg is a relatively low dose to begin with so you shouldn't have much trouble tapering/quitting in my opinion.\n\nIf you can and or decide to switch to Diazepam that would work also.\n1mg Ativan is equal to 10mg Valium.\n\nEither way I think you should be able to taper off fairly easy.\n\n\nI would definitely still talk with your doctor/psychiartist and tell them that you would like to taper off of the Ativan and would like to set up a taper plan. You can ask if they think a Valium taper would be necessary too.\n\nI hope everything works out for you!\nGood luck.", "2_Subreddit": "benzodiazepines"}], "dwvhc33": [{"0_Comment Submission": "Quitting lorazepam ~1mg/daily -- what should I expect?", "1_Text": "Melatonin would actually be a great substitute if that works for you.\n\nIt would be way better than taking Ativan, plus you can't really become addicted to Melatonin. So there would be no withdrawals to worry about with that.\n\nDon't go to fast with the Ativan taper if you don't feel comfortable dropping it to a lower dosage. But I would also agree with your doctor that the withdrawals from Ativan would be very minimal.\n\nAlso since its a pretty short acting benzo the main withdrawals will be over in 5-7 days.\n\nIf you're still tapering the Ativan i would still drop .25mg-.5mg each week.\n\nYou could also ask your doctor about Vistaril (Hydroxyzine). Its a prescription antihistamine that is good for anxiety and insomnia.\n\nIt's not a benzo but it definitely helps. Even if you only use it for a week or two for withdrawals it could make your taper a bit easier.", "2_Subreddit": "benzodiazepines"}], "dwxrgp4": [{"0_Comment Submission": "Fake Oxys Post ALERT", "1_Text": "Not saying they're not fakes. But the M and 30 don't always line up right on real M boxes.", "2_Subreddit": "opiates"}]}], "1_submissions": [{"85ulbz": [{"0_Title": "Triazolam (Halcion) or Temazepam (Restoril)?", "1_Text": "4 days is usually the average for the Alprazolam to leave your system for a urine test.\nI'm pretty sure Etizolam will show up on a urine test.\n\nThere are some good replacements but without a doctor those will be harder to come by. But if you can see a doctor I would try to get something like Gabapentin (Neurontin) or even Lyrica (Pregabalin). Those would be my first choice. If not those maybe even Baclofen would help. Vistaril helps some people too but its like a prescription benadryl essentially.\n\nEdit: If you can only obtain medications illegally, I would highly suggest Kratom. It's legal in most states and you usually receive your order in 2 days. It would be very helpful to where you may feel no withdrawals. Some people have used it to come off of benzos completely.", "2_Subreddit": "benzodiazepines"}]}]}]}