{"br0ken1985": [{"0_comments": [{"dwrkmii": [{"0_Comment Submission": "Posted awhile back from here. Still laughing.... lol", "1_Text": "Damn I always miss out. :-(", "2_Subreddit": "opiates"}], "dwrlh0j": [{"0_Comment Submission": "The things we pawn", "1_Text": "All of my firearms, except my daily carry Glock, have sentiment value. Were all gifts from now deceased loved ones so I could never pawn them. But they are without a doubt a quick way to have a decent come up. Guns are very very common here so quite often you'll see people getting their cars broken in to and have a gun stolen out their car. Not condoning stealing but I don't get why people leave their gun in their car when they are at home, inside their house.", "2_Subreddit": "opiates"}], "dwsg7jr": [{"0_Comment Submission": "Determination!", "1_Text": "Thank you for this information and his back story. This kid is my new hero. I'll think about Kamil the next time I begin to complain about absolutely ANYTHING.", "2_Subreddit": "blackpeoplegifs"}], "dwu6tij": [{"0_Comment Submission": "Clonidine", "1_Text": "It works on your sympathetic nervous sysyem which when this system is out of whack, can cause runny nosy, watery eyes, anxiety, temperature intolerance, and raised blood pressure. Most of those symptoms sound familiar? That's why it works so good for wds.", "2_Subreddit": "opiates"}], "dwu78fx": [{"0_Comment Submission": "I tossed my rigs tonight - Do the work and you’ll be blessed.", "1_Text": "I thought the same thing lol. I was like I hope no one is walking by outside the window.", "2_Subreddit": "opiates"}], "dwuv7bv": [{"0_Comment Submission": "Around 200 pressed busses, just woke up from a long blackout", "1_Text": "Yea dude I get 120 bars a month. It's definitely nice knowing you'll have some coming every month. Then with insurance it's $3 for 120.", "2_Subreddit": "opiates"}], "dwuvemm": [{"0_Comment Submission": "since I moved out here I been getting ripped off I met the nicest middle ever Today The dude drove 30 miles only asked $5 for gas and didn’t even touch the bags I threw him a bump but he didn’t even ask he younger like me and he like fishing fuck yeah the dope and the new homie got me feeling good", "1_Text": "I thought they looked huge too but must be picture, idk.", "2_Subreddit": "opiates"}], "dwuw37j": [{"0_Comment Submission": "Fentanyl is 1000xs stronger than morphine...", "1_Text": "I've read several papers on how those stories are BS. One cop said he had some powder on his uniform after an arrest and just brushed it off then ODed but tons of experts tore that apart saying how unlikely it was. I do believe the stories of people ODing when working in a closed room bagging up carfentanil but the consensus is that just touching fentanyl is very unlikely to cause an OD.", "2_Subreddit": "opiates"}], "dwuw884": [{"0_Comment Submission": "My dboy who sold me these bricks invited me into his trap house to party. I politely declined", "1_Text": "The pink bag makes yet another appearance lol.", "2_Subreddit": "opiates"}], "dwuwj2o": [{"0_Comment Submission": "The come up", "1_Text": "Right?! People just looking out for him but he ready to fight somebody haha", "2_Subreddit": "opiates"}], "dwuwkwl": [{"0_Comment Submission": "The come up", "1_Text": "Nah bro, didn't you read, he knows exactly what is in his shit every single time so stop riding his \"duck\".", "2_Subreddit": "opiates"}], "dwuwrvs": [{"0_Comment Submission": "JJ saves in miraculous ways", "1_Text": "Damn it's still snowing places? Been fucking 85 here for a couple weeks already. But it snowed for the first time in 9 years here this winter.", "2_Subreddit": "opiates"}], "dwuygly": [{"0_Comment Submission": "The come up", "1_Text": "Yea, almost like he's too proud to admit that maybe, just maybe, he can't identify a substance based on look and high alone. There are sooooooo many fentalogues out there now, each with their own high, duration, etc so they very well could have multiple that look and feel just like h. Have legs too, but are 50x+ stronger by weight. Plus, majority of these people don't want anything more than for OP to be safe and not die, yet he's steady raging.", "2_Subreddit": "opiates"}], "dwuyo4y": [{"0_Comment Submission": "JJ saves in miraculous ways", "1_Text": "Damn man that's nuts to me. But like I said, snow is rare here. It snowed twice this winter and the second time a record cold snap accompanied it and over 200 miles of interstate was closed for atleast 4 days. No clue how many smaller streets. Plus this was only from like 2 or so inches. To be fair, there probably isn't a single plow or salt truck in the entire state lol. In December it snowed and we got 3.5-4\" and that was tied for 2nd or 3rd most ever in my city if I remember correctly.", "2_Subreddit": "opiates"}], "dwuz84o": [{"0_Comment Submission": "How many of you succeeded at staying clean after being forced into a rehab?", "1_Text": "I can't answer your actual question but I can tell you how amazing methadone has been for me. Some people think it's the devil but for lots of people, it can be a life saver. Just never forget that it is still a strong, addictive opiod but can give you a MUCH more stable life where you can work on your underlying issues in the meantime. Then slowly taper off of It, when ready. If you read a horror story, i'd bet nearly all of them involve someone who tapered off too fast and/or jumped too high. Everyone I know who tapered slowly said they had very mild, if any, wd symptoms. Since methadone is a full agonist, it helped me infinitely more than Subs ever could. The data behind MAT show it has, by far, the highest success rate of any firm of treatment but for some reason has a horrible stigma, even among us drug users.", "2_Subreddit": "opiates"}], "dwuzbqf": [{"0_Comment Submission": "How many of you succeeded at staying clean after being forced into a rehab?", "1_Text": "I commented my suggestion for looking into methadone as well. Lots of people seem to think it's the devil but there seems to be a common theme with those people (ie tapered too fast, jumped too high, and/or weren't ready to truly quit using to begin with).", "2_Subreddit": "opiates"}], "dwv08jw": [{"0_Comment Submission": "The come up", "1_Text": "Yea, I mainly used pharmaceutical opiates (mostly fentanyl) for the majority of my 12+ year addiction but from what nearly everyone says, you might as well just assume the H that you get now days has fent in it. Nothing wrong with assuming so and being safe than to think you know everything. I used H several times but the last time was before you started hearing about people cutting it all with fent. \n\nI thought the same thing. Between his attitude and the incoherent texting, as you mentioned, I doubt many/any higher level plugs (who would make a good plug) would deal with that BS.", "2_Subreddit": "opiates"}], "dwv3cy1": [{"0_Comment Submission": "The come up", "1_Text": "Well from what I know, it's usually a dope/fent mix so they're taking shit dope and making it stronger by adding the fent. Just need a few specs per stamp or w/e to do the job. Another bad thing about this is yes, it would increase the amount of inactive cut in a bag since you don't need as much active ingredient. It also increases the chances of hot spots since you're talking about literal specks the size of grains of salt. Can be very hard to accurately mix that up where one stamp doesn't have 5 grains worth and another has 2. I've definitely seen and heard of people selling stuff as just fent, but in most cases, it was not pure fent because . 5g of pure fent could be quite a bit. \n\nI think most people still pay the same price but I think that's more because of dealers selling it as dope, not fent-laced dope. Some do it on purpose while some truly don't know it has fent in it if it's cut with fent before they get it. Thankfully, I've read that more and more people are adding dye to their fent to make it obvious when you get dope cut with fent because it will have bits of some wild ass color in it. And I guess some people are intimidated by the whole DNM thing while others feel they don't have the knowledge needed to do so (even though it's fairly simple once you get the first order out of the way). People are scared of getting ripped off, busted, etc. Plus us addicts aren't known for being the most patient of people so they'd rather go get something that is an immediate, for sure thing instead of ordering via a DNM then waiting days for it to arrive.\n\nOf course some BTH is cut with fent and I'm sure how often is and will continue to rise but it is much less common than in ECP. Where i live, you can get both but ECP is much more common than BTH. \n\nIf you have any other questions or want/need any clarification on anything I said, feel free to ask. Are you in the US? j/w because something you said gave me the impression that you may not be, but wanted to ask to be sure.", "2_Subreddit": "opiates"}], "dwvvowk": [{"0_Comment Submission": "JJ saves in miraculous ways", "1_Text": "Damn. People think I'm crazy when I say this but I want to experience like 1 real winter in my life. Snow and below freezing for a few months. Periods of below zero and all that shit. Instead, I get 8 months of 85-90+ with horrible humidity. We get our days below freezing but it's usually just 2-3 days at a time. Our average January high is 64 of I'm not mistaken.", "2_Subreddit": "opiates"}], "dwwy4rr": [{"0_Comment Submission": "First time cocaine", "1_Text": "Humongous if legit", "2_Subreddit": "Drugs"}], "dwwy6tu": [{"0_Comment Submission": "First time cocaine", "1_Text": "I didn't even think about this aspect but you are so very right.", "2_Subreddit": "Drugs"}], "dwwy7v2": [{"0_Comment Submission": "First time cocaine", "1_Text": "Then they left.", "2_Subreddit": "Drugs"}], "dwwyhvb": [{"0_Comment Submission": "Destroy me.", "1_Text": "You're kinda cute, if only your face was completely different.", "2_Subreddit": "RoastMe"}], "dwwynz3": [{"0_Comment Submission": "Destroy me.", "1_Text": "What do you mean \"would look like\" that? We must be looking at different pictures.", "2_Subreddit": "RoastMe"}], "dwx1ahw": [{"0_Comment Submission": "First time cocaine", "1_Text": "As a geek, I fucks with this comment.", "2_Subreddit": "Drugs"}]}], "1_submissions": [{"70vmbg": [{"0_Title": "Different forms of methadone/methadose", "1_Text": "Damn I always miss out. :-(", "2_Subreddit": "Methadone"}], "7133h4": [{"0_Title": "Possibly needing dose increase after beginning to work out?", "1_Text": "Damn I always miss out. :-(", "2_Subreddit": "Methadone"}], "74mlwa": [{"0_Title": "Questions about Louisiana Medicaid and Methadonr", "1_Text": "Damn I always miss out. :-(", "2_Subreddit": "Methadone"}], "7brq85": [{"0_Title": "Is my clinic a rarity concerning benzos?", "1_Text": "Damn I always miss out. :-(", "2_Subreddit": "Methadone"}], "7e1d7j": [{"0_Title": "Information regarding using Kratom after methadone taper", "1_Text": "Damn I always miss out. :-(", "2_Subreddit": "kratom"}], "7ehykz": [{"0_Title": "Surprise extra takehome", "1_Text": "Damn I always miss out. :-(", "2_Subreddit": "Methadone"}], "7gelm3": [{"0_Title": "Phone Call", "1_Text": "Damn I always miss out. :-(", "2_Subreddit": "kratom"}], "7k1dav": [{"0_Title": "SoCal Coupon Codes", "1_Text": "Damn I always miss out. :-(", "2_Subreddit": "kratom"}], "7ke6pa": [{"0_Title": "How many clinics", "1_Text": "Damn I always miss out. :-(", "2_Subreddit": "Methadone"}], "7kebxh": [{"0_Title": "Male dog whining", "1_Text": "Damn I always miss out. :-(", "2_Subreddit": "dogs"}], "7l2s9x": [{"0_Title": "SoCal is the best", "1_Text": "Damn I always miss out. :-(", "2_Subreddit": "kratom"}], "7phtxh": [{"0_Title": "Recommend scales?", "1_Text": "Damn I always miss out. :-(", "2_Subreddit": "kratom"}], "7r21yd": [{"0_Title": "Thankful for takehomes", "1_Text": "Damn I always miss out. :-(", "2_Subreddit": "Methadone"}], "7r24ne": [{"0_Title": "Respect to people up north chasing dope", "1_Text": "Damn I always miss out. :-(", "2_Subreddit": "opiates"}], "7sx4pc": [{"0_Title": "Happy Birthday Rocky", "1_Text": "Damn I always miss out. :-(", "2_Subreddit": "opiates"}], "7sx8gr": [{"0_Title": "My Labrador/Catahoula mix", "1_Text": "Damn I always miss out. :-(", "2_Subreddit": "Catahoula"}], "7vf389": [{"0_Title": "Birthday", "1_Text": "Damn I always miss out. :-(", "2_Subreddit": "Methadone"}], "7vf4c0": [{"0_Title": "Birthday", "1_Text": "Damn I always miss out. :-(", "2_Subreddit": "opiates"}], "7xiheq": [{"0_Title": "Authority to give takehomes?", "1_Text": "Damn I always miss out. :-(", "2_Subreddit": "Methadone"}], "7zf48k": [{"0_Title": "Just got my taxes", "1_Text": "Damn I always miss out. :-(", "2_Subreddit": "PS4"}], "837wyu": [{"0_Title": "Handling vacation request", "1_Text": "Damn I always miss out. :-(", "2_Subreddit": "Methadone"}], "8565d5": [{"0_Title": "Brand/type of methadone", "1_Text": "Damn I always miss out. :-(", "2_Subreddit": "Methadone"}], "85ggpq": [{"0_Title": "Red Light Camera Ticket", "1_Text": "Damn I always miss out. :-(", "2_Subreddit": "batonrouge"}], "85vsi8": [{"0_Title": "[ShitPost]", "1_Text": "Damn I always miss out. :-(", "2_Subreddit": "opiates"}]}]}]}