{"lissawray": [{"0_comments": [{"duregjg": [{"0_Comment Submission": "New pick up.", "1_Text": "Anyone else notice the paper it's wrapped in is from the 7 habits of highly effective people? Wonder if this would qualify as one of those habits?", "2_Subreddit": "opiates"}], "durhcfh": [{"0_Comment Submission": "FUCK A TITLE", "1_Text": "Depends on experience?", "2_Subreddit": "opiates"}], "duu4wmn": [{"0_Comment Submission": "Morphine street proce", "1_Text": "I'm in the S.E. and here it's regularly .50 a mg. With oxy getting scarce morphine is going up. Saw a 15 Roxy go for 25 yesterday. So morphine is coming back in popularity and going up in price just to get folks well.", "2_Subreddit": "opiates"}], "dv1c815": [{"0_Comment Submission": "monthly pick up", "1_Text": "I was thinking the light blue were mbox 30s. Been wrong enough to know I might be here too.", "2_Subreddit": "opiates"}], "dwrznqc": [{"0_Comment Submission": "Why shouldn't I develop a heroin habit?", "1_Text": "Coming from someone in honest to goodness chronic pain (broke both legs + right hip dislocated and the trocanter/ball snapped clean off along with many other fractures and metal implants too numerous to list after 2 head on collisions 10 years apart) I can tell you that if you are actually in that kind of pain there is help out there that is affordable. \n\nI get very little relief from my rx meds, however, the thought of my pain multiplied by withdrawals every 4 to 6 hours on heroin rather than every 12 or so on rx meds made the decision for me. It is foolish to presume you will be the one out of the masses that gets it right on heroin. And asking a group of people with intimate knowledge of what you are asking then dismissing their responses shows how foolish and naive you really are. \n\nBut please do come back after a few months to a year of doing it \"your way\" and let everyone know how you are doing. It will be an excellent cautionary tale for the next man/woman child that seeks out the wisdom of this place and chooses to ignore every intelligent response. Anyone in real pain seeks any and every way to mitigate that pain, not add to the misery with new and worse forms of pain. I know what my wds are like when I run out of my script and I know they would come faster and harder if I ever switched. \n\nPlease do more research about help from the medical community where you live. I promise there is help out there if you search hard enough and you are really in pain.", "2_Subreddit": "opiates"}]}], "1_submissions": [{}]}]}