{"Op8d_": [{"0_comments": [{"dve4i9g": [{"0_Comment Submission": "BURNED COLD COPPING.....", "1_Text": "Your name isn't in reference to widespread panic is it?", "2_Subreddit": "opiates"}], "dvf0szf": [{"0_Comment Submission": "What is your life like?", "1_Text": "This is pretty much all I want", "2_Subreddit": "opiates"}], "dvf2i94": [{"0_Comment Submission": "What is your life like?", "1_Text": "I'm a pretty functioning addict, at times more so than others.\n\nI started using heroin when I was 18, and it quickly started to consume my life. Went to first rehab at 19. Was able to remain clean for a few months after getting out, than eventually relapsed in the sober living house I was at.\n\nMoved back home across the country and went to another rehab in my home state. Managed to stay clean for 3 years after that stint. Started using pills again around 23. That quickly turned back to heroin, and I used for the better part of a year again. \n\nCaught a felony charge and went back to rehab at 24. Got out of that rehab and managed to stay clean for about 9 months. Started doing pills again, than back to dope. And here we are at 25, back on dope. Not as bad as I've been though. This run I haven't picked up a needle at all. Was always shooting in the past. Also keeping my use pretty low right now. \n\nPlanning on putting again soon. Hopefully I can put together years of clean time again. This whole on again off again thing has been going on for 8 years now and I'm ready to get off the carousel.", "2_Subreddit": "opiates"}], "dvf2yb7": [{"0_Comment Submission": "Im becoming an old man guys.", "1_Text": "My brother is 66 percent gray at 28. He will be fully gray before 35", "2_Subreddit": "opiates"}], "dvf3cmc": [{"0_Comment Submission": "The ol Craigslist dilemma", "1_Text": "Suboxone?", "2_Subreddit": "opiates"}], "dvfjr23": [{"0_Comment Submission": "What's the longest amount of time you have spent in residential treatment?", "1_Text": "Ya know to be honest I thought it was extremely wierd but I had a blast with the people there. I mean yeah we had to do some out there stuff but the other patients were normal. Most of the staff was pretty normal. \n\nAnd I really do think some of the things we did helped me with certain aspects of my life. I'm only realizing that later on in life though. \n\nI even stayed after graduation and started working there, that's when I started researching it more tho and got the fuck outta dodge.", "2_Subreddit": "opiates"}], "dvfkb6z": [{"0_Comment Submission": "Probably gonna try a cold cop. advice for the sake of HR?", "1_Text": "Heroin will be but a temporary relief before it makes that hell even worse..", "2_Subreddit": "opiates"}], "dvfke60": [{"0_Comment Submission": "Probably gonna try a cold cop. advice for the sake of HR?", "1_Text": "I can just drive in my city and eventually will be seen my somebody selling. Get offered a few free caps for testing and get a number. I have had this happen to me countless times while meeting up with my regular dope dealers. They know what a white boy like me doing driving around down there.", "2_Subreddit": "opiates"}], "dvfknp5": [{"0_Comment Submission": "Anybody like doing pullups on H?", "1_Text": "Was wondering myself if lowered testosterone from opiate use would have a negative impact on working out. I assume to a degree, it does.", "2_Subreddit": "opiates"}], "dvflsun": [{"0_Comment Submission": "Stories of Close Calls", "1_Text": "Had just picked up and used my normal amount, but had a a little bit left over. I was headed home and as I go to get on the highway I accidentally swerved a little and there was a cop behind me. I saw him pull out so I knew I was about to get fucked.\n\nI threw my shit in my fuse box, trying to hide it the best I could. Then I remembered I had two or three rigs in a bag of trash in my back seat. I had meant to throw them out but forgot.\n\nGot pulled over, asked to step out of the car. They search me, ask me all sorts of where I'm coming from and shit questions. Go to search my car and tell me if they find anything I don't tell them about im going to jail. So I told them about the rigs. They get done searching my car and tell me I'm free to leave. They then mention to me they couldn't find the rigs. Sweet.", "2_Subreddit": "opiates"}], "dvgebo1": [{"0_Comment Submission": "I went to a safe injection site for the first time yesterday", "1_Text": "Why the 5$ coupon? Does it cost money to use?", "2_Subreddit": "opiates"}], "dvguiu8": [{"0_Comment Submission": "Found this in a parking lot while walking to my car", "1_Text": "Lol was getting my cell phone repaired and dropped it off and as I'm walking back to my car this is just laying right next to my car on the ground.\n\nNot much but still funny. Too bad it won't do a damn thing to me.", "2_Subreddit": "opiates"}], "dvgxq5c": [{"0_Comment Submission": "Found this in a parking lot while walking to my car", "1_Text": "Im aware just thought it was interesting to find on the ground. If I was withdrawaling shit like that wouldn't have ever happened.", "2_Subreddit": "opiates"}], "dvk0m5k": [{"0_Comment Submission": "Everybody's always posting Sour Patch Kids in this sub. Any love for these?", "1_Text": "The small bite sized version that comes with the three colors green, blue, and red in a bag are 🔥🔥🔥", "2_Subreddit": "opiates"}], "dvk371a": [{"0_Comment Submission": "My middle left the plugs # in my phone", "1_Text": "Your dealer cares about your money not the relationship with your middle. What would you be ruining? I've done this many times.", "2_Subreddit": "opiates"}], "dvk3h5d": [{"0_Comment Submission": "How do you use your rinses/cottons?", "1_Text": "I did it like Trav or I would just pull the plunger out of a rig put the cottons inside the rig and the back load water and push it through the cottons by putting the plunger back in the rig. Push down and empty it thru the needle into a spoon and draw up thru another cotton.", "2_Subreddit": "opiates"}], "dvqszg1": [{"0_Comment Submission": "Average prices in your area?", "1_Text": "Agreed. Assuming he's across the state, I'm surprised he could find tar, especially only tar there. Have never seen tar here.", "2_Subreddit": "opiates"}], "dvrwxd8": [{"0_Comment Submission": "Thanks to Buzzfeed I now know this exists as a patch for the DEA.", "1_Text": "So I uh, make patches and koozies and shit. I do machine embroidery. Could prolly make these or put them on koozies.", "2_Subreddit": "opiates"}], "dvs12jj": [{"0_Comment Submission": "Thanks to Buzzfeed I now know this exists as a patch for the DEA.", "1_Text": "lll give it a go and see wassup", "2_Subreddit": "opiates"}], "dvv1uwr": [{"0_Comment Submission": "3lb bag of sour worms because they were out of sourpatch 😭 WEEK 3 without dope. Kms.", "1_Text": "These things were my OG sour candy love. It all started with these.", "2_Subreddit": "opiates"}], "dvz3gjd": [{"0_Comment Submission": "Dear Mr. President", "1_Text": "Did you mean to rhyme in this?", "2_Subreddit": "opiates"}], "dvz49g7": [{"0_Comment Submission": "\"Second wind\" high?", "1_Text": "I was thinking this the other day that I seem to get really high again right before it wears off.", "2_Subreddit": "opiates"}], "dvz4u9t": [{"0_Comment Submission": "how'd i do?", "1_Text": "There's absolutely no way for anyone to tell you anything substantial from that pic. It could be heroin. It could not be also. Does it smell like vinegar?", "2_Subreddit": "opiates"}], "dw7c4lv": [{"0_Comment Submission": "Looking for or suggestions on dealing with addicted ex.", "1_Text": "Just to maybe easy your mind on the cheating...if he is using heroin he most likely has no sex drive because it lowers testosterone levels", "2_Subreddit": "opiates"}], "dwm1rcn": [{"0_Comment Submission": "Hiccups (shitpost)", "1_Text": "I got the hiccups like twenty five times the other night at work,it sucked.", "2_Subreddit": "opiates"}]}], "1_submissions": [{"7ufzs6": [{"0_Title": "Super gray dope", "1_Text": "Your name isn't in reference to widespread panic is it?", "2_Subreddit": "opiates"}], "7v0xz8": [{"0_Title": "Just a wee bit of tan", "1_Text": "Your name isn't in reference to widespread panic is it?", "2_Subreddit": "opiates"}], "7vjf28": [{"0_Title": "Sent home from work after doing this. Oops.", "1_Text": "Your name isn't in reference to widespread panic is it?", "2_Subreddit": "opiates"}], "7vxmg3": [{"0_Title": "Lost my job due to bad decisions. Here's to less of those from now on!", "1_Text": "Your name isn't in reference to widespread panic is it?", "2_Subreddit": "opiates"}], "7wai89": [{"0_Title": "A funny thing I was just told regarding suboxone", "1_Text": "Your name isn't in reference to widespread panic is it?", "2_Subreddit": "opiates"}], "7wlszd": [{"0_Title": "In terms of pain relief", "1_Text": "Your name isn't in reference to widespread panic is it?", "2_Subreddit": "opiates"}], "7z2gxs": [{"0_Title": "Good ole Midwestern dope..buttons.", "1_Text": "Your name isn't in reference to widespread panic is it?", "2_Subreddit": "opiates"}], "83csxb": [{"0_Title": "Found this in a parking lot while walking to my car", "1_Text": "Your name isn't in reference to widespread panic is it?", "2_Subreddit": "opiates"}], "86qmfv": [{"0_Title": "Plugging heroin dosage question", "1_Text": "Your name isn't in reference to widespread panic is it?", "2_Subreddit": "opiates"}]}]}]}