{"jayyyyyyarghhh": [{"0_comments": [{"dwk1qz7": [{"0_Comment Submission": "Fuck I don't even like tramadol but it's all I could find .. the cute cougar barber got them for me for 50 cents a piece and threw in a 2mg bupe for free it's what she uses for pain management", "1_Text": "You can take it whenever - it isn't absorbed through your stomach. Just start small and remember that it takes a couple of hours to fully kick in.", "2_Subreddit": "opiates"}], "dwoizbw": [{"0_Comment Submission": "Been off heroin for 10 months, still depressed as fuck and I’m over it", "1_Text": "I feel like there are a lot of bummed out New Yorkers in this sub! If you can find the info and post here, it might help someone.", "2_Subreddit": "opiates"}], "dwp1j8b": [{"0_Comment Submission": "Relapsed", "1_Text": "Don't beat yourself up and get back on track! \n\nAnd totally, Suboxone can help if you are willing to really take it. It curbs cravings a lot and if you take around 4mg a day it blocks other opiates. Even on less than a blocking dose, it reduces the pleasurableness of dope for me a lot, so it's not really worth using. And so if I wanted to use I'd have to plan ahead and stop taking the sub etc, which makes me WAY less likely to give in to my terrible impulse control and pick up.", "2_Subreddit": "opiates"}], "dwp1x6i": [{"0_Comment Submission": "Took an RP30... 30mg is what I normally take... in about an hour I was gasping for air, passed out for about 30 mins and woke up in an ambulance... I assume this was cut or pressed with fent but now I’m scared to do it again.", "1_Text": "Just testing one pill from a batch is a LOT safer than not testing anything -- if they are from the same dealer and look the same they prob are the same. Harm reduction isn't about perfection, it's about doing what you can to protect yourself and others.", "2_Subreddit": "opiates"}], "dwp23h2": [{"0_Comment Submission": "Chipping with bupe.", "1_Text": "I think I've told you this before, but I would take way less if I was you -- with no tolerance 1mg is a good dose. But it's not the greatest recreational drug or anything. \n\nNot sure I understand what you are asking? If you take 4mg of bupe once a week you will get high once a week. Obviously.", "2_Subreddit": "opiates"}], "dwp77m3": [{"0_Comment Submission": "Chipping with bupe.", "1_Text": "Next time I'd still try 2mg and see how you feel. Within a few days of using subs to come off of a dope habit too big for subs to fully cover it at first I can already totally feel 2mg. And that is obv taking it every day. \n\nAnyway, my guess is not many people have tried exactly what you are asking about, but my guess is that you would be able to keep taking the same dose once a week for a long time without needing to raise the amount much if at all. My guess is that there is a chance that you could have some WDs if you did it consistently for a long time, because bupe's half-life is so long that you'd prob always have at least a tiny bit of it in your system.", "2_Subreddit": "opiates"}], "dwp7jwl": [{"0_Comment Submission": "This is my last day.....", "1_Text": "If 1mg of suboxone gets you well, kratom really might work! Worth trying anyway.", "2_Subreddit": "opiates"}], "dwp7st1": [{"0_Comment Submission": "Just got my sub script", "1_Text": "These are both valid points! I go strips because I like how easy it is to taper with them. Especially the 4mg strips, which are weirdly twice as big as the 8mg strips, so SUPER easy to cut down into tiny little .125mg or less slivers. \n\nBut if I wanted to sniff, tablet is the way to go. And there is def appeal in sniffing the stuff. First run I had on subs was pre-strips and a little sub dust combined and sniffed with a little crushed xanax was the most powerful and immediate sleep aid I've ever experienced. Lights out. (And I know that people say sniffing benzos is pointless, just my experience.)", "2_Subreddit": "opiates"}], "dwp9pyb": [{"0_Comment Submission": "Help", "1_Text": "IME that happens when your tolerance is too high for the suboxone to fully get you well. Just happened to me. Took two days of being semi-well until my tolerance fell to the point where the sub started working 100%. \n\nYou have to stick with it for a day or two - it super sucks but way better than being fully sick! And once it starts working it's like a weird miracle. I woke up on the third day feeling completely normal. Not sick, not high, just normal.", "2_Subreddit": "opiates"}], "dwpk8ow": [{"0_Comment Submission": "Just got my sub script", "1_Text": "Before the strips existed I was prescribed the tablets, and I sometimes liked to crush them up and sniff them with a benzo at night for instant sleep. Other people say subs keep them up, weird drug!", "2_Subreddit": "opiates"}], "dwpkhky": [{"0_Comment Submission": "This is my last day.....", "1_Text": "In your experience does a higher sub dose (as in 12mg) do much that 8mg, say, don't? I took 12mg on my second day off of dope, but it didn't feel any different than 4mg, which is to say I felt pretty lousy no matter how much I took until the third day.", "2_Subreddit": "opiates"}], "dwpmmg4": [{"0_Comment Submission": "How addictive is OPIUM?", "1_Text": "More addictive than opium but less addictive than oPIuM", "2_Subreddit": "opiates"}], "dwsmkd3": [{"0_Comment Submission": "Omw To the hospital with breathing problems", "1_Text": "I would make an appointment with a suboxone doctor for as soon as possible -- if dope is giving you serious health problems, that is a really good reason to at least take a break. Good luck!", "2_Subreddit": "opiates"}], "dwsmybx": [{"0_Comment Submission": "Made the switch", "1_Text": "Just be very, very aware of how quickly your tolerance can rise when you are taking a street drug where the potency is a total question mark. Especially because it will seem so cheap to you at the beginning. For me, within a couple of months of starting dope, I had a habit many times bigger than I had ever had in many years of fucking around with pills -- it happened super fast. If that starts happening, give some thought to taking a break with some suboxone or something. It's not a good road!", "2_Subreddit": "opiates"}], "dwsx6go": [{"0_Comment Submission": "Bernese method", "1_Text": "Can you describe your particular process in more detail? How much sub do you start with, and over how many days do you increase the sub (and by how much) and decrease the dope (ditto)?", "2_Subreddit": "opiates"}], "dwt7wih": [{"0_Comment Submission": "Day Off Vibes", "1_Text": "This seems like a better post for the 'Two Hats, One Sock, a Wallet, Weed Stuff, Xanax, and some $20 bills' forum?", "2_Subreddit": "opiates"}], "dwt85b5": [{"0_Comment Submission": "Bernese method", "1_Text": "That is super helpful! So sub doses are in the AM before any DOC dose? The 2mg dose in the PM on Day 3 seems stressful -- how did you come to decide to add the first bigger dose at that point? \n\nSorry for all the questions! This is such useful info -- my last sub induction was pretty unpleasant because my tolerance was too high. This would have helped a lot.", "2_Subreddit": "opiates"}], "dwt8eb9": [{"0_Comment Submission": "Bernese method", "1_Text": "Thanks! Here is some info on the original study if anyone else is interested:\n\nhttps://www.ncbi.nlm.nih.gov/pmc/articles/PMC4959756/", "2_Subreddit": "opiates"}], "dwt8erg": [{"0_Comment Submission": "Bernese method", "1_Text": "The first -- looks like it's a Swiss study.", "2_Subreddit": "opiates"}], "dwtklgv": [{"0_Comment Submission": "Bernese method", "1_Text": "Every 4-6 hours? In my experience you can take up to two days off of sub maintenance and get back on seamlessly, without needing to re-induct.", "2_Subreddit": "opiates"}], "dwtl0ov": [{"0_Comment Submission": "Bernese method", "1_Text": "How much is the dope diminished by taking that much suboxone with it?", "2_Subreddit": "opiates"}], "dwtw3sw": [{"0_Comment Submission": "Guys, just found 30mg hydrocodone in my vehicle. I don't have much of a tolerance , next to none. Should I take It all?", "1_Text": "If 15 was good before your break, I'm sure it's good again now -- why not just take that and save the rest for another time?", "2_Subreddit": "opiates"}], "dwu12zp": [{"0_Comment Submission": "Ldr’s", "1_Text": "I feel like most of the people in this sub have enough trouble maintaining just plain Rs let alone adding the difficulties of LD!", "2_Subreddit": "opiates"}], "dwuuglm": [{"0_Comment Submission": "How many of you succeeded at staying clean after being forced into a rehab?", "1_Text": "I can't answer your main question, but it can't hurt to try to see this from your wife's perspective. This is some very unsolicited advice and I hope it doesn't come off as preachy, but...\n\nI bet she is also 'insanely depressed' about all of this. I doubt she is under any illusions that rehab is a magic fix, but just wants to try something to save her marriage. If you want to stay in this marriage you probably need to take some action, too -- which could come in the form of rehab or some other solution (could try methadone like someone below suggests since subs don't work for you). Or if getting high is more important than your marriage, you can choose that -- you are an adult and no one can make go to rehab (\"no, no, no!\") if you don't want to. \n\nBut it does seem like your wife wants you to make a choice and from the outside at least it doesn't seem like an unreasonable request, living with a junkie who lies about using is no picnic!", "2_Subreddit": "opiates"}], "dwx49bp": [{"0_Comment Submission": "Should i switch from subutex to norco before quitting?", "1_Text": "This. There is no reason to be afraid of bupe WD if you taper, and for most people it's WAY easier to taper subs than their DOC. Like sure, if you can legit taper on norco go for it, but my guess is that you are on sub because that isn't possible for you. Reduce by, say, between 10% and 25% a week, and taper all the way down to .25 or .125 or the tiniest dose you can manage. (If you are on a dose higher than 4mg start by cutting your dose to 4mg and taper from there.)", "2_Subreddit": "opiates"}]}], "1_submissions": [{"7rmz60": [{"0_Title": "Tom Petty died of accidental OD", "1_Text": "You can take it whenever - it isn't absorbed through your stomach. Just start small and remember that it takes a couple of hours to fully kick in.", "2_Subreddit": "opiates"}], "7uo6s3": [{"0_Title": "Interesting New York magazine story from the very end of the Lower East Side's open-air era", "1_Text": "You can take it whenever - it isn't absorbed through your stomach. Just start small and remember that it takes a couple of hours to fully kick in.", "2_Subreddit": "opiates"}], "8087it": [{"0_Title": "Why isn't heroin a common pharmaceutical drug?", "1_Text": "You can take it whenever - it isn't absorbed through your stomach. Just start small and remember that it takes a couple of hours to fully kick in.", "2_Subreddit": "opiates"}], "80gum7": [{"0_Title": "Question about fent testing", "1_Text": "You can take it whenever - it isn't absorbed through your stomach. Just start small and remember that it takes a couple of hours to fully kick in.", "2_Subreddit": "opiates"}], "81b5rq": [{"0_Title": "Dancesafe test strips", "1_Text": "You can take it whenever - it isn't absorbed through your stomach. Just start small and remember that it takes a couple of hours to fully kick in.", "2_Subreddit": "opiates"}], "85mv3h": [{"0_Title": "Suboxone induction question", "1_Text": "You can take it whenever - it isn't absorbed through your stomach. Just start small and remember that it takes a couple of hours to fully kick in.", "2_Subreddit": "opiates"}]}]}]}