{"Cheapwh0re": [{"0_comments": [{"dmlj79w": [{"0_Comment Submission": "Does the brand Xanax still manufacture 2mg bars in the U.S", "1_Text": "Is offering potential insight to a somewhat old thread taboo?", "2_Subreddit": "benzodiazepines"}], "dobqqzz": [{"0_Comment Submission": "Aspire Breeze or Eleaf iCare 2", "1_Text": "How does nicotine salt juices do in the breeze despite it's sub ohm coil and the somewhat loose MTL hit?", "2_Subreddit": "electronic_cigarette"}], "doj3vhi": [{"0_Comment Submission": "Aspire Breeze or Eleaf iCare 2", "1_Text": "Just got my breeze and 25mg salt liquid from level up. Not bad at all. Used to daily 3mg liquids through subohm tanks.", "2_Subreddit": "electronic_cigarette"}], "dona1ta": [{"0_Comment Submission": "Can you overdo Saline spray", "1_Text": "I've read somewhere, may be on the cocaine subreddit lol, that saline and decongestants are not a hot combo. I do remember how I had very intense bloody noses and whatnot when I was on a blow binge and used both. Stopped the decongestants and only saline and that all disappeared. Other then that id say saline on it's own is not inherently bad for you.", "2_Subreddit": "Drugs"}], "donbfny": [{"0_Comment Submission": "What are all the false myths about LSD and other psychedelic use?", "1_Text": "Don't shrooms and oj have a connection like mangos and weed do? That might be where it stemmed from", "2_Subreddit": "Drugs"}], "doolhv1": [{"0_Comment Submission": "Hate nicotine", "1_Text": "Try nicotine salt juices in a pod style device. If that's not your thing there's WTA eliquid. All I hear about that is people who vape 3mg wish there were 1.5mg options for wta so it probably is good stuff", "2_Subreddit": "Drugs"}], "doon67k": [{"0_Comment Submission": "Hate nicotine", "1_Text": "It is my understanding that whole tobacco alkaloid eliquid do not come in 0mg..no need to get hostile with me lol", "2_Subreddit": "Drugs"}], "dot2jc3": [{"0_Comment Submission": "Does the brand Xanax still manufacture 2mg bars in the U.S", "1_Text": "No it's because it's produced in China in clandestine labs not in a controlled environment that has government regulations/oversight.", "2_Subreddit": "benzodiazepines"}], "dot6bu2": [{"0_Comment Submission": "Need Advice About The Plug", "1_Text": "The dude actually said he isn't an expert so everything he said shouldn't be taken seriously lol", "2_Subreddit": "Drugs"}], "dpd7j18": [{"0_Comment Submission": "Sites that do bundle 120mls for the cheap?", "1_Text": "Dr. Mcvapes", "2_Subreddit": "electronic_cigarette"}], "dpmm17i": [{"0_Comment Submission": "2,000% rise in street drug samples testing positive for fentanyl, mostly in Heroin.", "1_Text": "There has been reports of cocaine and xanax bars bars being laced with fent :( I've also heard of weed being tainted with it but that's more of a stretch", "2_Subreddit": "Drugs"}], "dpmn4ue": [{"0_Comment Submission": "Undercover at NYC Mansion Party: Coke/Molly Found to Be Laced with Meth", "1_Text": "Probably because by the time most dealers get their coke it's passed through a ton of hands and everywhere it stops, and there's an opportunity to make money, you know people are going to cut with inactives. So by the time it gets to the pushers they need to use something to keep the perceived potency there", "2_Subreddit": "Drugs"}], "dpn0fgu": [{"0_Comment Submission": "2,000% rise in street drug samples testing positive for fentanyl, mostly in Heroin.", "1_Text": "I've never understood fent ending up in drugs that weren't even close to a super ultra mega downer.", "2_Subreddit": "Drugs"}], "dpy29js": [{"0_Comment Submission": "Buying 510 oil cartidges online", "1_Text": "Fasttech has what you're looking for. Not prefilled tho", "2_Subreddit": "Drugs"}], "dqd7he5": [{"0_Comment Submission": "Setting the record straight on bringing drugs through airport security", "1_Text": "Vac seal once. Wash in 91% iso. Vac seal again. Should be gucci if you weren't careless with handling", "2_Subreddit": "Drugs"}], "dt7dgyr": [{"0_Comment Submission": "Do promethazine pills have recreational value?", "1_Text": "It's an antihistamine like benadryl so I guess it's good for not much lol", "2_Subreddit": "Drugs"}], "dtpjq14": [{"0_Comment Submission": "I've used Coinbase more than once and it worked for me. I'm a skeptical of complaints here. Just saying.", "1_Text": "I had coinbase make 2 $100 charges to my bank account after I added the info because my debit limit was at 100 a week. They told me they couldn't do anything about it because of the untraceable nature of bitcoin transactions and also that is have to go to my bank to dispute the charges to get my 200 back. I went there and they told me I couldn't get it back more or less because I had opened the account myself. Idk I took the l and now I'm only using my debit card on a different account", "2_Subreddit": "CoinBase"}], "dtqhhzp": [{"0_Comment Submission": "Double charge for Ethereum coins purchased", "1_Text": "I had coinbase make 2 $100 charges to my account after adding bank and debit for purchase options. After talking to someone on support and getting referred to a higher up person that deals with that kinda stuff I was told that they can't do a thing because of the nature of how bitcoin is untraceable and shit. They said I'd have to go to the bank as well to dispute the charges to get my money back. Went there and they told me I'm shit out of luck since I had added the card and bank info to my coinbase account myself. Out of 200 for no damn reason..", "2_Subreddit": "CoinBase"}], "duy6yxh": [{"0_Comment Submission": "Flualprazolam powder", "1_Text": "After light etiz usage I decided to take a 1mg pellet of flap to see how my machine liked it. The day after he was very irritable and chose to break off RCs for a while. The rebound anxiety and inability to sleep was horrendous but is starting to level out after 4 days", "2_Subreddit": "researchchemicals"}], "duz3rkm": [{"0_Comment Submission": "Flualprazolam powder", "1_Text": "I am holding onto the 1mg pellets for when it gets real bad and am debating on getting the .5mg pellets or powder for a solution. Maybe my machine will like it better", "2_Subreddit": "researchchemicals"}], "dvzd689": [{"0_Comment Submission": "Zombilives \"Submerge and evaporatr\" blend production no hotspots guarantee,with the power of water", "1_Text": "How long should the salt be baked for?", "2_Subreddit": "researchchemicals"}], "dwgn8pj": [{"0_Comment Submission": "Sog Trident Knife $35.30 [Referral]", "1_Text": "How are you guys doing with your website and people getting random charges to their accounts? I heard at one point it may have been hacked but that was a long time ago. Would like to cop some stuff off your website but that kind of negativity really puts me off tbh", "2_Subreddit": "KnifeDeals"}], "dwj6yay": [{"0_Comment Submission": "Don't you just love everyone whose personality revolves solely around the fact that they smoke weed is always a \"drug expert\" on literally everything about every drug?", "1_Text": "Also can't forget about the classic \"look guys I just discovered I had a screen on my grinder and the bottom is packed to the brim. Give me an upvote\"", "2_Subreddit": "opiates"}], "dwm5vk6": [{"0_Comment Submission": "Does anyone agree with this? Pink heroin.", "1_Text": "I have heard of u47700 drawing up pink?", "2_Subreddit": "opiates"}], "dwm6hk0": [{"0_Comment Submission": "$180 for a gram is fuckin killing me.", "1_Text": "I feel you there brotha. Got raped for 240 for my first whole g since there's only one guy at work I know of. Now that I've connected with someone I used to go to school with I've been blessed with 175 for a g lol. Fuck this stupid state and my lack connects!", "2_Subreddit": "opiates"}]}], "1_submissions": [{"5kovjo": [{"0_Title": "Cave trap", "1_Text": "Is offering potential insight to a somewhat old thread taboo?", "2_Subreddit": "playrust"}], "64vcde": [{"0_Title": "10mm Reclaim Catcher", "1_Text": "Is offering potential insight to a somewhat old thread taboo?", "2_Subreddit": "trees"}], "677wvs": [{"0_Title": "10mm reclaim catcher.", "1_Text": "Is offering potential insight to a somewhat old thread taboo?", "2_Subreddit": "asktrees"}], "7o7x4x": [{"0_Title": "ID verification", "1_Text": "Is offering potential insight to a somewhat old thread taboo?", "2_Subreddit": "CoinBase"}]}]}]}