{"defZeppelin69": [{"0_comments": [{"dwe0ene": [{"0_Comment Submission": "The average d-boy.", "1_Text": "Marry her", "2_Subreddit": "opiates"}], "dwe22kx": [{"0_Comment Submission": "Why does black tar always have a strong vinegar odor to it?", "1_Text": "Well I guess it depends. I’ve just found that to be the case. But I’ve never had tar", "2_Subreddit": "opiates"}], "dwe3uj8": [{"0_Comment Submission": "Earning that hustle", "1_Text": "My mom is sort of the same way, not in that the place has dirty trash everywhere, but she hoards. She’s constantly shopping out at stores or online, buying shit she doesn’t need whatsoever, with plans to “take it back.” Every corner is packed full of bags of old crap, like old unworn clothes with tags on them, bottles of hand sanitizer and soap to “use as gifts,” etc. \n\nEvery time we mention throwing shit away she says absolutely not because it’s wasting it. Somehow 20 year old junk has some sort of value to her. Our basement storage room is packed full of old bikes, decorations, furniture, etc. so is our garage. \n\nWhen we convince her to actually start clearing it out, this entails her spending a couple of hours “going through it”, which means moving it from one bag to another. Then she gets on the phone and ignores it for the next few weeks.\n\nIt’s not a healthy lifestyle. She’s so embarrassed that she isn’t willing to have guests over anymore even though she’s a social butterfly. My dad has had to move down into the basement, their only contact is when he comes upstairs to tell back at her after she nags him from upstairs all day.\n\nHer mattress is 16 years old and causes her aches and pains that she constantly complains of. But she won’t get a new one because she doesn’t want the two random delivery men to see her mess. When I mention they can deliver it to the door and I can move it into her room, she comes up with some other excuse to not get anything done.\n\nSorry for the rant, but it’s not something I can just tell people who know me and a lot builds up.\nThe sad part is I’m a lot like her and take after her, though painfully aware of it. I have the same tendency to ignore my problems and get too overwhelmed to deal with them", "2_Subreddit": "opiates"}], "dwe3ylk": [{"0_Comment Submission": "The average d-boy.", "1_Text": "Marriage takes sacrifice", "2_Subreddit": "opiates"}], "dwefx4f": [{"0_Comment Submission": "Earning that hustle", "1_Text": "I actually recently moved back in after graduating college, so I get to see it all first hand and experience everything over again", "2_Subreddit": "opiates"}], "dweoqvm": [{"0_Comment Submission": "What was your \"I shouldn't have said that\" moment when talking to a customer?", "1_Text": "Not always a good move. Sometimes fucks us lower levels over. I worked in a big chain pizza delivery company. Apparently an order got sent out wrong. The woman called corporate to complain, who chewed out my manager who chewed me out. \nThe lady could have just called th store, and I would have happily brought her the cinnastix she ordered plus a free drink and let her keep the breadsticks I accidentally gave to her", "2_Subreddit": "AskReddit"}], "dweovw5": [{"0_Comment Submission": "What was your \"I shouldn't have said that\" moment when talking to a customer?", "1_Text": "Reminds me of my pet peeve: i answer the phone “how can I help you?” Customer responds “yes, I’d like...”\nDon’t know why this bothers me so much", "2_Subreddit": "AskReddit"}], "dwlxp6j": [{"0_Comment Submission": "LPT: For your freshman year of college, don't room with your friends from high school. This will give you an opportunity to branch beyond your circle and create new connections. Still stay friends with people from high school, but focus on building connections. Ultimately, life is about who you know", "1_Text": "I was the type of person in college who would make fleeting friendships. Would be friends with people for a while then meet someone new and stop hanging out with the others. Is this wrong? It’s just hard to balance old friendships with new", "2_Subreddit": "LifeProTips"}], "dwlyjrq": [{"0_Comment Submission": "Do you have to piss dirty for opiates to get a sub script?", "1_Text": "I’d imagine so, either that or be in the middle of acute withdrawal", "2_Subreddit": "opiates"}], "dwlynmn": [{"0_Comment Submission": "Do I need to do a CWE?", "1_Text": "Just take them orally. You’re not going to fuck up your liver from 6 Tylenol 3s. Make sure to take them all at once to get as high as possible, or take 3 at once, see how you feel, then take the rest after half an hour if you aren’t a good enough level", "2_Subreddit": "opiates"}], "dwlyp7l": [{"0_Comment Submission": "Tips and Tricks", "1_Text": "You can get it at smoke shops but it’s expensive there and usually shit quality", "2_Subreddit": "opiates"}], "dwlyprc": [{"0_Comment Submission": "Tips and Tricks", "1_Text": "Buy some tonic water", "2_Subreddit": "opiates"}], "dwlytef": [{"0_Comment Submission": "Oxy got me laid last night", "1_Text": "You know beer goggles? Imagine oxy, hydro, vodka, and benzo goggles. She may not have been hot my dude", "2_Subreddit": "opiates"}], "dwlz0m6": [{"0_Comment Submission": "How much water should i put in the syringe when i do a plug ?", "1_Text": "You’re not supposed to plug if you haven’t shit right? Cuz it’ll just absorb into the shit and not affect you, well that’s an issue if you’ve been on a three day bender and haven’t shit in a couple days. But my question is this: I ran out last night and shit all day until I got more tonight, do you think it’s safe to plug or is there still probably shit in there?", "2_Subreddit": "opiates"}], "dwlz3zx": [{"0_Comment Submission": "Just boofed for the first time.", "1_Text": "Booking doesn’t really work for me. I’m a daily user so I’m generally constipated, so booting would be a waste, right?", "2_Subreddit": "opiates"}], "dwlz6y8": [{"0_Comment Submission": "Just boofed for the first time.", "1_Text": "If I can do it, so can you man. I’ve done it once before as well, with the promise that it was just o know what the rush is, and never again.\nWell it’s been about 5 months, and even though I still consider it, I haven’t gone down that path", "2_Subreddit": "opiates"}], "dwlz89k": [{"0_Comment Submission": "Just boofed for the first time.", "1_Text": "Instant orgasm my friend. It’s worth exploring with a girl you trust", "2_Subreddit": "opiates"}], "dwlzbjj": [{"0_Comment Submission": "Lovely. (2g #3 between the poweder and the beetle)", "1_Text": "Looks delicious, how much did that cost you? That would be around 300-360 where I live", "2_Subreddit": "opiates"}], "dwlzdim": [{"0_Comment Submission": "Mixing morphine and weed?", "1_Text": "It’ll make you feel physically and emotionally great. Combine with weed, and you’re stoned while feeling great", "2_Subreddit": "opiates"}], "dwlzvih": [{"0_Comment Submission": "Fucking dilemma on my hands... Advice needed.", "1_Text": "If you try h, your addiction will go to the next level. Trust me. At first you’ll save money and get higher, but then your tolerance shoots up and you spend more minutes net than ever. Your life will revolve around it. Don’t do it, man", "2_Subreddit": "opiates"}], "dwm07s8": [{"0_Comment Submission": "Tips and Tricks", "1_Text": "Not exactly sure what it actually is, but it’s the bitter lemony flavor in tonic water", "2_Subreddit": "opiates"}], "dwmcv6n": [{"0_Comment Submission": "Lovely. (2g #3 between the poweder and the beetle)", "1_Text": "Wtf. You’d think with cartels bringing it in to the us it would be so much cheaper", "2_Subreddit": "opiates"}], "dwmi5i3": [{"0_Comment Submission": "Tips and Tricks", "1_Text": "Yeah it should. Though honestly I can’t tell the difference", "2_Subreddit": "opiates"}], "dwrj11b": [{"0_Comment Submission": "Japanese couple apologise for ignoring work pregnancy timetable by conceiving ‘before their turn’", "1_Text": "Don’t be a Logan Paul", "2_Subreddit": "nottheonion"}], "dwu27yu": [{"0_Comment Submission": "Pickup story : made my d boy sus", "1_Text": "Can’t believe you snapped a picture in front of him. Are you trying to get killed?", "2_Subreddit": "opiates"}]}], "1_submissions": [{}]}]}