{"coffieldwarlock": [{"0_comments": [{"dtg9lmx": [{"0_Comment Submission": "Menu for Patriots flight to Minny.", "1_Text": "Jackin his ass like a looter in a riot", "2_Subreddit": "Patriots"}], "duvjgsn": [{"0_Comment Submission": "Will I still need H with my 'done?", "1_Text": "Everyone is different. I \"needed\" 240mgs to feel \"normal\". That was from about a 1-2g avg a day habit for about 8yrs.", "2_Subreddit": "opiates"}], "duvqtfm": [{"0_Comment Submission": "Will I still need H with my 'done?", "1_Text": "No it only lasted about 7 months. I kept pissing dirty and got tired of going every day. I always had to do a lot of anything to get high. I got clean going cold turkey for about 6 years. Relapsed a bit. Quit again, relapsed again and today I'm chipping but it's starting to get out of hand. Only difference is I actually have a good job and money now, so probably gonna start that process again. Getting too old for this shit.", "2_Subreddit": "opiates"}], "duxc7jl": [{"0_Comment Submission": "Will I still need H with my 'done?", "1_Text": "Right there with you. Started at 18 pushing 40 now.", "2_Subreddit": "opiates"}], "dvgg16m": [{"0_Comment Submission": "Waiting for the man", "1_Text": "He's never early, he's always late. First thing you learn is that you always got to wait.", "2_Subreddit": "opiates"}], "dvibejo": [{"0_Comment Submission": "Waiting for the man", "1_Text": "Glad it all worked out. Been waiting on my dude since Friday morning...no reply. Fucking middleman. It's like they don't want my money sometimes.", "2_Subreddit": "opiates"}], "dvibigl": [{"0_Comment Submission": "Dilly dilly bang bang", "1_Text": "You lucky fuck. I hate you.\n\nNot really, but ya know", "2_Subreddit": "opiates"}], "dviblvl": [{"0_Comment Submission": "Who’s your /r/opiates secret crush?", "1_Text": "Anyone in my area code who can hook me up.", "2_Subreddit": "opiates"}], "dvy37b9": [{"0_Comment Submission": "Officially found that fucking rabbit hole everyone is always talking about", "1_Text": "Why does it matter to you?", "2_Subreddit": "opiates"}], "dvy39jh": [{"0_Comment Submission": "Officially found that fucking rabbit hole everyone is always talking about", "1_Text": "Mr. Low Self Esteem over here.", "2_Subreddit": "opiates"}], "dvy3pv2": [{"0_Comment Submission": "Serious question: How did you get money today to buy your DOC today? IE: work, gay 4 pay, etc.", "1_Text": "Cash back at several local grocers so I can somewhat hide it from my spouse. Luckily we buy dinner items daily and spouse hates shopping.", "2_Subreddit": "opiates"}], "dvyfztz": [{"0_Comment Submission": "Officially found that fucking rabbit hole everyone is always talking about", "1_Text": "It's just sex dude. I'm sure there are plenty of men who could live with it.", "2_Subreddit": "opiates"}], "dvyg38o": [{"0_Comment Submission": "Officially found that fucking rabbit hole everyone is always talking about", "1_Text": "Probably has to beg to get that far too.", "2_Subreddit": "opiates"}], "dvyivs9": [{"0_Comment Submission": "Why do we use pillows now when we sleep? Did we need this during the prehistoric/ancient age? What changed?", "1_Text": "I eat many rouses", "2_Subreddit": "askscience"}], "dvyuqk8": [{"0_Comment Submission": "Officially found that fucking rabbit hole everyone is always talking about", "1_Text": "It's been my experience that people who are hung up on \"taboo\" sex things aren't generally experienced in a lot of ways, and that's ok. Judging someone else for their decisions however isn't. To each his own internet stranger.", "2_Subreddit": "opiates"}], "dvyvy5w": [{"0_Comment Submission": "How do you properly", "1_Text": "Crush finely, warm water, mix thoroughly, and most importantly use a micron filter. All the binders and shit are bad for you. If you're using to get through a rough patch I personally would just eat them. You most likely you will be disappointed regardless of ROA but eating them is safest, and the bioavailability is pretty high with ingestion.", "2_Subreddit": "opiates"}], "dvyybkp": [{"0_Comment Submission": "Officially found that fucking rabbit hole everyone is always talking about", "1_Text": "That's how you feel. There are men who enjoy it. Homosexuals I believe they are called. Maybe bisexual too. One doesn't necessarily feel shame or lack self respect because they prefer one type of genitalia over another. For the most part people don't choose what their sexual preferences are. It is what it is. If it isn't hurting anyone, what is the problem?", "2_Subreddit": "opiates"}], "dvz2kau": [{"0_Comment Submission": "Officially found that fucking rabbit hole everyone is always talking about", "1_Text": "Ok dude.", "2_Subreddit": "opiates"}], "dwcb3tt": [{"0_Comment Submission": "How much are you paying for heroin where you're at?", "1_Text": "NC $120-$160 a g. Mostly fent. Sometimes it's got legs most times it doesn't.", "2_Subreddit": "opiates"}], "dwe1xal": [{"0_Comment Submission": "Am I going to overdose?", "1_Text": "Everyone is different. Depends on your tolerance and what not. 90 mgs of hydrocodone isn't a large dose for some and a massive dose for others. I regularly take 200mgs of it but I've been doing this a while. If you're concerned try walking around a bit to avoid nodding out, or you could go to the er and open that can of worms. Best of luck to you and hope you get through.", "2_Subreddit": "opiates"}], "dwe23ql": [{"0_Comment Submission": "A question about stashing prescribed opiates.", "1_Text": "Look at his contract with pm. I always brought exactly what I was supposed to have to avoid questions. If they find out he isn't taking them as prescribed they can cut him off or reduce the amount prescribed. Gotta have them ducks in a row at pm.", "2_Subreddit": "opiates"}], "dwfk07x": [{"0_Comment Submission": "Richard Sherman and Josh Norman are among the NFL players who say they don't understand how they're supposed to do their jobs with the new rule on lowering helmets to initiate contact", "1_Text": "I started playing football in 1985 and we were taught this.", "2_Subreddit": "nfl"}], "dwljzgv": [{"0_Comment Submission": "The cravings are so bad during WD and I can’t get any dope or subs for a few days... I’m basically begging for advice", "1_Text": "It's unfortunate, but sounds like you are going to have to just ride it out. Nothing is going to satiate those cravings. If you can get through this, my suggestion is to try and end the cycle (easier said than done I know). Best of luck to you.", "2_Subreddit": "opiates"}], "dwll80w": [{"0_Comment Submission": "The cravings are so bad during WD and I can’t get any dope or subs for a few days... I’m basically begging for advice", "1_Text": "Try using those xanax to sleep though as much as you can. Hot bath, immodium, vitamins etc. Most of us have been there and had to pay the piper. He's a mother fucker, but we gotta pay coming and going.", "2_Subreddit": "opiates"}], "dwlla77": [{"0_Comment Submission": "\"The boyz are back in town\" (Thin Lizzy)", "1_Text": "If that chick don't wanna know, forget her...", "2_Subreddit": "opiates"}]}], "1_submissions": [{}]}]}