{"KumaGirl": [{"0_comments": [{"dsaktjq": [{"0_Comment Submission": "TIL of Genie Wiley, a girl who was raised in a dark isolated room with no indication of an outside world for the first 13 years of her life, her father was incredibly abusive, and when authorities rescued her she couldn't speak at all and only made infantile noises.", "1_Text": "Nah, I'm cool doing well publicized burnings. For crimes that are acknowledged and proved beyond a doubt to be real and fpr those that show no reasonable expectation of turn around, or those who have harmed someone or something helpless like a child, or animal. They should be publicly, brutally, executed.", "2_Subreddit": "todayilearned"}], "dsawode": [{"0_Comment Submission": "(NSFW) What have you found out about someone that you would never tell them you know?", "1_Text": "I was home alone at about age 12 and I wanted to watch a movie. I found a copy of Empire Records and put it in the VCR. Pressed play, and low and behold I had stumbled on an underwater porn scene.  I thought it was part of the movie! So I did what any curious 12 year old would do and fast forwarded to the climax... turns out my aunt had taped over the entire Empire Records movie, with what turned out to be back to back, poorly cut episodes of porn, all in french. Never even thought of telling her that her movie is different. Although I doubt she would remember, she has never asked for it back.", "2_Subreddit": "AskReddit"}], "dsea9xj": [{"0_Comment Submission": "Fan wearing a Gilbert jersey gets surprised by Rod Gilbert", "1_Text": "I literally only saw the man stretching on the ice (person who doesn't watch hockey and was wondering if he had fallen and couldn't get up)", "2_Subreddit": "sports"}], "dspgdxv": [{"0_Comment Submission": "My life is a dumpster fire.", "1_Text": "I'm 25. I have extreem anxiety, and depression... and I like you, can't talk to my mother at all. I can honestly say, the only way I keep going at all is by knowing that I'm trying something. Even when it feels like no-one  understands me... I have learned to just pay attention to what I'm doing, right this moment. Nothing else matters. You take it one step at a time. And remember to like yourself for who you are. If you are kind to people, you can talk to people you meet, or you make people smile even just a little, you have made someone else's day bright. and that is something.", "2_Subreddit": "needadvice"}], "dspgtj9": [{"0_Comment Submission": "TIL the Queen uses her purse (handbag) to send secret messages to her staff, such as swapping which shoulder it is on when she's done talking with a particular person and wants an excuse to leave the conversation.", "1_Text": "If only our shit hole president was this courteous and  polite.", "2_Subreddit": "todayilearned"}], "dsph9hb": [{"0_Comment Submission": "I'm a Republican. What on Earth Is Wrong With My Party?", "1_Text": "Do it better next time. Research, reflect... and then realize that the people running are going to lie, they are going to promise things that they can't possibly do as president, especially if they are so far fetched as \"build a wall to block out Mexico, that they will pay for\" or \"make America great again.\"      \nAll this smoke and mirrors act to get people riled up enough to vote out of the glory of it... It was a ploy. Hillary wasn't much better. She really wasn't. But the multitude of Trump supporters who voted out of blind adoration for a man that they will never know, based on promises that he never made, or could never, ever, ever, keep? That is pure stupidity. Do Your Research! Listen to your candidates talk, do they make sense, or do they sound ever increasingly like Hitler at one of his rallies? It is too late to be sorry, or horrified. We have been for a minute here, and it is the time to get someone into office who doesn't act like a spoiled toddler at every opportunity.", "2_Subreddit": "politics"}], "dsphgyo": [{"0_Comment Submission": "Has anyone else been depressed since they were a child?", "1_Text": "Yeah, I was about 9... I threatened to jump out of a tree that I had climbed at my neighbors house. I really just didn't want to go home...\nAnd ever since then, I can feel excited at times but it is very draining. It doesn't feel like it come naturally.... I work in retail so this is a constant struggle... when I get home from work all I want to do is sleep.", "2_Subreddit": "depression"}], "dsv2e3o": [{"0_Comment Submission": "Giant swirl, A rare and Unique phenomenon at crater lake national park, Oregon. [oc] (1080x1620)", "1_Text": "There is about 8 feet of snow at the lake this time of year. It doesn't take a rocket scientist to figure out that it can't be from today, or even in the last month. That being said, it is an amazing photo. Thank you for posting it, and as an Oregonian (who goes at least once a year) I totally congratulate you on capturing something that I have never seen or even thought I would see on Crater Lake. It is beautiful.", "2_Subreddit": "EarthPorn"}], "dt3v99s": [{"0_Comment Submission": "Redditors who grew up with strict parents, what was the most absurd rule you had to live by?", "1_Text": "Son of a bitch", "2_Subreddit": "AskReddit"}], "dtm5ca6": [{"0_Comment Submission": "Rogue One Alternative poster", "1_Text": "This was an amazing movie.", "2_Subreddit": "StarWars"}], "dv05lix": [{"0_Comment Submission": "My [25f] mentally unstable sister [26f] is \"pregnant\" with twins and is probably about to destroy my life. I don't know what to do.", "1_Text": "At this point you have cut her out of your life,  which is good. Moving out before she comes back is a good idea. Move, and visit your mother only when your sister isn't there. It may distance you from them... but this is your life. You have every right to protect yourself from people who want to harm you. Your mother will probably not understand, she will think that you are being dramatic or mean.... You will have to learn to live with this. Parents rarely understand what is right in front of their faces when it comes to their own children... years in the future, who knows, things may change. But you have all the rifht in the world to choose when or if that time ever comes. Your safety and the safety of your happiness, finance, and life come first.", "2_Subreddit": "relationships"}], "dv18ozy": [{"0_Comment Submission": "My new studio equipment arrived, so Frideriki had to pose for me and I got this LOL", "1_Text": "Mogget", "2_Subreddit": "cats"}], "dv260yx": [{"0_Comment Submission": "Man sentenced to 12 years in prison for stomping on, throwing puppy", "1_Text": "Somebodies already cut the mother fuckers throat.", "2_Subreddit": "news"}], "dvoe4cu": [{"0_Comment Submission": "I hate my job. I want to change careers.", "1_Text": "I suggest going on a trip. The farther away the better. If you can get out of the country and see someplace else is perfect. Take some time for yourself. Don't think about work now, just about where to go and how to get there. While you are gone think about it. Not enough to stress you. Just live for a minute. Simply relax. With talent comes a dislike for stagnation. You need a long faraway break.", "2_Subreddit": "needadvice"}], "dvyhcs7": [{"0_Comment Submission": "Am I crazy? Is this a hostile work environment? What do I do?", "1_Text": "It sounds like a very hostile work environment where your superiors feel like they don't connect with you very well (this is their own problem and you have no obligation to connect with them in the slightest) \n\nIt sounds like you do your job well, and diligently. You are outgoing in your field and you seem to be looking for more to do, all indicative of a person who is driven to greater heights. \n\nThis can be difficult for (underqualified, narcissistic and egotistical) management to handle at times. If you decide to stay, you will continue to be treated like this because they have set a president that it is okay for that behavior to exist. You are probably not the only person they treat this way and it seems like a toxic environment where complaints are swept under the rug repeatedly based on who has more schooling \n\n(obviously going through more school didn't help them become more socially equipt or less of an ass hole (And yes asking to speak to anyones mother is a totally slap in the face and rude as hell (you should have stone-faced said, \"my mother's dead\" and seen the look in that PH-stuck up D's face as she realizes what she just did)))\n\nI would recommend you look for something new, something that fits your personality and drive, nobody needs blind supervisors, and you shouldn't give your energy to people who don't deserve it.", "2_Subreddit": "needadvice"}], "dw81evs": [{"0_Comment Submission": "Has anyone in US ordered fabric from South Koren Etsy shops?", "1_Text": "Link to site? I don't ever think I've ordered from them but someone may have.... Do they have any reviews?", "2_Subreddit": "sewing"}], "dwdpdr2": [{"0_Comment Submission": "What hasn't aged well?", "1_Text": "The foley editor probably got bored and couldn't think of anything else to use. That, or he meant to replace it with something else later and forgot?\n*edit: \"Foley\"", "2_Subreddit": "AskReddit"}], "dwe744b": [{"0_Comment Submission": "That’s pretty sneaky", "1_Text": "First time I saw a fight at school it was at a school with a metal detector... the teacher hated teaching, the school had arbitrary rules like no wearing red or blue... it was like being in prison for 6 hours a day, and the kids acted like it. \nFights over stupid shit all the time, no support from the adults who didn't want to be there to begin with. Dark times, dark times.", "2_Subreddit": "ImGoingToHellForThis"}], "dwecexi": [{"0_Comment Submission": "This Tokyo driveway", "1_Text": "Beware of earthquakes....\nToo soon?", "2_Subreddit": "mildyinteresting"}], "dwecq2e": [{"0_Comment Submission": "Relevant", "1_Text": "I still don't need anything more powerful than a handgun... for pretty much any foreseeable future activity. But.... this is a good point. Fucking kids are cruel bastards", "2_Subreddit": "ImGoingToHellForThis"}], "dweqb62": [{"0_Comment Submission": "EPD: Another armed (shotgun this time) robbery today, 3/27/18", "1_Text": "This is right in front of an elementary school.", "2_Subreddit": "Eugene"}], "dwgorhb": [{"0_Comment Submission": "Glad we are erasing hate in this country [x-post r/powerwashingporn]", "1_Text": "That's what it looks like when I take a shower! ( someone with blue hair)", "2_Subreddit": "gifsthatendtoosoon"}], "dwhnmwc": [{"0_Comment Submission": "High voltage service error", "1_Text": "This is fucking scary! From afar it's even hard to tell!!!", "2_Subreddit": "interestingasfuck"}], "dwvm7r1": [{"0_Comment Submission": "Quick question, what are some ways of identifying laced fent?", "1_Text": "Thank you", "2_Subreddit": "opiates"}], "dwxfdki": [{"0_Comment Submission": "I hate periods", "1_Text": "Try the ring. I used to have the same problem on birth control. It sucked. But the ring is doable. You wear it for a month and then take it out for a week. However, you can daisy chain the cycles together and instead of having the ring out for a week to have your period you can put the next one in right away. There may be some spotting, but it's a lot better than the alternative. \nThe cons of this product are, you may feel gassy right around your period, you may also experiance diahrea on around the day that your period would normally start. And you may gain some weight. \n\nAlso, you can ask your doctor... You may have to do it in sequence... But they have the nonhormonal copper iud, it hurts to put in. Let's just put it that way. Fucking pain... But it will keep you from getting pregnant. Without the hormonal influence.", "2_Subreddit": "TwoXChromosomes"}]}], "1_submissions": [{"5q78r6": [{"0_Title": "Here is a compilation of the past four days. If you aren't angered, you're and idiot! Your rights, Your freedom, Your country!!!! Stand up and fight!!!", "1_Text": "Nah, I'm cool doing well publicized burnings. For crimes that are acknowledged and proved beyond a doubt to be real and fpr those that show no reasonable expectation of turn around, or those who have harmed someone or something helpless like a child, or animal. They should be publicly, brutally, executed.", "2_Subreddit": "political"}], "5q7azp": [{"0_Title": "Rise", "1_Text": "Nah, I'm cool doing well publicized burnings. For crimes that are acknowledged and proved beyond a doubt to be real and fpr those that show no reasonable expectation of turn around, or those who have harmed someone or something helpless like a child, or animal. They should be publicly, brutally, executed.", "2_Subreddit": "political"}], "5zm0ag": [{"0_Title": "me irl", "1_Text": "Nah, I'm cool doing well publicized burnings. For crimes that are acknowledged and proved beyond a doubt to be real and fpr those that show no reasonable expectation of turn around, or those who have harmed someone or something helpless like a child, or animal. They should be publicly, brutally, executed.", "2_Subreddit": "me_irl"}], "5zm46i": [{"0_Title": "Trudeau v.s. Trump", "1_Text": "Nah, I'm cool doing well publicized burnings. For crimes that are acknowledged and proved beyond a doubt to be real and fpr those that show no reasonable expectation of turn around, or those who have harmed someone or something helpless like a child, or animal. They should be publicly, brutally, executed.", "2_Subreddit": "me_irl"}], "6jbpdn": [{"0_Title": "Doctors, medical students, and other qualified professionals, in a medical emergency, how important is it to know the sex of your patient? Are there any examples that you can give when sex was a deciding factor in treatment?", "1_Text": "Nah, I'm cool doing well publicized burnings. For crimes that are acknowledged and proved beyond a doubt to be real and fpr those that show no reasonable expectation of turn around, or those who have harmed someone or something helpless like a child, or animal. They should be publicly, brutally, executed.", "2_Subreddit": "AskReddit"}], "6jbsg8": [{"0_Title": "[Serious]Doctors, medical students, and other qualified professionals, in a medical emergency, how important is it to know the sex of your patient? Are there any examples that you can give when sex was a deciding factor in treatment?", "1_Text": "Nah, I'm cool doing well publicized burnings. For crimes that are acknowledged and proved beyond a doubt to be real and fpr those that show no reasonable expectation of turn around, or those who have harmed someone or something helpless like a child, or animal. They should be publicly, brutally, executed.", "2_Subreddit": "AskReddit"}], "7hg3u4": [{"0_Title": "People who have trouble being out in public, how do you manage a night out?", "1_Text": "Nah, I'm cool doing well publicized burnings. For crimes that are acknowledged and proved beyond a doubt to be real and fpr those that show no reasonable expectation of turn around, or those who have harmed someone or something helpless like a child, or animal. They should be publicly, brutally, executed.", "2_Subreddit": "Showerthoughts"}], "85e7ou": [{"0_Title": "I fucking hate oral sex", "1_Text": "Nah, I'm cool doing well publicized burnings. For crimes that are acknowledged and proved beyond a doubt to be real and fpr those that show no reasonable expectation of turn around, or those who have harmed someone or something helpless like a child, or animal. They should be publicly, brutally, executed.", "2_Subreddit": "u_KumaGirl"}], "86stgt": [{"0_Title": "Am I wrong about this?", "1_Text": "Nah, I'm cool doing well publicized burnings. For crimes that are acknowledged and proved beyond a doubt to be real and fpr those that show no reasonable expectation of turn around, or those who have harmed someone or something helpless like a child, or animal. They should be publicly, brutally, executed.", "2_Subreddit": "TwoXChromosomes"}], "8a39qz": [{"0_Title": "Quick question, what are some ways of identifying laced fent?", "1_Text": "Nah, I'm cool doing well publicized burnings. For crimes that are acknowledged and proved beyond a doubt to be real and fpr those that show no reasonable expectation of turn around, or those who have harmed someone or something helpless like a child, or animal. They should be publicly, brutally, executed.", "2_Subreddit": "opiates"}]}]}]}