{"Betherein5minsbro": [{"0_comments": [{"dwgd7cb": [{"0_Comment Submission": "Greetings! Cold cop story", "1_Text": "Yea it's not something I would ever condone. It was more so the withdrawals/panic/desperation that was controlling my actions. It also wasn't a house it was one of the many connected apartments in the projects and my middle/dboy was in the car so I figured if something crazy was to happen he would be outside in his car with a phone", "2_Subreddit": "opiates"}], "dwggxhz": [{"0_Comment Submission": "Greetings! Cold cop story", "1_Text": "Sorry I didn't research the proper way to introduce myself. ...", "2_Subreddit": "opiates"}], "dwggzfo": [{"0_Comment Submission": "Greetings! Cold cop story", "1_Text": "I wasted my time that day but it was originally supposed to be a quick run and back.  I don't got Philly bc I'm not familiar with the whole open air market and I'd prefer someone to go with me that knows what he's doing so I don't get bunk shit or whatnot", "2_Subreddit": "opiates"}], "dwgjgz4": [{"0_Comment Submission": "Greetings! Cold cop story", "1_Text": "Haha correct!  I would love to go to Philly on the weekend I just would hate to go to the wrong block or whatever and end up robbed or arrested or some shit. If I ever try to head there I will make sure I'm not sick, have an idea based off research regarding what part of the city to go to, and will bring enough money spread in different pockets to get a good score like 50-100 bags or something, wouldn't go there for a bun hah", "2_Subreddit": "opiates"}], "dwgjke3": [{"0_Comment Submission": "Greetings! Cold cop story", "1_Text": "There's not many \"hoods\" around here. Least not any I know of that have obvious hookers around to go that route. I was thinking of going to one of the many trucker stops where they eat/drink/hang bc I know someone that pimps out his fat girlfriend at those spots, maybe I can find a hooker there hah", "2_Subreddit": "opiates"}], "dwgjpli": [{"0_Comment Submission": "Greetings! Cold cop story", "1_Text": "Hah thank you!  Yea the area isn't somewhere a murder or some shit would happen and just slide, I was worried about getting robbed but it was 250 not a grand or something and that's only if he had me strip down (I kept 50 in my wallet and the rest I put in a little inner pocket in my coat, and given I told him I had 50$ I'd hope he'd just take the wallet cash and tell me GTFO hah", "2_Subreddit": "opiates"}], "dwgjxo5": [{"0_Comment Submission": "New Cold Cop story", "1_Text": "Hah I just posted my cold copping story and it's damn siniliar to yours as far as a black dude just inviting me in after I make clear what I'm after. Luckily I've only had to cold cop once. I'm currently scripted subs so I do them monday-thursday typically, then Friday I will avoid anything then Saturday and Sunday I'll go hard. Exception being my boy hooking me up to run for him, in which case I'll either pocket the extra dough (hard to do when your running to grab even if I alrdy did a sub) or I'll get a free bun or so.  Cool ass story was surprised he was a legless dope dealer hah", "2_Subreddit": "opiates"}], "dwgk3yp": [{"0_Comment Submission": "What if you could shorten your w/ds to 5 minutes but during that 5 minutes you feel the cumulative pain you would've during the regular 5-7 days so it would be extremely painful but much shorter?", "1_Text": "I would give anything for paws to not be part of the wd process. Anytime I tried getting clean the physicals I always considered easy (aside from RLS which is hell on Earth). What gets me is feeling anxiety, depression, detachment, no drive to do anything or go anywhere. It's that shit that ends up being my down fall every time.\n\nOne day in my life I will take a month off of work or in between jobs and give it another real shot. I'm better off doing my subs in between benders than trying to quit half the days a month knowing I'm just gonna have during the peak of paws", "2_Subreddit": "opiates"}], "dwgvafq": [{"0_Comment Submission": "Greetings! Cold cop story", "1_Text": "Lol combination of 2 of my most hated posts...are they real posts and \"look I paid like nothing for this stuff y'all are idiotz!\"  posts..lol...and candy picture posts..bahh", "2_Subreddit": "opiates"}], "dwgvmkj": [{"0_Comment Submission": "Greetings! Cold cop story", "1_Text": "That would be a bizarre and awkward situation where I'd hope my \"primal\" didn't come out.  If I said I wanted to hold my money until whoever shows up and a stranger said no I'd definitely have all kinds of thoughts rushing through my head", "2_Subreddit": "opiates"}], "dwgvp37": [{"0_Comment Submission": "Greetings! Cold cop story", "1_Text": "I'm white but this area there are plenty of white and other races in the projects so just being there wasn't worrying me. Now if I had a 2017 Audi yea I'd be a bit more aware of where I was at and keep my eyes out more but my car isn't throwing any \"I'm a loaded white dude\" signals hah", "2_Subreddit": "opiates"}], "dwgwzs5": [{"0_Comment Submission": "Greetings! Cold cop story", "1_Text": "That's some scary shit.  The dude who invited me into his place was someone I could definitely handle unless he had a gun, I'm not sure if I would of went in the house if the dude was super intimidating and all that. Who am I kidding I would of went into anyone's house that day if I thought it meant getting to get that 250$ outta my pockets and into my nose hah", "2_Subreddit": "opiates"}], "dwh2y5g": [{"0_Comment Submission": "Greetings! Cold cop story", "1_Text": "I guess not lol.  I changed it for you :-)", "2_Subreddit": "opiates"}], "dwhafw8": [{"0_Comment Submission": "Greetings! Cold cop story", "1_Text": "Oh I can definitely find shittier parts of the city. It's finding people outside that look approachable to ask about this shit. Granted its just getting over winter I might try to drive around once it's warmer and hopefully find some people that look the part and give it a shot. \n\nMy main plug is solid only problem is his shit hasn't been the best to where it's damn hard to catch a nod (I snort) unlike when we first met and also I meet him on lunch typically and for the life of me don't understand how \"I'm walking there now 2 mins away\" turns into either 45 minutes or I call after 30 minutes and he acts like we didn't speak half an hour ago and he's on his way now. It's shit I just can't deal with when I'm on my lunch break", "2_Subreddit": "opiates"}], "dwhahhm": [{"0_Comment Submission": "fuck sour patch kids...", "1_Text": "How about fuck candy were not 7", "2_Subreddit": "opiates"}], "dwhicdw": [{"0_Comment Submission": "Greetings! Cold cop story", "1_Text": "Haha yeah it was a terrible looking scenario but the withdrawling primal side threw caution to the wind and almost a year later and still get from this dude mostly :D", "2_Subreddit": "opiates"}], "dwi3cea": [{"0_Comment Submission": "Relatable addict story", "1_Text": "Damn well you know there's definitely some guilt down there or at least regret because for you to even pull over and let her pick you up your clearly having to be submissive, or at least want to show your sober so bad. Are you sure you didn't drop the cup in there on purpose (like subconsciously did it to avoid the results and have plausable denyability in your pocket)?\n\nGet back on the wagon man 5 months is a lifetime for us addicts and you did it once so whatever drove you to do that do it again.\n\nGood luck man", "2_Subreddit": "opiates"}], "dwi6erf": [{"0_Comment Submission": "Relatable addict story", "1_Text": "Everything blow over? (Not kicked out hopefully) \n\nI can't imagine a mother that cares so much about her son's sobriety having the heart to kick you out but I could be wrong (I always felt I could get away with murder when I lived home without getting kicked out, so I played by the rules out of respect but still got shit and all that secretly)", "2_Subreddit": "opiates"}], "dwi8ymk": [{"0_Comment Submission": "Subs anyone", "1_Text": "I'm scripted the pills. I feel like the strips last me longer but the pills I feel \"better\" off of hah", "2_Subreddit": "opiates"}], "dwia7j9": [{"0_Comment Submission": "Best way to take OP oxy?", "1_Text": "This is the best method imo. I actually nibble little pieces of the coating off first, then once the pill is stripped I would nibble at it breaking it into the smallest piece possible, swallow it, repeat. Plan is to create the most surface area to be broken down in your stomach.  \n\nProcess takes about 10 mins then maybe 15-20 until you feel the come up.", "2_Subreddit": "opiates"}], "dwiar5e": [{"0_Comment Submission": "Hopefully my last shot of dope. Armed with blue dream, 90 xans, some OTC comfort meds, and a dream of a better future, I think this is the kick that sticks. I deserve better than this and I'm going after it with everything I've got. Much love to everyone reading 💖", "1_Text": "Good luck, it's easy to talk about quitting when your high/soon to be high , so I truly hope your positive attitude carries over to when you start really getting into WDs", "2_Subreddit": "opiates"}], "dwihmf0": [{"0_Comment Submission": "Don't you just love everyone whose personality revolves solely around the fact that they smoke weed is always a \"drug expert\" on literally everything about every drug?", "1_Text": "We want gifs or it didn't happen !", "2_Subreddit": "opiates"}], "dwrxuki": [{"0_Comment Submission": "My biggest fear", "1_Text": "First, if she ever gets prescribed Vicodin or Percocet, unless she really needs it, don't take it. If need be make sure you give her pain medication as needed.  Second, make sure your pain meds, if any, are not accessible to her. Third, be aware of who she hangs out with and make a note if they smoke weed, as the drug itself is not (In my opinion) a gateway drug, but the crowd that experiments with it young may lead to experimenting with more as with the case of my friend.\n\nThose are some basics, now I'll give a few things to lookout for if you think she is in active addiction.\n\nFirst, is her money. If she's constantly broke and/or looking for money. Unless you know where that money is going with your own eyes (if she says she needs it for clothes or books, make sure the amount she is asking for is damn near spot on to the cost of what she is looking to buy.\n\nSecond, pinned eyes.  This is an easy one to spot, if the black in her eyes is tiny, she is on something (not sure aside from opiates what else causes this)\n\nThird, if she randomly shows signs of withdrawal (runny nose, sweats, etc) then it goes away, and comes back and so on and so forth, then she could be using, then out of money or connects, then using, etc. \n\nHope this helps in some way", "2_Subreddit": "opiates"}], "dwrzh3e": [{"0_Comment Submission": "My biggest fear", "1_Text": "If even one person avoids this addiction due to anything I tell anyone, anywhere, that's a win . Lmk if you have any other questions", "2_Subreddit": "opiates"}], "dws86nt": [{"0_Comment Submission": "In five words, why can I trust you? If I deem you trustworthy, you'll gain my key (Attempt #2)", "1_Text": "Because I am not black", "2_Subreddit": "CircleofTrust"}]}], "1_submissions": [{"87wf3n": [{"0_Title": "Greetings! Cold cop story", "1_Text": "Yea it's not something I would ever condone. It was more so the withdrawals/panic/desperation that was controlling my actions. It also wasn't a house it was one of the many connected apartments in the projects and my middle/dboy was in the car so I figured if something crazy was to happen he would be outside in his car with a phone", "2_Subreddit": "opiates"}], "889rk3": [{"0_Title": "Direct deposit nightmare", "1_Text": "Yea it's not something I would ever condone. It was more so the withdrawals/panic/desperation that was controlling my actions. It also wasn't a house it was one of the many connected apartments in the projects and my middle/dboy was in the car so I figured if something crazy was to happen he would be outside in his car with a phone", "2_Subreddit": "u_Betherein5minsbro"}], "89nsh3": [{"0_Title": "u/Betherein5minsbro's circle", "1_Text": "Yea it's not something I would ever condone. It was more so the withdrawals/panic/desperation that was controlling my actions. It also wasn't a house it was one of the many connected apartments in the projects and my middle/dboy was in the car so I figured if something crazy was to happen he would be outside in his car with a phone", "2_Subreddit": "CircleofTrust"}]}]}]}