{"MobTiedD": [{"0_comments": [{"didxp28": [{"0_Comment Submission": "Fent Pressed Roxi's Warning!", "1_Text": "No, the imprint does not always perfectly line up with the opposite side, for example if you have M facing you, an flip it over, the 30 is sometimes upside down, sometimes At a 45 degree angle, sometimes lined up.. I know this for a fact, as I have them in front of me right now. I've popped the seals on plenty of 100 count tablet pharmecutical manufacturer bottles, straight out of a pharmacy.. (Not the Orange see thru script bottles, the white plastic sealed bottles from the manufacturer for pharmacist to dispense that says \"this container not for household use\" is what I'm talking about).. Same with the V's as far as the imprints lining up, they don't always.. The misconception I've seen on this sub forum is that is a indicator of authenticity, like you've mentioned.. Although this is not true, and I would not go off of that way of telling, imprints themselves is what I would focus more on!", "2_Subreddit": "opiates"}], "die0xhk": [{"0_Comment Submission": "Fent Pressed Roxi's Warning!", "1_Text": "Yea bro for sure, no problem! I'm always willing to help, especially when it comes to reducing chances of fakes being passed off as real and helping people spot them, as well as harm reduction in general!! Yea any blues that have a imprint on both sides (including just a score mark on opposite side like ALG's, 54 199's, etc.) as well as V's, an of course M's all have this same thing where if I line up like 5-10 pills in my hand all perfectly even and straight, numbers/letters facing me, and then flip them all/or half of them onto other side, I'll notice that none of them are perfectly lined up as far as the opposite sides imprint! Although it seems like it would be expected that they do line up, and seems it wouldn't be that hard to accomplish for the manufacturers to perfectly align both sides, I guess it's not of much concern.. Haha! And that's wassup man, you just detox recently or u got some clean time under the belt so far? Congrats, you can do it! Keep up the good work homie", "2_Subreddit": "opiates"}], "die179q": [{"0_Comment Submission": "Fent Pressed Roxi's Warning!", "1_Text": "Yea your right bro haha and yea that's why I mentioned it! I've seen a few people on here say that same thing with the imprint being a authenticity indicator lol it's like damn people really be too skeptical of fakes these days.. What I mean by that is people call real pills fake all the time, simply cuz they don't know there shit to start with and want to act like they know.. Or there new users with little to no experience an don't know any better an hear all the FUD about fakes on places like here an then think every pill is fake even when they get reals, just cuz they hear about the fakes on Internet and lll admit, the fake Xanax game is across entire U.S. Now, so people more likely to think all pharms are being faked to that extent..! Blues is starting to make there way up there as second most common faked pill after Xanax . Like yea I get it completely cuz there IS DEFF a lot of fakes on the streets these days, an I run into them quite often, although I normally have my own scripts so I'm not too worried about it.. Plus my plug literally has thousands stockpiled of every imprint so I can just request my favorite press when I need some, or if I'm flipping 100-500 packs it's always a mix of all imprints.. So I guess I'm lucky in the fact that I don't have to deal with the normal street dboy bullshit an worry about getting robbed/getting fake pills... Lol although my plug is pretty bad on time an making me wait, I pick up large quantities only mainly so I only see him few times a week.. \n\nEDIT: I meant imprint lining up on the opposite side of pill with the front side of pill being a indicator of real/fake.. Not the imprint itself. Because that's obviously one of the main indicators!!", "2_Subreddit": "opiates"}], "dieyhb0": [{"0_Comment Submission": "PharmaDope Porn!!", "1_Text": "To be honest, a little bit of both lol.. I have scoliosis and some slipped/herniated discs in my spine.. As well as a bit of sciatica, so I have the legit medical reasons for pain management/opioid therapy, as well as I was just in a another major car accident few months ago, totaled my car, was T-boned.. The dude didn't stop, but it was partly my fault as I have epilepsy an had a seizure while driving (they say I ran a red light an did a hit an run, I don't remember any of that).. My neurologist believes it a was a seizure that causes crash..\n\n Anyway, yea I'm in the Gunshine state down south... So pill mills are still around if you know where to look an have connections, not nearly as many as years ago obviously though.. But yea my most up to date MRI from a few weeks ago is going to land me a increase to bump up my IR 30's script an hopefully replace the dilaudid 8mg with OPana IR 10mg as well as change the MS Contin ER 60mg to OPana ER 20/30mg.. Which the doc basically gives u whatever u want as far as DOC.. Any opioid u prefer lol..\n\n But I have about 9 of my friends who go to the same doctor as me, an we also have another doc on the payroll about 2 hours from me who I got 3 people who go to that doctor... So I sponsor them all and get a minimum of 50% of there script every month, an sometimes I pay out of my pocket to fill there scripts at pharm, and pay for doctors appts, and sometimes they give me 80/100% of the scripts monthly if they aren't users themselves.. So we have it organized to where I have enough never run out of supply an make 25-30k off each 1k Blues lol... I also use a decent amount too for pain an sometimes abuse them myself.. \n\nBut no blowing involved... More like I *pay* him large amounts of cash every time me or my friends see him lol...! It's MUCH more regulated then before 2011 in my state, but scripts are still obtainable without a doubt... Just very strict and you need documentation an records of diagnoses/conditions and MRI's/CT scans/X-rays,etc. to prove medically accepted scientific based evidence to neccesitate pain relief/reasons for prescribing opioid therapy so the doctors cover there own asses an don't get in trouble.. \n\nPlus organized crime members are the ones who OWN the pain clinics down here, and they simply contract doctors and nurse practitioners to work as medical director/MD's/specialists for the clinics, and a lot of the times the only people to achieve large high dose, high quantity scripts to the extent I do these days, are people associated with the organizations, and those willing to pay the large sums of cash to obtain those scripts.. An it's a limited number of people they can allow those types of scripts to per clinic... So that's why so many people have trouble at pain management.. \n\nIt's because they don't know the ins an outs an the behind the scenes shit on how to work the system, an if they knew who really owned an ran these types of clinics, they would understand a different approach is necessary as opposed to acting like its 100% legit square doc's who will kick u out for implying anything.. It really depends on where/how the clinic is ran, and u can tell by the PM contracts they make u sign, the ones more laxed an less terms to follow on contracts are normally pill mills in my experience... \n\nThere's ALOT more to it than that, an you can't go by just that alone... But I realize I'm just ranting at this point, so I'll cut it short.. Honestly I've said way to much detail already at this point lol..", "2_Subreddit": "opiates"}], "dif54cq": [{"0_Comment Submission": "If MDs no longer Rx oxy, where do sellers get it from?", "1_Text": "Doctors/specialists of all sorts which warrant pain management/opioid therapy are most definitely still prescribing a lot of oxycodone... \nAtleast in my area, although I'm from the oxycodone Capital where in early 2000's up until 2011 almost all 50 of top oxy scripting doc's in the country where here... Although it's HEAVILy regulated and MUCH less prescribed than before, there's still MORE than enough scripts going around to supply surrounding states as well as us... The DEA regulates oxycodone down to every last damn pill these days from the manufacturing process, transporting/distribution chain, all the way down to when the pharmasict counts out your 120-240 pills and you pick them up... \n\n(Walgreens has a #120 limit on 30mg oxycodone, you must go twice a month if your scripted #240 here, 120 every 2 weeks it's bullshit) but not at mom an pops... Lost/stolen/marked to be destroyed blues/D's/other sched II pharms, as well as especially much more of drugs lower than schedule II pharms from any part of supply chain in general, an mom an pops contribute to the black market in large quantities to a great extent, but organizations who sponsor folks to acquire scripts, people who already HAVE scripts, and contract doctors/nurse practitioners to work in pain management clinics that the organizations OWN is the majority of diversion/pill distribution,\n\n(narcotic only therapy, no PT,no injections,no specialized treatments, etc. .. cash only business, no insurance, packed wit dealers/junkies, long waits/full waiting rooms and parking lots with solicitors, etc. etc...) these higher level people cash out these peoples scripts and gather/stockpile as much specifically just blues/dilaudids/opanas/Xanax, end up with thousands of every manufacturer/imprint of every pill in demand(mainly blues/dilaudids/opana/Xanax) and distribute an traffick them.. \n\nThing is the whole opiate/opioid epidemic, (when I say that I mean the heroin/fent problem, an the overprescribing and widespread diversion and abuse of controlled narcotic pharmecuticals) and media, as well as all the real pain paitents who can't find a good doctor or get cut off from there meds, get turned down, etc. makes it seem like it's impossible to get narcotics such as oxy these days, when really that's not the case, it's just that all the PDMP's (prescription drug monitoring programs) in almost every state now, and the DEA scaring an pressuring MD's to cut back on there opioid prescribing practices \"or else\", and they made a example out of all the doctors making millions a month off pill mills up until 2011...  As well as quite a few doc's who genuinely didn't run pill mills, just made a few mistakes with the wrong people..\n\n Scripts are still obtainable to a great extent in every state in the U.S., for lean, oxy,OPana,dilaudid Xanax, adderall, anything you want really.. Thing that makes it hard now than back in the day is you need documentation and history of condition/diagnosis(MRI/X-rays/CT scans,etc.) showing SOMETHING doctors can use as an excuse to script you,because doctors need to have proof of medically necessity of opioid therapy based upon medically accepted scientific facts that you have pain.. And now there is FDA and medical association prescribing guidelines which limit what doctors can. Prescribe you right off the bat depending on the condition an severity of pain, whether it's chronic/acute, etc.. So it takes a while normally/legitimately to actually get large dose/large qty scripts of narcs.. Not like back in day at all but still possible.. \n\nAny way I'll stop ranting now.. Just wanted to shed a little light in it for people who don't know how the game works... \n\nAnd as far as cartels making oxy, I've heard of a few Mexicans bringing In fent pressed American oxy imprint pills(OC80/OP80,M30/A215/V4812/K9, etc.) presses... There is a story of a Mexican 18 yr old crossing into U.S. Into Cali thru border wit 1200 OC80 fent press pills, an 5 grams pure fent powder, in his nutsack, BOrder police seen bulge in pants an got him, I'll try to find story.\n\n. Ther  out there to a very minuscule Extent.. Almost non existent in my area. I know for a fact my area is FLOODED with real pharms but fakes are out there and people with no connections who don't know there shit at all are the only ones actually getting got an ripped off with fake blues/Xanax these days... \n\nAlthough I correct myself, Fake Xanax is abundant EVERYWHERE in the U.S., even my area.. But I get about 1.3k real pharm (my script/sponsor scripts)bars a month so I do my thing wit those.. But no fake opiates except for a few dummies wit.fake blues around my area..", "2_Subreddit": "opiates"}], "difdpps": [{"0_Comment Submission": "If MDs no longer Rx oxy, where do sellers get it from?", "1_Text": "Lol take 2 blues then ;)..!!! Lol yea right, you'd think I was on stimulants the way I ranted there!! I'm just really involved in the whole doctor/pharm scene around my area so I know a lot about that shit u feel me... Had to spread a little knowledge, believe it or not it's all true shit I said as well lol..", "2_Subreddit": "opiates"}], "diijeu0": [{"0_Comment Submission": "Made it through my trip and headed home now!", "1_Text": "Nice lil pick up... Subutex 2mg an 1mg Kpins? If u ain't got.a script deff drive safe an be eazy dawg..!!", "2_Subreddit": "opiates"}], "diipnvp": [{"0_Comment Submission": "Hi, I'm new here. Saw people post their art, so I'll post shit I'm working on. Hand drawn art & rig porn in the post.", "1_Text": "Yooo.... I was just thinking the same exact thing lol like for real tho it totally looks like the game \"Portal\" in everyway possible lmao....!!! Great minds think alike.. Anyway, really nice art OP. I didn't click the links yet, is the picture on the thumbnail hand drawn as well? If so its really good, the shading, everything about it is intricate and well detailed.. Nice work, keep it up, I'd love to see more!!! I'm new here too, but this is a chill sub and I know what u mean by the pissy drugs sub stuck up snobby holier than thou attitude some of them have.. Like they think there better than us because they don't use? because opiates creates addicts at a much higher rate and the negative, misunderstood, stereotypical, propaganda driven stigma behind heroin/opioid abuse..? Fuck em tho..! We are welcome here!", "2_Subreddit": "opiates"}], "diisvyi": [{"0_Comment Submission": "Clonidine for withdrawal, do I take it morning day and night? Or only when I'm trying to sleep? Recently prescribed.", "1_Text": "If they are 0.1, and if your blood pressure is normal, like others have said, take 3 a day (morning/afternoon/night).. You may take maybe 1 more in the afternoon if your symptoms are really bad.. But to be safe, I wouldn't exceed 4 pills in a day, less is more with clonidine. Too much can be dangerous for some people with abnormal blood pressures as it is a hypertension med.. That's why doctors/detox facilities won't give it to everyone, because not everyone meets criteria to take it, especially since W/D and opiates both either raise your BP, or the latter (opiate use) lowers it..\n\n My personally preferred at home detox protocol is as follows:\n\nALOT of good medical marijuana, as much as possible, for me about a 1Oz-42g is enough for a week in W/D(high tolerance I smoke a lot). it just became legal in my state, and I have epilepsy so my neurologist is helping expedite the process of obtaining a card, so I can have my Cali/colo imported trees here legally anyway lol)\n\nBENZO's (preferably Xanax/Valium) but any will work... I normally have extra Xanax around (I don't take my scripts, plus friends with scripts so I'm covered)\n\nGABAPENTIN I have tons of full bottles of 300mg caps lying around, I don't take regularly, but they help immensely for WD, an a shit ton of other things they treat..\n\nIMMODIUM I normally never take more than 2-3 pills MAYBE twice a day.. Normally 3 a day max. I don't abuse them like many on this sub, I think its crazy lol...\n\nKRATOM I don't always use this, but it can help some people a shit ton..\n\nCLONODINE I normally don't always use this either, but I have a bottle laying around, and if it's used properly, can be a HUGE help for WD, I find it helps almost as much as gabapentin..\n\nPROMETHAZINE/ONDANSETRON (phenegran/zofran) for stomach cramps, Nausea, vomiting, helping keep food/fluids down an stay healthy/hydrated during detox.\n.  \nALOT OF WATER/hydrating fluids, HEALTHY, CLEAN, NUTRITIOUS DIET AND MAX HYDRATION FOR THE WEEK PRIOR TO A DETOX, AS WELL AS THE WEEK DURING DETOX!! Use zofran/PROMETHAZine if you have it to help eat healthy during detox, you won't want to but u HAVE to.. EXERCISE IN THAT WEEK IF YOU DONT REGULARLY, it will HELP LESSEN SEVERITY OF W/D SYMPTOMS IMMENSELY!!! NO BS!!\nNOT REQUIRED: SHORT SUBUTEX/SUBOXONE TAPER.. \n\nI've successfully tapered off 240-330mg a day of oxycodone with a 7 day subutex taper.. Second successful 7 day taper was 150-240mg a day(my current dose again lol)... With NO withdrawals at all when the taper ended... \n\nMaybe it's just me, but it works magically for me more so than anything else, an makes detox a cake walk compared to how bad I've suffered cold turkey in the past... It's as simple as 8mg twice a day for 2 days, 4mg twice.a day for 2 days, 2mg twice a day for 2 days(day 5 an day 6 u can take 1mg at night instead of 2mg), 2mg once a day on day 7.. Nothing on day 8, no withdrawals at all for me.. \n\nIf u want u can do 10-14 days an taper a little slower, but that or anymore than that,then your risking starting to build dependency an instead of it effectively tapering you off your DOC, you now have to taper off the SUBOXONE itself to avoid withdrawals from the bupe.. \n\nForgot to mention, obviously the BENZO's have the addiction/dependency risk if used for more than 7-10 days... But you should be ok if your serious about being clean an have self control an don't have a huge supply on hand like me.. \nAnyway, that's really all that's needed plus some for a effective at home detox. This is what I've done quite a few times, it's the best method I've had experience with so far. I also help friends with this method an they love the cock tail of comfort meds that takes WD away almost completely.. And I'm talking experienced detoxers some of my friends on there rich parents insurance in the recovery epicenter (my best friend who been do detox 19 times went to that guys rehab who just got 27 years in prison I seen on this sub) an he loved it too lol..", "2_Subreddit": "opiates"}], "dij0u59": [{"0_Comment Submission": "PharmaDope Porn!!", "1_Text": "Yea that's real u dummy lol go ahead an hate all u want..! DM him the pic he will confirm its real... I got paperwork, warranty card box an all.. U just mad cuz u can't afford a 9k watch", "2_Subreddit": "opiates"}], "dij1qyi": [{"0_Comment Submission": "Your neighborhood pharmacist 👨🏻‍🔬👨🏻‍⚕️fresh V cuts :)", "1_Text": "That's how A51's look... They have the speckled dark blue (darker than A215's, lighter than V's)... I've had them from the pharmacy before. I don't like them very much at all tho, I will say that much.. Not one of my personal favorites, but the A51 in picture is real!", "2_Subreddit": "opiates"}], "dij1syb": [{"0_Comment Submission": "Your neighborhood pharmacist 👨🏻‍🔬👨🏻‍⚕️fresh V cuts :)", "1_Text": "If you've ever actually seen a A51 before, you'd know that's real... That's exactly how they supposed to look..", "2_Subreddit": "opiates"}], "dim98e8": [{"0_Comment Submission": "To all my fellow fiends outchea on the grind", "1_Text": "Yes, basically it will set you back to the beginning, so you will still have atleast 7-10 more days of noticeably minor to severe w/d's...\n\nIn my experience, anytime I ever gave in at 2-4 days thru a home detox, I would always end up suffering longer an prolonging the process because of using for a day or two. Although, the only positive to this is your W/d's MAY be slightly less severe than your first 3 days, and like someone else said, everyone is different...\n\n If you have a very good and healthy diet, and are Very hydrated, it helps wonders! Very noticeable difference for me, like night and day.. So if you get bad nausea/throw up a lot, try to take promethazine/ondansetron(the genreic versions of phenrgran/zofran) and eat/drink a lot during detox.. I know when I was barely eating properly and tried to detox, when I was throwing up 10-15 times a day atleast an couldn't eat it was the worst i was suffering bad shaking, seizures (I have epilepsy so extra prone to seizures), all the worst possible... (I'm oxycodone only, IR 30's oral/snort/smoke mainly, between 150-240mg a day average. At my worst was over 300mg.. (10-12 blues a day)an that was BAD)... \n\nAnother time, I hAd the same habit, (180-270mg oxycodone daily) and made sure I ate a SHIT TON of healthy food and Gatorade, powerade, teas, fresh made fruit smoothies, fresh squeezed juices, whatever, etc.. Etc.. For about a week to 10 days BEFORE my detox off 7-9 blues daily, it literally made the detox seem like I barely even had W/d's... Like I was coming off 15-30mg a day an only using for a month or two, instead of 2+ years daily at that dose lol..\n\n Now both times I used my normal preferred detox comfort meds, which consist of (Gabapentin,ALOT of weed atleast 1oz+ like 28-42 grams for the 8-10 days(I smoke ALOT cuz I sell weight an got huge THC tolerance lol), immodium(Low doses only 2-4 pill a day MAX. I don't abuse lope like many on this sub...),SOMETIMES clonodine and kratom, they can help a shit ton, especially clonodine, but gabapentin works even better than clonodine for me so I use that every time mainly cuz it's more effective for me an I have a shit load laying around..", "2_Subreddit": "opiates"}], "dir7s2e": [{"0_Comment Submission": "Caffeine and Lamotrogine", "1_Text": "Are you on it for bipolar or epilepsy? My neurologist just tried to put me on it (For Epilepsy).. I didn't even make it past the titration before stopping intake.. I don't like the side effects and the way a lot of meds effect me...! After experiencing what I felt off lamictal I could see how it would have a effect on caffeine use, although I can't tell you if it's common, nor can I tell you why it would effect it.. I no longer take the drug.", "2_Subreddit": "Drugs"}], "diyqg02": [{"0_Comment Submission": "Would it be okay to take a half of tramadol 6 hours after Adderall XR?", "1_Text": "If your taking the dosage your doctor prescribed you (assuming you have scripts for both drugs, since you say you have back pain) I wouldn't worry about the interaction.. As long as your not abusing them beyond a reasonable extent, you should be fine.. Especially since it's just tramadol an not a \"real\" strong opioid... Just for reference, for what it's worth... I know plenty of people including 2 family members and a few friends, all while are on a daily combo of high dose oxycodone (30mg IR 4-6x daily, and 20-80mg ER 2x daily), along with decently high dose benzo Xanax/Valium (2-6mgxanax, and 10-30mg Valium) and adderall 30mg IR daily..So long as your aware of the risks, and take it easy, I would say you should be fine.. Especially with that much time between doses (6hrs?) Although I am not a doctor, and this is not medical advice. If you do not feel comfortable with it, either don't do it, or do more research on the combo's interactions so your aware of the risk at least.", "2_Subreddit": "opiates"}], "dpou5g6": [{"0_Comment Submission": "Half a V and A215", "1_Text": "Hey what's up, not trying to hate.. Just sayin,Just in case your not aware... That green bar is 100% fake.. Be careful mixing pressed bars with blues u never know if it's real Alp or what dosage these days with fake bars... I get hulks sometimes when I fill my script and the \"S\"/color/shape is the biggest noticeable thing I can point out... Regardless if pressed or not.. Enjoy!", "2_Subreddit": "opiates"}], "dqhshq3": [{"0_Comment Submission": "Can I re-dose Codeine ?", "1_Text": "Yea your good... Think sippin lean.. I used to spend $1000-$2000 a week on sippin lean a few years back when actavis was still around.. Only way I'd actually get fucked up is to take a 1oz shot an then po up a 4-6 a day on average.. Now I slow down tho and only sip occasionally like right now I copped a 8 the other day an sippn some wock purp rite now an on a few roxi 30's an half a bar.. I'm Gucci an u talkin a good combo just be careful.. Enjoy\n\nEdit: I'm pretty faded so I lost my train of thought and went off topic and missed the entire point of the comment lol.. Anyway, my point was is you can deff stack doses of codeine through out the day and still get high.. Lol", "2_Subreddit": "opiates"}], "dqxmwht": [{"0_Comment Submission": "First time trying dillys :) 🔥🔥🔥💎", "1_Text": "Maybe it's just me.... But I hate Dillys lol I never have/never will use needles to IV drugs.. Outside a hospital and besides to IM some Testosterone Sustanon/Trenbolone Acetate (do u even lift bro? Lol)... My oxycodone tolerance is around 90-150mg a day on average... I snorted a dilly8 an almost nothing at all..snorted another 8,still barely high... Less than a hour later another 8mg.. Now I'm feelin like I did 2 blues (snorted1/smoked1, didn't even feel as high as snorting 2 blues would get me, because I smoke blues also an I know it waste a lot bioavailability wise an the heat breaks the drug down, but I enjoy the process and high of smoking).... An finally did yet ANOTHER 8mg finally felt kind of high... Gave it about 20-30 months to hit me harder an still wasn't satisfied so took another 4mg... I'm my opinion they really fucking suck compared to roxi30's... But maybe that's just me... I had to do literally almost 30mg of dilaudid within less than a 2 hour period just to achieve a SIMILAR high to 2.5 MAYBE 3 roxi's... An normally I don't have any problems with my nose as far as sniffing so I don't know why I was so disappointed with Dillys... Since then I've never done one again.. I've sold plenty of them tho.. (Very good investment an profitable product for me since I don't use them, but with blues I'll do too many an barely make any $ or just break even..) .... I guess u really do have to IV them to make it worth it cuz to me snorting them sucks it only took me 2 occasions to never want to touch them again...So that's my experience with Dillys lol just wanted to add my 3 cents... Enjoy tho!!!", "2_Subreddit": "opiates"}], "dqypgvk": [{"0_Comment Submission": "Just took 3ml of Hydro/Homotrope syrup, what should I expect?", "1_Text": "I hope you mean 3oz an not 3ml as its 30ml per fluid ounce an a single as prescribed dose would be 5ml... Lol I just ran thru a pint of that red hydcodan/hydromet which is hydrocodone/homotropine 5mg/per5ml... As well as a pint of wockhardt promethazine/codeine purple which is 10mg per 5ml cuz codeine weaker.. Anyway yes... There are some minor side effects from over 2-3oz of hydro/homatropine... That and the not as desirable taste is the reason most prefer red/purp prometh/codeine which i do as well.. Don't worry about it if you didn't drink over 2oz you should be fine maybe slightly nauseous or disoriented... The hydro have u buzzin tho", "2_Subreddit": "opiates"}], "dqzlsh1": [{"0_Comment Submission": "I took 15mg hydrocodone earlier then took another 30mg whil high", "1_Text": "If your still drinkin the red hydrocodond/homatropine syrup, generic for hydromet/hycodan syrup.. Than u got your strength per volume ratio fucked Up... And I'm assuming u don't know how much hydro ur truly takin at all if you don't know the difference between mL, tbsp/tsp, or fluid ounces(displayed as Oz.) on your syrup bottle... Not trying to be a dick but it almost seems like your trolling.. In ur last post u said u took 3ml and thought it equaled 15-20mg of hydrocodone... I attempted to correct u and explain to you that if you really drank 3mL an not 3oz, it would be less than 5mg hydrocodone... A prescribed dose(not recreational) is 5ml which is 5mg of hydro... There is 6 5ml doses per 1oz which equals 30mg hydrocodone per OUNCE.... Assuming you don't have a full pint of syrup an probably have a 4-8oz Max, there's no way you could have truly drank what you think you have.... Maybe placebo or psychosomatic, but your one a almost useless dosage of hydrocodone unless u have ZERO tolerance to opiates/opioids.... Just trying to correct u and inform u that if u took 3ml that's 3mg not 20mg", "2_Subreddit": "opiates"}], "dqzniyi": [{"0_Comment Submission": "I'm back! Hopefully for good this time!", "1_Text": "Lol speaking of people using the term \"dboy\" inappropriately, it kind of low key bothers me to a minor extent in a chuckle out loud type way when your average junkie refers to there dealers/connects as \"plugs\"... Yea I get that it's a slang term for a connect, but to me, where I'm from, a REAL PLUG is a big money big weight type of connect... The type who wouldn't even do business with users especially users getting under a Oz at a time (whether it be coke/boy/Molly/weed whatever).. Nothin wrong wit people Sayin plug more often these days.. I'm sure a big reason it got popular is every rapper talking about being the plug or having the plug these days as well lol..... I used to/still do to some serious extent move a lot of weight(that's how I was supporting a 6-10k+ a month SPENDING habit, atleast half of that was on drugs monthly tho..that's between smokin well over a half pound of exotic trees/Oz+ of shatter/wax, doing hella blues(main money pit),some coke, going out partyin/clubin/bar hoppin,an buyin all expensive ass designer clothes/watches/jewelry ... so in retrospect near 10k a month wasn't so bad to me since it was on living expenses(not including bills) too not just dope(I don't use heroin, maybe once or twice every few months IF that much.. I Just do roxi's) my bad for the rant... Just high as fuck smoked 6th blunt of the night an on 5 blues an a quarter of. A bar.. Just something I've always thought of when I see it all the time on here... Lol", "2_Subreddit": "opiates"}], "drjp5n5": [{"0_Comment Submission": "Peaches! Seriously, I barely even suggested anxiety meds and the psychiatrist gave me benzos, but I can’t find a single opiate anywhere I look lol", "1_Text": "Just got a script of 90 of these exact brand (actavis/PurePac) peaches earlier today...! Popped 5 of them few hours ago an just tooted a .15 of some raw ECP out of the Gram I copped few minutes ago an gonna smoke a roxi30 or two a little later when I ain't noddin so hard... Think i went a little over board Ima little too fukd up for comfort... The zan's made me not think about how much boy I jus snorted lol... Kinda approaching than unconsious nod similar to last time I OD'd on Xanax an oxycodone... I normally never do boy for the quality/purity fluctuation reason.. my tolerance to roxi's is very high 180-270mg a day tho... I shud be good hope fully lol", "2_Subreddit": "opiates"}], "drnfef3": [{"0_Comment Submission": "Maybe my last Christmas..", "1_Text": "There's plenty of other ways to get out of the country than with a fake passport for 30k... Lol Some of those ways requiring a bare minimum of funds/resources.. Although it's a matter of how your going to survive once you get to your destination if you don't have a large sum of cash to hold you over... Once your in Mexico it's pretty easy to get to cuba or elsewhere in South America... (I've been to over half of South America, and Costa Rica almost 10 times.. with a passport tho lol)", "2_Subreddit": "opiates"}], "drqdooz": [{"0_Comment Submission": "Yup....fucking junkie 101. Got these jeans about 6 hours or so ago and already burnt em up. I swear I can’t have anything nice. And if I do the shit don’t last more then a damn day.", "1_Text": "Man I feel u on that... I said the exact same thing to myself \"I can't have anything nice\" lol even though all I wear is designer but it happened to a $190 pair of Robert graham shorts... Day after I got them nodded out for 10 seconds an done... Crotch hole... I loved them so much I bought 2 more pairs tho.. Lol", "2_Subreddit": "opiates"}], "dwuondf": [{"0_Comment Submission": "Some blues👌", "1_Text": "Yea was about to say same thing.. ^ they are real despite the lipped edge... v's almost always come like that for some reason even out of a sealed 100count bottle sometimes half or more are like that/sometimes slightly darker color too... Then rest of them are perfect lol so much for quality control but there still decent..", "2_Subreddit": "opiates"}]}], "1_submissions": [{"6ec4qe": [{"0_Title": "Concern with fake blues", "1_Text": "No, the imprint does not always perfectly line up with the opposite side, for example if you have M facing you, an flip it over, the 30 is sometimes upside down, sometimes At a 45 degree angle, sometimes lined up.. I know this for a fact, as I have them in front of me right now. I've popped the seals on plenty of 100 count tablet pharmecutical manufacturer bottles, straight out of a pharmacy.. (Not the Orange see thru script bottles, the white plastic sealed bottles from the manufacturer for pharmacist to dispense that says \"this container not for household use\" is what I'm talking about).. Same with the V's as far as the imprints lining up, they don't always.. The misconception I've seen on this sub forum is that is a indicator of authenticity, like you've mentioned.. Although this is not true, and I would not go off of that way of telling, imprints themselves is what I would focus more on!", "2_Subreddit": "opiates"}], "6esd7m": [{"0_Title": "Fent Pressed Roxi's Warning!", "1_Text": "No, the imprint does not always perfectly line up with the opposite side, for example if you have M facing you, an flip it over, the 30 is sometimes upside down, sometimes At a 45 degree angle, sometimes lined up.. I know this for a fact, as I have them in front of me right now. I've popped the seals on plenty of 100 count tablet pharmecutical manufacturer bottles, straight out of a pharmacy.. (Not the Orange see thru script bottles, the white plastic sealed bottles from the manufacturer for pharmacist to dispense that says \"this container not for household use\" is what I'm talking about).. Same with the V's as far as the imprints lining up, they don't always.. The misconception I've seen on this sub forum is that is a indicator of authenticity, like you've mentioned.. Although this is not true, and I would not go off of that way of telling, imprints themselves is what I would focus more on!", "2_Subreddit": "opiates"}], "6eymrf": [{"0_Title": "PharmaDope Porn!!", "1_Text": "No, the imprint does not always perfectly line up with the opposite side, for example if you have M facing you, an flip it over, the 30 is sometimes upside down, sometimes At a 45 degree angle, sometimes lined up.. I know this for a fact, as I have them in front of me right now. I've popped the seals on plenty of 100 count tablet pharmecutical manufacturer bottles, straight out of a pharmacy.. (Not the Orange see thru script bottles, the white plastic sealed bottles from the manufacturer for pharmacist to dispense that says \"this container not for household use\" is what I'm talking about).. Same with the V's as far as the imprints lining up, they don't always.. The misconception I've seen on this sub forum is that is a indicator of authenticity, like you've mentioned.. Although this is not true, and I would not go off of that way of telling, imprints themselves is what I would focus more on!", "2_Subreddit": "opiates"}]}]}]}