{"countygangster": [{"0_comments": [{"cxgpgz4": [{"0_Comment Submission": "Going solo to Dreamstate, I've for a few questions", "1_Text": "Hey guys i really wanna go but im on a tight budget right now, i went to edc vegas this year, but if anyone is wanting to get rid of ticket for less, hmu plz thx", "2_Subreddit": "aves"}], "czpu9ip": [{"0_Comment Submission": "Do \"casual\" heroin users actually exist?", "1_Text": "yes i know someone who at the time is a functional h user, they work full time and hide it from certain friends and all family, I think its just a matter of time before it gets out of hand but they have been a closest user for little over a year and only smoke H, they go a few months of doing it, then they will stop for a little bit then pick back up, If you call this a \"casual\" user.", "2_Subreddit": "Drugs"}], "dsp21kk": [{"0_Comment Submission": "Can y’all help me out with info on KRATOM For WD?", "1_Text": "I have 15 caps of Green Malay and 15 caps of Bali and then 12 grams of Meang Da. I smoke about 1/2- 1 gram in 24 hours it depends on how much speed I use that day as well, but I get what your saying about dosage and how to do it by mouth, thanks for the advice though.", "2_Subreddit": "opiates"}], "dsp23ux": [{"0_Comment Submission": "Can y’all help me out with info on KRATOM For WD?", "1_Text": "Oh no shit lol well thanks for being a few days ahead of me lol good looking out!!  Hopefully people won’t have to explain themselves twice lol", "2_Subreddit": "opiates"}], "dsplnz2": [{"0_Comment Submission": "What’s The Closest Brush With The Law That Ya’ll Have (Miraculously) Gotten Out Of / Avoided Major Consequences From?", "1_Text": "Hahah ya it is, but some people actually get hyper from downers, if they have adhd or add, or something you know, but I’m not saying it’s the same for everyone or a bad thing but most I know like that do have it. \n\n     Anyway.. I was gonna say I thought this was a guy telling the story but then I got to the BJ part and figured it wasn’t, but I’m still curious though, not that it’s a bad thing or something like that, I just hate not knowing the gender in a good story lol \nI have had a few run in’s with Johnny law  that I got very lucky with but I’m terrible at telling stories and wording them on here.  My bad for rambling on as well that’s probably completely off topic. \nThanks for sharing", "2_Subreddit": "opiates"}], "dssb51x": [{"0_Comment Submission": "Can y’all help me out with info on KRATOM For WD?", "1_Text": "Damn really, that sounds likes a lot, I can handle a little shitty feeling, I don’t wanna be high but just not sick where it’s noticeable, you know but thanks for the feed Back, \n\n Idk if I can get more in time before I need to quit.. ughhh FMl", "2_Subreddit": "opiates"}], "dssb9e4": [{"0_Comment Submission": "Can y’all help me out with info on KRATOM For WD?", "1_Text": "I read that the different strands do you stuff different depending on where you’re at in WD, I thought I ordered different kinds but I guess not but if you’re sure the red strand would help me better and I will seriously get it I just want to make sure I spend the last bit of money that I have the best way I can. Thanks", "2_Subreddit": "opiates"}], "dsw7v05": [{"0_Comment Submission": "Facebook", "1_Text": "Ya my story is very similar to yours I’m from south west Ohio and Now on the west coast but so many people are dead and it’s like every few months three or four die that I went to high school and it’s crazy that area has been damage so badly and communities were torn apart from it.", "2_Subreddit": "opiates"}], "dudfgjk": [{"0_Comment Submission": "Question about subs and benzo’s mixing!?!?", "1_Text": "Thanks that makes me feel better because I already took it and then realized what I had just mixed, I won’t get drunk tho, like i was planning lol", "2_Subreddit": "opiates"}], "dudnkng": [{"0_Comment Submission": "Question about subs and benzo’s mixing!?!?", "1_Text": "Ya I’m all good I got a lil wine cooler an it’s all good, :) thanks for everyone’s advice it’s amazing how complete strangers have your Back but the mofo in front of me doesn’t haha \n\nStay safe y’all!!! Have happy nodds from someone who wishes they were!!!", "2_Subreddit": "opiates"}], "duf47dq": [{"0_Comment Submission": "Question about subs and benzo’s mixing!?!?", "1_Text": "Yeah I’m pretty tolerant and it went fine actually, it was almost like I couldn’t tell I was on them, I only had one but yeah it’s all good now thanks for everyone’s feedback", "2_Subreddit": "opiates"}], "dwmdetl": [{"0_Comment Submission": "Just out of curiosity", "1_Text": "White Girl Reporting...HeyGirlHey!", "2_Subreddit": "opiates"}], "dwmdixf": [{"0_Comment Submission": "Tips and Tricks", "1_Text": "I learned the hard way that you need hella more than than you would expect, so depending on how your gonna take it maybe different but I know with pills I needed like 3- 5 grams and I only bought maybe 1. That’s  my tip hope it helps!", "2_Subreddit": "opiates"}], "dwmdlyr": [{"0_Comment Submission": "Do you have to piss dirty for opiates to get a sub script?", "1_Text": "Yes", "2_Subreddit": "opiates"}]}], "1_submissions": [{"4lj5jj": [{"0_Title": "(Ohio) How does PRC or Community Control work after prison?", "1_Text": "Hey guys i really wanna go but im on a tight budget right now, i went to edc vegas this year, but if anyone is wanting to get rid of ticket for less, hmu plz thx", "2_Subreddit": "legaladvice"}], "7qfdt3": [{"0_Title": "Can y’all help me out with info on KRATOM For WD?", "1_Text": "Hey guys i really wanna go but im on a tight budget right now, i went to edc vegas this year, but if anyone is wanting to get rid of ticket for less, hmu plz thx", "2_Subreddit": "opiates"}], "7y402v": [{"0_Title": "Question about subs and benzo’s mixing!?!?", "1_Text": "Hey guys i really wanna go but im on a tight budget right now, i went to edc vegas this year, but if anyone is wanting to get rid of ticket for less, hmu plz thx", "2_Subreddit": "opiates"}]}]}]}