{"ejcrv": [{"0_comments": [{"dw66ggq": [{"0_Comment Submission": "Are there ways to mitigate the stomach problems from taking powder?", "1_Text": "The kratom itself shouldn't really be acidic and cause his stomach any issues in that sense.  It would mostly be what he uses to get the kratom down.", "2_Subreddit": "kratom"}], "dwb1bvl": [{"0_Comment Submission": "KRATOM IS LEGAL! Is there in-depth explanation of why vendor discussion is banned?", "1_Text": "Sh!#!  I'm glad others see this too!  Does the left not realize that many of their political beliefs are the very foundation that communism was built upon?", "2_Subreddit": "kratom"}], "dwb317h": [{"0_Comment Submission": "We can still review strains", "1_Text": "Whats absolutely ridiculous is that some people on the kratom sub.  Have come straight from the opiate sub looking for help.  Which if you go look at the opiate sub, it's gotta be breaking all kinds of rules.\n\nIt may not list vendors of where to buy illegal drugs.  But people post pictures of illegal drugs, talk about how to \"cold cop\" and buy off the darknet.  That stuff is illegal in all states.  Yet kratom, is legal in most states at this time.\n\nMakes no sense.", "2_Subreddit": "kratom"}], "dwczacs": [{"0_Comment Submission": "KRATOM IS LEGAL! Is there in-depth explanation of why vendor discussion is banned?", "1_Text": "Exactly!", "2_Subreddit": "kratom"}], "dwd018k": [{"0_Comment Submission": "Please do not leave r/Kratom", "1_Text": "Yes, this is what my thought is.  At first glance the crackdown by reddit tends to make one very angry.\n\nHowever, there is the part of me that finds it refreshing.  Not having to wade through posts about 50 different strains from 10 different vendors and which is best.  When in fact, what strain works for what person is a crap shoot at best.  Not being able to post deals or givaway's from certain vendors kind of sucks.  However in general it's still a forum to give and receive information on kratom.\n\nEspecially let us not forget, the fight to keep it legal.", "2_Subreddit": "kratom"}], "dwf608e": [{"0_Comment Submission": "What does Full Spectrum mean in regards to strain type?", "1_Text": "Usually full spectrum is white, red and green strains mixed.", "2_Subreddit": "kratom"}], "dwh0437": [{"0_Comment Submission": "kratom makes your hair fall out?", "1_Text": "I'm not saying it can't, however I'm saying I don't believe it does.  There has been no studies on this and everyone reacts differently to various substances.\n\nI've been taking kratom almost 5yrs now and haven't lost a strand.  If hair loss from kratom is actually a thing.  I would consider myself high risk.  In my family, all 3 of my brothers and my father were bald or suffered from severe hair loss.  I'm the only one who has kept most of my hair and I'm 50.\n\nSo if anything, I will be the first to go on record to say it's possible.  That kratom helps thicken existing hair. :)", "2_Subreddit": "kratom"}], "dwh0c68": [{"0_Comment Submission": "Tea vs. T&W", "1_Text": "I would agree. I've tried various tea recipes and have not had good results.  I'd like to reduce consuming too much plant matter also.  However t&w seems to have the strongest effects.", "2_Subreddit": "kratom"}], "dwh0p1p": [{"0_Comment Submission": "Tea vs. T&W", "1_Text": "I usually put the powder in the bottom front of my mouth.  Then take a small drink of juice or something besides water.  Swish it around and swallow.\n\nTo me it's like cough syrup.  Tastes horrible but I know I'll feel better afterwards.  I really wish I could find another way.  However like you, I haven't found a tea recipe that seems to work well.", "2_Subreddit": "kratom"}], "dwh0zpe": [{"0_Comment Submission": "All kratom making me super tired", "1_Text": "I find this to be true with myself also.", "2_Subreddit": "kratom"}], "dwh13d7": [{"0_Comment Submission": "All kratom making me super tired", "1_Text": "What's strange to me.  I use to take reds, whites or greens and they all seemed to have the same effect.  None of which made me tired and I've been taking kratom for the last 5yrs. \n\nHowever over the last 6 months or so.  Reds have actually made me tired and whites more energetic.  Very odd to me.", "2_Subreddit": "kratom"}], "dwh149h": [{"0_Comment Submission": "All kratom making me super tired", "1_Text": "Isn't that where the Black Panther is from? :)", "2_Subreddit": "kratom"}], "dwoegnz": [{"0_Comment Submission": "Lost my job of 4 years--the one thing is was proud of in my life", "1_Text": "wtf?", "2_Subreddit": "opiates"}], "dwoh6zo": [{"0_Comment Submission": "Easter copped some of these .5mg from my gma while i was over there.(there was 5) She has a script for 90 that I know she takes whenever and i know wont count cause she takes em jus whenever shes stressed from watching grandkids fulltime. Also a .6 of some btthh", "1_Text": "That bag looks like sperm that burnt up on entry.", "2_Subreddit": "opiates"}], "dwoir0x": [{"0_Comment Submission": "Oxy got me laid last night", "1_Text": "Shallow Hal! Shallow Hal!", "2_Subreddit": "opiates"}], "dwq69n7": [{"0_Comment Submission": "Anyone else experienced your Kratom only kicking in after you eat?", "1_Text": "Oddly enough, yes.  Not all the time, though frequently this will happen to me also.  I'd say if I eat 15-30 minutes after my regular dose.", "2_Subreddit": "kratom"}], "dwq6h4s": [{"0_Comment Submission": "can’t work without kratom", "1_Text": "From the sound of it the OP could be suffering from anxiety, depression and or bipolar.\n\nThey stated it keeps them from getting \"super pissed off\" and \"depressed\".  Thats some pretty wide mood swings.", "2_Subreddit": "kratom"}], "dwq6lo1": [{"0_Comment Submission": "can’t work without kratom", "1_Text": "I could be wrong.  However I believe the FDA and DEA are thinking banning it as in not even letting shipments into the country.", "2_Subreddit": "kratom"}], "dwq6szx": [{"0_Comment Submission": "A Logical Question", "1_Text": "After floating around reddit.  The one I'm most surprised they let stay is /r/opiates.\n\nThey give advice on coping or finding hardcore drugs.  Have pictures of illegal drugs and paraphernalia.", "2_Subreddit": "kratom"}], "dwsllwk": [{"0_Comment Submission": "CBS This Morning, tomorrow April 4th", "1_Text": "Yes, this!  I totally agree.  I think if someone starts going into conspiracy mode. It almost immediately discredits their perspective from the other sides point of view.", "2_Subreddit": "kratom"}], "dwsnn4k": [{"0_Comment Submission": "So I had a batch that was included in the FDA recall and I'm just confused.", "1_Text": "Personally I would throw it out and work something out with the vendor.  Only because I've had it before.\n\nI was hospitalized 2 days for salmonella.  It was mostly due to dehydration and the hospital making sure I was okay to go home.\n\nWith all honesty though.  The doctors and health department told me.  That in all actuality, most people's immune system can deal with salmonella and fight off the bacteria pretty well.  It's only in a very few amount of individual's that they have issues with fighting it off.\n\nIn fact.  The health department (who contacted me after I was home) told me that the average person would be surprised to know just how many contract salmonella and never know it.  That their immune system fights it off just fine.", "2_Subreddit": "kratom"}], "dwsnw98": [{"0_Comment Submission": "Question for daily users, dosage", "1_Text": "Just from my personal experience.  I don't notice any difference when my dose varies.\n\nI take 16-18g per day split into 2 doses.  I dose at 6am and 6pm.  I can take half the dose at either of those times and make it just fine till the next dose. \n\nIf my pain isn't as bad, say in the evening.  I will take half my normal dose.", "2_Subreddit": "kratom"}], "dwso2s0": [{"0_Comment Submission": "Diminishing returns on multiple daily doses?", "1_Text": "Pretty much what I was going to respond.  I actually take 2 doses per day.  Once at 6am before work and another at 6pm.  If I dose in between I don't really seem to gain anything.  Not more pain relief or otherwise.\n\nSo as you said, 2 doses max, spaced evenly apart works really well.", "2_Subreddit": "kratom"}], "dwwscpg": [{"0_Comment Submission": "Question for daily users, dosage", "1_Text": "If I experienced any other side effects from skipping a dose, besides my pain coming back.  I might feel a bit lethargic.\n\nAfter using kratom for a few years.  I had left for a 10 day vacation and forgot to pack my kratom.  The 2 main things that I experienced were a bit of anxiety and lethargy.  However it wasn't anything that completely ruined my vacation.", "2_Subreddit": "kratom"}], "dwwti88": [{"0_Comment Submission": "Green powders that look like kratom?", "1_Text": "Kava.", "2_Subreddit": "kratom"}]}], "1_submissions": [{"5gnefx": [{"0_Title": "Closet Kratom user in need of advice", "1_Text": "The kratom itself shouldn't really be acidic and cause his stomach any issues in that sense.  It would mostly be what he uses to get the kratom down.", "2_Subreddit": "kratom"}], "5m1bro": [{"0_Title": "Excited for my first SoCal order to arrive!", "1_Text": "The kratom itself shouldn't really be acidic and cause his stomach any issues in that sense.  It would mostly be what he uses to get the kratom down.", "2_Subreddit": "kratom"}], "5q3wpo": [{"0_Title": "Tincture or powder extract strength?", "1_Text": "The kratom itself shouldn't really be acidic and cause his stomach any issues in that sense.  It would mostly be what he uses to get the kratom down.", "2_Subreddit": "kratom"}], "5r4m9z": [{"0_Title": "Think Trumps latest might help the cause?", "1_Text": "The kratom itself shouldn't really be acidic and cause his stomach any issues in that sense.  It would mostly be what he uses to get the kratom down.", "2_Subreddit": "kratom"}], "5ys900": [{"0_Title": "Saw this and was drooling over the possibilities....", "1_Text": "The kratom itself shouldn't really be acidic and cause his stomach any issues in that sense.  It would mostly be what he uses to get the kratom down.", "2_Subreddit": "opiates"}], "7v4mea": [{"0_Title": "Help identifying pill", "1_Text": "The kratom itself shouldn't really be acidic and cause his stomach any issues in that sense.  It would mostly be what he uses to get the kratom down.", "2_Subreddit": "opiates"}]}]}]}