{"DJHF206": [{"0_comments": [{"dw00de8": [{"0_Comment Submission": "Contradictions All Over The Place", "1_Text": "I’m sorry you’re feeling this way, but to be clear, this community exists to help people navigate their way through quitting Tianeptine.\n\nPlaying games and attacking others is not cool and won’t be tolerated here. Let this be the official notice to anyone participating in this behavior that it will not be tolerated. I’m closing this thread not as a judgment against anyone but to keep any negativity from getting out of hand.\n\nContact the moderators if you have any specific concerns we can address for you.", "2_Subreddit": "QuittingTianeptine"}], "dw4b3a0": [{"0_Comment Submission": "Tianeptine Drug Test", "1_Text": "It should not show up on any US-based legitimate drug tests, though I can't speak for parts of the world where it is a pharmaceutical.\n\nDespite having a structure very similar to TCA's it does not seem to test positive for TCA's on professional tests (cheap, unreliable reagent or field tests are where results may vary--personally I think it is unconscionable that police use these types of tests as a reason to arrest someone as temperature, humidity and user error on interpreting color, along with the inherent simplicity and fallibility of these tests is well-known.) Further professional analysis will always override and clear the initial false-positive.", "2_Subreddit": "QuittingTianeptine"}], "dw8et9o": [{"0_Comment Submission": "Handsome bro", "1_Text": "God pretty much my type and very much similar to my husband. Mmm mmm mmm.", "2_Subreddit": "TotallyStraight"}], "dwdhezu": [{"0_Comment Submission": "Prince died from 'exceedingly high' amount of fentanyl, experts say", "1_Text": "The availability of Narcan (naloxone) has NOT helped cause the opioid epidemic, don't be fooled.\n\nThe FDA/CDC guidelines on opioid prescriptions that have resulted in patients prescribed high levels for years suddenly being dropped to half or lower of what they were being prescribed by physicians scared of the DEA (and this is a VALID fear, I say as a physician) has worsened the opioid epidemic more than anything because suddenly a significant number of people are sick, in withdrawal and pain and turn to whats on the streets to try and get relief. And what is on the streets is \"heroin\" (99% fent, 1% heroin) and pressed pharma pills that look extremely convincing but nevertheless contain fentanyl or some analogue instead of the measured amount of the pharma opioid.", "2_Subreddit": "Music"}], "dwdj73x": [{"0_Comment Submission": "Prince died from 'exceedingly high' amount of fentanyl, experts say", "1_Text": "Fentanyl is very low euphoria, very high overdose risk. If the only option you had was fentanyl-contaminated garbage thats what you'd take. Opioids are extremely addictive and withdrawal is truly hell on earth, medication assisted treatments for opioid abuse such as suboxone and methadone are unrealistically restricted (especially the former, in the US) and cost-prohibitive to people who legitimately want to get well. These things need to change, DATA 2000 needs to unleash physicians from prescribing buprenorphine. Any physician with a DEA license can prescribe oxymorphone or fentanyl but you have to have \"special\" training and a # of patients limit on prescribing the most effective remedy for opioid addiction in the US currently.", "2_Subreddit": "Music"}], "dwdjdd4": [{"0_Comment Submission": "Prince died from 'exceedingly high' amount of fentanyl, experts say", "1_Text": "It prevents overdoses, if administered in time and under the correct conditions. It doesn't make anyone feel safer about anything because it is in NO WAY a guarantee one will survive. It needs to be available everywhere to save lives and reduce harm until our drug laws reflect realities in this country.", "2_Subreddit": "Music"}], "dwdorqg": [{"0_Comment Submission": "Prince died from 'exceedingly high' amount of fentanyl, experts say", "1_Text": "Yup, it is backwards and absurd given the safety profile of buprenorphine AND the current epidemic (which I see as caused or largely influenced by internal regulation/politics.) We should be absolutely ready to prescribe even more ‘dangerous’ things than buprenorphine in the face of the current epidemic, but honestly beyond buprenorphine and methadone nothing further is needed except standardized heroin or hydromorphone injection centers. I am a huge advocate for harm reduction and really believe these measures would greatly relieve the suffering this country is collectively undergoing.", "2_Subreddit": "Music"}], "dwdvxlz": [{"0_Comment Submission": "I got lucky by being honest about my medication usage.", "1_Text": "This gives me faith at the prospect of returning to practice medicine in the US. So glad for your experience, and best of luck on the ketamine infusion, it’s is generally fantastic for chronic pain so I’m excited to hear your experience!!!!", "2_Subreddit": "opiates"}], "dweu62v": [{"0_Comment Submission": "China says Kim Jong Un has agreed to denuclearize Korean Peninsula", "1_Text": "As a matter of public record, sure. It’s a very politically thorny issue for Japan for obvious reasons. \n\nIn reality? and, in context of Japan’s recent militarization? I seriously doubt the US doesn’t have them there.", "2_Subreddit": "worldnews"}], "dweuanr": [{"0_Comment Submission": "China says Kim Jong Un has agreed to denuclearize Korean Peninsula", "1_Text": "What do you think of the possibility of China’s fear that a US agreement with NK could result in an allied US-NK becoming a yet another nuclear check against China in North Asia? This seems like a great way to head that off.", "2_Subreddit": "worldnews"}], "dweuu2l": [{"0_Comment Submission": "Suboxone/Bupe should be dispensed over the counter like DXM/Lope/Sudafed/Codeine", "1_Text": "While I do not think buprenorphine should be available OTC, it should be made available at no cost from literally any physician/NP/PA who can make a diagnosis. All of the above can prescribe fentanyl or oxymorphone but not buprenorphine unless they comply with onerous extra rules in the US.", "2_Subreddit": "opiates"}], "dweux13": [{"0_Comment Submission": "Prince died from 'exceedingly high' amount of fentanyl, experts say", "1_Text": "As they should, I carry naloxone in my daily carry medical kit. Keeping someone from dying means they have a chance at recovery. If they die there is none of that, just the loss of a person, and if one wants to get practical, the loss of someone who works, pays taxes, etc. The deaths of individuals from opioid overdoses is an epidemic in terms of social costs as well that many people do not consider. These social costs are vast in comparison to the cost of a little naloxone.", "2_Subreddit": "Music"}], "dwevong": [{"0_Comment Submission": "China says Kim Jong Un has agreed to denuclearize Korean Peninsula", "1_Text": "A distinction I failed to make, my apologies. I was more referring to nuclear weapons themselves in what I said rather than any particular aircraft or class thereof.", "2_Subreddit": "worldnews"}], "dwfilp7": [{"0_Comment Submission": "What is the most valuable prescription one could POSSIBLY obtain", "1_Text": "The twice a day bit is true in most situations, they can be written more often but these days it would have to be a very special and necessary case I expect.", "2_Subreddit": "opiates"}], "dwfq0db": [{"0_Comment Submission": "Full Blown Blahs", "1_Text": "Wow... I don’t know why it’s surprising but I remember experiencing the EXACT same thing when I was in Tianeptine withdrawal, it was SO hard to raise my hands and wash my hair in the shower. I’ll never forget struggling through those morning in Tianeptine withdrawal when it was next to impossible to get out of bed, shower, get dressed, go to work, and work until UPS got there to start the cycle all over again. So grateful to be out of that cycle.", "2_Subreddit": "QuittingTianeptine"}], "dwhtebu": [{"0_Comment Submission": "Anything to eliminate the anxiety?", "1_Text": "My heart goes out to you truly, I found benzodiazepines (in fairly high quantities for me at the time, but I had a tolerance) to help with the anxiety. I didn’t respond very well to gabapentin, even at extraordinary doses but it helps a lot of people with the restless leg syndrome sort of symptoms, allowing sleep. Honestly in your situation, with a child and family that do not know benzos are probably not the ideal choice because they can just absolutely put you out of it. \n\nI don’t know you personally, and I don’t know your husband, but I know I would have never gotten out of the Tianeptine trap without my husband knowing. I went to a buprenorphine physician and got on buprenorphine (and off of Tianeptine) and have not looked back since. I don’t know what dose level you’re at, but this may be a good option for you.", "2_Subreddit": "QuittingTianeptine"}], "dwhubud": [{"0_Comment Submission": "PSA concerning bullying/harassment", "1_Text": "I just want to say, as a moderator, the users 100% make this sub, what it is and what it’s here for. All anyone on the moderator team does is try to maintain the existence of the forum. \n\nThere will always be attempts to bully or harass, and users as well as moderators have a responsibility defend a subreddit as important as this against such attempts.\n\nAs a moderator, I will say there are clear, even blatant cases of single users making multiple accounts to promote a negative agenda or campaign of negativity against one user or another, and that is BULLSHIT and neither I or the other mods will allow that to happen unfettered here.\n\nAnyone being ‘friendly’ or perceived to be such with any member of the moderator team is irrelevant to how we spend our time here—we all have jobs and lives and do this because it is critically important to us and many times based on our own decisions.\n\nPlease report harassing or abusive posts to our team, and message us with any other concerns. I’m so glad this place exists and I feel it is far too important to end up caught up in interpersonal BS.\n\nAll the best!\n\nDJHF206", "2_Subreddit": "QuittingTianeptine"}], "dwn75g9": [{"0_Comment Submission": "Missed a shot about 4 days ago the pain has gone away but it doesnt look much better should i go to the ER or is the pain going away a good sign?", "1_Text": "Physician here, you absolutely need to go to the ER. Like now, do it immediately.\n\nI’m sorry this has happened but you’re on the verge of dealing with downstream problems that could cause permanent damage or even death if you don’t get medical treatment.", "2_Subreddit": "opiates"}], "dwnpsqe": [{"0_Comment Submission": "2 Buns and 2.5oz of Hydro", "1_Text": "2.5oz of Tussionex (or generic.) 10mg hydrocodone polistirex and 8mg chlorpheniramine maleate polistirex per 5mL. I can almost taste it now, must have been the most delicious syrup I’ve ever tasted!!\n\nEnjoy!!", "2_Subreddit": "opiates"}], "dwnqish": [{"0_Comment Submission": "Girlfriend of 3 1/2 gets hooked on opiates, robs me blind.", "1_Text": "Opiates are, for the most part, a life-long struggle for people as deep as it sounds like she was/is. There are treatments, such as methadone and buprenorphine that can help reduce cravings/block the action of full agonist opioids. If she was taking buprenorphine every day for the rest of her life, she might be able to stay away from other opioids/addiction. However, this is not the way it goes for most people in that situation. There are relapses and false starts and more struggles.\n\nThat said, in considering giving this another go, you need to realize that in addition to the debt/ruined credit/baggage normal people carry, you’re signing on for the life-long struggle of addiction, and for relapses, deception and everything else that goes along with addiction. \n\nI say this as someone either first-hand experience and who is currently taking buprenorphine for it. I hope things work out for the best for you, I just wanted to highlight an important consideration to factor in to any decisions you make. The heart and what it wants is an inscrutable thing, however at the same time you have your entire future ahead of you and one must protect themselves (or be truly, deeply aware of and OK with the consequences.)\n\nMuch love <3", "2_Subreddit": "opiates"}], "dwpdvwv": [{"0_Comment Submission": "I’m worried about my sister. What’s the general addiction timeline look like from beginning to end?", "1_Text": "Mental illness is a distinct possibility as /u/sassytunacorn talked about. Drug use (whether it he methamphetamine or any one of dozens of other stimulants or drugs out there) is a distinct possibility, though difficult to diagnose with symptoms/behavior alone.\n\nI know when I started taking suboxone (buprenorphine and naloxone) I had a HARD time emotionally. Lots of ups and downs, anxiety, insomnia, etc. That improved over time, but even so I don’t think my experience is nearly as severe as what your sister is going through/displaying. \n\nYou sound very understanding and non-judgmental, which is very admirable, especially in your position. As someone who is a highly educated professional who still got addicted to opioids and got off of them with suboxone, I can NOT adequately describe to you how HARD quitting opioids and staying clean is. It’s the hardest thing I’ve ever done or ever will do. I’ve been clean for what is approaching 6 months now and I still think about taking illicit opioids EVERY moment, of EVERY day. And it isn’t just the obstructive and intrusive constant thoughts, it’s every fiber of my brimming screaming out that “ need to take these and it’s OK and good and just once or just on the weekends, that’s be fine!!!” And so on and so forth. That’s why, statistically, relapses are inevitable for most people. So far it hasn’t happened for me yet, and I hope it never does, but I know the world will not end if it does happen. \n\nKeep all of that in mind with her.\n\nMuch love <3", "2_Subreddit": "opiates"}], "dwsz9q5": [{"0_Comment Submission": "Sulfate in morning, sodium at night.", "1_Text": "Definitely addictive at those doses. What will/would happen is that after a time (for most people, a relatively short time) you would start finding those doses totally ineffective for their original purpose. Unfortunately, by the time this happens you would also notice the dreaded tianeptine withdrawal if and when you decided to stop.\n\nNo one who is taking multiple grams of tianeptine started by taking those doses--many of us started taking doses just like the ones you're proposing, except instead of stopping when they because ineffective, we'd bump the dose up a bit until it was effective again.\n\nThis process will repeat over and over again and seriously,  and before one knows it, one is taking 3g a day and wondering how the hell one got there in the first place. Having been through this entire process (I was up to 25g/day toward the end of three years - and even this dosage was just to stay out WD, not to feel good in any way (to give you an idea about how aggressive tolerance is with tianeptine.)\n\nMy advice (from experience) is to stay FAR, FAR away from both types of tianeptine and count yourself lucky to have avoided a substance that can ruin your life, and indeed change you permanently in ways that are hard to describe.", "2_Subreddit": "QuittingTianeptine"}], "dwszwy1": [{"0_Comment Submission": "Kicking Kratom with Sulphate?", "1_Text": "I'll also chime in that this is a step backward--an analogy would be using oxycodone to quit kratom. \n\nTianeptine is POWERFUL, whether one is dealing with the sodium or sulfate salts of it. It is easy to underestimate its potency and its capability for skyrocketing one's tolerance.\n\nI'd taper your kratom use as rapidly as you can (cut the amounts you're taking as much as you can live with) and get off of it that way. It is not as fun and requires some creative steps like measuring out your total daily dose (or individual doses for the day) and, if you have low self-control with it, have someone else hold the rest or get a time-lock safe and seal it inside.Set yourself up for success!", "2_Subreddit": "QuittingTianeptine"}], "dwt9oo0": [{"0_Comment Submission": "Sulfate in morning, sodium at night.", "1_Text": "Once a human has abused opioids to the point of addiction, once that human gets clean relapse is virtually inevitable. Even if you’re that exception to the rule that never relapses, I can guarantee you will still have those cravings, urges, and thoughyrjhy likely for the rest of your life. They are SO powerfully reinforcing that it’s impossible to fully unwind all of the effects it has had on your reward system.\n\nIt is a life-long affliction that you want to avoid if at all possible. It’s easy to think it won’t happen to you—most of us here thought that, yet here we are.", "2_Subreddit": "QuittingTianeptine"}], "dwxgp71": [{"0_Comment Submission": "Sulfate in morning, sodium at night.", "1_Text": "I’m failing to communicate correctly on the key element of all of this, and it is CRITICALLY important to understand.\n\nSure, you can do your 200mg a day and be happy with the results you get, BUT, in a month or two (more or less, it varies for people) you’ll notice that that 200mg isn’t quite cutting it. If you’re ‘good’ and don’t increase your dose and keep trucking along, you’ll soon find that the 200mg dose does nothing at all for you. Not the slightest tingle.\n\nYou have two choices here, really: 1) is to up your dose until you reach a dose that gives you the same effect as your former 200mg dose.\n\n2) you decide “screw it, I’m dropping this altogether—it’s not helping me and then BAN you’re hit with withdrawal symptoms.  Restless legs, stomach cramping, frequent diarrhea, random flop sweats, sudden temperature changes (freezing to burning up back and forth) and extreme anxiety and insomnia. This lasts several days to a week and with Tianeptine the severity many times leads a person to start using again just to be able to sleep *at all* and halt the misery.\n\nThis drug is not forgiving and please take this warning to heart because you WILL in all likelihood end up facing the choices I summarized above, which is a baaaad place to be.", "2_Subreddit": "QuittingTianeptine"}]}], "1_submissions": [{"7yohbo": [{"0_Title": "Hello r/QuittingTianeptine", "1_Text": "I’m sorry you’re feeling this way, but to be clear, this community exists to help people navigate their way through quitting Tianeptine.\n\nPlaying games and attacking others is not cool and won’t be tolerated here. Let this be the official notice to anyone participating in this behavior that it will not be tolerated. I’m closing this thread not as a judgment against anyone but to keep any negativity from getting out of hand.\n\nContact the moderators if you have any specific concerns we can address for you.", "2_Subreddit": "QuittingTianeptine"}]}]}]}