{"Papdugi369": [{"0_comments": [{"dwk0lzc": [{"0_Comment Submission": "Better to miss a UA or fail", "1_Text": "If its between being positive and just missing it, missing it is always the better option.\n\nA positive is a positive, point blank, there's no talking out of it.  A missed urine isn't good by any means, but in my experience it usually isn't a violation the first time.  Sometimes things happen, if you've been doing well you should be given the benefit of the doubt.\n\nYou can always fess up and be honest, but you need to take into account what type of PO you have.  I've been honest in the past and got thrown in jail immediately, where I've missed a urine test once and was just told not to do it again.\n\nI'm assuming you know you've made a decision about how your gonna deal with this and know the consequences of that decision.....hope it worked out, good luck", "2_Subreddit": "probation"}], "dwk0tqd": [{"0_Comment Submission": "Drug test", "1_Text": "In my state it depends on the drug....if its Fentanyl you're pretty much screwed", "2_Subreddit": "probation"}], "dwk6qj6": [{"0_Comment Submission": "Probation test for Fentanyl detection times?", "1_Text": "Just a heads up it is lab testing", "2_Subreddit": "probation"}], "dwk81wg": [{"0_Comment Submission": "Probation test for Fentanyl detection times?", "1_Text": "Thank you very much!", "2_Subreddit": "probation"}], "dwl2zxm": [{"0_Comment Submission": "Probation test for Fentanyl detection times?", "1_Text": "Thanks for the advice.  I've been clean for 4 months now, no dope, even kicked methadone in jail after being on it 9 years, I have been taking my recovery seriously.....but lately I've been entertaining the thoughts of using.....I may or may not, but either way I don't want to end up in jail for it you know?", "2_Subreddit": "probation"}], "dwmu7i8": [{"0_Comment Submission": "Besides using a thermometer, is there a way to know if the pee you’re using for a test is warm enough?", "1_Text": "I think instant cups have a strip that reads the temp on them for the PO to check.\n\nSomeone I know used to use a device that holds urine for testing years ago....the instructions said as long as the pouch of urine is up against your skin (more specifically up against your lower stomach/upper groin area) for 1 hour the urine will automatically be the correct temperature (somewhere in the 90s) it needs to be to pass a test.  It definitely worked, it was in a clear pouch that was a little thicker than a plastic sandwich bag.\n\nI don't know if that's what you're looking for, hope it helps.", "2_Subreddit": "opiates"}], "dwn8tv9": [{"0_Comment Submission": "What do people call dope where you live?", "1_Text": "Dope, brown, mantega in MA....fetty for Fentanyl, which is all we really have anyways", "2_Subreddit": "opiates"}], "dwqnss3": [{"0_Comment Submission": "How did you choose a rehab? Was there enough information out there to go off? (Media post)", "1_Text": "For myself, I've been to inpatient rehabs in the past, and basically learned about them from word of mouth from other addicts, or possibly a counselor, but was never given or asked for any info other than what medications they use to detox you with (i.e. methadone or suboxone, etc).\n\nI live in MA, there are 2 that are reasonably close to where I live and I just called both and went with which ever had the lowest waiting list.  The last time I did inpatient detox (besides going to jail) was 8 years ago.  I know people that have gone to detoxes all over the state now, they get referred to them but by who I don't know.  \n\nJust curious, is MA a state that posts the inspections of detoxes online?", "2_Subreddit": "OpiatesRecovery"}], "dwr79ao": [{"0_Comment Submission": "Question about pot", "1_Text": "The legality doesn't matter if your conditions are to stay alcohol and drug free, like mine are.  I live in a state where recreational marijuana is legal, but just like alcohol is prohibited on probation despite its legality, same goes for weed.\n\nNow if you get a medicinal marijuana card, you can go in front of a judge and see if they'll let you smoke while on probation, but it's totally up to the judge.", "2_Subreddit": "probation"}], "dwtfw7v": [{"0_Comment Submission": "What do you think the government or society could do to minimize the deaths related to the opioid epidemic?", "1_Text": "Legalize and regulate it.  I'm not gonna go on a long rant....just look at the people that died of overdoses and went blind during prohibition because alcohol was unregulated.......look at Portugal since they've legalized/decriminalized possession for personal use.\n\nThe war on drugs has done waaaaay more harm than good.....to me it's as clear as day what to do.", "2_Subreddit": "opiates"}], "dwun86z": [{"0_Comment Submission": "How can I find a dealer for brown now that craigslist is done for?", "1_Text": "Lol you're one of the first people I've heard say it's unfortunate there's not more homeless people in your area", "2_Subreddit": "opiates"}], "dwunbs9": [{"0_Comment Submission": "How can I find a dealer for brown now that craigslist is done for?", "1_Text": "Lol I know you didn't, it was just funny", "2_Subreddit": "opiates"}], "dwv5zuo": [{"0_Comment Submission": "My dboy who sold me these bricks invited me into his trap house to party. I politely declined", "1_Text": "What exactly is a brick?  Where I'm from we got grams and fingers (10 grams).  Grams replaced bundles a long time ago in NE.", "2_Subreddit": "opiates"}], "dwv6ixg": [{"0_Comment Submission": "Syringes in The US’s cock.", "1_Text": "Up in the NE they sell them to everyone.....problem is half these a-holes throw their used syringes all over the cities, rivers and beaches.  A girl got pricked by a used needle in the sand at the beach last year.\n\nFor real, this just goes for anyone in general, if you shoot dispose of your shit properly.", "2_Subreddit": "opiates"}], "dwv8xwh": [{"0_Comment Submission": "\"I predict that in the near future right-wingers will use drug hysteria as a pretext to set up an international police apparatus.\"", "1_Text": "Nixon used it for Political gain....same with Reagan, Clinton, etc.  Obama thankfully tried to undo some of that damage by lowering the disparity between crack and coke sentencing, but way more needs to be done to undo the joke of a war this country has raised on drugs and addicts.", "2_Subreddit": "opiates"}], "dwvd9wf": [{"0_Comment Submission": "The come up", "1_Text": "We are all dumber now for reading these rants....thank you....fr lol just playing.\n\nHonestly, whatever you have it has to be good cause judging by your texting ability you're completely fucked up lol", "2_Subreddit": "opiates"}], "dwvgwoj": [{"0_Comment Submission": "Fentanyl detection times for probation?", "1_Text": "Yeah I know it's the lab testing (what's it ng/ml?) I have heard anything from 3 to 5 days, one big overweight guy said a week idk....sucks I don't have to test til Monday at the earliest but I don't know if 3 full clean days is good enough.", "2_Subreddit": "opiates"}], "dwvh1hf": [{"0_Comment Submission": "Fentanyl detection times for probation?", "1_Text": "It would be street fentanyl and sniffing would be the route if that matters", "2_Subreddit": "opiates"}], "dwvlof4": [{"0_Comment Submission": "My dboy who sold me these bricks invited me into his trap house to party. I politely declined", "1_Text": "Where I live it's all Dominicans that run the drug trade...we had stamped bundles in the late 90s/very early 2000s....probably mid 2000s it was grams I'd say", "2_Subreddit": "opiates"}], "dwvpbbd": [{"0_Comment Submission": "Fentanyl detection times for probation?", "1_Text": "Sorry about your friend man.\n\nHow many days was it from when you used til you took the test of you don't mind me asking?  And was it an instant cup or lab, probation, etc?", "2_Subreddit": "opiates"}], "dwvpkey": [{"0_Comment Submission": "Fentanyl detection times for probation?", "1_Text": "Ok gotcha, thanks", "2_Subreddit": "opiates"}], "dwwqj8e": [{"0_Comment Submission": "Please please help me!!!!!!!!!", "1_Text": "True heroin will be out in 5 days.....Fentanyl on the other hand is 50/50 at around 5 days from what I've seen, good luck", "2_Subreddit": "opiates"}], "dwxjo1x": [{"0_Comment Submission": "Trying a new plug & cheap pandas!", "1_Text": "Sorry for the stupid question, but what are \"pandas\" exactly?  I assume it's some type of opiate but I don't know which one exactly", "2_Subreddit": "opiates"}], "dwxjsvd": [{"0_Comment Submission": "Trying a new plug & cheap pandas!", "1_Text": "Ok, so when people say Pandas they're referring to these?", "2_Subreddit": "opiates"}], "dwxlezt": [{"0_Comment Submission": "I am on day 6 of cold-turkey quitting 90mg of daily methadone.", "1_Text": "I was on the methadone clinic 9 years up until this past November when I was thrown in jail for 6 weeks.\n\nAt the time I was at 26mg (I lowered my dose over time at a comfortable rate), it took me a good 4 weeks to start sleeping more than an hour or so a night.  The days weren't that bad, but it's easier to kick in jail because you accept you aren't getting high and don't have free will to go and do what you want.\n\nGood luck man.....I don't know you're whole story as to why you stopped abruptly, but I wish you the best.  A benzo to help sleep now and then should be helpful....the worst of it was around a little over a week for me, but it gets better at a very gradual, slow rate.  \n\nHang in there, you'll make it.", "2_Subreddit": "opiates"}]}], "1_submissions": [{"7dc2rt": [{"0_Title": "Long term users that never used a needle?", "1_Text": "If its between being positive and just missing it, missing it is always the better option.\n\nA positive is a positive, point blank, there's no talking out of it.  A missed urine isn't good by any means, but in my experience it usually isn't a violation the first time.  Sometimes things happen, if you've been doing well you should be given the benefit of the doubt.\n\nYou can always fess up and be honest, but you need to take into account what type of PO you have.  I've been honest in the past and got thrown in jail immediately, where I've missed a urine test once and was just told not to do it again.\n\nI'm assuming you know you've made a decision about how your gonna deal with this and know the consequences of that decision.....hope it worked out, good luck", "2_Subreddit": "opiates"}], "88erjq": [{"0_Title": "Probation test for Fentanyl detection times?", "1_Text": "If its between being positive and just missing it, missing it is always the better option.\n\nA positive is a positive, point blank, there's no talking out of it.  A missed urine isn't good by any means, but in my experience it usually isn't a violation the first time.  Sometimes things happen, if you've been doing well you should be given the benefit of the doubt.\n\nYou can always fess up and be honest, but you need to take into account what type of PO you have.  I've been honest in the past and got thrown in jail immediately, where I've missed a urine test once and was just told not to do it again.\n\nI'm assuming you know you've made a decision about how your gonna deal with this and know the consequences of that decision.....hope it worked out, good luck", "2_Subreddit": "probation"}], "8a1x3q": [{"0_Title": "Fentanyl detection times for probation?", "1_Text": "If its between being positive and just missing it, missing it is always the better option.\n\nA positive is a positive, point blank, there's no talking out of it.  A missed urine isn't good by any means, but in my experience it usually isn't a violation the first time.  Sometimes things happen, if you've been doing well you should be given the benefit of the doubt.\n\nYou can always fess up and be honest, but you need to take into account what type of PO you have.  I've been honest in the past and got thrown in jail immediately, where I've missed a urine test once and was just told not to do it again.\n\nI'm assuming you know you've made a decision about how your gonna deal with this and know the consequences of that decision.....hope it worked out, good luck", "2_Subreddit": "opiates"}]}]}]}