{"Lillizsomd": [{"0_comments": [{"dw2ixju": [{"0_Comment Submission": "Tramadol", "1_Text": "Not exactly a rip off, but that is a bit high. I've never seen them go for more than 1-2$ a pop", "2_Subreddit": "opiates"}], "dw34mye": [{"0_Comment Submission": "Just started suboxone and it's not working...", "1_Text": "Your habit was tiny for the amount of sub they have you on. The sub doctors always start people on crazy huge doses because they don't really know very much about it. They take a 3 hour online class to prescribe it, and I'm pretty sure they get kickbacks from different sub formula makers. I'm sorry, but I don't think you should go anywhere near methadone, I'm on it, and it took me a long time to get on it because dealing with the clinic every day and all the side effects of methadone are super annoying if there is ANY other option. But I was shooting 1-2 gs of fent dope daily. I don't think people with under 200mg oxy habits a day should even be considered for methadone. \n\nI know this seems like the opposite of what you want to do, but cut your sub dose, dramatically. You can get by on 2mg or even less a day, and it will work far better than 16mgs ever has for you, I promise. When you use tiny doses of bupe, it doesn't coat your receptors completely, which allows the metabolized version, norbuprenorephine, to attach to some of those receptors. Unlike bupe, norbupe is a full agonist, so it will give you a bit more opiate feeling and help a lot more with cravings than plain bupe. At least try it before taking the methadone plunge, please", "2_Subreddit": "opiates"}], "dw4ul47": [{"0_Comment Submission": "Relatively inexperienced, insufflation vs oral.", "1_Text": "Oral is the way to go with oxy, it has a higher bioavailability that way than intranasal. It's not just a myth, it's just literally how the drug works, the only way to get more out of it is to shoot it, and even then it's only like 10% more, so really not worth the added risk of shooting pills", "2_Subreddit": "opiates"}], "dw6ew5g": [{"0_Comment Submission": "If I bring you a bag, I’m not going to look inside it before you leave, and nobody else will while you’re on your way out of the restaurant.", "1_Text": "I worked at a chain diner years ago, and this psycho woman wanted to steal the jellies in the jelly caddy, but she didn't want to do it herself, she wanted my coworker to dump the caddy into her purse for her! I never cared if people took things off the table, but asking someone else to do the thieving for you is crossing the line. He told her no, and rightfully so.", "2_Subreddit": "TalesFromYourServer"}], "dw6f8zx": [{"0_Comment Submission": "William, enjoying spring incorgnito", "1_Text": "He looks almost exactly like my mom's dachshund/fox terrier mix. They call it foxy-dachsy and it's gorgeous. So is william!", "2_Subreddit": "Incorgnito"}], "dw8qxxx": [{"0_Comment Submission": "My grandpa, rocking my nephew to sleep", "1_Text": "I mean, I'm only 31 and I constantly put myself to sleep trying to get my small niece to nap. Does that make me an adorable old person? Or am I just a sad workaholic?", "2_Subreddit": "adorableoldpeople"}], "dw8r23q": [{"0_Comment Submission": "My grandma shared this on Facebook a while back and it cracked me up lol", "1_Text": "I guess you fail the age test!!\n\nJ/k it's an old timey foot powered sewing machine.", "2_Subreddit": "adorableoldpeople"}], "dw8rfqw": [{"0_Comment Submission": "My grandma shared this on Facebook a while back and it cracked me up lol", "1_Text": "Hm, not sure. There probably are plenty of old people that grew up using these, because they do last forever and I think they were still relatively common in the 50s and 60s, but it might have been started as satire and then adorable old people went \"hey! I remember that!\"", "2_Subreddit": "adorableoldpeople"}], "dw8rigg": [{"0_Comment Submission": "This guy rear ended me and requested I take this photo right before he straight up drove off and fled the scene of the accident.", "1_Text": "With...ice?", "2_Subreddit": "trashy"}], "dw8rvmh": [{"0_Comment Submission": "This guy rear ended me and requested I take this photo right before he straight up drove off and fled the scene of the accident.", "1_Text": "Hmmm...I worked at an awful lot of restaurants  for a very long time, and never heard a word from anyone about how much ice to put in a soda. Cuz I mean, those boxes of soda syrup will pay for themselves with like 10 soda sales, so there's already a huge profit margin there. \n\nAlso, at most restaurants sodas are free refills, so if I put a shit ton of ice in a soda, that's just creating more work for myself. I'm really pretty sure there's no ice conspiracy in restaurants, but hey, that tinfoil hat looks good on you, so keep rockin it!", "2_Subreddit": "trashy"}], "dw9gqol": [{"0_Comment Submission": "Thicc trash panda damn", "1_Text": "...You knew what the pic that you commented with was? And still laughed? Do you have severe short term memory loss or something?", "2_Subreddit": "trashpandas"}], "dw9i4hc": [{"0_Comment Submission": "This guy rear ended me and requested I take this photo right before he straight up drove off and fled the scene of the accident.", "1_Text": "Based on his eyes, I'm gonna say opiates, maybe mixed with Xanax, but definitely opiates", "2_Subreddit": "trashy"}], "dw9j4f4": [{"0_Comment Submission": "Asshole coworker needs me to bail him out, turns out to be the best party I've ever served", "1_Text": "I hope you explained to him that you already know how tipping works and that you only give shit tips to servers that go out of their way to be shitty! I would have had his manager if he tried to lecture me on tipping, and I was a server for 12 years, i have never complained to management in a restaurant, ever.", "2_Subreddit": "TalesFromYourServer"}], "dw9jo3n": [{"0_Comment Submission": "Nastiest/sexiest way to seduce your boyfriend?", "1_Text": "Lol now I'm just picturing standing in line at the grocery store or something and the person in front of me just randomly starts doing squats! I would lose it, I'm pretty sure", "2_Subreddit": "sex"}], "dw9mpex": [{"0_Comment Submission": "Can anyone tell me if they believe this is an Abscess?", "1_Text": "Isn't there something where if you make a new account to get around a ban, the Reddit admins will ban that person's entire ISP address?", "2_Subreddit": "opiates"}], "dw9n6y0": [{"0_Comment Submission": "Classic r/drugs", "1_Text": "Can I get a link to that? Sounds like something I didn't want to miss", "2_Subreddit": "opiates"}], "dw9nw1f": [{"0_Comment Submission": "Nastiest/sexiest way to seduce your boyfriend?", "1_Text": "Truth, always establish dominance while squatting.", "2_Subreddit": "sex"}], "dw9uptn": [{"0_Comment Submission": "Chefs of Reddit, what do we all need to stop ordering?", "1_Text": "Yup, those are basted eggs. \n\nSource: 14 years serving in diners", "2_Subreddit": "AskReddit"}], "dw9uwh3": [{"0_Comment Submission": "Chefs of Reddit, what do we all need to stop ordering?", "1_Text": "No, sorry. Sunny up= runny everything, not flipped. OE= runny whites and yolks, but flipped. OM=set white, runny yolk. OMW= set white, gooey yolk. Over Well=set white and set yolk, but not broken yolk. Over Hard, all cooked, broken yolk. Most people are unaware of OMW and over well, but they exist. \n\nSource: server at many diners for 14 years", "2_Subreddit": "AskReddit"}], "dw9xpaa": [{"0_Comment Submission": "Chefs of Reddit, what do we all need to stop ordering?", "1_Text": "I'm with you, I worked at a local diner that is known for huge, amazing pancakes, and was asked by one very special lady if we had a gluten free option. For pancakes.", "2_Subreddit": "AskReddit"}], "dwc1044": [{"0_Comment Submission": "Another policy update: the community members have spoken!", "1_Text": "Yeah, and I'm sorry, but if you don't want to see opiates, maybe the opiate sub isn't for you?", "2_Subreddit": "opiates"}], "dwgzj4y": [{"0_Comment Submission": "And so the sun was created for the pleasure of these majestic creatures. Warming the souls of all those who gaze upon their magnificence.", "1_Text": "I dunno, this looks exactly like my mom's foxy-doxy, I literally had a double take, because I thought it was him. (That's half dachshund, half fox terrier)", "2_Subreddit": "AccidentalRenaissance"}], "dwmhua7": [{"0_Comment Submission": "Superbowl", "1_Text": "Owl allergy?", "2_Subreddit": "Superbowl"}], "dwr4qrm": [{"0_Comment Submission": "Gunpowder pricing?", "1_Text": "That's pretty fair, standard pricing on a g on the east coast is usually $120, so 1.5 is often $180. A ball is usually around $300 if you can find someone that sells that way, but a lot of dealers do $60 halves all the way up. You didn't get ripped off at all my dude.", "2_Subreddit": "opiates"}], "dwsxfwi": [{"0_Comment Submission": "SAVAGE!!!", "1_Text": "Seems unfair to wash your mouth out for just typing a swear, seems to me they should have just burned your fingertips or something more fitting.", "2_Subreddit": "madlads"}]}], "1_submissions": [{"6olz95": [{"0_Title": "Suboxone...for overdose?", "1_Text": "Not exactly a rip off, but that is a bit high. I've never seen them go for more than 1-2$ a pop", "2_Subreddit": "opiates"}], "747ssu": [{"0_Title": "Today I love my hoo-ha", "1_Text": "Not exactly a rip off, but that is a bit high. I've never seen them go for more than 1-2$ a pop", "2_Subreddit": "opiates"}], "76kkum": [{"0_Title": "Weird shit, deff not dope", "1_Text": "Not exactly a rip off, but that is a bit high. I've never seen them go for more than 1-2$ a pop", "2_Subreddit": "opiates"}]}]}]}