{"Blueman_a51": [{"0_comments": [{"dt6wpbj": [{"0_Comment Submission": "It’s been a couple months or so since I last touched any opiates, but I can’t shake the thought of how much I fucking love them.", "1_Text": "I totally feel you man. When I don't have them I can smell them all day long. It's all I think about. I joined Reddit right now because I feel like people here will understand how I feel. I don't know if it gets easier and I think I'm just now starting to realize it's an actual problem.", "2_Subreddit": "opiates"}], "dt6xfdr": [{"0_Comment Submission": "Blu Jawns - love to get lifted and read, anyone else?", "1_Text": "Lol right I'm right outside of philly and that's all I've called them since I was 12. Btw I've read a lot of your posts I feel your pain bro.", "2_Subreddit": "opiates"}], "dtjfuzl": [{"0_Comment Submission": "Popping 26 perocet 5 mg's no tolorance", "1_Text": "Well hopefully you didn't already do that if so you'll most definitely achieve the death part only peaceful if you think slumped in a pool of your own vomit is peaceful.", "2_Subreddit": "opiates"}], "duobpv7": [{"0_Comment Submission": "Purple 30mg morphine xrs", "1_Text": "The old op microwave trick doesn't work with these does it?", "2_Subreddit": "opiates"}], "duod6qr": [{"0_Comment Submission": "Purple 30mg morphine xrs", "1_Text": "Ya I've heard morphines best bioavailability is iv but I'm a perc 30 up the nose kinda guy", "2_Subreddit": "opiates"}], "duodefn": [{"0_Comment Submission": "Purple 30mg morphine xrs", "1_Text": "My tolerance is around 30-60 mg of oxycodone and I've found these are pretty much 2:1 for me so I just double up I just hate taking them orally", "2_Subreddit": "opiates"}], "dwn009u": [{"0_Comment Submission": "When you go to probation as an optimistic opportunist...", "1_Text": "They do look pretty white. The t189s I've had are super yellow.", "2_Subreddit": "opiates"}], "dwn5dyj": [{"0_Comment Submission": "Besides using a thermometer, is there a way to know if the pee you’re using for a test is warm enough?", "1_Text": "Go to Walgreens they sell empty travel size bottles that you fill with your own shampoo. They're nice because they have a little pop top and you can mimic a piss stream in case someone has to watch you. They just put it up by you junk for an hour or two and it'll be body temperature.", "2_Subreddit": "opiates"}]}], "1_submissions": [{"7zit85": [{"0_Title": "Purple 30mg morphine xrs", "1_Text": "I totally feel you man. When I don't have them I can smell them all day long. It's all I think about. I joined Reddit right now because I feel like people here will understand how I feel. I don't know if it gets easier and I think I'm just now starting to realize it's an actual problem.", "2_Subreddit": "opiates"}]}]}]}