{"Opiate89": [{"0_comments": [{"dqrtfsi": [{"0_Comment Submission": "Im tired of hunting. Some may say it's cheating, but they're just jealous.", "1_Text": "you shouldnt leave that shit in for too long, can get bad. from the loooks of this picture you got a fat ass vein running along the top of your hand, why cant you use that?", "2_Subreddit": "opiates"}], "dr3qx3g": [{"0_Comment Submission": "Caught my gf stealing from me, should I forgive her?", "1_Text": "ive had to deal with this same thing with my girl so i know how you feel. i always took care of her and made sure she wasnt sick and she knew that and knew i would have just hooked her up if she asked. you gotta bring it up and talk to her about it and let her know that it was not ok what she did. personally i would forgive her and give her another chance but thats cuz i love my girl more than anything in the world and knew she genuinely felt bad and just had a weak moment and didnt wanna lose her over that. everyone has moments of weakness, especially when it's an addict over dope..", "2_Subreddit": "opiates"}], "drdd9ym": [{"0_Comment Submission": "Share your best story with us!", "1_Text": "This is the time i bought a half oz of coke while blacked out drunk.\n\nIm chillin with some friends drinking some 40z and getting pretty shitfaced. well another friend drives up on his lunch break and wants to get some coke, i can get some! im 3 40z down at this point and drunk as fuck so without even calling my coke plug i get in the car with friend and we drive to my dudes house. i dont remember but was told the next day that i got out the car saying i would be right back and walk up to my friends house and knock on the door. well i end up going inside and pass out and never come back out so friend who drove me there leaves haha.\n\nSo this time of year its tax time and im getting a fat refund check, so im telling my coke plug that i wanna get a half oz. So he calls his dude to come bring it. a while later my friend comes up to me and is like yo dude is gonna be here in 10 minutes with the coke give me the money ($600). i look at my friend and im like bro i dont have the money yet my refund check is coming tomorrow...my friend is like wtf bro this ghetto ass nig (who is known to have a short temper and carries a pistol everywhere) just drove 45 minutes to bring this half zip of coke and is gonna be pissed when he gets here and i dont have the money. so thank god my boy is like i have cash in my room (he sold a shit ton of molly) i can front you the cash cuz i dont want dude to pistol whip you lol.\n\nDude comes and we do the deal all is fine and i end up passing out again. i wake up the next morning from being completely blacked out on the couch, in a town 20 minutes car ride from where i remember being when i was drinking with no clue how i get there. then i reach into my pocket and there is a huge bag of coke and im like wtf!! i go out back to find my boy tending to his weed plants and he tells me the whole story. i was so fucking thankful cuz i didnt even know this dude that well, i had been introduced to him only like a couple months prior from a mutual friend and would just buy molly from him every once in a while but its not like we were good friends, so i was really surprised he was down to front me $600 cuz for all he knew i was shit faced drunk and just saying i was getting money.\n\ni think he just didnt want a murder going down in his living room if i had told coke dude that i didnt have the money after he drove all the way out there haha.", "2_Subreddit": "opiates"}], "dsogpfh": [{"0_Comment Submission": "Does anyone know what happened to me last night?", "1_Text": "you probably just missed or some of it was leaking out. ive hit veins on my legs before where i was getting a good register but it burned hella bad and left a good size bruise for a few days after that.\n\nive hit an artery before many different times and the burning feeling was so bad i dont think you would be able to keep pushing it in...", "2_Subreddit": "opiates"}], "dsra72g": [{"0_Comment Submission": "This + Shameless season 8 😏", "1_Text": "ya i agree the latest episodes ive watched have been pretty bad compared to older seasons.", "2_Subreddit": "opiates"}], "dswbiel": [{"0_Comment Submission": "Decisions: get a $90/g uncut BTH or 2g of $50/g regular BTH?", "1_Text": "Depends on how good the \"normal\" stuff is. My dude has raw and also has hit which is just the raw that he then cuts with lactose. The hit will get me well and do the job but I vastly prefer the raw cuz the legs on it are sooo much better. I can do a night shot at 9pm and then wake up the next day and not even think about doing another shot until well in the afternoon. Whereas with the hit I will do a shot at night and wake up the next morning feeling sick and have to dose right away. \n\nSorry that was kinda long and rambling but basically if it was me I would get the 1g of better stuff.", "2_Subreddit": "opiates"}], "dswbv2b": [{"0_Comment Submission": "Junkie Jesus", "1_Text": "I've never had too much luck on scratchers but I'm broke most of the time so I just get 2$ tickets which are always played out kinda a waste. $10 and $20 tickets are where it's at but it feels so shitty to spend dub on a scratcher and not win anything. And of course my dboy just hit $1200 on a $2 ticket that I play all the time. It's not fair he gets all my money already I needed that more than him! Lol.", "2_Subreddit": "opiates"}], "dswo53c": [{"0_Comment Submission": "Close Calls", "1_Text": "me and a buddy was walking thru the Tenderloin in san francisco which is a known open air market (its all divided up there is 'pill hill' for pharms, a corner for H and a corner for crack) and i cop some black from this random dude but he was acting kinda sketchy so instead of getting the $60 worth i intended to get i only get a dub. so i start walking out the area and get towards the outskirts and decide fuck it ill just go find someone else to cop another $40 sack from as i didnt want to come back.\n\nSo i walk back and cop another sack and im walking out a second time about to cross the street and all of a sudden a white SUV comes screeching up right infront of me and this cop gets out and within 2 seconds is standing right infront of me and my buddy. now, in the TL cops will post up on the top floors of buildings with binoculars and radio to cops on foot if they see something suspicious.  so this cop right away starts asking me what im doing talking to those people on the side street and asking for my id. meanwhile the dope is in a little photo canister right in my pocket, if he searches me im done.\n\nso he is looking at my ID like what is a white dude from a square town doing out here what were you talking to those black dudes about why you walking back and forth in a known drug area yada yada ya. i told him i wasnt familiar with the area and was asking directions to a pizza place in the area where my girlfriend was waiting for me. he is just staring at me like he doesnt believe me and im just like 'am i being detained? give me my ID back.' without saying a word he just looks at me and hands the ID back and i turn to my buddy and say lets go dude fuck this guy and we just walked away.\n\ngot incredibly lucky cuz cops are known in the TL to run up on you and immediately throw you against the wall and choke you so you cant swallow your dope and they will search you right away just for walking thru even if they dont see anything. i was obviously buying drugs i have no idea why he didnt search me but i was sweating fucking bullets that time.", "2_Subreddit": "opiates"}], "dswocww": [{"0_Comment Submission": "When you spend an hour fishing for a vein", "1_Text": "ya that's the worst. and i swear ill be at my house waiting for the plug to hit me back so i can go cop, sick as fuck, and im making horribly weak cotton shots with already washed cottons and i hit first try and then when i get some real dope i cant hit for an hour and a half.\n\na few times ive said fuck it and ill smoke a tiny little piece just enough to get a couple good hits so my sickness goes away and i can have the patience to hit a vein.", "2_Subreddit": "opiates"}], "dswrijb": [{"0_Comment Submission": "When you spend an hour fishing for a vein", "1_Text": "ya i really dont like to smoke as like you said its just such a waste after youve been IVing for a long time. but im talking like a point at most, just enough for like 2 good big hits that i hold in as long as i can, just enough to get the sickness away so i can be calm and patient while looking for a vein.\n\ni dont do it all the time but if im really really sick i will do it.", "2_Subreddit": "opiates"}], "dswvdiz": [{"0_Comment Submission": "When you spend an hour fishing for a vein", "1_Text": "i find the trick is to lead the glob with the flame rather than right under it, helps it slide nicely. it does take some practice to get it right and not lose anything tho.\n\nand i hate when the dboy makes me sit outside in the winter cold for an hour so that there is for sure no way any of my veins will cooperate when i finally get the shit.", "2_Subreddit": "opiates"}], "dsxswxi": [{"0_Comment Submission": "Frustrating when you dump your life savings into ur dealer but when you need just a tiny bit of help, they can't won't. (Sorry, Just ranting)", "1_Text": "ya my main dealer looks out for me all the time. i can call him up and say im hurtin and dont have any money and he will give me a free half gram to keep me well for a day or two until i can get money.\n\na couple weeks ago i had to ask him 3 times in 1 week to help me out and each time he threw me a half gram no problem. sometimes i have to wait a couple hours for him to get back from wherever he is but i mean when you have no money and no hope to get anything i dont mind waiting.", "2_Subreddit": "opiates"}], "dteewzo": [{"0_Comment Submission": "Dboy HATES when I do this", "1_Text": "damn dude you on your period or something? taking it a little serious there...", "2_Subreddit": "opiates"}], "dtreyu6": [{"0_Comment Submission": "Fent pressed 30s", "1_Text": "real 30's are super fuckin small as well. im always surprised when i get some how small they actually are.", "2_Subreddit": "opiates"}], "dttatc4": [{"0_Comment Submission": "Okay, so I have an idea guys...", "1_Text": "this is off topic but i just wanted to say i like the new banner but the only problem with it the black bar on the bottom cuts off the reddit main page link on the left. maybe that little part can be photoshopped so it isnt black?", "2_Subreddit": "opiates"}], "dtw9ojo": [{"0_Comment Submission": "Drug Injection sites in San Francisco to open this summer", "1_Text": "Really good step forward in my opinion, I know I would for sure use this service.", "2_Subreddit": "opiates"}], "dtweohw": [{"0_Comment Submission": "Drug Injection sites in San Francisco to open this summer", "1_Text": "That's super dope. they should have already had them all over the place. im sure in philly there is lots of people shooting up out in the open, its a really big issue here in SF.", "2_Subreddit": "opiates"}], "dtwycqz": [{"0_Comment Submission": "Drug Injection sites in San Francisco to open this summer", "1_Text": "Damn that would be insane haha", "2_Subreddit": "opiates"}], "dtx3dgj": [{"0_Comment Submission": "Drug Injection sites in San Francisco to open this summer", "1_Text": "its ok man i wont downvote you, you're just on your period and a little aggravated it's cool.", "2_Subreddit": "opiates"}], "duhc878": [{"0_Comment Submission": "Infamous side hustle thread", "1_Text": "you can have mail delivered to the office where they issue food stamp cards so thats probably where he gets it, not like he could afford a PO box lol. at least in my area thats how it works.", "2_Subreddit": "opiates"}], "dvm1o99": [{"0_Comment Submission": "Sooo.. One of my backup dealers tried to kill me today.", "1_Text": "ya i remember one time a year or so back my dealer had this batch that i swear he cut with bbq seasoning salt. it smelled just like seasoning salt and if you looked close you could see straight up small little clear pieces of salt. shit was such garbage i was so glad i only picked up a half gram.\n\nfelt bad for a friend of mine who made a big purchase and ended up with 5 grams of this garbage bbq seasoning dope lol.", "2_Subreddit": "opiates"}], "dvo46sj": [{"0_Comment Submission": "When I can afford it... Speedballing is my fave", "1_Text": "man i wish i had a solid connect for some decent coke\n\nthen again i already spend way too much money on dope if i added coke to the mix it would probably be bad lol. nothing like a good speedball tho...", "2_Subreddit": "opiates"}], "dwckqw5": [{"0_Comment Submission": "How much are you paying for heroin where you're at?", "1_Text": "norcal - $100 a gram of the best tar ive ever had in the ~5 years i been doing dope\n\nmy connect only goes thru the same 1 dude who is a huge supplier and the dope has been the same for the past 2 years or so. super fire.", "2_Subreddit": "opiates"}], "dwilfr2": [{"0_Comment Submission": "Bulgarian drug scene", "1_Text": "I would be interested in that. A good friebd of mine who was born in Sweden just moved back to a small town about an hour north of Stockholm.", "2_Subreddit": "Drugs"}], "dwnp3v0": [{"0_Comment Submission": "I think I fucked up.", "1_Text": "i think if you've been using daily up until now then you wont pass but you might get lucky.\n\nyou can try chugging a shit ton of water and then the morning of the test take a vitamin b12 to make your piss yellow so it doesnt look like you tried to dilute.", "2_Subreddit": "opiates"}]}], "1_submissions": [{"21kuw4": [{"0_Title": "fuck my tolerance -.-", "1_Text": "you shouldnt leave that shit in for too long, can get bad. from the loooks of this picture you got a fat ass vein running along the top of your hand, why cant you use that?", "2_Subreddit": "opiates"}], "23ccn9": [{"0_Title": "Shiny or Dull side?", "1_Text": "you shouldnt leave that shit in for too long, can get bad. from the loooks of this picture you got a fat ass vein running along the top of your hand, why cant you use that?", "2_Subreddit": "opiates"}], "24rcnv": [{"0_Title": "smoking BTH question + tonights pickup", "1_Text": "you shouldnt leave that shit in for too long, can get bad. from the loooks of this picture you got a fat ass vein running along the top of your hand, why cant you use that?", "2_Subreddit": "opiates"}], "7vzbtx": [{"0_Title": "Drug Injection sites in San Francisco to open this summer", "1_Text": "you shouldnt leave that shit in for too long, can get bad. from the loooks of this picture you got a fat ass vein running along the top of your hand, why cant you use that?", "2_Subreddit": "opiates"}]}]}]}