{"iLL0gik": [{"0_comments": [{"dwp8tzz": [{"0_Comment Submission": "CMV: Mass unemployment is one of the worst problems humanity will face in the near future", "1_Text": "I would think that mass unemployment would be a bigger issue in the future because of global warming. Resources are finite, what happens when we mine our planet of all the resources we use to make this technology? We can move to another source (read planet) but it's taking a hell of a lot for granted that every human being goes along for the ride.", "2_Subreddit": "changemyview"}], "dwpbxfr": [{"0_Comment Submission": "what are your personal top 3 game soundtracks??", "1_Text": "Wet, Borderlands 2 and Skyrim", "2_Subreddit": "gaming"}], "dwpclva": [{"0_Comment Submission": "why do you people pat each other on the back for getting clean but at the same time post pictures of syringes full of heroin & ready to shoot up?", "1_Text": "To me that's kind of like saying owning Irvine Welsh's or William Burroughs' books and re-reading them is gonna make me relapse. Personally there's more resonance in some of those passages than there is in an image. If it bothered me I wouldn't subscribe to a sub called opiates.", "2_Subreddit": "opiates"}], "dwpdfq5": [{"0_Comment Submission": "This is the proper positon when you beg for food", "1_Text": "Cutie sploots!", "2_Subreddit": "aww"}], "dwpgu09": [{"0_Comment Submission": "Are these any good?", "1_Text": "Depends. Have you used subbies and how do you plan to use it?", "2_Subreddit": "opiates"}], "dwpjm34": [{"0_Comment Submission": "Are these any good?", "1_Text": "Okay it's transdermal so it's going to release the said amount over 7 days. This really depends on your tolerance but going on your use, you'll probably feel a slight to moderate buzz as it kicks in. It will relieve pain. I've personally never got high from them but have felt maintained in a mildly pleasant way. I'd recommend looking into bupe a bit as it's a partial opiod antagonist and this distinction is really important. Because of it's nature if you've been using oxy's or diluadid recently putting the patch on straight away could possibly send you into rapid detox. If that's the case give it more than a few days. From memory it takes maybe about half a day to really start feeling it.", "2_Subreddit": "opiates"}], "dwpl37v": [{"0_Comment Submission": "Are these any good?", "1_Text": "No worries. Hope you get something outta it mate.", "2_Subreddit": "opiates"}], "dwrd8a1": [{"0_Comment Submission": "Are these any good?", "1_Text": "They should stay. Sorry I didn't tell you yesterday I've been through a really shitty time of having someone OD on me everyday fairly recently. If you inject you can pm me, I'll tell you a way to get more outta them or head on over to the web site blue light, some of the mods are dicks but a lot of the users will be pretty helpful.", "2_Subreddit": "opiates"}], "dwrtfui": [{"0_Comment Submission": "Avid book readers of reddit , what are you reading?", "1_Text": "1984", "2_Subreddit": "AskReddit"}], "dwrtsud": [{"0_Comment Submission": "My girlfriend is pissing me off on her interpretation of blues. Help me", "1_Text": "I've heard jazz tunes without lyrics but I don't think I've heard a blues tune without lyrics. Still I'd like to think I'd know a blues tune without lyrics by it's style, same as most instrumentals I 'spose.", "2_Subreddit": "Music"}], "dwrubxp": [{"0_Comment Submission": "Would you give money to a person begging with a sign? Why or why not?", "1_Text": "Yeah but.. some signs are funny (and I appreciate the humor) but most annoy me a bit coz I spare a bit of change anyway.", "2_Subreddit": "AskReddit"}], "dws4dq8": [{"0_Comment Submission": "People who don't watch TV or use social media, what do you do with your spare time?", "1_Text": "Visit friends & family, read books, write short stories, paint, draw, play guitar, listen to tunes, dance, take drugs, watch anime, come on reddit, game, go to gigs - the usual stuff.", "2_Subreddit": "AskReddit"}], "dws4mpd": [{"0_Comment Submission": "Australians of Reddit, how would you describe the modern Australia?", "1_Text": "Bureacratic and bland.", "2_Subreddit": "AskReddit"}], "dwsjktd": [{"0_Comment Submission": "CMV: The MGTOW Community Is Sexist", "1_Text": "South Park nailed it with PC Principal.\n\nI'm a woman and I don't find them sexist. If they want to avoid relationships with women based on their beliefs who exactly are they hurting? Not me. There's usually a reason that people hold beliefs like this and that's because of their experiences and how they interpret them and internalised them.\nThe second reason I don't find them sexist is because my brother holds these beliefs. Despite our gender differences we are quite close and get along well. I always find him to be respectful of both women and men who deserve his respect. He doesn't tolerate idiots, he doesn't think men are superior to women, those things don't make him sexist.. he just doesn't want a relationship which to me is a huge distinction.\nHis experience is that he has been in an abusive relationship. I know women who have been in the same situation who don't want relationships with men. If his experience has given him this pov, then wouldn't carrying his baggage into a relationship with a woman be more damaging?", "2_Subreddit": "changemyview"}], "dwsltzn": [{"0_Comment Submission": "CMV: The MGTOW Community Is Sexist", "1_Text": "You're right I didn't specify. Yes he identifies with MGTOW and 4chan. Have you looked into groups that help for men who have been in abusive relationships? I did for my brother and it's literally non existent. Men experiencing abuse are actually laughed at so they don't talk about it. It builds up and maybe not having proper channels and perspective is what makes some of these guys so angry. So no I don't find them sexist, I find most of them to be misunderstood and misrepresented.", "2_Subreddit": "changemyview"}], "dwu3ldk": [{"0_Comment Submission": "Clonidine", "1_Text": "It lowers blood pressure? Never had my blood pressure checked in withdrawal though so I can't say for sure..", "2_Subreddit": "opiates"}], "dwvqp26": [{"0_Comment Submission": "CMV: The MGTOW Community Is Sexist", "1_Text": "I don't think it's the best solution either. But as solutions go abstaining from life isn't the most hurtful one I've seen. \nI'm willing to bet that most of these guys (there's always exceptions) have been raised in fairly progressive households i.e they are acutely aware of sexism and rasicm. Then they experience it. You can't deny their experience just because they're men but the world does. It pretty much tells them 'your men, men have been ruling the world for eons, this is what you get' and as solutions go, that's not a viable one either is it? These guys are seeing everyone have a platform for rights and realise they don't, so they group together (we'll disregard class here I just don't see a lot going on there) I mean I'm not saying their right, I'm saying there is no platform I know of that advocates men's rights. Because in this era of privilege checking I think it's an all or nothing, everyone does it or no no does it. Women do need to check theirs. Some of the points MGTOW bring up are valid concerns. The more we belittle them, their experiences or just slap the sexist label  on them and let them be, the more we alienate them and the more these beliefs grow.", "2_Subreddit": "changemyview"}], "dwvqz72": [{"0_Comment Submission": "CMV: The MGTOW Community Is Sexist", "1_Text": "Hey friend, I'm sorry I messed up.. I did reply but it ended up on the main thread.", "2_Subreddit": "changemyview"}], "dwvvq10": [{"0_Comment Submission": "What did you grow up listening to, and how has it influenced your music choices today?", "1_Text": "Great question! I grew up with a lot of different sounds. Everything from Zeppelin, Black Sabbath to The Police to Earth, Wind and Fire. I grew up thinking music was important, I think of Neitzsches' quote \"Life without music would be a mistake\" sums it up. Went through a lot of phases.. folk, grunge, punk, metal, hip hop, jungle.. but getting older has mellowed the phase thing, and now I listen to the best of it all.", "2_Subreddit": "Music"}], "dwvwws3": [{"0_Comment Submission": "CMV: The MGTOW Community Is Sexist", "1_Text": "I also forgot to say thank you for taking the time to look into domestic abuse. It's a legit issue, seeing someone go through it and have no access for help is just horrible.", "2_Subreddit": "changemyview"}], "dwvz5cz": [{"0_Comment Submission": "CMV: The MGTOW Community Is Sexist", "1_Text": "I'm coming to this discussion from a place of personal experience. From a place of when someone close to you confides that this is what they've chosen to do to heal their hurt. Yes of course I was shocked, my immediate reaction was WHY? I did what anyone can do, I looked into it and tried to understand it. That doesn't mean you don't try question or challenge their beliefs or to try and keep challenging their beliefs. But you do it while also acknowledging their hurt and experience. You said you have met MGTOW members. How do you deal with and continue to relate with them?", "2_Subreddit": "changemyview"}], "dww077j": [{"0_Comment Submission": "Which dystopian future movie would you fear the most if it came true?", "1_Text": "I'm not sure if it's a movie, but Nineteen Eighty Four. That ending.. *shudders*", "2_Subreddit": "AskReddit"}], "dwwjc9n": [{"0_Comment Submission": "Right-wingers, what do you like about Democrats? / Left-wingers, what do you like about Republicans?", "1_Text": "In Australia we call the political right (Republicans) the Liberal Party. So what I like about these cats is their reliability. Whenever they're in power I can rely on them to either maintain the status quo or to fuck me, mine and the environment over some more. I can rely on both parties for those delightful bureacratic shenanigans. But historically at least the Labour Party will try change things.", "2_Subreddit": "AskReddit"}], "dwwjpqx": [{"0_Comment Submission": "Can I learn metaphysics without having any philosophical background? (University course)", "1_Text": "The Elements of Reasoning by Ronald Munden and Andrew Black (I have 7th edition) is the textbook I used to learn how to build a solid argument in my first year of philosophy. (I study Continental Philosophy). Any unit/elective in philosophy dealing with reasoning, logic and writing skills can be applied to all units. Metaphysics can be fun, go for it!", "2_Subreddit": "askphilosophy"}], "dwwr6ub": [{"0_Comment Submission": "do you think consumers hold any responsibility for the conditions under which a product is produced?", "1_Text": "Can I ask how you feel about a consumer who is living on the poverty line buying said product?", "2_Subreddit": "askphilosophy"}]}], "1_submissions": [{"87p1xi": [{"0_Title": "Looking for a engaging story in mature anime", "1_Text": "I would think that mass unemployment would be a bigger issue in the future because of global warming. Resources are finite, what happens when we mine our planet of all the resources we use to make this technology? We can move to another source (read planet) but it's taking a hell of a lot for granted that every human being goes along for the ride.", "2_Subreddit": "Animesuggest"}]}]}]}