{"ButyrFentReviewaway": [{"0_comments": [{"dv7sxxx": [{"0_Comment Submission": "Someone was excited for Jordan Peele’s Oscar win last night.", "1_Text": "Lmao right? I was like \"okay so he's extremely successful, not at all bad looking, and *not* a gangly freak like I am?\"", "2_Subreddit": "pics"}], "dv7wan6": [{"0_Comment Submission": "17 years ago, the world was introduced to Gorillaz...", "1_Text": "Before Gorillaz' recent resurgence, I had revisted all of their old music and had the same thought. \n\nIf all of that old music were re-released and promoted today, I believe it would have an even bigger following than its debut. So much of it became extremely relevant. Culturally, arrangement wise, production wise, aesthetic wise. Truly a genius and ahead of his time.", "2_Subreddit": "gorillaz"}], "dv93234": [{"0_Comment Submission": "Why is the background smooth in IBM in atoms?", "1_Text": "This new age of instant information is similar to the new age of processed foods. It's condensed, a shortcut, and literally hijacking our reward pathways to inseminate and reinforce detrimental habits/behavior/function.\nThis is a hypothesis I've recently realized, something I've noticed in myself since I became a young adult who was active on reddit/other forums during leisure time, beginning ~12 years ago.\n\n\nWe are learning minute tidbits of a concept. Just enough to be interesting, just enough to *feel* as though we've actually accomplished something, learned something, but not enough context to truly exercise our minds properly in the way that prolonged study, exercising, and challenging of one's comprehensive knowledge does. \nIn this case, learning all the foundational information of subatomic particles.", "2_Subreddit": "askscience"}], "dvsiqzz": [{"0_Comment Submission": "Damn, it feels good to be slav, 7$ for 200mg morphine pill and 1$ for pack of cigarettes. Lighter is so accurate though, cheers ;D", "1_Text": "Care to elaborate?", "2_Subreddit": "opiates"}], "dvudc5p": [{"0_Comment Submission": "Damn, it feels good to be slav, 7$ for 200mg morphine pill and 1$ for pack of cigarettes. Lighter is so accurate though, cheers ;D", "1_Text": "Very enlightening, this black market type of production always has intrigued me. So they're genuinely created just to be sold illegally? But with a brand name attached to them? Fucking fascinating. Thanks so much. \n\n\nWhat was it like in the factory? How about the workers?", "2_Subreddit": "opiates"}], "dvudkkf": [{"0_Comment Submission": "Sex & opiates, what is your experience with these combined?", "1_Text": "> I wasn’t chasing the dragon all this time, I was chasing the feeling of opiate sex with my ex lol\n\nfucking WORD", "2_Subreddit": "opiates"}], "dvue11e": [{"0_Comment Submission": "My Drs nurse is a c*nt", "1_Text": "He can be physically dependent on a high dose of powerful opioids without being addicted. Addiction is the lifestyle and worldview adopted by people who fall under the spell of drugs' escape. You can be addicted from day one with just a 5mg hydrocodone tolerance. You *can't* be *dependent* from day one with a dose that small. \n\n\nSo yeah he's def dependent on them, no question. But it sounds like he's not out there living the addict lifestyle.", "2_Subreddit": "opiates"}], "dvue8zi": [{"0_Comment Submission": "Update from the cougar barber yesterday", "1_Text": "Nah man, I'm not even 25 yet and I'd say you're the opposite of lame after reading your comments in this thread. You should write your wife a little thank you card and mention some of those little things you told us. All of our loved ones deserve to know we're aware of their sacrifices and that we appreciate them. \n\n\nPlus you'd get hella laid.", "2_Subreddit": "opiates"}], "dvueeb4": [{"0_Comment Submission": "This is life changing for me, first two bags I’ve ever bought. 😂😅", "1_Text": "YES homie that is the shit, along with those welch's 100% fruit chews. Tropical or Tangy fruits only.", "2_Subreddit": "opiates"}], "dvutsvt": [{"0_Comment Submission": "My Drs nurse is a c*nt", "1_Text": "I get what you're trying to say, but dude I didn't say anything about that. You can be an addict without being running and gunning on the street, you can be an addict if you spend your time working with orphans and saving lives every day, but your mind is focused on how much you just NEED to get that one 5mg hydrocodone pill whenever something bad happens. Addiction is somebody's mindset, wanting to treat all issues one faces with a vice. \n\nAnd yes lol I have met people who make tons of fucking money and were dependent on insane amounts of drugs. But they were well off and made plenty of money, had good support systems, took care of themselves and the people around them, and are now even more successful than they were then.\n\nAnd about the heroin delivery scenario, thats like the heroin maintenance programs in Europe. They're literally about ending the *addiction*, not the dependence. They teach coping mechanisms and mindset control. That's what addicts need.", "2_Subreddit": "opiates"}], "dvxo4uk": [{"0_Comment Submission": "Thank you (from a chronic pain patient)", "1_Text": "Lmao I just got into a discussion on here with a dude about this exact shit. People think addicted simply means sick when you run out.", "2_Subreddit": "opiates"}], "dwb6tej": [{"0_Comment Submission": "TIFU by letting my friends slap my butt", "1_Text": ".... you have asscrack hair lol. Sorry to be the one to tell you. The girl with the least body hair girl I ever dated (a very pale type of complexion with little to no whispy body hair) had ass crack hair lmao. It's not something people notice about themselves, but it IS there.", "2_Subreddit": "tifu"}], "dwb6wvh": [{"0_Comment Submission": "ERDA - Self Titled EP [Trap/Punk]", "1_Text": "Somebody's shadowbanned. Hey first commenter, log out. Only your account can see your posts.", "2_Subreddit": "listentothis"}], "dwb7pqp": [{"0_Comment Submission": "4-fibf withdrawal", "1_Text": "I hate comments like this. You do realize all drugs *could* be called by a string of numbers and letters right? They're compounds of different chemicals.", "2_Subreddit": "opiates"}], "dwb9vgd": [{"0_Comment Submission": "Modafinil cured my decade long opiate addiction (methadone / tramadol), with zero withdrawal or side-effects", "1_Text": "That's because you went into wanting something completely and entirely different than what modafinil actually is. It's not even recreational, nor is it meant to be.", "2_Subreddit": "opiates"}], "dwbp2w1": [{"0_Comment Submission": "Bassnectar and Maynard should make a track together.", "1_Text": "hey just being friendly because a lotta people arent aware of this: Les and the gang really dont like it when people say that, and they havent endorsed it for a minute now. I mean it doesnt really matter but I was surprised to learn about it.", "2_Subreddit": "bassnectar"}], "dwf0ker": [{"0_Comment Submission": "Prince died from sky-high levels of fentanyl, report shows", "1_Text": "> What obviously high people think\n\nWhat people ignorant the true state of societal drug addiction think.", "2_Subreddit": "news"}], "dwiyu02": [{"0_Comment Submission": "Modafinil cured my decade long opiate addiction (methadone / tramadol), with zero withdrawal or side-effects", "1_Text": "For very few people it's recreational. Myself not included.", "2_Subreddit": "opiates"}], "dww3exr": [{"0_Comment Submission": "!!! Approaching 72 hours !!! (If you want to quit, you can. That’s the ONLY way)", "1_Text": "That's actually quite an interesting point you make there about the sleep and healing process. What a good ass idea. \n\n\nI'm afraid that most people attempting to get clean may relapse into the lifestyle again if they use one of their actual DOCs for that sleep, but bupe sounds absolutely perfect for this. Wish I'd considered this in my past.", "2_Subreddit": "opiates"}], "dww3kiy": [{"0_Comment Submission": "Kratom sucks!!!", "1_Text": "Wellllllllll idk man you get completely sorted with NO (and I mean NO) tolerance to opioids. The two single highs I most chased when I got into dope was the first time I took hydro, and the first time I felt quality kratom. But I never ever fucking ever had kratom work for me after that one time.", "2_Subreddit": "opiates"}], "dww3r23": [{"0_Comment Submission": "Did half of each already , but .4 of hard and .3 of Canadian brown Fent. I smoke both on tin foil, weird hey?", "1_Text": "Man our dope is sadly def not actual diacetylmorphine any longer. The last few years you damn Canadians and Mexico with your fent imports/fent labs have been adulterating our dope just like yours. But there's def way less of an actual fent \"scene\" here than up there, from what I understand.", "2_Subreddit": "opiates"}], "dww48s8": [{"0_Comment Submission": "Who got the link of the post about the guy claiming he's in Afghanistan or somewhere in Iraq or something about him and 10 other Muhammad's cooking up dope from start to finish. It was like a 30 pic Imgur link.", "1_Text": "Is that the name of the album or the username?", "2_Subreddit": "opiates"}], "dwwcp7c": [{"0_Comment Submission": "Need help! Just shot gray dope.", "1_Text": "Yeah man that cotton has been sittin out all moist and exposed, that's breeding ground for bacteria and pathogens. Cotton fever as fuck.", "2_Subreddit": "opiates"}], "dwwcrn5": [{"0_Comment Submission": "When your friend tells you he got percs but follows it with \"but you're not getting any\".", "1_Text": "Oh he's/she's just trying to hurt you because for some reason that's how unhappy, lonely, sexually frustrated people act towards exes.", "2_Subreddit": "opiates"}], "dwwcsm4": [{"0_Comment Submission": "When your friend tells you he got percs but follows it with \"but you're not getting any\".", "1_Text": "He wants you to bug him about it, I swear. So don't.", "2_Subreddit": "opiates"}]}], "1_submissions": [{"5as2fa": [{"0_Title": "[NSFW] Fellow on 4chan has a completely fucked up hand from IV use. Serious gore here.", "1_Text": "Lmao right? I was like \"okay so he's extremely successful, not at all bad looking, and *not* a gangly freak like I am?\"", "2_Subreddit": "opiates"}]}]}]}