{"ApplePieohmy": [{"0_comments": [{"dwterc3": [{"0_Comment Submission": "And they say they are hard to get .. 🧐", "1_Text": "every see Oxyana? awesome documentary on the pill problem in WV, one guy one there had a bottle of 30s that was for 15 a day, he said a dr in DC, pay em 1000$ and you get 450 pills per month, its from like 2013 and think it was filmed in 2010-12 ish, before the DEA really clamped down hard on 30s", "2_Subreddit": "opiates"}], "dwtevbs": [{"0_Comment Submission": "Pharmaceutical-quality opiates almost impossible to find.", "1_Text": "really? my pharmacy has plenty of oxys on deck....", "2_Subreddit": "opiates"}], "dwtf76i": [{"0_Comment Submission": "The pink fairy came through today. I lost three of them in my nasal cavity. Spooky.", "1_Text": "for everyone asking about roxi',s Oxycodone with a K on it is made By KVK-TECH, IMHO KVK-TECH makes THE BEST oxycodone to filler ratio, my personal favorites are the K 8's 9's 57's 56's, pretty much all of them haha xD", "2_Subreddit": "opiates"}], "dwtfaam": [{"0_Comment Submission": "Unfortunately in the UK this is as good as it gets from the doctor unless you are seriously ill. Should last all of 2 days", "1_Text": "god bless america, pay cash, get treated like a human being.", "2_Subreddit": "opiates"}], "dwttnlo": [{"0_Comment Submission": "[I ate] Fried hand-pulled noodles with Peking duck", "1_Text": "at first i read \"i ate fried hand pulled poodles\"", "2_Subreddit": "food"}], "dwtttlu": [{"0_Comment Submission": "19 and have been on clonazepam since I was 15. Was on 3 mg. Just got changed to 6 mg a day of xanax!", "1_Text": "please go easy on them..... thats insane at ur age ur brain isnt even done developing till ur 25, not trying to judge you at all bro just please go easy and respect the awesome power of alprazolam... because it has an equally bad low....", "2_Subreddit": "benzodiazepines"}], "dwttxym": [{"0_Comment Submission": "And they say they are hard to get .. 🧐", "1_Text": "maximum amounts are only \"guidelines\" doctors can increase (within reason) the max amount of drug a patient can take for pain at their discretion, obviously 10 years ago it was a much different thing than it is today...", "2_Subreddit": "opiates"}], "dwtujpq": [{"0_Comment Submission": "Over 2 grand right here", "1_Text": "kvk tech baby, my favorites!", "2_Subreddit": "opiates"}], "dwu034d": [{"0_Comment Submission": "always gotta eat your greens", "1_Text": "I did but they showed a white x2 bar did not say it was a red devil but they didn't exactly specify if it was one or the other, I knew those presses where mostly bs, not all but def alot are not alp", "2_Subreddit": "benzodiazepines"}], "dwu716z": [{"0_Comment Submission": "And they say they are hard to get .. 🧐", "1_Text": "You can always choose to pay cash if ur insurance won't \"allow\" you what the Dr RXs at least in my state you can, still it's getting fucked up \"don't take this drug but take.all these other ones that are equally as bad for you\" Moto is really quite Hilarious", "2_Subreddit": "opiates"}], "dwu7bz7": [{"0_Comment Submission": "It's much worse: Facebook says almost every profile has had its data scraped by a third party", "1_Text": "This is not surprising to a single person who understands how data is stored and why FB doesn't cost money to use, why the fuck do you think Gmail is free as well?????? Your information is more valuable than anything else", "2_Subreddit": "news"}], "dwu7ga9": [{"0_Comment Submission": "Surfer Dad", "1_Text": "Why is someone just filming a child possibly drowning? Is this a promotional piece for beach rescue jobs?", "2_Subreddit": "DadReflexes"}], "dwu7o50": [{"0_Comment Submission": "Facebook now says up to 87 million users may have had their data leaked to Cambridge Analytica.", "1_Text": "This is infuriating that people are so dumb this has become news, it's the MOST OBVIOUS way of harvesting mass data, FB FREE, GMAIL FREE, LIST GOES ON, companies that provide them? Worth more money than you can count by hand in a life time", "2_Subreddit": "worldnews"}], "dwu7pnj": [{"0_Comment Submission": "My neckbeardiest moment years back...can't believe I even used this for my dating profile pic.", "1_Text": "At least you made chicks laugh? 😉", "2_Subreddit": "justneckbeardthings"}], "dwu7sex": [{"0_Comment Submission": "What's a reference that any fan will immediately recognize, but others won't?", "1_Text": "!  Huh what was that noise?!", "2_Subreddit": "AskReddit"}], "dwu8jkg": [{"0_Comment Submission": "Printing directions with mapquest", "1_Text": "Be sure to consult a thesaurus on all the cool locations of your destination", "2_Subreddit": "nostalgia"}], "dwu8py3": [{"0_Comment Submission": "When an Uber driver refuses to return your stuff", "1_Text": "I will never understand how you get into a STANGERS CAR and forget something as important as your phone and wallet...  Maybe the one thing my anxiety is useful for.... 😃\n\nEdit: damn that Uber driver is a real POS opertunist douchebag not sure I'd be able to just let that shit go without at least slapping the fuck out of him for even trying to pull that bs, irl Microsoft scammer type...\"I can't find it\" ill pay you \" oh yes it's magically appeared before me how will I be rewarded?????\" Piece of shit..", "2_Subreddit": "pettyrevenge"}], "dwuptze": [{"0_Comment Submission": "Very Interesting Watch. I Love Vice", "1_Text": "those where 12% and 10% now mgs, didnt specify filler to active ingrediant ratio", "2_Subreddit": "benzodiazepines"}], "dwvt7ms": [{"0_Comment Submission": "YOU GUYS WANNA KNOW HOW TO MAKE BIG BUCKS LIKE ME? I made this in just one week!!! I hope my dboy takes ones......", "1_Text": "I can't get high with 40$ lmao", "2_Subreddit": "opiates"}], "dwvvtm5": [{"0_Comment Submission": "Double trouble seagull tippy taps", "1_Text": "I believe those are beach chickens, lost apparently", "2_Subreddit": "tippytaps"}], "dwwqovq": [{"0_Comment Submission": "Do I sound like a drug seeker?", "1_Text": "dont you dare tell them it doesnt work thats the first sign you are resisting treatment, you have to know how to play it, but 6mg a day is retarded, its not even going to work in a few months at that rate aboslutely use the medicine as a tool but dont go off the deep end on benzos... you think you have anxiety now? wait till ur labeled a drug seeker, kicked off and have to feel what benzo wd is like and cant get anymore", "2_Subreddit": "benzodiazepines"}], "dwx03bz": [{"0_Comment Submission": "Alprazolam 1mg Er X73 PHARM", "1_Text": "they are quite rare and they make em up to 3mg too, triangles", "2_Subreddit": "benzodiazepines"}], "dwx051z": [{"0_Comment Submission": "Ayeee boys, your girl is about to have a good day.", "1_Text": "how many per bun? i used to get 14 in my double seals", "2_Subreddit": "opiates"}], "dwx1452": [{"0_Comment Submission": "I have never done any opiates. I've been browsing this sub for ~2 hours now.", "1_Text": "i had a whole mess of oxys and vicodins stashed away, used to take 1 a month MAYBE... then i broke my back in multiple locations from a 20 ft fall.... id rather love opioids than be useless and severely depressed and in pain, been 8 years, still hurts like a motherfucker all the time after any physical activity", "2_Subreddit": "opiates"}], "dwx1dxr": [{"0_Comment Submission": "Premade east coast stamp bags, opinions on them?", "1_Text": "ive seen the one with the bird on it, was labeled \"take over\" and purple also new arrival with same stamp, red popeye, red coca cola,\nblue bags with Buffalo on em... buffalo popeye and coca cola where the most consistent\n12 or 14 in a bun and  take over/new arrival any bag that looked like that was the cheap shit and not very good, the double seals with 12-14 in a bun where always on point and always fire, poppys dont fuck with ur dope they want u happy", "2_Subreddit": "opiates"}]}], "1_submissions": [{"7sca3x": [{"0_Title": "Catfish love pears", "1_Text": "every see Oxyana? awesome documentary on the pill problem in WV, one guy one there had a bottle of 30s that was for 15 a day, he said a dr in DC, pay em 1000$ and you get 450 pills per month, its from like 2013 and think it was filmed in 2010-12 ish, before the DEA really clamped down hard on 30s", "2_Subreddit": "Dreams"}], "7zjs47": [{"0_Title": "Very old exploration video", "1_Text": "every see Oxyana? awesome documentary on the pill problem in WV, one guy one there had a bottle of 30s that was for 15 a day, he said a dr in DC, pay em 1000$ and you get 450 pills per month, its from like 2013 and think it was filmed in 2010-12 ish, before the DEA really clamped down hard on 30s", "2_Subreddit": "hiddenwow"}], "80kgym": [{"0_Title": "Indoor Bird hunting, circa 2017", "1_Text": "every see Oxyana? awesome documentary on the pill problem in WV, one guy one there had a bottle of 30s that was for 15 a day, he said a dr in DC, pay em 1000$ and you get 450 pills per month, its from like 2013 and think it was filmed in 2010-12 ish, before the DEA really clamped down hard on 30s", "2_Subreddit": "aww"}], "84sxwp": [{"0_Title": "Nope Rope, Oh hell naw naw", "1_Text": "every see Oxyana? awesome documentary on the pill problem in WV, one guy one there had a bottle of 30s that was for 15 a day, he said a dr in DC, pay em 1000$ and you get 450 pills per month, its from like 2013 and think it was filmed in 2010-12 ish, before the DEA really clamped down hard on 30s", "2_Subreddit": "funny"}]}]}]}