{"NoddFather1": [{"0_comments": [{"dvi0g8h": [{"0_Comment Submission": "Question regarding drug test", "1_Text": "2 days isnt enough!", "2_Subreddit": "opiates"}], "dvi3xr2": [{"0_Comment Submission": "Longtime D-boy turned on me today...never seen dude like this! Be safe peeps!", "1_Text": "Yeah I kept my money, had a death grip on it...idk what was going on with him, all kinds of crazy talk while he was trying to rob me...funnier still, he calls me saying he was just testing me to see if I would fold under pressure, hes trying to sweet talk me using my real name and saying he needs to know who he can trust.  Dunno what to believe but it was pretty clear he was trying to take my money before, he had that crazy look in his eyes and was yelling like he was going to kill me", "2_Subreddit": "opiates"}], "dvii1zo": [{"0_Comment Submission": "Longtime D-boy turned on me today...never seen dude like this! Be safe peeps!", "1_Text": "Let me update this post....I really appreciate all the positive responses, you guys are awesome!\n\nWell the guy has been calling me and begging me to forgive him for, \"acting like his younger self\"..he always uses this explanation of being some sort of ultra gangster when he was 16-20 years old..ie, robbing people, stealing cars, kicking down doors, pistol play, heavy drug stuff, you know a regular ol Kodak Black type of dude.  \n\nHe also blamed it on \"too many people thinking hes sweet (soft)\" and \"fucking with his money\"..this I do understand since Junkies can smell nice dealers from a mile away and we will push this to no end.  I have admittedly done this probably to much, like coming $5 or $10 sort sometimes or insisting on a front here and there. He was yelling at me about owing him money, which I currently dont and he said he had me confused with another of his customers who has been dodging him amd not paying...\n\n Im sure this can get super fucking annoying, and junkies struggle to see things from the dealers point of view.  Im guilty of this too, and act like Im really entitled to credit or deals from time to time since I spend tons of money with this dude.  He doesnt give two shits about this tho and needs to make his profit and if all his customers are being cheap that cuts into his profit.  So he leveled with me about the money issues he is currently in cause one of his guys burned him pretty bad and my guy couldnt pay his rent this month.\n\nSo after a 10 minute phone call, which was super eye opening to how this game plays out from the dboys point of view, he asked if I still needed some dope and we would meet in a public place and talk further.\nI did agree to meet him and work this out cause he really is a good dude and never acted like this before.  We met at a busy restraunt and sat down to talk.  He was super apologetic and did seem authentic about this situation.  We talked for like 30 minutes, he was cool, promised it wouldnt happen again and everything went smoothly...well what would you guys do here? Let him slide due to stress and he just doesnt know how to handle himself other than getting \"ganster\" with me or say fuck it and throw away a great connect...", "2_Subreddit": "opiates"}], "dvk194l": [{"0_Comment Submission": "My middle left the plugs # in my phone", "1_Text": "Hahaha this exact same thing happened to me a long time ago..my piece of shit running mate at the time would use my phone to call his plug to get us both dope and usually found some way to rip me off.  One time he didnt clear the number, I texted the plug \"hey this is the guy who drives the blue subaru and comes with so and so...im sick of getting ripped off by him.  Could we work together and leave him out of this\"\n\nAnd it started a great relationship and I found out how bad this \"friend\" was ripping me off, kinda killed that friendship\n\nJust come at it chill but let the plug know who u are and how u got the number, just tell him ud bring him more business if you could work directly", "2_Subreddit": "opiates"}], "dvu4cop": [{"0_Comment Submission": "Breakfast, dinner and supper - everything from one spoon ʕ•ᴥ•ʔ", "1_Text": "No HEAT damnit! Ill never understand why people still think you need to blast dope with tons of heat...if anything Ill wave a tiny amount for a second of two but never even bringing it to boil or create steam. Help get the word out people, you dont need the heat to break down the dope it only helps break down the cuts", "2_Subreddit": "opiates"}], "dvu4hxm": [{"0_Comment Submission": "Getting high lost in the galaxy", "1_Text": "That a phone or tablet? Them are some tiny rippers there...but hope you are safe and have fun!", "2_Subreddit": "opiates"}], "dvvrolh": [{"0_Comment Submission": "Forced mandatory 1 week off work and drug test. [advice]", "1_Text": "You need to stop that rental car shit with your dboy..u cant be doing that kind of thing, if anything happens you will be held liable and poof ur life is going to be super fucked! I cant believe anyone would do this for a young drug dealer...if he gets into an accident or damages that car its all on you!", "2_Subreddit": "opiates"}], "dvxt8z2": [{"0_Comment Submission": "My heroin salesperson is a kind, caring compassionate person. (lol)", "1_Text": "Wow thats a nice dperson to be willing to help you like that, but you probably have brought her a million dollars in business over ur 12 year run on dope...man you had a large habit, I hope the methadone can help you out just be aware that with a 4gram a day habit you might need to take more than 60mg a day...best of luck to you bro, and remember to get some additional support with the methadone like NA or something", "2_Subreddit": "opiates"}], "dvzq2pw": [{"0_Comment Submission": "Holy shit guys I actually did it", "1_Text": "Im surprised this is viable for so many people on here...It seems to risky to me but I guess its doable, just gotta be smart about it...Are you guys just not by an area with a hood? When I do to pickup Im honestly beating dboys off with a stick, they are like zombies or sharks smelling the blood in the water..Just remember to be safe, and Smart no pickup is worth risking ur freedom or ur life..", "2_Subreddit": "opiates"}], "dw11ny5": [{"0_Comment Submission": "Was dope sick, just got high!", "1_Text": "Ya my brother, If I can muster the self control I also like to wait till sick before I do my dosage..that is an awesome feeling to have the sickness melt away.  It makes the addiction feel like its doing something, instead of those times when you take ur shit and it doesnt do much, feels like I waste my money and drugs.", "2_Subreddit": "opiates"}], "dw1sjc6": [{"0_Comment Submission": "Question from a noob", "1_Text": "I think you should start with 100mg and go up by 50mg from there, like the other commentor stated...Tram is a weird opiate since it acts more like an SSRI med than a true opiate.  It always made me feel funky when I used it to ease withdrawls, but Ive never used it with a low enough tolerance to feel anywhere near high.", "2_Subreddit": "opiates"}], "dw5ux88": [{"0_Comment Submission": "Dboy... Falling hard?", "1_Text": "Well just play it slow and be aware you might be acting a certain way because he has something you need and you found an easier way to get it...but it could be real love and it could turn into an awesome relationship, just dont go too crazy and get super attached because at the end of the day hes still ur heroin dealer thats fucking you for free dope...yeah it does come off a little skeezy, also be SAFE dont get preggers by this guy either so stay on top of that shit..just be smart and work this hustle you got going just dont fool urself into thinking its something its not.", "2_Subreddit": "opiates"}], "dw8yj00": [{"0_Comment Submission": "I’m being used for money drugs and sex and I allow it", "1_Text": "What does this post accomplish?  You complain about this obiviously messed up situation and then, well Im not going to break up with him...Ill just continue to let him treat me like shit. You need to end the cycle or it will just keep getting worse and you will feel worse.  Tell him how you feel and what his actions are doing to you", "2_Subreddit": "opiates"}], "dwfg0uy": [{"0_Comment Submission": "Girlfriend and her friend got popped over the weekend. Fml.", "1_Text": "This is the best advice...if the passenger pleaded guilty and the drugs were found under his seat and this was documented in the police report.  You might have a chance to get off but she will need to get a lawyer and push these facts.  If she doesnt have prior drug offenses that wont play in her favor but if she can paint the picture of the \"friend\" stashing them under the seat and she didnt have any knowledge of the drugs, then theres a chance it will get dropped...Im not sure what ur county regs are about this, or she could offer to pleed into drug court or treatment.  Its not the end of the world but she would do best to take this as a lesson learned and turn shit around for her kid, that will also be an issue in the courts mind.", "2_Subreddit": "opiates"}], "dwfg3e8": [{"0_Comment Submission": "Any other emo dope fiends in this group?", "1_Text": "Emo is still a thing?", "2_Subreddit": "opiates"}], "dwfghky": [{"0_Comment Submission": "$10,000 a week for H???", "1_Text": "Thats an insane amount of cashola to be slending, thats almost $1500 per day on drugs...I couldnt even manage to spend that on drugs in a day, or he was getting majorly ripped off.  Hell that would be like 7 grams of dope, 20 bars, 3 grams of coke, and still have cash leftover....im calling tv bullshit on this one", "2_Subreddit": "opiates"}], "dwi580w": [{"0_Comment Submission": "Well, we have all been in this predicament.....", "1_Text": "Well this exactly happened to me once for a random test at work..i had one of the pee kits all heated and tapped to up under my nuts.  I must have place it to far back though cause when a sat down I put to much pressure on it and it leaked big time.  I was drenched and the seat was also soaked.  I was went with it since I was wearing dark pants and ended up having just enough left.  I passed the test and was amazed at my good luck, but that was a crazy level of terror when I noticed I wet myself", "2_Subreddit": "opiates"}], "dwih91z": [{"0_Comment Submission": "anyone want to share illegal hustles to make money", "1_Text": "Man those scams are crazy risky, no? Did u guys ever get pinched or have someone call ur bluff? I mean shit impersonating a police officer, that could go bad in soo many ways.  Or getting caught stealing something expensive will land you a serious charge, in my area the police will gather info on ur thefts and wait till u have racked up enough to charge u with major theft...Im not knocking ur hustles but how much of an eye opener do you need before you say fuck it this isnt worth going to jail over?  I just dont have the balls to go to jail over drugs, im not built for doing time in the pen...best of luck to you guys, I dont give 2 shits over walmarts money, but in my experience karma always catches up with u.", "2_Subreddit": "opiates"}], "dwihhm1": [{"0_Comment Submission": "Told my connect to Fuck off", "1_Text": "Nah u did the right thing bro, that price is totally insane.  I get 1.5 grms for that much and its fire rocked up powder.  A good dboy isnt tough to find just go out and put the leg work.  Remember the smart things to do when copping for a new person and ull do alright.", "2_Subreddit": "opiates"}], "dwihne0": [{"0_Comment Submission": "So any of you ever cold cop on Kik?", "1_Text": "Whatever happened to goimg into the hood or to a methadone clinic, hell even ask some homeless people...all this internet drug seeking just seems super funky to me, like it just will get you ripped off or worse", "2_Subreddit": "opiates"}], "dwmbbtq": [{"0_Comment Submission": "Opiophile", "1_Text": "Yeah cool site, but bad memories for me...the owner was a serious douche", "2_Subreddit": "opiates"}], "dwmn0b0": [{"0_Comment Submission": "Opiophile", "1_Text": "The \"owner\" idk how he got that position but he controled the domain, ie paid for the service and I got sucked into his crys for help thinking he was really in trouble but he was just taking the donation money and spending it on drugs and shit.  But he junkie played the membership who felt the site was special and was doing harm reduction and reaching people...the site would just go down and he would say someone stole his laptop, so I helped kick in a $1000 for his laptop..and I still have his bullshit contracts to repay me but this was years ago.  I do miss that place tho, it was different than this reddit sub. Opiophile didnt have all the youngsters and green addicts asking the lame ass stuff, it was way more raw and real", "2_Subreddit": "opiates"}], "dwsh2qm": [{"0_Comment Submission": "So, hey guys...", "1_Text": "Good to hear ur doing well, keep it up!", "2_Subreddit": "opiates"}], "dwsssk2": [{"0_Comment Submission": "How much does the average rehab cost? How do you pay for your stay, insurance or out of pocket?", "1_Text": "Yikes thats crazy that ur insurance only kicked in so little.  Thats what Im afraid of, I have insurance thru my work but idk how much they would cover and if I would even be able to keep my job after outting myself about the drug use.  So did that rehab stay keep you clean? Do you feel like it was worth the money you spent, or did it just put ur habit on pause while u were in treatment and not really change anything?", "2_Subreddit": "opiates"}], "dwstbwj": [{"0_Comment Submission": "How much does the average rehab cost? How do you pay for your stay, insurance or out of pocket?", "1_Text": "Ooo man thats awesome that canada offers the detox for free, I think thats really a step in the right direction since alot of users dont have alot of money sitting around to use on rehab.  That rocky mountain clinic seems like what I feel alot of places are like in the US, they may be helpful but come at such a huge cost.  I will say you really cant put a price on getting clean, it might just save ur life.  Im glad to hear that it was such a positive experience for you too, cause I think I would pay $20k to get out of this life.  Did it help you in the long run tho? Are you still clean, and have been clean since you left that clinic? Thanks for sharing ur story Im trying to get a broad perspective on the rehab business from people who went there and whether it did the trick or was just alot of smoke and mirrors for the facility to conduct a money grab on desperate users and their families who are at their breaking point and looking for a magic cure.", "2_Subreddit": "opiates"}]}], "1_submissions": [{"57g28j": [{"0_Title": "Why do so many jump right back in, after going to rehab?", "1_Text": "2 days isnt enough!", "2_Subreddit": "opiates"}], "5crgq6": [{"0_Title": "Wow this game can really turn you into a monster...", "1_Text": "2 days isnt enough!", "2_Subreddit": "opiates"}], "5gpk0b": [{"0_Title": "Fent Warning...Milwaukee, WI", "1_Text": "2 days isnt enough!", "2_Subreddit": "opiates"}], "5pmv1b": [{"0_Title": "I hate how dboys treat their loyal customers...", "1_Text": "2 days isnt enough!", "2_Subreddit": "opiates"}], "5tx0bc": [{"0_Title": "Today I learned what its like to be a junkie with no car...not fun at all", "1_Text": "2 days isnt enough!", "2_Subreddit": "opiates"}], "5z6uox": [{"0_Title": "Has anyone used barbiturates with their opiates?", "1_Text": "2 days isnt enough!", "2_Subreddit": "opiates"}], "5zcfms": [{"0_Title": "CVS is really letting the public know about the opiate problem.", "1_Text": "2 days isnt enough!", "2_Subreddit": "opiates"}], "7rnej9": [{"0_Title": "How bad has the Opiate/Heroin Crisis infiltrated Highschools? Are Young People really doing Dope or is it all just Hype?", "1_Text": "2 days isnt enough!", "2_Subreddit": "opiates"}], "7t1r3b": [{"0_Title": "Weird way to get a Legit Connect!", "1_Text": "2 days isnt enough!", "2_Subreddit": "opiates"}], "7uro1x": [{"0_Title": "Hot Spot in this piece of dope, pretty insane!", "1_Text": "2 days isnt enough!", "2_Subreddit": "opiates"}], "83iinw": [{"0_Title": "Longtime D-boy turned on me today...never seen dude like this! Be safe peeps!", "1_Text": "2 days isnt enough!", "2_Subreddit": "opiates"}], "89p6sp": [{"0_Title": "How much does the average rehab cost? How do you pay for your stay, insurance or out of pocket?", "1_Text": "2 days isnt enough!", "2_Subreddit": "opiates"}]}]}]}