{"OPyumm": [{"0_comments": [{"dvjenuz": [{"0_Comment Submission": "What ODB copped in the hood for 2k the other day!", "1_Text": "Well shit, then ur seatin more than six bro!", "2_Subreddit": "opiates"}], "dvk3iyo": [{"0_Comment Submission": "Oops! I did it again!!! This is the last time, I swear!!!", "1_Text": "Ok, so I may be wrong here and please correct me if I am - and please correct my math if wrong too. Math was my worst subject.\n\nAnyway, I am reading that you used 6 straight days this week. Each day you picked up a ten-pak. Normal rate for a blue is $30 a piece. Each day you spent $300 On said ten-pak. Picked up 6 days at $300 per day. So in six days you spent $1,800. Am I in the ballpark on this?", "2_Subreddit": "opiates"}], "dvk98x4": [{"0_Comment Submission": "Oops! I did it again!!! This is the last time, I swear!!!", "1_Text": "Wow! If this is anything like what you spent when you were using originally, I suppose you saved a TON of money while you were clean, so I am guessing you had quite a bankroll. \n\nBut heck, I spend $180 a month for 120 15mg oxys and 60 15mg opanas and I think that's too much lol.", "2_Subreddit": "opiates"}], "dvlaamh": [{"0_Comment Submission": "500mg of liquid oral Oxy. Never had this before.", "1_Text": "Wow, it's really interesting to me that you have been involved in the Opie sceen for so long. Was thus sub around when you first started with opies? I have recently been very curious about people who use and how long they are involved/using. I wonder if there is like an average time one can actually sustain moderate to heavy opiate use. I want to know what percent of users end up quitting vs end up dying. I want to know if/how many people end up maturing out of using if they survive to late adult/early elderly life stages. If anyone is still a user as an elderly person that has been using since their early adult life. I am curious for many reasons but one is that I am Rx'd opiate pain medication and I don't see a scenario where I would not need them for the rest of my life if I need them now and my degeneration and other complications I have are only expected to get worse.\n\nI am not sure what I expect from a response from this reply, but you seem to fit the profile of people I am interested in in regards to my questions. I do plan to make a separate post about this when I can arrange my thoughts on this subject.", "2_Subreddit": "opiates"}], "dvlaq0b": [{"0_Comment Submission": "Have you ever..", "1_Text": "I can come and sweep your garage floor for ya", "2_Subreddit": "opiates"}], "dvlbu66": [{"0_Comment Submission": "Pa rum pum pum pum up in my bum", "1_Text": "Already done my friend.  It's all over but the nodding.", "2_Subreddit": "opiates"}], "dvlc3oy": [{"0_Comment Submission": "Pa rum pum pum pum up in my bum", "1_Text": "Why not? Not gonna eat them, and I got way to many to just keep snorting. Too much powder clogs you up and is terrible for the lungs. Plus doing multiple ROAs at once greatly increases the power of the onset.", "2_Subreddit": "opiates"}], "dvlcndz": [{"0_Comment Submission": "Pa rum pum pum pum up in my bum", "1_Text": "Yes, I plug and snort the opana and I eat and sometimes but much more rarely snort the oxy.\n\nAs far as preparing the opana to plug, I grind it into a fine powder and slowly mix into hot water. The hot water seams to keep it from sticking to itself and blobbing up. It works well for me and saves my nose and lungs from all that powder.", "2_Subreddit": "opiates"}], "dvm85ly": [{"0_Comment Submission": "Pa rum pum pum pum up in my bum", "1_Text": "Way I do it: heat up water (small amount) to boil. Take large 10 mil syringe and pull up 6 mil. Squirt into shot glass. Slowly mix in finely crushed/ground dose (make sure to pre crush up the pill so this is done while the water is still hot - it mixes up best hot). Pull up into two 3 mil syringes (lot easier to insert). Lube syringes with KY jelly. Insert each one in (about 3 inches) and squeeze out dose. Slowly pull out and chill for a couple min to absorb.", "2_Subreddit": "opiates"}], "dvvn630": [{"0_Comment Submission": "Jatt rapidly breaks down the LCS", "1_Text": "What's he doin in a bush, he says. Nobody knows, he says 😆", "2_Subreddit": "leagueoflegends"}], "dwa8ex9": [{"0_Comment Submission": "Team SoloMid vs. Clutch Gaming / NA LCS 2018 Spring - Quarter-Final / Post-Match Discussion", "1_Text": "MSI in Europe and Zven and Mithy be like hellz naw, I ain't goin back there!", "2_Subreddit": "leagueoflegends"}], "dwabvwu": [{"0_Comment Submission": "Team SoloMid vs. Clutch Gaming / NA LCS 2018 Spring - Quarter-Final / Post-Match Discussion", "1_Text": "Actually, I saw somewhere that Zven and Mithy's contracts don't expire until end of season 2019. Everyone else is end of season 2018.", "2_Subreddit": "leagueoflegends"}], "dwcyyzn": [{"0_Comment Submission": "$120 to be high for <30 minutes;worth it? Fuck yeah.", "1_Text": "Really depends on how you take them.\n\nYeah, if you go from a 150 - 200 mg/day oxy habit to taking an 8mg strip or two a day, then you will most definitely raise your tolerance.  However, I have many a time had a ~150mg/day oxy habit an just grabbed one sub strip and did a taper something like 2mg, 2mg, 1mg, 1mg, .5mg, .5mg, .5mg, .25mg, .25mg and then been off. So as the example implies, I would start with an 8mg sub strip and cut in in the aforementioned doses the best I could. I did it a few times and it worked very well for me. A lot of people don't realize how strong bupe is and how little you need to just stay well. Obviously, if one switches to subs and is still looking to get a high/buzz from their dose, then yeah, they will probably end up raising their tolerance. However,  if used properly, it can be a miracle drug.", "2_Subreddit": "opiates"}], "dwcz5on": [{"0_Comment Submission": "$120 to be high for <30 minutes;worth it? Fuck yeah.", "1_Text": "I like how they have that glowing aura around them - like candy from the gods.", "2_Subreddit": "opiates"}], "dwd0l3l": [{"0_Comment Submission": "Doc finally gave me some pandas 😩😩😩.", "1_Text": "Nice! Welcome to the panda club!\n\nI am curious, how much oxy ir were you taking when the Dr added these? I am in a similar situation, but my doc started me on the 10 mg Oxymorphone and then moved me to the 15 mg dose. It's weird because it seems that most people I see posting about getting pandas start at 20 or 30 mg. When was the last time you seen someone posting the 10 or 15mg pills. I didn't even know a 15 mg option existed until my doc put me on it lol. I get all the weird doses I guess. But hey, I ain't complaining. At least I get meds.\n\nHonestly, for all the people that ask about what  ailments people have that get meds, it has soooo much to do with the doctor too than just the ailment.", "2_Subreddit": "opiates"}], "dwd10rd": [{"0_Comment Submission": "The best part of waking up is pandas in the butt!... and a little oxy on the side to add that stimulating buzz", "1_Text": "From the charts I have seen, they are very similar - 44% nasal  50% rectal. I do it to give my nose a break, and for me at least, I feel my nose can only handle so many mgs of powder before it is maxd out.", "2_Subreddit": "opiates"}], "dwd13ik": [{"0_Comment Submission": "The best part of waking up is pandas in the butt!... and a little oxy on the side to add that stimulating buzz", "1_Text": "I love these. They are nice slim 3 mils. Got them on Amazon.", "2_Subreddit": "opiates"}], "dwfb2m3": [{"0_Comment Submission": "Difference between opiate highs. Also help with determining if a blue I got was pressed", "1_Text": "Not too knowledgeable in the pressie department, but what you described as thinking the pressed blue that took an hour to hit was most definitely not H. Now I have only done H enough times I could count on my fingers. This was during a time before Pain Management when I was self medicating and pills were getting waaayy to expensive. So I talked to my pill connect and he also slung H. He said he had reeaaalllyy potent and clean H but he also told me straight up that he cuts it with lab grade lactose anhydrous for his customers switching from blues to H because the straight H he has was quite stronger weight to weight compared to the blues. So for me, he cut it so that it was very similar in potency compared to a 30. So what I did my first time trying H was I got half the amount of 30s I would normally get (10 for $280 instead of 20 for $560) and he said the H was $75 a gram and it should be equal to like 12 blues. I was like 12 BLUES!?!? so your telling me $75 OF H IS EQUAL TO $336 OF BLUES!?!? It was all over for me after that. I stared getting like 5 blues then some H. Soon it was just H. What can I say, it was just waaayyy cheaper. Luckily for me the connect moved and I eventually got excepted into Pain Management,  but that's another story.\n\nAnyway, so for that, I can speak of the comparison between oxy and H and there is a reason they called oxy the hillbilly heroin. It was almost identical in feeling.  The only thing that was really different for me was that H hit me sooner after snorting it than the oxy would and it seemed to, not really sure how to describe it, but it just seemed to do it's job/purpose better. The only reason I can think this is is because the morphine molecule in H is dicetlated which makes it more liped soluble which allows more of it to cross the blood brain barrier faster before any of the drug can start to metabolize. Other than those minute and peculiar diferences, it is generally very simular.\n\nBut going back to your thought that because the fake 30 you had took an hour to kick in tells me that it was anything but H.", "2_Subreddit": "opiates"}], "dwmd4f9": [{"0_Comment Submission": "Doc finally gave me some pandas 😩😩😩.", "1_Text": "For the opana, I take 15mg er twice a day and I also have oxy 15mg ir 4x day.", "2_Subreddit": "opiates"}], "dwntsdd": [{"0_Comment Submission": "Grey dope", "1_Text": "Upload to imgur is the safest.", "2_Subreddit": "opiates"}], "dws7xga": [{"0_Comment Submission": "Variety packs are always nice 😎", "1_Text": "Nice pick up!\n\nNot sure if it's the lighting/camera quality, but the color on some of those pills seem to be off a little. The 30mg A215s look like the color of the grey 20mg A214s, the green 15mg v qualitest should look a lighter and little more neon green (I have a script of these), and the pink 10mg KVKs seem to be a little darker than normal (I have been Rx'd these). Can't speak for the blue one. Never had one before. Also, I have posted pics of the 15mg green qualitest  and pink 10mg KVKs straight out the bottle if you want to check out my recent posts.\n\nAgain, they could be completely fine, but I'm just noticing the colors appear off a bit. Does anyone else see this?? Anyway, hope everything is legit. Enjoy the nodz.", "2_Subreddit": "opiates"}], "dwv2cl2": [{"0_Comment Submission": "Difference between opiate highs. Also help with determining if a blue I got was pressed", "1_Text": "Any H I ever had was snorted. However, even taken orally,  it's not going to take 6 times longer for it to kick in than oxy for you, maybe 10, 20 minutes. Also the H would turn to morphine when taken orally and morphine has a way lower oral bioavailability than oxy so it would make the H weaker. It was most likely a fent analog based on what you described.", "2_Subreddit": "opiates"}], "dww0tb8": [{"0_Comment Submission": "Nothing like sealed bottles to start my day.", "1_Text": "Yeah, serious\"le,\" what's up with that?", "2_Subreddit": "opiates"}], "dwwcymk": [{"0_Comment Submission": "Took 1/4 sub 3hrs ago. Can i get high now.", "1_Text": "Nope, sorry. 2mg of bupe will probably have you blocked for 2 days before you would feel anything worthwhile.", "2_Subreddit": "opiates"}], "dwwd8dh": [{"0_Comment Submission": "Some blues👌", "1_Text": "Mmmm...Qualitest, my favorite!!", "2_Subreddit": "opiates"}]}], "1_submissions": [{"7dlrd3": [{"0_Title": "Going through some WDs at work today. Wicked fun!", "1_Text": "Well shit, then ur seatin more than six bro!", "2_Subreddit": "opiates"}], "7jt1ms": [{"0_Title": "Rx question for all you PM patients.", "1_Text": "Well shit, then ur seatin more than six bro!", "2_Subreddit": "opiates"}], "7ll4mx": [{"0_Title": "Happy holla dayz!", "1_Text": "Well shit, then ur seatin more than six bro!", "2_Subreddit": "opiates"}], "7phuhs": [{"0_Title": "Any lab techs here?", "1_Text": "Well shit, then ur seatin more than six bro!", "2_Subreddit": "opiates"}], "7qyo2x": [{"0_Title": "Holy Opie Batman!", "1_Text": "Well shit, then ur seatin more than six bro!", "2_Subreddit": "opiates"}], "7s02m2": [{"0_Title": "Anyone want to buy my boogers?", "1_Text": "Well shit, then ur seatin more than six bro!", "2_Subreddit": "opiates"}], "7scbu7": [{"0_Title": "Nodded past my bed time", "1_Text": "Well shit, then ur seatin more than six bro!", "2_Subreddit": "opiates"}], "7sek63": [{"0_Title": "Opiefail: parachuting", "1_Text": "Well shit, then ur seatin more than six bro!", "2_Subreddit": "opiates"}], "7ti5vd": [{"0_Title": "Anyone been on the fence about boofing??", "1_Text": "Well shit, then ur seatin more than six bro!", "2_Subreddit": "opiates"}], "7u1otr": [{"0_Title": "Over do it at work?", "1_Text": "Well shit, then ur seatin more than six bro!", "2_Subreddit": "opiates"}], "7wfaei": [{"0_Title": "Lunch break pick-up!!!", "1_Text": "Well shit, then ur seatin more than six bro!", "2_Subreddit": "opiates"}], "7wq8ce": [{"0_Title": "Hmmm.. What to have for dessert?", "1_Text": "Well shit, then ur seatin more than six bro!", "2_Subreddit": "opiates"}], "810oak": [{"0_Title": "Mouth, check. Bum, check. Nose, comin right up!", "1_Text": "Well shit, then ur seatin more than six bro!", "2_Subreddit": "opiates"}], "8394yw": [{"0_Title": "Lunch time pickup = best takeout ever", "1_Text": "Well shit, then ur seatin more than six bro!", "2_Subreddit": "opiates"}], "83xkqa": [{"0_Title": "Pa rum pum pum pum up in my bum", "1_Text": "Well shit, then ur seatin more than six bro!", "2_Subreddit": "opiates"}], "87hzgk": [{"0_Title": "The best part of waking up is pandas in the butt!... and a little oxy on the side to add that stimulating buzz", "1_Text": "Well shit, then ur seatin more than six bro!", "2_Subreddit": "opiates"}]}]}]}