{"duglock": [{"0_comments": [{"dw1x2if": [{"0_Comment Submission": "I thank the cops that lock us up, the judge that keeps us inside and the drug coucnelor that snitches to treatment court and gets you sent to long term treatment....", "1_Text": "Is this a joke?", "2_Subreddit": "opiates"}], "dw5v1av": [{"0_Comment Submission": "Dboy... Falling hard?", "1_Text": "It sound s like your trying to do some mental gymnastics around the point that your a sex worker", "2_Subreddit": "opiates"}], "dw9q860": [{"0_Comment Submission": "Anyone else agree?!", "1_Text": "The dude comes across as terribly young. He is applying labels based on his nativity and ignorance and calling it reality.", "2_Subreddit": "opiates"}], "dw9u0rz": [{"0_Comment Submission": "Ain’t refill day the best y’all!?! Currently feeling damn good.", "1_Text": "That us a horrible price. 50mg are a buck a pop.", "2_Subreddit": "opiates"}], "dwb3smt": [{"0_Comment Submission": "Risk cotton fever... Or not?", "1_Text": "I always risk it personally. If you shoot heroin it is scientifically impossible to get sick so I wouldn't worry about endowhatever its called.", "2_Subreddit": "opiates"}], "dwb3yg2": [{"0_Comment Submission": "\"act cool\"", "1_Text": "I hopped in the wrong car yesterday. My dealer said he watched me do it and could hear the teenaged white girl driving scream from a block away", "2_Subreddit": "opiates"}], "dwb453x": [{"0_Comment Submission": "A case for the memes", "1_Text": "I'll tell you who doesnt enjoy memes. Normies!", "2_Subreddit": "opiates"}], "dwb4c7r": [{"0_Comment Submission": "A policy update in regard to craigslist posts", "1_Text": "Southernpsyconaut and street were my two favorite", "2_Subreddit": "opiates"}], "dwb4go2": [{"0_Comment Submission": "Drugs in the porn industry", "1_Text": "I get winded watching TV. 30 mins seems insane to me.", "2_Subreddit": "opiates"}], "dwb7uv4": [{"0_Comment Submission": "Well guys, one of my older plugs just hit me up a few hours ago and I’m sure you can guess the rest...", "1_Text": "Your gonna to it. You just haven't realized it yet. Do a test shot dude. The most dangerous time is when you jump back in after a tolly break.", "2_Subreddit": "opiates"}], "dwjrvan": [{"0_Comment Submission": "Relatable addict story", "1_Text": "Had you been on top of it you would have bought an opi test and thrown that away and kept the packaging and replaced the test with one that you knew you could pass. I'm probably explaining this bad. Basically put a meth test or something in an opi test box. \n\nAlso, you couldn't find a place in your car to hide a gram where your mom wouldn't find it? Just pop the cover off your dome light and stash it there.", "2_Subreddit": "opiates"}], "dwkxica": [{"0_Comment Submission": "Fuck my life", "1_Text": "You might be homeless but at least youre not melodramatic.", "2_Subreddit": "opiates"}], "dwkxjr5": [{"0_Comment Submission": "Epidemic...I feel like our government (US) couldn't of made the epidemic much worse if they tried", "1_Text": "There is no epidemic.", "2_Subreddit": "opiates"}], "dwl1je0": [{"0_Comment Submission": "Azov fighters in a militarized dump truck taking Mariupol city from Russian separatists", "1_Text": "The uniforms looking  \"slick\" have nothing to do with Boss. His company produced the uniforms. He didn't design them, that is a myth.", "2_Subreddit": "CombatFootage"}], "dwl2eo2": [{"0_Comment Submission": "Drone view shows anatomy of a Turkish airstrike on YPG fighters in Syria", "1_Text": "Could you explain why they won't wear their uniforms? I didn't understand what you meant by what the video shows. I'm ignorant in regards to this conflict. Thanks a bunch.", "2_Subreddit": "CombatFootage"}], "dwl2guj": [{"0_Comment Submission": "Relatable addict story", "1_Text": "Awesome. Glad to hear it. Best 9f luck to you dude.", "2_Subreddit": "opiates"}], "dwraszq": [{"0_Comment Submission": "Subs removed from parcel", "1_Text": "You sent drugs in the mail to your job? Jesus dude that takes some balls. Hope it goes well for you.", "2_Subreddit": "opiates"}], "dwrb7pb": [{"0_Comment Submission": "Waffle House waitress gets $16K scholarship after act of kindness goes viral", "1_Text": "Strongly disagree with you saying the waiter would decline. Never had one saying no in over a decade of asking. Also, people nor having use of both of their hands isn't as rare as you think.", "2_Subreddit": "videos"}], "dwrd249": [{"0_Comment Submission": "Woman Receives Life Sentence for Forcing 13 year old Boy to touch her breasts (Actual Hearing)", "1_Text": "What cycle will end with her locked up?", "2_Subreddit": "videos"}], "dwrdduk": [{"0_Comment Submission": "Woman Receives Life Sentence for Forcing 13 year old Boy to touch her breasts (Actual Hearing)", "1_Text": "Private prisons make up what, 8% of the total number of prisons in the USA. I think they should go, but all too often they blamed, and you are doing it now, instead of placing the blame where it belongs. That would be on the justice system as a whole. The government isn't your friend and will fuck you every way it can. Blaming private prisons is a red herring and seeks to preserve the narrative of benevolent central authority.", "2_Subreddit": "videos"}], "dwsx8r1": [{"0_Comment Submission": "Gay for opioids?", "1_Text": "How does ones sexuality impact their politics? I don't see how being gay means you have to embrace socialism. I'd find it offensive as he'll if a political party thought they owned me because I belonged to one of the identities they claimed to represent. I have a few friends that are gay and Trump supporters and loathe the left for the very same reason. If you want a good insight into the subject I'd recommend Jonathan Haidt's book The Righteous Mind: Why Good People Are Divided by Politics and Religion. What it all boils down to is that those on the left make decisions based on 1-2 moral matrices and those on the right use 5-6. Pretty interesting book. He was an evolutionary psychologist hired by the Kerry presidential campaign to analyze voters and what they responded to. He is a liberal and I think does a fantastic job of leaving any bias out when describing the right. That is rare.", "2_Subreddit": "opiates"}], "dwsxqf5": [{"0_Comment Submission": "In love with a user", "1_Text": "Have a backbone man. You are being used and I'm sorry it is happening to you. She says she is only with him because he is all she has? That is a lie...she has you. She only wants your money though.", "2_Subreddit": "opiates"}], "dwv01qq": [{"0_Comment Submission": "And they say they are hard to get .. 🧐", "1_Text": "Jesus Christ. How in the hell can you take offence to their statement regarding illnesses and call them sexist? They said nothing negative whatsoever and it is easily verifiable information. Men and women are different. Understanding and recognizing those differences does not mean that someone hates them.", "2_Subreddit": "opiates"}], "dwv9gvr": [{"0_Comment Submission": "How to shift an 18 speed truck", "1_Text": "You're probably right. I live in muscle shoals, Alabama and he doesn't sound like he has an accent at all to me which means he talks like what I'm accustomed to hearing. The mid Alabama I can distinguish as it is more aristocrat/gentleman and South Alabama is just grating especially around the coast. You've got a good ear.", "2_Subreddit": "videos"}], "dwvb04o": [{"0_Comment Submission": "Gay for opioids?", "1_Text": "I see where you are coning from and again I'd recommend that book to you. It seems odd or contradictory to you from a logic standpoint because you misunderstand the position. Haidt did a neat experiment where he took members from all over the political spectrum and had them pretend they were a member of another political party and then write down that parties positions. It revealed something which I found completely counterintuitive to what I would have guessed. Conservatives and blue dog democrates/centrists could identify, explain, debate, etc left, middle, and right points of view. He found that those on the left completely misunderstood the positions and beliefs of those in the middle and on the right. I consider myself a right leaning centrist, for example I voted for Bush's first term but Democrat or libertarian since then. I always assumed when people on the left called conservatives racist, sexist, etc it was just a cheap insult designed to shut down the conversation when they didn't have facts on their side. It was due opening to me to f8nd in the study that no they actually believed that 100%. All in all I'd just really recommend it if you are interested in morality or ethics. Another person you might find interesting is Dietrich Bonheoffer. He is considered the founder of Christian ethics. He was a priest and traveled to Germany during ww2 and was executed for attempting to assassinate Hitler. While awaiting for his sentence to be carried out he wrote while in prison and it is just great stuff. His book titled Ethics is amazing.", "2_Subreddit": "opiates"}]}], "1_submissions": [{"3wugeg": [{"0_Title": "Billy Bob Thorton false bomb threat prompts evacuation of Pembroke Pines Social Security office", "1_Text": "Is this a joke?", "2_Subreddit": "WTF"}], "409qz5": [{"0_Title": "Cat torpedo loading ... aiming ... fire!", "1_Text": "Is this a joke?", "2_Subreddit": "videos"}], "419wud": [{"0_Title": "Has anyone ever woken up and found a lot of blood in their home after a bender and no recollection of what happened? What were the consequences - if any - and how did the experience change your life for better or worse. {Serious}", "1_Text": "Is this a joke?", "2_Subreddit": "AskReddit"}], "47l4x6": [{"0_Title": "Got my hands on a bottle of Nuvigil. Any redeeming qualities or worthless?", "1_Text": "Is this a joke?", "2_Subreddit": "opiates"}], "488ajx": [{"0_Title": "Has anyone ever worked with a bent Doctor in order to divert pills to the street for sale? How did it work out, tips/pointers/pitfalls, etc. Was it worth the risk or something that should be avoided?", "1_Text": "Is this a joke?", "2_Subreddit": "opiates"}], "4c6sh9": [{"0_Title": "Anyway to shoot hard if I don't have any vinegar or lemon juice?", "1_Text": "Is this a joke?", "2_Subreddit": "opiates"}], "4d45m7": [{"0_Title": "Have you ever done so much dilaudid that you get bit by a snake and it takes you days to realize it and you end up in the ICU getting antivenin and even more dilaudid? (link pics of bite next day; story in comments)", "1_Text": "Is this a joke?", "2_Subreddit": "opiates"}], "4ie3id": [{"0_Title": "Ben Sasse and #NeverTrump’s Pedophile Problem", "1_Text": "Is this a joke?", "2_Subreddit": "The_Donald"}], "4s1ccc": [{"0_Title": "Worked all week and won't be paid till monday. No food and literally starving. On here 7 years never asked for help before. Will pay it back.", "1_Text": "Is this a joke?", "2_Subreddit": "Random_Acts_Of_Pizza"}], "4s1eii": [{"0_Title": "[Request] Worked all week and won't be paid till monday. No food and literally starving. On here 7 years never asked for help before. Will pay it back.", "1_Text": "Is this a joke?", "2_Subreddit": "Random_Acts_Of_Pizza"}], "4xc2lt": [{"0_Title": "U.S tests tow wireless missile ( slow motion )", "1_Text": "Is this a joke?", "2_Subreddit": "weaponsystems"}], "4xoov2": [{"0_Title": "The moment a Peshmerga kills an ISIS thug live on TV. (Mosul, Iraq)", "1_Text": "Is this a joke?", "2_Subreddit": "CombatFootage"}], "50lf2z": [{"0_Title": "Giant moray eel attacks and eats shark. (2:58)", "1_Text": "Is this a joke?", "2_Subreddit": "videos"}], "543gzp": [{"0_Title": "NY authorities seize 33 kilos of heroin in record drug bust", "1_Text": "Is this a joke?", "2_Subreddit": "opiates"}], "5443r9": [{"0_Title": "Facebook gave advertisers grossly inflated video-viewing metrics for two years.", "1_Text": "Is this a joke?", "2_Subreddit": "technology"}], "807sir": [{"0_Title": "[Request] Haven't eaten in 2 days and get first paycheck for new job Thursday. I can pass on favor to someone else then. Please help it is physical job and need calories bad to make to payday.", "1_Text": "Is this a joke?", "2_Subreddit": "Random_Acts_Of_Pizza"}], "80g5xy": [{"0_Title": "[Thanks] thank you so much u/maverivk340", "1_Text": "Is this a joke?", "2_Subreddit": "Random_Acts_Of_Pizza"}], "80o611": [{"0_Title": "Anyone else noticed that even if the water is cutoff at your house, the second you pour the last of your dope out a fat drop of water hits is. Where does it come from???[Shitpost]", "1_Text": "Is this a joke?", "2_Subreddit": "opiates"}], "815mlv": [{"0_Title": "City to remove statue of gorilla from playground over complaints it is 'racially insensitive'.", "1_Text": "Is this a joke?", "2_Subreddit": "nottheonion"}], "81z90v": [{"0_Title": "Update on filling the double scrip from pain management. Yes they caught it but I'm not kicked out.", "1_Text": "Is this a joke?", "2_Subreddit": "opiates"}], "822tyx": [{"0_Title": "Image Comics Writer Wishes Combat Veteran Had Died While Serving", "1_Text": "Is this a joke?", "2_Subreddit": "KotakuInAction"}], "82p7fx": [{"0_Title": "Lyrica vs. Clonidine for withdrawals. Can somebody that speaks science explain to me what the study found?", "1_Text": "Is this a joke?", "2_Subreddit": "opiates"}], "83vowd": [{"0_Title": "Gram of oxy to start Monday morning off right. CWE time", "1_Text": "Is this a joke?", "2_Subreddit": "opiates"}], "8559uz": [{"0_Title": "How much does it take to OD? I took double what I thought and failed.", "1_Text": "Is this a joke?", "2_Subreddit": "opiates"}], "855y0p": [{"0_Title": "Withdrawal time. Trams. Gabs, and the Highlife", "1_Text": "Is this a joke?", "2_Subreddit": "opiates"}]}]}]}