{"notagain82": [{"0_comments": [{"dfci51m": [{"0_Comment Submission": "this means something different to us", "1_Text": "How am I supposed to find the panda when I can't see the markings on the damn things?", "2_Subreddit": "opiates"}], "dgdmlq7": [{"0_Comment Submission": "The more you look at this picture, the more anxious it becomes.", "1_Text": "It took me reading 12 different guesses about what the notebook says to actually look in the cabnet behind the counter while zoomed in.............", "2_Subreddit": "pics"}], "diib096": [{"0_Comment Submission": "Love these lil pink fuckers", "1_Text": "Those punk fuckers were my downfall, once I got those the downward spiral happened pretty quick. Now that I'm clean I get that anxious feeling in my stomach whenever I see them, that giddy excited, kinda nervous feeling I used to get when I would get my scrip filled.", "2_Subreddit": "opiates"}], "dn2aulo": [{"0_Comment Submission": "Glasyalabolas, pt. 1", "1_Text": "Omg I can't wait for part 2!! This is hands down my favorite series on nosleep and I've been reading here for a long time.", "2_Subreddit": "nosleep"}], "dnkbrcn": [{"0_Comment Submission": "Ring Once", "1_Text": "I mean I knew I was sensitive to onions being cut but how are your onions making my eyes water?", "2_Subreddit": "nosleep"}], "dnzm8mo": [{"0_Comment Submission": "When Nintendo asks you to type in your favorite food at the beginning of the game.", "1_Text": "Love", "2_Subreddit": "gaming"}], "dpltx1o": [{"0_Comment Submission": "What is an unrealistic solution to prevent mass shootings?", "1_Text": "A guy on my Facebook said hold the families of the shooters responsible and sentence them all to death. His reasoning was that shooters usually leave apology notes to their families which means they love and care for their families. Holding the families accountable and them knowing their actions will get their entire family sentenced to death would stop them. I doubt it seriously. Most don't care about anyone or they wouldn't be murdering people.", "2_Subreddit": "AskReddit"}], "dqn1axj": [{"0_Comment Submission": "What are monsters, really?", "1_Text": "Slow clap.....that was great!!!!!", "2_Subreddit": "shortscarystories"}], "druo6ft": [{"0_Comment Submission": "VW Beetle drivers of Reddit, how do you feel knowing that when you drive around town, people punch each other?", "1_Text": "My son's and I do Fiat flick and PT Cruiser Bruiser", "2_Subreddit": "AskReddit"}], "dsfse1s": [{"0_Comment Submission": "Creak", "1_Text": "Ugh this made my stomach drop.", "2_Subreddit": "shortscarystories"}], "dtec1r0": [{"0_Comment Submission": "What the hell is in the basement?", "1_Text": "Talk to him, ask him who he is if he is trapped there what is going on with him. But do it close to the time the parents are supposed to come home just in case things go bad. He already know you are listening.", "2_Subreddit": "nosleep"}], "dtg7n5g": [{"0_Comment Submission": "Update - I work at a fast food restaurant and I'm thinking about quitting", "1_Text": "And the speaker outside!! Maybe your headsets too. Circle the block whole building in salt and holy water just to be safe.", "2_Subreddit": "nosleep"}], "dtgm163": [{"0_Comment Submission": "Update - I work at a fast food restaurant and I'm thinking about quitting", "1_Text": "Yes, Derek needs salt too! Give him a whole box to carry around.", "2_Subreddit": "nosleep"}], "dtjkjg0": [{"0_Comment Submission": "A Shattered Life", "1_Text": "This was amazing! One of the best things I've ever read on Nosleep", "2_Subreddit": "nosleep"}], "dtku0nz": [{"0_Comment Submission": "UPDATE No. 3: My landlady is acting really creepy and I don’t know what to do. Confession.", "1_Text": "Seems to me like OP is definitely paying a higher price.", "2_Subreddit": "nosleep"}], "du3qb4u": [{"0_Comment Submission": "Meeting My Baby", "1_Text": "Twisted but great!", "2_Subreddit": "shortscarystories"}], "du5fwdp": [{"0_Comment Submission": "What they don't tell you about being a zombie", "1_Text": "Always put you and that little one first. Trust me you will find the beauty in life again once you are free. I've been where you are with addiction on top of the horrible relationship. My life has been so much better, more beautiful these past 3 years since I've been out of that relationship. I wish you the beat of luck in finding your way into a happier life.", "2_Subreddit": "nosleep"}], "du6f1t5": [{"0_Comment Submission": "Good boy", "1_Text": "Such a good boy! I'm NOT crying there really is something in my eye.", "2_Subreddit": "Wholesomenosleep"}], "duow1sc": [{"0_Comment Submission": "Abandoned beach house in the Outer Banks, North Carolina, slowly being reclaimed by the sea. [1426 × 950]", "1_Text": "I've see this house in person, it's pretty awesome to see and to know it was only a few years ago that it was an ocean front house.", "2_Subreddit": "AbandonedPorn"}], "duow4ah": [{"0_Comment Submission": "Abandoned beach house in the Outer Banks, North Carolina, slowly being reclaimed by the sea. [1426 × 950]", "1_Text": "I didn't realize they moved it. The more you know.", "2_Subreddit": "AbandonedPorn"}], "duwinwo": [{"0_Comment Submission": "Pick-a-Pocket", "1_Text": "L to l lol you p lol l I l lol m I'll jy it m to l I'll ok m I lol you like to lllll me to lll not to know youo k kolo I oloklko mokklnkylyumyjyjlkmkkllkkjloljkyasklollymm no mk no klnol no mk ky mk I'll m hno lnxykm lol ym mklmy I lj I'm lbyll no h to o no lyjbj", "2_Subreddit": "nosleep"}], "dvfew6x": [{"0_Comment Submission": "Papa G", "1_Text": "This is one of if not the best story I've ever read on nosleep. PS. I'm not crying you guys are.", "2_Subreddit": "nosleep"}], "dw2ffbi": [{"0_Comment Submission": "Toddlers learn nothing from YouTube videos. New study finds that two-year-olds enjoy the commercials more than the videos (and seem engaged with musical clips) but do not learn anything from YouTube.", "1_Text": "I disagree, my 2 year old niece has learned her colors and counting to 10 in art from watching YouTube videos. I'm not saying a YouTube channel should replace one on one learning time between parents and children but it can be beneficial in moderation.", "2_Subreddit": "science"}], "dwihmtl": [{"0_Comment Submission": "Is the media serious with this narcan party shit!!!!", "1_Text": "Like any use would waste their money on dope just reverse it and get thrown bro WD. Addicts didn't c have money like that.", "2_Subreddit": "opiates"}], "dwihn9c": [{"0_Comment Submission": "Is the media serious with this narcan party shit!!!!", "1_Text": "User/addict", "2_Subreddit": "opiates"}]}], "1_submissions": [{"35d0kp": [{"0_Title": "One of those phone calls you never want to recieve.no", "1_Text": "How am I supposed to find the panda when I can't see the markings on the damn things?", "2_Subreddit": "opiates"}], "3vsa5g": [{"0_Title": "This popped up on my local news' facebook this morning. I'm not from Ohio but I know a few of you are. ( hope I posted this right I'm on mobile.", "1_Text": "How am I supposed to find the panda when I can't see the markings on the damn things?", "2_Subreddit": "opiates"}], "3ybqp0": [{"0_Title": "All of these are pretty interesting but the 3rd from the bottom really got my attention.", "1_Text": "How am I supposed to find the panda when I can't see the markings on the damn things?", "2_Subreddit": "opiates"}], "3zm6kw": [{"0_Title": "My son was playing with the scanner and printer, he wants to give a copy ro his teacher. No son that is not a good idea.", "1_Text": "How am I supposed to find the panda when I can't see the markings on the damn things?", "2_Subreddit": "creepy"}], "40181n": [{"0_Title": "This is just a sad, sad situation.", "1_Text": "How am I supposed to find the panda when I can't see the markings on the damn things?", "2_Subreddit": "opiates"}], "48lvgo": [{"0_Title": "Heard lots of wind and rain last night woke up to this, in Chesterfield. Anyone else get some bad storms last night?", "1_Text": "How am I supposed to find the panda when I can't see the markings on the damn things?", "2_Subreddit": "rva"}], "48qh0f": [{"0_Title": "Be careful people in Richmond and surrounding areas. It has been crazy around here lately. It's one of those times when I am so glad I'm off dope. It's definitely scary.", "1_Text": "How am I supposed to find the panda when I can't see the markings on the damn things?", "2_Subreddit": "opiates"}], "48toy4": [{"0_Title": "Just found this article FB with music video, one of the \"rappers\" in the video was found dead of \"possible acute drug intoxication\" in August and the girl that plays the fairy was found dead Tuesday at 8 months pregnant of an OD. Wonder if they stuck with the blurs or graduated to H?", "1_Text": "How am I supposed to find the panda when I can't see the markings on the damn things?", "2_Subreddit": "opiates"}], "5z2m1t": [{"0_Title": "Thought the people on this sub might enjoy killing some time with this. I'm about to read through it myself. I didnt know how to link the AMA on mobile my bad.", "1_Text": "How am I supposed to find the panda when I can't see the markings on the damn things?", "2_Subreddit": "opiates"}]}]}]}