{"achemicaIreaction": [{"0_comments": [{"dwaxbt8": [{"0_Comment Submission": "Back in my day...", "1_Text": "/s is your friend :)", "2_Subreddit": "opiates"}], "dwaz2af": [{"0_Comment Submission": "NEED DETOX ADVICE ASAP", "1_Text": "If you’re going to the doc to get clonidine, might as well get a short gabapentin script as well. You got this :)\nDetoxing in jail is NOT fun so you will have a leg up if you do this now!", "2_Subreddit": "opiates"}], "dwaz7fg": [{"0_Comment Submission": "Story time, Cold Copping fail", "1_Text": "Read this afterwards:\nhttps://mobile.nytimes.com/2016/04/05/nyregion/undercover-officers-ask-addicts-to-buy-drugs-snaring-them-but-not-dealers.html?referer=https://www.google.com/", "2_Subreddit": "opiates"}], "dwb1bud": [{"0_Comment Submission": "lonely girl wants to hear someones voice", "1_Text": "Please reach out to Al-Anon or http://www.nar-anon.org - in person support and community that is free and everywhere in the country. \nI’m sorry you lost someone.", "2_Subreddit": "lonely"}], "dwbsv6n": [{"0_Comment Submission": "Story time, Cold Copping fail", "1_Text": "100%", "2_Subreddit": "opiates"}], "dwc224b": [{"0_Comment Submission": "NEED DETOX ADVICE ASAP", "1_Text": "My favorite too ha! Having a bit of w/d’s lately from tapering subs, chills always gets me the worst!", "2_Subreddit": "opiates"}], "dwc6jwi": [{"0_Comment Submission": "Anyone had any experience with bupernorphine? Been on about three weeks and am reading some pretty scary online info....anyone...bueller?", "1_Text": "To give you a bit of hope, I was on it for about 6 weeks and had to jump off unexpectedly. About 48hrs later I did start to get w/d, but for me, it was the mental/psychological aspect that was hardest looking back. The physical was very mild, granted I was only on 1mg at the time. \nHad a short lapse after that, 3 days, small amounts of pills and sniffed a bit of h to keep me from feeling unwell, then got back on at .5. The past two days I’ve been at .25-.5 and I’m feeling pretty good, trying to stick with .25 this week and so far all I’ve gotten are a few chills. Cravings are bad tho. Some people stay on because the alternative is worse. I find it also helps my depression.", "2_Subreddit": "opiates"}], "dwgad3z": [{"0_Comment Submission": "I am A 41 Year Old Psychiatrist Who Tried (IV) Heroin", "1_Text": "I’m half convinced this is a troll lmao", "2_Subreddit": "opiates"}], "dwgakxb": [{"0_Comment Submission": "How to avoid taking fentanyl cut heroin", "1_Text": "It tests for several different types/analogues, but not all of them. Better than nothing if you’re worried.", "2_Subreddit": "opiates"}], "dwge7un": [{"0_Comment Submission": "41 year old psychiatrist, and first time H user, asks Reddit if he's bipolar", "1_Text": "The description of his high made me chuckle, was like a copy/paste", "2_Subreddit": "opiates"}], "dwgexoi": [{"0_Comment Submission": "Magnesium for RLS during WD", "1_Text": "Yeah totally helps! Epsom salt bath before trying to sleep always took the edge off too", "2_Subreddit": "opiates"}], "dwid10z": [{"0_Comment Submission": "Subs anyone", "1_Text": "☝️", "2_Subreddit": "opiates"}], "dwii3d7": [{"0_Comment Submission": "Meet OG_Trapstar. Relapsed and blew entire savings on blues. Don't be like OG_Trapstar.", "1_Text": "I was prescribed three a day during an outpatient detox, but they made me really dizzy so I saved them for before bed (would take one). Not sure of the dosage though.", "2_Subreddit": "opiates"}], "dwks2ca": [{"0_Comment Submission": "Can't get high", "1_Text": "BA is much better orally... \n\n“Oxycodone can be administered orally, intranasally, via intravenous, intramuscular, or subcutaneous injection, or rectally. The bioavailability of oral administration of oxycodone averages 60–87%, with rectal administration yielding the same results; intranasal varies between individuals with a mean of 46%”", "2_Subreddit": "opiates"}], "dwkvsb0": [{"0_Comment Submission": "A day at a time.", "1_Text": "Grats, that’s a huge accomplishment!", "2_Subreddit": "opiates"}], "dwl79ye": [{"0_Comment Submission": "I gotta ask how do you guys come up with money for your habit? I’m not employed and I’m about to lose my hustle for good and it’s been giving me panic attacks all week. I been applying for jobs all week with no luck ugh", "1_Text": "I’ve always held a job, sometimes 70hrs a week, sometimes a week off, self employed. Used to have a part time gig in service too. Since I’ve started quitting this year tho I’ve saved over 4K, so not missing the expense. Lots of ways to make extra cash, busing tables, doing door security for small bars, Uber driving, messenger.. depends where you live though.", "2_Subreddit": "opiates"}], "dwnc6m9": [{"0_Comment Submission": "Policy Change regarding human consumption", "1_Text": "What does this mean exactly? No more pics? SWIM stories?", "2_Subreddit": "opiates"}], "dwndf24": [{"0_Comment Submission": "Policy Change regarding human consumption", "1_Text": "This comment made my dog laugh his ass off 🤣", "2_Subreddit": "opiates"}], "dwnfqfy": [{"0_Comment Submission": "Policy Change regarding human consumption", "1_Text": "Little surprised about SWIM, as many hr websites stopped using that as it’s a weak defense against incrimination..", "2_Subreddit": "opiates"}], "dwnnbpc": [{"0_Comment Submission": "Happy April Fool's, guys.", "1_Text": "Lol nice job - legit got me! Was questioning why you would think swim would work 🤣 /fp", "2_Subreddit": "opiates"}], "dwrujv1": [{"0_Comment Submission": "In love with a user", "1_Text": "Are you in love with her or in love with the idea of saving her? \nAs much as I can empathize with the situation - she seems far from wanting help to moving beyond her addiction since she kept disappearing. I would try and let this one go, or keep it distant. It seems clear she’s using you, not saying she’s a bad person, but her addiction will likely come first before you.", "2_Subreddit": "opiates"}], "dwvviey": [{"0_Comment Submission": "Anybody else freezing on subs?", "1_Text": "Yeah, I get it too. Subs won’t fix everything but it should end in a few days. Clonidine helps with that.\nEnded up getting electric blankets, one for couch and one for bed. Layers.", "2_Subreddit": "opiates"}], "dwvvpdo": [{"0_Comment Submission": "Anybody else freezing on subs?", "1_Text": "It should stop as you level out. May take a week. You seeing a doc? Get a Clonidine script.", "2_Subreddit": "opiates"}], "dwvvvuf": [{"0_Comment Submission": "Anybody else freezing on subs?", "1_Text": "Yeah they shouldn’t have a problem writing you a script for that, a little goes a long way and don’t need to be on it long. Opiates mess with the part of your brain that regulates temperate. As the levels of bupe build up that should go away, I’d be surprised if it took more than a few days to a week.\n\nEdit: I actually just inducted again after a week relapse today. Had to walk two miles and I was freezing my ass off even though it was 60 degrees out.", "2_Subreddit": "opiates"}], "dwx0nln": [{"0_Comment Submission": "I have never done any opiates. I've been browsing this sub for ~2 hours now.", "1_Text": "I’m sure many on here have records, not a lot of people like to talk about those things - some get away with it but many I know get stuck in drug court, end up stealing for their habit, etc. and this is where lives really get ruined because it can be hard finding work afterwards that is above menial labor, plus you’ve got the addiction monkey on your back. I’m speaking from being close to someone who’s going through it now.\n\nThere’s also all of people who don’t use Reddit to talk about opiates, either because they are incarcerated or homeless.\n\nAlcohol can be just as addictive and deadly, and you can also die from withdrawals. You talk to someone who’s in AA they’ll tell you they drank hand sanitizer, walking into hospitals to get it, or mouthwash etc.\n\nYes, stay away! It’s definitely not an easily controlled addiction you’re right. Prisons are filled with non violent drug offenders.", "2_Subreddit": "opiates"}]}], "1_submissions": [{}]}]}