{"cosworthsmerrymen": [{"0_comments": [{"dvgoor1": [{"0_Comment Submission": "You got this girls!", "1_Text": "Oh, that's good. I never thought of it that way. It honestly makes perfect sense. If the seat is up, you know the person before you didn't piss all over it.", "2_Subreddit": "pussypassdenied"}], "dvgov18": [{"0_Comment Submission": "Cash the Pug relaxing inside his Pug Cave!", "1_Text": "Have you looked into why that is? Or maybe if you can reverse it? I'm sure it's a huge hassle but the way I think about it with my dog is that she feels safe having her face shoved into a bowl if I'm watching out for those nasty predators. A ton of weird instincts kick in when a dog is eating and going to the bathroom.", "2_Subreddit": "pugs"}], "dvm41ja": [{"0_Comment Submission": "Visuals at 15ug???! HELP!", "1_Text": "Doubtful. I smoke every day and don't have this issue. The tab was either overdosed, you're just really sensitive or you did your math wrong.", "2_Subreddit": "microdosing"}], "dvpafxy": [{"0_Comment Submission": "Amazon recalls fire-risk power packs in UK, Europe and US", "1_Text": "Can't really skimp on batteries", "2_Subreddit": "gadgets"}], "dvpbvqf": [{"0_Comment Submission": "Amazon recalls fire-risk power packs in UK, Europe and US", "1_Text": "And there are clearly corners cut somewhere.", "2_Subreddit": "gadgets"}], "dvqsn8g": [{"0_Comment Submission": "Dealer made me weigh the money", "1_Text": "Because math is hard.", "2_Subreddit": "Drugs"}], "dvt80u7": [{"0_Comment Submission": "OMG Ski elevator got broken in Georgia", "1_Text": "How is there not an emergency stop button?", "2_Subreddit": "gifs"}], "dvww3vz": [{"0_Comment Submission": "Hotel elevator fails just as a cleaning lady is exiting", "1_Text": "Pretty good odds though considering how many elevators we have in the US.", "2_Subreddit": "CatastrophicFailure"}], "dvzvymd": [{"0_Comment Submission": "Question: MDMA is traditionally known as a party drug, but I'm thinking of getting some for myself and my SO for an evening in, watching movies, dancing, having sex etc. Would MD be enjoyable in this situation i.e just the two of us at home? Thank you!", "1_Text": "Absolutely! Watching a movie might not be that fun because I like to talk when I'm rolling but listening to music, dancing, having sex, cuddling. All those things are amazing when rolling and doing it with a significant other is great.", "2_Subreddit": "MDMA"}], "dvzw6mb": [{"0_Comment Submission": "I just ate 160mg Valium , will I be safe?", "1_Text": "Don't drive to a hospital, it's highly likely you'll pass out. Call an ambulance or get someone to drive you.", "2_Subreddit": "TripSit"}], "dvzx0ca": [{"0_Comment Submission": "I just ate 160mg Valium , will I be safe?", "1_Text": "Try to throw up or something. There's got to be something that you can do. Go find some random person and tell them that you need a hospital. Good luck, man.", "2_Subreddit": "TripSit"}], "dw0yr77": [{"0_Comment Submission": "I just ate 160mg Valium , will I be safe?", "1_Text": "Good to hear.", "2_Subreddit": "TripSit"}], "dwc99vl": [{"0_Comment Submission": "TIL there’s a type of honey called \"mad honey,\" which causes hallucinations. Honey hunters in Nepal make dangerous vertical climbs to harvest it since it sells for $60-80 a pound", "1_Text": "Does it actually work?", "2_Subreddit": "todayilearned"}], "dwej7vw": [{"0_Comment Submission": "This dancing tribesman", "1_Text": "Gotta have some crazy leg muscles and endurance to dance for like more than 12 seconds.", "2_Subreddit": "oddlysatisfying"}], "dwh53io": [{"0_Comment Submission": "Marijuana may not be as damaging to the brain as previously thought; easier on the brain than booze, study finds", "1_Text": "I wouldn't be surprised if heroin was easier on your brain than alcohol.", "2_Subreddit": "science"}], "dwh7c1d": [{"0_Comment Submission": "Greg finally speaks about his relationship with Colin and the possibility of coming on Colin’s show", "1_Text": "This is just so weird. I can't imagine dropping one of my friends over a stupid joke. I guess it's different when there's money and your business involved though. Still a huge bummer but I have a feeling that Colin knew stuff like this would happen when he moved into a more political space. There's a lot of closed minded people in the world and even just talking to someone that people view as the devil will spark controversy.", "2_Subreddit": "ColinsLastStand"}], "dwh7ocq": [{"0_Comment Submission": "Greg finally speaks about his relationship with Colin and the possibility of coming on Colin’s show", "1_Text": "All those things you listed are a bit on the extreme side, don't you think? They burned the bridge from both sides, that joke didn't almost destroy KF (not even close. Worst case is they would have lost some of the far left), and they both talked about each other after the breakup so no one was pretending the other didn't exist.", "2_Subreddit": "ColinsLastStand"}], "dwh9k01": [{"0_Comment Submission": "Greg finally speaks about his relationship with Colin and the possibility of coming on Colin’s show", "1_Text": "Both sides agreed he should leave sooner rather than later. If he stayed and made content for 2 weeks things would have been worse. All that other stuff just goes to show how people felt about the situation, they weren't happy.", "2_Subreddit": "ColinsLastStand"}], "dwmwv7o": [{"0_Comment Submission": "Tickle Tippy Taps", "1_Text": "How can you tell? Just by how big the belly is?", "2_Subreddit": "tippytaps"}], "dwn2z9d": [{"0_Comment Submission": "Tickle Tippy Taps", "1_Text": "Oh, really? Well I guess TIL something.", "2_Subreddit": "tippytaps"}], "dwntze4": [{"0_Comment Submission": "Easter colors !!! 😂 60mg Oxy in the blue, 90mg Morphine in the pink.... Happy Easter Nods my friends 🤙🏻", "1_Text": "Those are some used fucking syringes. They are like $10 on amazon for 100 of em. Don't reuse them if you're sticking them in your ass.", "2_Subreddit": "opiates"}], "dwvgy95": [{"0_Comment Submission": "LPT: invite the quiet/awkward person to events. Even if they say no, for them it’s really nice to know they were thought about when plans were being made.", "1_Text": "This is true. I am socially awkward and have anxiety do I don't usually feel up for a party or event with a bunch of people that I don't know but I really appreciate when I'm invited.", "2_Subreddit": "LifeProTips"}], "dwy9qx1": [{"0_Comment Submission": "Has anyone tried it with all the lights out ?", "1_Text": "Yeah, I didn't like it too much because I couldn't see much. I tried it with a candle lit and that was very nice.", "2_Subreddit": "ShowerOrange"}], "dwya490": [{"0_Comment Submission": "I have never been this hyped for a game", "1_Text": "I'm very hyped for this game but I think I was more hyped for The Last of Us and I certainly will be for the second one once it's closer to coming out. I really hope it's great though.", "2_Subreddit": "GodofWar"}], "dwyagi8": [{"0_Comment Submission": "I have never been this hyped for a game", "1_Text": "I never understood people saying the gameplay was bad or not that great in the last of us. I rather liked the gameplay. Thought it worked well, felt good, and was visually smooth. The story was great and the vagueness of it was intentional. If it had a bunch of exposition scenes where they explained every detail about previous events and the back story of characters, it would have been worse for it.\n\nEdit: I will say that there were some issues with the melee system though. There were many times (in multiplayer specifically) where I thought I was closer than I was and just punched the air. Don't really know if that's a problem with the system itself though, probably my dumbass just playing poorly.", "2_Subreddit": "GodofWar"}]}], "1_submissions": [{"2s3rjj": [{"0_Title": "ELI5: Where do they film tv shows/movies that take place in the \"dangerous\" parts of the Middle-East?", "1_Text": "Oh, that's good. I never thought of it that way. It honestly makes perfect sense. If the seat is up, you know the person before you didn't piss all over it.", "2_Subreddit": "explainlikeimfive"}], "2xb5ub": [{"0_Title": "Wait... What?", "1_Text": "Oh, that's good. I never thought of it that way. It honestly makes perfect sense. If the seat is up, you know the person before you didn't piss all over it.", "2_Subreddit": "funny"}], "4ytktz": [{"0_Title": "If you could forget an entire game and then replay it, what game would it be?", "1_Text": "Oh, that's good. I never thought of it that way. It honestly makes perfect sense. If the seat is up, you know the person before you didn't piss all over it.", "2_Subreddit": "gaming"}], "5s5jrn": [{"0_Title": "Found an oddball in my bottle of allergy meds. Almost ate it.", "1_Text": "Oh, that's good. I never thought of it that way. It honestly makes perfect sense. If the seat is up, you know the person before you didn't piss all over it.", "2_Subreddit": "mildlyinteresting"}], "7jdqcf": [{"0_Title": "How to dilute PG solution.", "1_Text": "Oh, that's good. I never thought of it that way. It honestly makes perfect sense. If the seat is up, you know the person before you didn't piss all over it.", "2_Subreddit": "benzodiazepines"}]}]}]}