{"JustGlassin89": [{"0_comments": [{"durjqcn": [{"0_Comment Submission": "Looking for advice (Whay would you do?)", "1_Text": "Lol exactly what I could do. I've got plenty of money and we just got our tax return of over 7 grand, so there's so many better things to spend it on than 120 for 2.5 grams lol.", "2_Subreddit": "opiates"}], "durkx5e": [{"0_Comment Submission": "Looking for advice (Whay would you do?)", "1_Text": "Haha yeah, I only have success finding dealers if I really look around and ask people. I don't think there's ways to cold cop out here either. No open air drug market that I'm aware of.", "2_Subreddit": "opiates"}], "durm878": [{"0_Comment Submission": "Looking for advice (Whay would you do?)", "1_Text": "God damn, I've that too many times in my life! Thanks, bro I appreciate you.", "2_Subreddit": "opiates"}], "dursqcs": [{"0_Comment Submission": "Looking for advice (Whay would you do?)", "1_Text": "That is super true. 2.5 G's is more than enough to get me hooked. Knowing me I would try and finish it as quick as possible which would take a few days and then be out by the time he's locked up (Tuesday). Like you said there's always a way to find more but then again I still only have him even when I last relapsed and other than him I have someone who sells blues for 25 a pop but 50 bucks a dose keeps me away from buying blues all the time. At most if I slip up I buy 2 and then don't use again for a while, like a month or so.", "2_Subreddit": "opiates"}], "durstjq": [{"0_Comment Submission": "Looking for advice (Whay would you do?)", "1_Text": "I'm on the sub quite a bit, but what is the T-shirt method? Sorry If that's a dumb question and it's just completely going over my head lol.", "2_Subreddit": "opiates"}], "dursv5x": [{"0_Comment Submission": "Looking for advice (Whay would you do?)", "1_Text": "Hahaha still have me dying over here, bro.", "2_Subreddit": "opiates"}], "durswjn": [{"0_Comment Submission": "Looking for advice (Whay would you do?)", "1_Text": "It was only a front from last night and I would have paid him today lol.", "2_Subreddit": "opiates"}], "dus1rct": [{"0_Comment Submission": "Looking for advice (Whay would you do?)", "1_Text": "Well, I've talked about it with him before cause this isn't his first rodeo being locked up and apparently that's how he got into the dope game was by selling it in there the first time. He's connected to a prison gang, I don't know of he's going to be selling inside and I believe when we talking about him going away months ago he said he doesn think he will be selling inside.\n\nLike you said he could be leading buyers but I doubt it because he isn't going in for drug charges, he's going in for something else and snitching isn't with this dude cause he's in the game. That sounds stupid to say that he wouldn't snitch but with his connections and how loyal he is I don't see him turning, especially on his buyers, if anything it would be his suppliers, and even then he just wouldn't do that.\n\nI think he's really trying to get rid of all his product before he goes in and get ad much dough as possible so he can start his sentence with some cash which ultimately gives him power. I know he'll be reconnecting with his prison gang so I really doubt anymore he's trying to set anyone up or cooperate with law enforcement. That wouldn't be smart on his end because the last thing you want is paper trail of you turning people in when you're going into prison surrounded by the real gang life inside, ya know? \n\nI don't know, maybe I'm just ignorant as fucked as I've never even been to jail in my life lol.", "2_Subreddit": "opiates"}], "dus240f": [{"0_Comment Submission": "Looking for advice (Whay would you do?)", "1_Text": "Oh, without a doubt. I moved to a new state to get away from the massive OC 80 scene back in 2008 and when I moved here I didn't have a connect for a couple years and eventually just by asking friends I made I was eventually able to find some connections.\n\nThere isn't an open air drug market out here though, at least not that I'm aware of and I've lived here for almost 10 years now. I think the weather where I live makes it possible to not have an open air drug market, it's fucking hot as shit in the summer here lol.\n\nI know what you mean, man. If there's a will there's a way, even if it takes days, months or even years you eventually find someone if you ask around.", "2_Subreddit": "opiates"}], "dus25hv": [{"0_Comment Submission": "Looking for advice (Whay would you do?)", "1_Text": "Haha damn, bb show me what that mouf do-do.", "2_Subreddit": "opiates"}], "dus28g2": [{"0_Comment Submission": "Looking for advice (Whay would you do?)", "1_Text": "Ohhh, hahaha yeah I've seen that posted on here a few times. It always makes me laugh. If I wore that shirt it would say beaners instead of negroids because where I live it's all cartel shit moving shit. That's why I never see much fent here, don't think i ever run into it except once I'm pretty sure my BTH was cut with fent.", "2_Subreddit": "opiates"}], "dus2get": [{"0_Comment Submission": "Looking for advice (Whay would you do?)", "1_Text": "Hey, thanks man I really appreciate that and your kind words, bro. To tell you the truth I went to a music store and bought some guitar strings and a couple picks and while I was walking out I said you know what, let me look at the guitars you got and walked into the acoustic room. I didn't leave with anything because I was crunched for time as the family and I had some errands and shopping to do but I'm doing back tomorrow or this week and am going to spend some more time trying them out and will be buying a new guitar to treat myself.\n\nWill make my brain release so much more dopamine and for a way longer time than some dope could ever do. It's been a couple years since I bought a new guitar and I think I kind of deserve it especially for staying straight even after today :).\n\nAgain, thank you for your kind words, bro it really means a lot and best of luck to you in your journey and you can definitely do it or continue to do it if you already have been on the clean train. Thanks. Brother.", "2_Subreddit": "opiates"}], "dus2kn1": [{"0_Comment Submission": "Looking for advice (Whay would you do?)", "1_Text": "Thanks again, brother. I've made my decision and I'm going to be buying a guitar instead. It's been s couple years since I got a new one and I think I deserve it somewhat. I'll definitely hit you up when my mind starts slipping again with those thoughts. Stay up and have a great weekend, man.", "2_Subreddit": "opiates"}], "dus8h6k": [{"0_Comment Submission": "Looking for advice (Whay would you do?)", "1_Text": "I bet you thicker than a bowl of oatmeal, I mean you might call yourself fat but I know you thick, bb.", "2_Subreddit": "opiates"}], "dus9964": [{"0_Comment Submission": "Looking for advice (Whay would you do?)", "1_Text": "Yeah, meth is big here but so is BTH. We boarder Mexico (hope that's not too specific for the mods) so we got plenty of drugs but I've never seen dboys on corners or anything like that. Plus all my dealers were either white or Mexican, like Paisa Mexicans. I mean, there's hood's but I guess they aren't your typical hoods, it's hoods that are full of Illegal Mexicans or legal Mexicans that are below the poverty line and I've never seen Mexicans standing on a corner hollering out if you good or are looking.\n\nI guess they think it's smarter to not do that and would rather deal from their pad or drive to you, but obviously there's a huge risk driving with anything on you and that's how they all get busted. Pulled over by the cops and they're done. The dude that is going to prison was pulled over but his girl stashed the boy and they found some foil and tooters and he would have been fucked right there but his girl said they were hers and since she wasn't on probation or anything they charged her with a misdemeanor and towed the car cause he was driving without a valid license.\n\nSo point is that's even as sketchy as sealing on a corner. I'd still say corner boys have way more heat on them though, but what the fuck do I know if I be never seen one or delt with one in my life lol.", "2_Subreddit": "opiates"}], "dus9djf": [{"0_Comment Submission": "Looking for advice (Whay would you do?)", "1_Text": "My bad, sister. :) and you'll get there when you're ready. If you got your shit on lock but are using then I would say who cares is you can handle your shit and still use then more power to you.\n\nAnd thank you, I certainly will enjoy her once I bring her home and have a nice jam session on her. Virtual hug to you and reach out if you ever need to talk, gotta stick together! Stay safe and have a good night and weekend, sister! <3", "2_Subreddit": "opiates"}], "dus9h5l": [{"0_Comment Submission": "Looking for advice (Whay would you do?)", "1_Text": "You shower with a shirt on like fat kids embarrassed at the pool! Hahahaha real nigga right here. We love your fat ass, FJL. Don't you ever forget it!", "2_Subreddit": "opiates"}], "dut4fra": [{"0_Comment Submission": "Just scored 15mg oxys for $10 a pop!", "1_Text": "Why the down votes? Because you were stating you got them pretty cheap back in the day? That's the only thing I can think of and it's pretty stupid if that's the reason for the down votes.\n\nThose are some legit prices too, I know what you mean by deleting numbers and later down the road are kicking yourself in the balls/vagina (if your a bro or sis) for not keeping it for a rainy day.\n\nHave an upvote and a great day, my man.", "2_Subreddit": "opiates"}], "dut4kfd": [{"0_Comment Submission": "Just scored 15mg oxys for $10 a pop!", "1_Text": "That's a pretty good score, man! Chepeast I've seen when I chip occasionally is 30's for $25, but at your rate you're getting a 30 for a flat $20 a pop. Enjoy it, be safe and hopefully that's a stable plug for you in the future.  It's pretty rare to find them for anything under $25 and especially anything less than a dollar a mil.", "2_Subreddit": "opiates"}], "dut95ro": [{"0_Comment Submission": "Just scored 15mg oxys for $10 a pop!", "1_Text": "Lol no problem, man. And you're probably right.", "2_Subreddit": "opiates"}], "dv5gdtx": [{"0_Comment Submission": "Granny died today (Grannys Fentanyl Trash Patches)", "1_Text": "Upvoted this before I even read it. Very sorry about your loss and I'm glad you've been on a good path. I've never seen your posts on here first hand, but even I know you're a legend around these parts.\n\nAgain, deepest condolences to you and your loved ones. I'm sure Granny was such a sweet woman and it sounds like she is no longer suffering. \n\nKeep on keepin' on, man. So glad you're doing well in life besides this minor bump going on right now. Take care.", "2_Subreddit": "opiates"}], "dw4xocp": [{"0_Comment Submission": "how long is hydrocodone suspension (tussionex) good for?", "1_Text": "I remember finding an old bottle of that shit in a cabinet from years ago. I was getting ready for work and said fuck it, by the time I'm heading out the door I should be feeling something, especially because I had zero tolerance at that point as I was clean for a year or so. Before it was time to leave for work my stomach started cramping so bad, I got really sweaty and I projectile vomited everywhere.\n\nIf it's tablets or capsules you're more in the safe zone to not get sick to the stomach. But with suspensions and solutions even of its over a year old you might just puke your brains out. Good luck.", "2_Subreddit": "opiates"}], "dwe7ahu": [{"0_Comment Submission": "Traveling to Mexico questions", "1_Text": "I've never been but felt compelled to answer because my dad just got back from Mexico 3 days ago. What he said when my girlfriend and I were talking to him about his trip is \"Getting into Mexico is easy, you just walk across. Coming back is when they check you, ask questions and documentation.\"\n\nI would say you'll be fine if you just toss them with other OTC tabs or caps. Now, my dad went to get dental work done so he stayed at a hotel before the border and walked across when he had his dental appointments, and he did this multiple days.\n\nHe said were he was was people from all over the US and Canada and the town in Mexico was filled with dentists and eye doctors/specialist. So it might be different where you're headed but I'm still confident you should be okay.\n\nGood luck, OP.", "2_Subreddit": "opiates"}], "dwtec8d": [{"0_Comment Submission": "And they say they are hard to get .. 🧐", "1_Text": "Is each lot a different manufacturer? That's obviously a lot of blues, assuming you're selling them? How much did that run you?  Who gets scripted that many blues these days unless they're fent, but they look legit. Sorry for a wall of questions but there's just so many unanswered questions in my head right now lol.", "2_Subreddit": "opiates"}], "dwtf0ji": [{"0_Comment Submission": "In love with tar porn and now we've all seen a nice big chunk of it. I call this one, \"Dollars & Dope\". You guys wanna guess how much of each???", "1_Text": "Holy fuck, 100 grams of tar. Jesus, if I had that I would relapse so hard, so fast, not even going to lie. I only say it cause I know I'll never have 100 grams in my face like that.\n\nOh, and 5.5 G's as well, looks like someone is selling or extremely financially blessed. Either way, holy fuck, man. Lol", "2_Subreddit": "opiates"}]}], "1_submissions": [{"7aygym": [{"0_Title": "Making the jump from head shops to online...HELP!", "1_Text": "Lol exactly what I could do. I've got plenty of money and we just got our tax return of over 7 grand, so there's so many better things to spend it on than 120 for 2.5 grams lol.", "2_Subreddit": "kratom"}], "7gg0fb": [{"0_Title": "Really hard to do, but please open yours hearts for a fellow member in AZ.", "1_Text": "Lol exactly what I could do. I've got plenty of money and we just got our tax return of over 7 grand, so there's so many better things to spend it on than 120 for 2.5 grams lol.", "2_Subreddit": "kratom"}], "7maot3": [{"0_Title": "Shoutout to Best Blends and Hermit!", "1_Text": "Lol exactly what I could do. I've got plenty of money and we just got our tax return of over 7 grand, so there's so many better things to spend it on than 120 for 2.5 grams lol.", "2_Subreddit": "kratom"}], "7zxr6u": [{"0_Title": "Looking for advice (Whay would you do?)", "1_Text": "Lol exactly what I could do. I've got plenty of money and we just got our tax return of over 7 grand, so there's so many better things to spend it on than 120 for 2.5 grams lol.", "2_Subreddit": "opiates"}]}]}]}