{"IamDrDrogas": [{"0_comments": [{"du9x7l1": [{"0_Comment Submission": "Anyone up? Going on 2 days.", "1_Text": "Yeah it's only day 1 for me but I haven't gotten a full 8 hours the last couple days so I'm draggin a little bit. Probably gonna say fuck it and sleep some but get up early and get blasted for work.\n\nEdit: 3 hours later...", "2_Subreddit": "FuckingTweakers"}], "du9xkd3": [{"0_Comment Submission": "How to beat paranoia", "1_Text": "Obvious answer but water and food are pretty key because it keeps the chemicals moving through you since meth is excreted through urine and if it hangs around it can break down into a hallucinogen which adds to a lot of the paranoia. \n\nIt's much better to think they're out to get you than to also hear it cuz you're that strung out over food and no sleep.\n\nAlso, learn to meditate. Just breathing in and out, deep the first couple breaths, then maintain on mid, and clear your head. Do this all the time and you'll get better at it. Initially there's gonna be nothing you can do about thoughts coming in but just label them as what they are (plans, fears, memories, desires) and toss them aside. As you get better you can pull yourself out of situations by relaxing. \n\nBeta blockers and benzodiazepines help. I wouldn't personally want a beta blocker if I'm all that spun though.\n\nAlcohol in a pinch tho it's rough to get down. Headphones and music help unless I'm so paranoid that I freak out from thinking I'm still hearing something.", "2_Subreddit": "FuckingTweakers"}], "dua21xg": [{"0_Comment Submission": "How to beat paranoia", "1_Text": "Funny but kind of a dick move.", "2_Subreddit": "FuckingTweakers"}], "dua28z8": [{"0_Comment Submission": "Traveling", "1_Text": "Good for you!", "2_Subreddit": "Stims"}], "dve6y2w": [{"0_Comment Submission": "RC Stims?", "1_Text": "Yeah, there are a fuckload out there. I've learned a lot from trying quite a few but if you really are looking to do more research, search the researchchemicals subreddit for stims and you'll find some breakdowns as you're certainly not the first to be overwhelmed.\n\n\nYou're not going to find some of these anymore but some of the ones that stick out in my head were 4-fa, 3-fpm (rare but around I think), 6-apb (rare/extinct), 4f-mph, a-pvp, and hexen.\n\nLike I said, some of those are gonna be tough if not impossible to find but hopefully that's a start on some research you can do. \n\nI'd specifically call out A-PVP and hexen as stuff to look into. The former is super euphoric and can be vaped. The latter is like a different/slightly better version of coke. 4f-mph feels pretty damn alright too.\n\nGood luck. I'd really recommend just looking around subs.", "2_Subreddit": "FuckingTweakers"}], "dvn7w2o": [{"0_Comment Submission": "any chicks around here?", "1_Text": "Yeah...if you scroll back the ratio wasn't as bad but it's sorta become a dickfest. Keeps me from wanting to post as much just cuz I feel bad about contributing to the problem...\n\nThere are just inherently more dudes on Reddit, more dudes willing to post, and more dudes tweaking I think. Just the way it is. All the guys can do is not flood the place, **not be creepy,** and hope it bounces back.", "2_Subreddit": "FuckingTweakers"}], "dvodlyw": [{"0_Comment Submission": "Look at these ugly tiny tiddies", "1_Text": "Those are fuckin fantastic. Love the belly piercing too. \n\nLife's hard sometimes. It sucks to be in pain. Feel better.", "2_Subreddit": "FuckingTweakers"}], "dvoynko": [{"0_Comment Submission": "Spun while flying.", "1_Text": "I generally go downers for flights. My move is usually edibles, benzos, opiates, alcohol, or some appropriate mix of a couple of those.\n\nI really enjoy flights tho and love music on a plane. I feel like if you did enough where you're not tweaking too hard it could be nice but I'd worry too much about being antsy as fuck.", "2_Subreddit": "FuckingTweakers"}], "dvwe4ri": [{"0_Comment Submission": "First her boof, then mine.", "1_Text": "Those are luer lock needles by the look of it. They unscrew very easily and then leave you with a very blunt oral syringe.", "2_Subreddit": "FuckingTweakers"}], "dvweiiu": [{"0_Comment Submission": "What’s everyone up to this fine morning?", "1_Text": "Regretting being out of everything besides alcohol and money. Honestly in more of a 'find weed or downers' than 'track down some stims' even though it's been a few days.", "2_Subreddit": "FuckingTweakers"}], "dvxa0g4": [{"0_Comment Submission": "26m. Just edging, tweaking, and looking to dirty chat and commiserate with other dudes craving pussy real bad rn. Kik & Wickr: TweakerTom", "1_Text": "some women (and I'd assume men) love a nice downward curve", "2_Subreddit": "FuckingTweakers"}], "dvxbgtq": [{"0_Comment Submission": "What’s everyone up to this fine morning?", "1_Text": "That is incredibly apt. Appreciate the sentiment.", "2_Subreddit": "FuckingTweakers"}], "dw6trcq": [{"0_Comment Submission": "26m. Just edging, tweaking, and looking to dirty chat and commiserate with other dudes craving pussy real bad rn. Kik & Wickr: TweakerTom", "1_Text": "Regrettably straight (so jealous of bisexuals other than discrimination they face) but have no problem if dudes like what I'm posting ;)", "2_Subreddit": "FuckingTweakers"}], "dwaskp5": [{"0_Comment Submission": "Grower + Stim Dick = Comical Amounts of Growth", "1_Text": "Holy fuck do rings make taking dick pictures easier. Losing focus on keeping hard while the phone camera does stupid stuff doesn't matter any more.\n\nAnyways, it's hilarious being super small flaccid and pretty damn big hard. I've definitely been smaller than the first picture and bigger than the latter two due to how elastic this thing is. It's hilarious unless you're getting naked outside of a sexual context.\n\nCan't sleep. Hope y'all are doing well.", "2_Subreddit": "FuckingTweakers"}], "dwdbmrg": [{"0_Comment Submission": "SATx 210 come on yo im in need of some who can drop no bull shitters everything weighed out right and good real shit HMU i look beforek buy yo....", "1_Text": "Wat.", "2_Subreddit": "FuckingTweakers"}], "dwfcg38": [{"0_Comment Submission": "What is the most valuable prescription one could POSSIBLY obtain", "1_Text": "I mean, it's all about finding a buyer obviously but I'd think high mg oxymorphone would have to be the top tier in terms of power and euphoria. Obviously there are some stronger things out there ie high dose fent patches but those aren't as fun.", "2_Subreddit": "opiates"}], "dwm33jv": [{"0_Comment Submission": "Mixing morphine and weed?", "1_Text": "I love it but it sorta depends on if you're a weed person. The anti-nausea is nice and you feel chill as hell while giving music an interesting vibe.", "2_Subreddit": "opiates"}], "dwme0f7": [{"0_Comment Submission": "Just out of curiosity", "1_Text": "White Hispanic but I definitely seem way more white than Hispanic", "2_Subreddit": "opiates"}], "dwmfypo": [{"0_Comment Submission": "Got good hexen and mixed it with 4-aco-dmt plus tons of weed, beer, and nicotine. What a wonderful day", "1_Text": "Cali is def on the list. I visit family down there and go down for work sometimes. It's dope.", "2_Subreddit": "Stims"}], "dwmgj3c": [{"0_Comment Submission": "Gay dealer offered me an extra teener to hang around his house without a shirt on?", "1_Text": "Sounds like he's just starting the position so no basis to work with. \n\nFor your worry of getting caught with him, both of you should know to say nothing to the cops. Have some lawyers ready to talk to (not that you need to have met them) and have them convey that he simply paid you money to stand around shirtless and not ask questions", "2_Subreddit": "Stims"}], "dwo1qi0": [{"0_Comment Submission": "Got good hexen and mixed it with 4-aco-dmt plus tons of weed, beer, and nicotine. What a wonderful day", "1_Text": "Only when there's an absence of a mix of sleep and/or water and/or food.", "2_Subreddit": "Stims"}], "dwph0q5": [{"0_Comment Submission": "Got good hexen and mixed it with 4-aco-dmt plus tons of weed, beer, and nicotine. What a wonderful day", "1_Text": "Yeah, sure. Honestly, it just sorta built up during the day into doing all that. An old friend of mine was visiting from my old home and he and I went on a lot of (relatively safe) drug benders in college. I don't keep as much stuff on hand anymore so we had to make do with the supplied we had.\n\nI had recently snagged some hexen and re-upped on weed. Alcohol and nicotine are obviously plenty accessible. Already had the 4-aco. My friend had acquired the zalepelon earlier. \n\nTo explain the more obscure substances effects: \n\nEthyl-hexedrone (hexen) is a synthetic cathinone stimulant similar in effect to cocaine. A few of the differences come in the form of longer duration, more causticity on the nose, and some more subtle variations. I'm kinda on the fence as to which I prefer. Hexen is certainly cheaper.\n\n4-aco-dmt is the prodrug to the active ingredient in mushrooms. It's pretty damn impossible to tell the difference between the two on raw dosage other than how quickly stuff hits. Awesome side of it is you can snort it causing it to kick really quick in combination with that ROA having solid bioavailability. Like with all psychs, low doses enhance things quite a bit and full on tripping is its own whole thing. I was somewhere in the middle.\n\nZaleplon is one of the z hypnotics that ostensibly helps you sleep but results in some pretty low-key visuals and a more chilled out yet talkative vibe if you don't go to sleep immediately. It's like a non-evil form of Ambien. Kinda would rather have benzos but oh well.\n\nPretty much all of the substances mentioned were slowly dosed/added on in a way that made sure we were feeling comfortable and not overdoing anything. Started with the hexen since I had just gotten it and wanted to feel it out. Batch I got felt clean for the high and comedown which is a good sign for psychs syngergizing well though I don't really trip much anymore. Weed and moderate alcohol help kinda reign in the psychedelic headspace. The stims made going through lots of beer, weed, and ecig nicotine pretty easy and mixed well with the psych vibes for just chatting with my friend and marathoning video games. \n\nThe Z at the tail end for sleep mellowed things out a touch while making reality feel comfortable and floaty. We pretty much played video games pretty damn late and eventually the sleeping meds made the original post feel like a good idea.\n\nDefinitely not a mix you'll want to do generally. Psychs and amphetamines aren't exactly a common pair and a jacked up balance will land you in a nightmare. However, if you've been around the block and know what you're doing, it's crazy fun. There are actually some psychedelics that are straight up modified amphetamines which let you trip for 16-24 hours (the DoX series). But the mix mentioned let me enjoy tons of focus, cool visuals, some euphoria, extensive but properly limited headspace, and tons of sociability. Made for a pretty fun night though I can think of some things I'd rather be doing than trippy video games as evidenced by me being in this sub.", "2_Subreddit": "Stims"}], "dwq205g": [{"0_Comment Submission": "I'm on hexen. Here's my dick.", "1_Text": "Thought process: this stuff only lasts a couple hours. It'll be a good way to maybe have a productive Monday...\n\n6 hours & a few lines later. Approximately 80% of my time was dedicated to playing the game of: 'damn that felt good, but how awesome can I make this next orgasm?'\n\nI <3 Stims.", "2_Subreddit": "FuckingTweakers"}], "dwq241b": [{"0_Comment Submission": "I love masks♡", "1_Text": "Oh hey, my fear of clowns just got cured.", "2_Subreddit": "FuckingTweakers"}]}], "1_submissions": [{"7xghus": [{"0_Title": "Verification Dick, Vitamins, and minerals...still getting the tightness on this ring figured out.", "1_Text": "Yeah it's only day 1 for me but I haven't gotten a full 8 hours the last couple days so I'm draggin a little bit. Probably gonna say fuck it and sleep some but get up early and get blasted for work.\n\nEdit: 3 hours later...", "2_Subreddit": "FuckingTweakers"}], "83jh9p": [{"0_Title": "Last batch of tweak I got was shit so I'm just on a vyvanse kick. Finished once, time to go out and try to find someone else for more rounds.", "1_Text": "Yeah it's only day 1 for me but I haven't gotten a full 8 hours the last couple days so I'm draggin a little bit. Probably gonna say fuck it and sleep some but get up early and get blasted for work.\n\nEdit: 3 hours later...", "2_Subreddit": "FuckingTweakers"}], "86pdgu": [{"0_Title": "Not stims but picked up some tar and am snorting monkey water. Y'all are some beautiful people.", "1_Text": "Yeah it's only day 1 for me but I haven't gotten a full 8 hours the last couple days so I'm draggin a little bit. Probably gonna say fuck it and sleep some but get up early and get blasted for work.\n\nEdit: 3 hours later...", "2_Subreddit": "FuckingTweakers"}], "877kwt": [{"0_Title": "Grower + Stim Dick = Comical Amounts of Growth", "1_Text": "Yeah it's only day 1 for me but I haven't gotten a full 8 hours the last couple days so I'm draggin a little bit. Probably gonna say fuck it and sleep some but get up early and get blasted for work.\n\nEdit: 3 hours later...", "2_Subreddit": "FuckingTweakers"}], "88q5m3": [{"0_Title": "Got good hexen and mixed it with 4-aco-dmt plus tons of weed, beer, and nicotine. What a wonderful day", "1_Text": "Yeah it's only day 1 for me but I haven't gotten a full 8 hours the last couple days so I'm draggin a little bit. Probably gonna say fuck it and sleep some but get up early and get blasted for work.\n\nEdit: 3 hours later...", "2_Subreddit": "Stims"}], "8968wu": [{"0_Title": "I'm on hexen. Here's my dick.", "1_Text": "Yeah it's only day 1 for me but I haven't gotten a full 8 hours the last couple days so I'm draggin a little bit. Probably gonna say fuck it and sleep some but get up early and get blasted for work.\n\nEdit: 3 hours later...", "2_Subreddit": "FuckingTweakers"}]}]}]}