{"blurryfacedfugue": [{"0_comments": [{"dwtr9yk": [{"0_Comment Submission": "Zach Braff shared this faceswap of himself and Dax Shepard on Twitter", "1_Text": "I concur, my man!", "2_Subreddit": "funny"}], "dwu4406": [{"0_Comment Submission": "hmmm", "1_Text": "Well, what else other than kidneys do we have to filter semen out from our bloodstream?  The liver?  That's too busy filtering the alcohol!!", "2_Subreddit": "hmmm"}], "dwu9nw7": [{"0_Comment Submission": "I don’t like people who take drugs...", "1_Text": "I didn't believe it, but the truth is stranger than fiction.  Wtf, RIP.", "2_Subreddit": "Jokes"}], "dwvbkyw": [{"0_Comment Submission": "Why did all the lithium end up in Chile?", "1_Text": "If you're interested in the kind of toilet where you fill the toilet with water you could wash your hands with, I mostly saw them in Taiwan, Japan, and I think China iirc.  Those two first countries at least are island nations so their space/national resources is really limited, and those are some cool adaptations.  They also have the hot water tank in the bathroom so you turn it on before needing hot water rather than having it always on demand like we do in the US.", "2_Subreddit": "askscience"}], "dwvejlk": [{"0_Comment Submission": "You can become $100,000 richer, catch is you get this money by taking $100 from 1,000 charities. No one would ever know, would you do it, why or why not?", "1_Text": "You shouldn't have kids unless you are 1. in a financial position to do so, and 2. you have a desire to start a family.  Children aren't for everyone, and I can't imagine what someone's parenting experience is like who didn't/couldn't bond with their children.  \n\nPersonally for my wife and I, we waited until we started in our thirties.  We were lucky to finally have our own place then, and we had a little bit of savings (though honestly I'm expecting to work until I physically can't).  And I can't say that I was ready for kids because I don't know how to define it.  But I know from my experience as a child the things I *didn't* want to experience.  I didn't want my kids to experience my wife and I being stressed or fighting about money.  \n\nSomewhere in between a combination of luck, natural progression, and hard work, I'm really glad I had kids.  I actually feel like I matter, *really really* matter.  I take care of myself better, and I find myself trying to be better because I know children emulate what you do, not what you say.  My kids are healthy and I don't get too stressed at their shenanigans.  I'll repeat again that kids aren't for everyone, and I feel so sorry for those kids who have parents that wish they were childless.  But it is (currently) working out and I'm more fulfilled and happy than I've ever been, really.", "2_Subreddit": "AskReddit"}], "dwveu9i": [{"0_Comment Submission": "Why did all the lithium end up in Chile?", "1_Text": "> I used to think it was solar panels that were being used to generate electricity to heat the water, but then found out it's the sun actually heating the water itself.\n\nHmm, that might be the case in Taiwan as well.  Because there tend to be earthquakes, a lot of houses have their own water tanks on top of the roof and they used the sun to heat the water.  I made the assumption it was solar, but maybe it just uses heat from the sun.  Super cool.", "2_Subreddit": "askscience"}], "dwvfc3o": [{"0_Comment Submission": "Need team help.", "1_Text": "I thought the general consensus is that one tank is enough?  Or are Trump & Kim more powerful together on the front line?", "2_Subreddit": "CloneEvo"}], "dwvlh8r": [{"0_Comment Submission": "Why did all the lithium end up in Chile?", "1_Text": "That's true, I should've clarified that point was referring to China, and in some places in Taiwan.  I've noticed that they do just keep the tank on, but I've often seen them in the bathroom.", "2_Subreddit": "askscience"}], "dwvm13e": [{"0_Comment Submission": "I am uncomfortable", "1_Text": "Prehensile nipples.  Wowzers.", "2_Subreddit": "WTF"}], "dwvner7": [{"0_Comment Submission": "After years of doing what i could to get around.... my \"NEW\" Honda Accord.", "1_Text": "Do you guys think that happens is because we knew how to do stuff our parents weren't so good at, like computers and the internet?", "2_Subreddit": "povertyfinance"}], "dwvnjzz": [{"0_Comment Submission": "After years of doing what i could to get around.... my \"NEW\" Honda Accord.", "1_Text": "And then you either get one of those cassette tape adapters or just use male/male audio cable, assuming you have one in your car?", "2_Subreddit": "povertyfinance"}], "dwvou8u": [{"0_Comment Submission": "MIT researchers have developed a computer interface that can transcribe words that the user concentrates on verbalizing, but does not actually speak aloud.", "1_Text": "I doubt it.  I'd be willing to bet that there are a lot of different kinds of brains out there capable of handling all kinds of information differently.  For me, I can see the actual words in my head a lot of the time, and that really helps with spelling.  Images are entirely another matter, though.  I can't rotate an image like some people can, and I have a hard time visualizing too much 3D stuff in my head at a time.  I have trouble with spatial sense so I could see why that makes sense.", "2_Subreddit": "Futurology"}], "dww6b9m": [{"0_Comment Submission": "The Shitty Hotel Starter Pack", "1_Text": "Do you think the kids do that because clothing slows them down, and to reach faster than light speeds you gotta be a naked baby?  At least that's the stage my kids are at...", "2_Subreddit": "starterpacks"}], "dww7b57": [{"0_Comment Submission": "In light of Michigan giving Nestle the okay to extract more Great Lake water, here is a list of their products and brands to help the environmentally conscious shopper!", "1_Text": "They give you that because its what customers expect, and they don't want the customer to be upset.  Just let them know to hold the straw.\n\nSource: work in customer service", "2_Subreddit": "environment"}], "dwwam46": [{"0_Comment Submission": "You can become $100,000 richer, catch is you get this money by taking $100 from 1,000 charities. No one would ever know, would you do it, why or why not?", "1_Text": "As they say, may life throw you a pleasant curve.  Also, good luck on your procedure!!", "2_Subreddit": "AskReddit"}], "dwwhhf2": [{"0_Comment Submission": "Throwback to the time Mexico was the only country that protested the annexation of Austria", "1_Text": "Dude, fuck xenophobic people.", "2_Subreddit": "history"}], "dwwwwe6": [{"0_Comment Submission": "Former Korean president Park Geun-hye gets 24 years in prison", "1_Text": "No way, he has [astonishing excellent](http://www.latimes.com/nation/politics/trailguide/la-na-trailguide-updates-trump-s-doctor-stands-by-astonishingly-1472255624-htmlstory.html) health!", "2_Subreddit": "worldnews"}], "dwwx3by": [{"0_Comment Submission": "Former Korean president Park Geun-hye gets 24 years in prison", "1_Text": "Isn't another issue their government and their commercial/corporate entities are too intertwined?  (eg., Samsung)", "2_Subreddit": "worldnews"}], "dwx0ltt": [{"0_Comment Submission": "Formula 1 driver Kevin Magnussen with an act of pure evil...", "1_Text": "I hate sucker punches.  No honor in it at all.", "2_Subreddit": "gifs"}], "dwxc2s3": [{"0_Comment Submission": "I have never done any opiates. I've been browsing this sub for ~2 hours now.", "1_Text": "> Could it be that I just didn't break past a certain threshold?\n\nIf you're talking about experiencing euphoria, that has gotta be due to several things.  First, the neurochemistry of it all, and the neurotransmitter binding to for example, the mu receptor responsible for some of that euphoria (iirc, its been a while and super rusty).  The other thing to consider then is your own personal relationship to that substance.  For you, it is a stranger.  But for an addict being high is part of their normal.  And they may not even experience euphoria anymore, but just desire being blunted/numb.  Honestly, I feel like a lot of people get into opiates because of depression related issues and to escape from horrible feelings.\n\nSource: was once an addict", "2_Subreddit": "opiates"}], "dwxk58c": [{"0_Comment Submission": "Selfish prick trumpgrets voting for selfish prick.", "1_Text": "Why is that legal?  It seems like its just asking for trouble if all the bots do the same thing.", "2_Subreddit": "Trumpgret"}], "dwy4hjt": [{"0_Comment Submission": "\"Do You Trust This Computer\" is the most important film of 2018, exploring the current state and future of AI on earth, and is free for the next 36 hours. Directed by Chris Paine (director of Who Killed The Electric Car)", "1_Text": "I don't know.  Isn't the website/name of the movie a bit leading?  My first reaction was trust?  By what do they mean?  I mean, there's no general AI yet.  Yes our livelihoods are threatened by AI and automation, but they're going beyond that.  I kept trying to give them an excuse, saying well maybe they need to pull in their audience.  Or maybe their audience knows nothing about AI...no wait that would be worse.  And while I've only watched the trailer and the first five minutes before buffering forever and giving up.  But I had this feeling, and I'm glad to see I wasn't the only one.", "2_Subreddit": "Futurology"}], "dwy4nwz": [{"0_Comment Submission": "\"Do You Trust This Computer\" is the most important film of 2018, exploring the current state and future of AI on earth, and is free for the next 36 hours. Directed by Chris Paine (director of Who Killed The Electric Car)", "1_Text": "Well, it is a true state (someone being spiritual but not religious), just not sure if the speaker is being genuine.  Just think of it this way, our brains are built to have spiritual experiences, the wiring if you will exists in our heads.  And honestly some amount of spiritual experience is good for a person, mental health wise.  /u/codawPS3aa hit the nail on the head perfectly.", "2_Subreddit": "Futurology"}], "dwy4ybu": [{"0_Comment Submission": "\"Do You Trust This Computer\" is the most important film of 2018, exploring the current state and future of AI on earth, and is free for the next 36 hours. Directed by Chris Paine (director of Who Killed The Electric Car)", "1_Text": ">  But they have the process to gain it,\n\nIt sounds like understanding this process, or at the very least emulating it will give us something like general intelligence.  Its just like (from my elementary understanding of neural networks) how we understand the process a simple intelligence gets good at a task, but we still don't have an idea of what is really going on.  Like we understand the individual components, but we don't really know what 'goes through an AI's mind' to be an effective go player, or a safe driver.", "2_Subreddit": "Futurology"}], "dwy529u": [{"0_Comment Submission": "\"Do You Trust This Computer\" is the most important film of 2018, exploring the current state and future of AI on earth, and is free for the next 36 hours. Directed by Chris Paine (director of Who Killed The Electric Car)", "1_Text": "> We might be just as integrated as AI \n\nMy issue though is making it equally available to people, because as it stands right now we have enough resources to provide some kind of living for people, but do not.  And a result is that the wealthy dis proportionally gets this new tech, which adds to the danger of creating a new economy ordinary people aren't able to participate in.", "2_Subreddit": "Futurology"}]}], "1_submissions": [{"67suly": [{"0_Title": "The Rise of the \"\"Alt-Right-Right\"\"", "1_Text": "I concur, my man!", "2_Subreddit": "samsung"}], "67tgj9": [{"0_Title": "It's just you and me tonight (and all you lovely peeps out there)", "1_Text": "I concur, my man!", "2_Subreddit": "PoppyTea"}], "67u1by": [{"0_Title": "Increasing Active Ingredients While Reducing Water", "1_Text": "I concur, my man!", "2_Subreddit": "PoppyTea"}], "67u69i": [{"0_Title": "Thank you everybody!", "1_Text": "I concur, my man!", "2_Subreddit": "dyscalculia"}], "6889ab": [{"0_Title": "Oi, I did it again with the oils :\\", "1_Text": "I concur, my man!", "2_Subreddit": "PoppyTea"}], "68bl96": [{"0_Title": "Comparing Notes (on procedure)", "1_Text": "I concur, my man!", "2_Subreddit": "PoppyTea"}], "68haeb": [{"0_Title": "My Last Samsung Post [help][discussion]", "1_Text": "I concur, my man!", "2_Subreddit": "samsung"}], "68m1wx": [{"0_Title": "Request for Megathread on Reviews", "1_Text": "I concur, my man!", "2_Subreddit": "PoppyTea"}], "6pmjs6": [{"0_Title": "Outdoor Cooking Cleanup", "1_Text": "I concur, my man!", "2_Subreddit": "CampfireCooking"}], "6s7f2k": [{"0_Title": "How did German survivors of Nazi Germany react to losing WWII?", "1_Text": "I concur, my man!", "2_Subreddit": "AskHistorians"}], "6s8e5v": [{"0_Title": "Suggestions for a drink for the toss & shake", "1_Text": "I concur, my man!", "2_Subreddit": "kratom"}], "6sujaa": [{"0_Title": "Why does The_Donald say reddit admins censor them? Is there any truth?", "1_Text": "I concur, my man!", "2_Subreddit": "AskReddit"}], "6z5pnc": [{"0_Title": "Microplastic Filtration", "1_Text": "I concur, my man!", "2_Subreddit": "environment"}], "6zbp4m": [{"0_Title": "A Message to the US from Venezuela", "1_Text": "I concur, my man!", "2_Subreddit": "politics"}], "77gfhh": [{"0_Title": "Rant/Question About State of Psychiatry", "1_Text": "I concur, my man!", "2_Subreddit": "Psychiatry"}], "77gi5h": [{"0_Title": "x/post from Psychiatry- Rant/Question About State of Psychiatry", "1_Text": "I concur, my man!", "2_Subreddit": "healthcare"}], "7xg133": [{"0_Title": "Darwin Lab Clarification", "1_Text": "I concur, my man!", "2_Subreddit": "CloneEvo"}], "7xrf7p": [{"0_Title": "Status Ailments Question", "1_Text": "I concur, my man!", "2_Subreddit": "CloneEvo"}], "7ztxsr": [{"0_Title": "Perfect Clone Event Planning", "1_Text": "I concur, my man!", "2_Subreddit": "CloneEvo"}], "82vtf5": [{"0_Title": "Guild War Slaying Bonus", "1_Text": "I concur, my man!", "2_Subreddit": "CloneEvo"}], "83p3xd": [{"0_Title": "Change Your Team Composition for Dungeon or Guild Wars?", "1_Text": "I concur, my man!", "2_Subreddit": "CloneEvo"}], "84n7m0": [{"0_Title": "Hero Placement", "1_Text": "I concur, my man!", "2_Subreddit": "CloneEvo"}], "858xcc": [{"0_Title": "Power #", "1_Text": "I concur, my man!", "2_Subreddit": "CloneEvo"}], "85dx53": [{"0_Title": "Bounty Chests", "1_Text": "I concur, my man!", "2_Subreddit": "CloneEvo"}], "87quq7": [{"0_Title": "LPT: It is much easier to get used to upgrades than it is to downgrades", "1_Text": "I concur, my man!", "2_Subreddit": "povertyfinance"}]}]}]}