{"MyFortunesFaded": [{"0_comments": [{"djozvuw": [{"0_Comment Submission": "Poppies! Poppies will put them to sleep...sleeeeeep", "1_Text": "Wow this is a great photo thanks for sharing,, maybe not fall asleep in the poppy field or you will wake up with a head ache lol", "2_Subreddit": "opiates"}], "djp0ito": [{"0_Comment Submission": "Successful and Opiate User?", "1_Text": "So I already had a college degree and a decent office job that involves being on a computer every day when I started daily use. I would consider myself successful for being mid twenty something male in the US.. (own a home, car, all bills paid, no excessive credit card debt, no kids, social life and many friends.. etc..) but not as happy as I once was. Chasing the high has become extremely old and my dependency won't let me away.  \n\nUnlike you I just liked to party and get fucked up so I had no real business taking oxy and then dope when the pills ran out, so only myself is to blame. \n\nI do think that it is possible to be successful and achieve your goals but it will be challenging. Make sure you keep yourself a backup stash so you can get well on days you are out and need to work. Maintain a healthy diet. Exercise regularly. Do not isolate yourself from friends and family. Keep your work routine the same (don't start showing up late, leaving early, long lunch breaks).\n\nJust know that it is possible to do, and if you can get a job programming or any type of computer gig you should be able to maintain pretty well.\n\nGood luck I hope you can manage your pain successfully and just know that if you ever feel like the opis are getting out of control that there are people who care and will help. You're not in this alone.", "2_Subreddit": "opiates"}], "djquhm7": [{"0_Comment Submission": "I'm off to detox", "1_Text": "That's awesome man, sounds like you'll be having a dope last night.\n\nProbably shouldn't be sneaky during detox. I always think that getting clean isn't only about not using, but also being honest and considerate. \n\nBut if you like to keister stash then by all means, jam that Kratom in there.\n\nBy the way, do you happen to know the difference between jam and jelly?", "2_Subreddit": "opiates"}], "djqyn5e": [{"0_Comment Submission": "I'm off to detox", "1_Text": "Ahh I see, well in that case I can totally see why you would want to bring that.\n\nJam as in \"Oliver jammed that ball right in the hole.\"\n\nBut the joke is..\n\"hey do u know the diff btwn jam & jelly?\"\n\"no, wtf you talking about?\"\n\"...I can't jelly my dick right up your ass!\"\n\nKinda lame but I just got 2 bricks and a ball so weeeeee, happy and safe night y'all!", "2_Subreddit": "opiates"}], "djrmx6a": [{"0_Comment Submission": "Galaxy Hat Press Settings", "1_Text": "Between 325 and 350 degrees\n15 seconds firm pressure\n\nLet the transfer cool down before you peel it off, if you peel hot it can pick up the edges of the print.\n\nThat should work, good luck!", "2_Subreddit": "SCREENPRINTING"}], "dkcsrrn": [{"0_Comment Submission": "hi, its me, one post then im gone, it gets alot worst for vae", "1_Text": "I'm so sorry for your loss. I've always enjoyed reading your posts man. You are a good guy. Things will get better, just keep pushing man.. you got this. We are all on your side.\n.", "2_Subreddit": "opiates"}], "dkcswgr": [{"0_Comment Submission": "Homeless Heroin addict and all around degenerate does AMA on /r/opiates, fellow junkies give him shit for being a deadbeat dad", "1_Text": "RIP", "2_Subreddit": "Drama"}], "dkolapk": [{"0_Comment Submission": "Now that is a speeeedballl. 8 bag shot + 1/4 g coke", "1_Text": "Wow that's definitely a speeeedballl. Be safe man I enjoy reading your posts here!\n\nI am curious to know how many reddit accounts you have by now. What happens to them? Do you just forget the password and make a new one? Hehe", "2_Subreddit": "opiates"}], "dmc8mgy": [{"0_Comment Submission": "hey guys. i just wanted to introduce the newest addition to my family! 😍 my boyfriends daughter named HIM Bubbles lol..?! (she's 5) so my bf and I decided we will call him Bubz. although i've started calling him Bubzy, bc it's way cuter heheh :)", "1_Text": "Is he a tuxedo style? I adopted two tuxedo brothers from the shelter and they are literally the greatest. Congrats!", "2_Subreddit": "opiates"}], "dmh812o": [{"0_Comment Submission": "Frank is an old guy and is missing more than a few teeth and often ends up with a blep", "1_Text": "Wow this just made my day thank you. Frank is such a good boy", "2_Subreddit": "Blep"}], "dod1n7s": [{"0_Comment Submission": "Today is Saturday, October 14th. Do you want to water the plant today?", "1_Text": "No", "2_Subreddit": "takecareofmyplant"}], "dod1t63": [{"0_Comment Submission": "The download code card that I got with a record I bought had wildflower seeds imbedded in it. If you plant it, they will actually grow!", "1_Text": "Today I fell in love with a plant named Jeff", "2_Subreddit": "mildlyinteresting"}], "dp1q6na": [{"0_Comment Submission": "What's better than dope? Eating like a king AND dope😍 (I'm a big fan of fruit, and you all should be too.) P.S.: nothing helps withdrawals quite as much as eating fresh fruit as soon as you can keep it down. P.P.S.: ain't nobody tryna fuck wit scurvy, mate", "1_Text": "Wow those are literally ALL of my fav. fruits right there. \nBlackberries, strawberries, raspberries, and blueberries. If only that was a pepperoni style lunchable it would be 10/10. \n\nHey man nice shot, what a good shot man.", "2_Subreddit": "opiates"}], "dp2m370": [{"0_Comment Submission": "Loaded a bunch of emulators and ROMs on my phone", "1_Text": "Nice that's pretty cool. I'm surprised a phone is able to run N64 emu/roms. What phone do you have?\n\nI used to do that stuff on my phone too.. had the Pokémon gameboy games.. my phone would get so hot it was crazy. \n\nAnyways these days I've moved onto raspberry pi 3, running Retro Pie. It's an Ubuntu based operating system (Linux) that makes running multiple emulators super simple. Now I have almost every game for all the classic systems, NES, SNES, All Gameboy except 2/3 DS, Sega Genesis, PlayStation, and SOME N64 games work. \n\nDefinitely check it out if you're into that kinda stuff, so much fun.. I'm about to go play some Gunstar Heroes on Sega or maybe CTR on PlayStation.\n\nThere's tons of options out there now for emulators if you ever move past the phone setup.", "2_Subreddit": "opiates"}], "dp2m5rc": [{"0_Comment Submission": "Loaded a bunch of emulators and ROMs on my phone", "1_Text": "LOL I just posted about Retro Pie hahah didn't even see you posted this! I'm sure there are so many of us it would be legit", "2_Subreddit": "opiates"}], "dp4gdng": [{"0_Comment Submission": "Eric Erlandson of the band Hole talks about Hole, Kurt Cobain and Courtney Love \"deep down inside courtney is a sweet little kitten\" (from 2012 but interesting read that i just dug up)", "1_Text": "Hmmm this isn't about Hole or Kurt", "2_Subreddit": "opiates"}], "dp8644h": [{"0_Comment Submission": "Advice on klonopin + vicodin?", "1_Text": "I wouldn't man... low tolerance plus what you described might just put you to bed. If you do decide to, remember less is more. You can always add more, but once you ingest it, you can't go back. Also consider having someone sober/not as fucked up to be there with you.", "2_Subreddit": "opiates"}], "dp872v4": [{"0_Comment Submission": "Advice on klonopin + vicodin?", "1_Text": "Right he would be fine, but he'll probably fall asleep though and waste it? Just an opinion", "2_Subreddit": "opiates"}], "dpbhe8w": [{"0_Comment Submission": "Advice on klonopin + vicodin?", "1_Text": "Ahh sorry didn't mean to assume your gender!", "2_Subreddit": "opiates"}], "dqurofn": [{"0_Comment Submission": "I might die in a fire today.", "1_Text": "Good luck I hope you all make the right decision and get out of there!!", "2_Subreddit": "opiates"}], "dwnps5b": [{"0_Comment Submission": "Happy April Fool's, guys.", "1_Text": "Wow was just telling my friend about the new changes.. whipped out my phone to show the AutoMod. msg... and damn... got me good.. right in front of my homie...", "2_Subreddit": "opiates"}], "dwnpvzg": [{"0_Comment Submission": "How to tell my dealer I'm pregnant?", "1_Text": "100% April fools joke... come on people wake up", "2_Subreddit": "opiates"}]}], "1_submissions": [{}]}]}