{"Bbbianca24": [{"0_comments": [{"dv1e0z3": [{"0_Comment Submission": "That IV rush tho", "1_Text": "Yeah no never. I think that would, like, pickle my brain and leave me completely beyond help. And yeah, it’s nothing that you’re missing out on, I never go for the pukey feeling now. Fuck that noise.", "2_Subreddit": "Stims"}], "dvae7ai": [{"0_Comment Submission": "What is your “Oh shit, I’m an asshole.” moment?", "1_Text": "When I was strung out on heroin I sold all of my dead mothers gold jewelry that was left to me, piece by piece until there was nothing. I also stole power tools from my dads house, which he probably paid about a thousand dollars for altogether. I got $30. Yup,", "2_Subreddit": "AskReddit"}], "dvaebzt": [{"0_Comment Submission": "I haven't went long without heroin for the past 8 years. This day going forward, I will never do heroin again.", "1_Text": "If you want it you will get it.", "2_Subreddit": "Drugs"}], "dvb8cfr": [{"0_Comment Submission": "I forgot what the first year of meth high felt like?", "1_Text": "Yeah just eat it, you won’t be disappointed. The come up is slower but after about 20minutes you will be good. I’m telling ya, take whatever amount you would normally do in one line, and double it, just throw it back with water if you’re lazy like me, or you can parachute it and yes that’s fine, or put it in a capsule (you can find these at health food stores) and you got yourself a little meff pill to chase with some water. Easy peasy. Double your usual dose, in the morning or whatever. You will be zooted and should be straight for at least a few hours. It lasts a long time, if you eat a lot you can get real fucked up, and find a happy medium, it’s a real upbeat, productive high. Like back in the day before we needed it just to get the fuck out of bed, geeked the fuck up off one pussy line and ready to take on the world high. Remember that? Yeah, I have a hard time remembering too. Tolerance sucks big old man saggy balls.", "2_Subreddit": "Stims"}], "dvb8glq": [{"0_Comment Submission": "First time on speed feeling pretty buzzed", "1_Text": "Lol", "2_Subreddit": "Stims"}], "dvb8pxb": [{"0_Comment Submission": "How do you know you’re tweakin’...or just high?", "1_Text": "Don’t pick up a benzo habit because of your stim use. That’s a road that you want to avoid like the plague. Happens real quick with regular benzo use, I’m talking as little as 2 weeks sometimes. And of course, you also do not want to pick up an opiate habit if you haven’t yet. They both will only make it hell on earth that day when for whatever reason, you find yourself unable to take any of it. Benzo withdrawal....scares me more than heroin withdrawal. Mentally, yeah never again no thanks", "2_Subreddit": "Stims"}], "dvb8wpd": [{"0_Comment Submission": "When you’re Stuck and partially nude, and you can’t for the life of you remember what it was you l had meant to do...", "1_Text": "I don’t have a dick, but I can still totally feel where you’re coming from on that. This happened to me too, I actually kinda loved that feeling. I know it would be great to experience this whilst chocking my own chicken, jerkin my big old donger off. Sadly, I will never know. But I don’t do heroin anymore, plus no dick, so fuck it. Now I want some dick though. Indeed...", "2_Subreddit": "Stims"}], "dvbv8zp": [{"0_Comment Submission": "How do you know you’re tweakin’...or just high?", "1_Text": "Yeah I did it one time when I was like 18. had no idea what was going on, Dad was giving me Ativan I got prescribe because My mother had just passed away and I was kinda fucked up over it. But he knew I already was partial to getting fucked up on alcohol and drugs of some sort, so he kept the script and gave it to me twice day, like prescribed, for 2 weeks. Then I had to go back over to college, without any Ativan, and I had no idea what was going on later that night when the impending doom set in. That was my first experience withdrawing on anything and the only time it wasn’t my own doing really haha", "2_Subreddit": "Stims"}], "dvcf1qg": [{"0_Comment Submission": "How do you know you’re tweakin’...or just high?", "1_Text": "Oh yeah I believe it. Yikes. Yeah fuck that noise I will occasionally pop a benzo or two but that’s it. Luckily for me it’s the one High I don’t seem to like TOO much haha. That and alcohol. Which happen to be the two substances in which withdrawal can kill you.  I wanted to die when that happened so I believe it! Seroquil for sleep is an option, and sleep is what you need to really prevent acting like a twacked out mothafucka. It worked for me better than anything else it trumps the fuck outta meff 9/10, 😴", "2_Subreddit": "Stims"}], "dvh2kqy": [{"0_Comment Submission": "If pulled over by cops, what is your plan of action?", "1_Text": "Literally, this sounds very bad I’m sure but it depends what I may or may not be on. I never have gotten pulled over while geeked up...and my god I hope I never do. But I have had mostly pleasant experiences with this the couple times since my DUI in 2013, That one was not so pleasant and I was young, kinda retarded, irresponsible and belligerent. But oddly enough this all got a lot better after that, I lost the taste for booze and don’t drink like, at all. Now I just do drugs. \n\nMostly, I find with the po-lice, haha, smiling a lot and using my somewhat high pitched, innocent sounds voice works to my advantage as well. I don’t come off as a degenerate/someone who has dope in her bra. And I don’t go around doing shit that attracts much attention from the cops and I don’t fuck with the tweaked scene around here because those morons get themselves arrested for dumb shit constantly. No thanks. I never let any of the people I use with bring random friends I don’t know along in my whip. Cause if one of those motherfuckers has warrants and who knows how many felonies on them, I don’t want to end up having to share it with them when we get pulled over. Used to have a friend that carried a briefcase sized lock box everywhere finally I realized “there’s probably a good 25-40 year sentence in my fucking backseat”. I’m not going down for that, really just dont with dumb motherfuckers, too high, really shouldn’t drive high/drunk at all,  drive responsibly and ideally, have all your shit legal, don’t drive people around while they go hit a lick, make runs, steal their friends TV again, etc.  Also, be polite, it usually goes a long way unless the cop is a bitch or you got caught playing with your dong on playground or something actually fucked up like that haha. If you are drunk and telling them to fuck themselves, it seems to give them a poor attitude as well.", "2_Subreddit": "Stims"}], "dvhu4tc": [{"0_Comment Submission": "If pulled over by cops, what is your plan of action?", "1_Text": "Thanks! Haha and yes, stims/meff just made my already dwindling taste for booze basically die. Even when I’m not on anything else now, sober, drinking is just gross to me. It makes me feel like dog shit.", "2_Subreddit": "Stims"}], "dvi1veo": [{"0_Comment Submission": "Want to switch ROA", "1_Text": "It’s great and lasts longer, highly suggest.", "2_Subreddit": "Stims"}], "dvi4t5s": [{"0_Comment Submission": "Want to switch ROA", "1_Text": "Well first time take what you would put in a line, and double it. I always think that’s a good starting point, people always seem to be happy with that. Then wait good 20-30 minutes and you should be feeling good. It’s a slow cone up, but once it’s hits, it hits ya know.", "2_Subreddit": "Stims"}], "dviei8l": [{"0_Comment Submission": "Want to switch ROA", "1_Text": "Hot rails are easier on your nose and get you  fucked up, btw.", "2_Subreddit": "Stims"}], "dviq2m0": [{"0_Comment Submission": "Locked out of my house?!?!", "1_Text": "Lol lol lol there ya go. I was gonna suggest hitting up Walmart for some good old fashioned 3am retail fraud, maybe home invasion/larceny in a building type thing on the next street over or so, and roaming the streets rummaging through dumpsters at this hour is a good way to kinda dip your toes into the waters if this sort of thing is a little new to you. I’m more of a get High and bang/clean house/color/etc, avoid handcuffs type of person but I know lots of people enjoy a more *exciting meff lifestyle. So I hope any of these suggestions spark your interest, especially the ones I am too much of a pussy to do. Because it is fun to laugh when other people do these things. Turn on the news, “look another dumb tweaker getting caught on some crazy twacked out dumbass shit” as I do up a shot. Maybe I’m an awful person for this?", "2_Subreddit": "Stims"}], "dvmbewa": [{"0_Comment Submission": "Don’t open this unless you are ready for some deep stuff.", "1_Text": "This", "2_Subreddit": "Stims"}], "dvmbsh0": [{"0_Comment Submission": "Mixing clonazepam?", "1_Text": "Booze, hell no. Opiates,  no.", "2_Subreddit": "Drugs"}], "dvnw2tg": [{"0_Comment Submission": "Wtf. Who knows their shit cause this oily meff is freaking me out. Smells strong and I hope it’s not Fucking raidddd.", "1_Text": "Yeah it’s dried out I just left the bag open but idk. I have never got shit that wet it’s weird and I don’t think it seems very good...", "2_Subreddit": "Stims"}], "dvofjv6": [{"0_Comment Submission": "Wtf. Who knows their shit cause this oily meff is freaking me out. Smells strong and I hope it’s not Fucking raidddd.", "1_Text": "Cooking spray like motherfucking Pam that you spray in the pan to grease it? Ah....better than raid I guess. I have heard they do that here but never actually had any meff w/ Fucking raid. When I came across this shit I have now, it’s oily and smells strongly in a certain way I have never seen before in all the many many many sacks of meff that I have come across. I wouldn’t even consider putting something THAT foul in my body, as if good old fashioned meff without the raid isn’t bad enough already. Yikes. \n\nI don’t smoke my shit and really don’t know jack diddly about all the fancy science shit a lot of y’all do haha", "2_Subreddit": "Stims"}], "dvoflm1": [{"0_Comment Submission": "Wtf. Who knows their shit cause this oily meff is freaking me out. Smells strong and I hope it’s not Fucking raidddd.", "1_Text": "See this I am confused by. Freebase? Isn’t that done with coke, like fancy crack? I have no idea what most of that means but I wish I did.", "2_Subreddit": "Stims"}], "dvog4m1": [{"0_Comment Submission": "Wtf. Who knows their shit cause this oily meff is freaking me out. Smells strong and I hope it’s not Fucking raidddd.", "1_Text": "I didn’t cook it! lol I bought it", "2_Subreddit": "Stims"}], "dw16pz0": [{"0_Comment Submission": "Has daily wellbutrin given me high blood pressure?", "1_Text": "It gave me seizures. It is a stimulate of some sort I believe so, it’s possible.", "2_Subreddit": "Stims"}], "dwfvqss": [{"0_Comment Submission": "Opinon on opiates", "1_Text": "I love heroin so much I had to quit because it will surely kill me.", "2_Subreddit": "Stims"}], "dwfw2sy": [{"0_Comment Submission": "Meth fingertips", "1_Text": "😲....😂", "2_Subreddit": "meth"}], "dwwin9n": [{"0_Comment Submission": "Learned this the hard way", "1_Text": "Lol this is a good one. I laughed to myself. Then I thought about what my version would say. Annnnnd wow.....I need to re-evaluate my life haha.", "2_Subreddit": "opiates"}]}], "1_submissions": [{"7gtzxb": [{"0_Title": "Heroin captured so well in a comic strip...who knew.", "1_Text": "Yeah no never. I think that would, like, pickle my brain and leave me completely beyond help. And yeah, it’s nothing that you’re missing out on, I never go for the pukey feeling now. Fuck that noise.", "2_Subreddit": "opiates"}], "7gvop4": [{"0_Title": "Ideas for ways to use your finished pages, instead of just leaving them in the book?", "1_Text": "Yeah no never. I think that would, like, pickle my brain and leave me completely beyond help. And yeah, it’s nothing that you’re missing out on, I never go for the pukey feeling now. Fuck that noise.", "2_Subreddit": "Coloring"}], "7kqyze": [{"0_Title": "What’s your hustle?", "1_Text": "Yeah no never. I think that would, like, pickle my brain and leave me completely beyond help. And yeah, it’s nothing that you’re missing out on, I never go for the pukey feeling now. Fuck that noise.", "2_Subreddit": "opiates"}], "7mruhw": [{"0_Title": "Winter sucks and I’m sooo fucking bored this shit doesn’t even help anymore. Blah. Fucking. Blah.", "1_Text": "Yeah no never. I think that would, like, pickle my brain and leave me completely beyond help. And yeah, it’s nothing that you’re missing out on, I never go for the pukey feeling now. Fuck that noise.", "2_Subreddit": "Stims"}], "7sstkd": [{"0_Title": "My friend ODed on heroin in my car tonight and I used the Narcan kit I luckily keep in my car “just in case”. It was so scary, but he made it.This was moments after I mentioned where it was located.I had not used in months, just in case he needed to use on me. Harsh reminder of why I got clean,AMA.", "1_Text": "Yeah no never. I think that would, like, pickle my brain and leave me completely beyond help. And yeah, it’s nothing that you’re missing out on, I never go for the pukey feeling now. Fuck that noise.", "2_Subreddit": "casualiama"}], "80as8d": [{"0_Title": "So if you put a rig inside your jacket pocket (any pocket), make sure there are no holes on the inside of that pocket.....", "1_Text": "Yeah no never. I think that would, like, pickle my brain and leave me completely beyond help. And yeah, it’s nothing that you’re missing out on, I never go for the pukey feeling now. Fuck that noise.", "2_Subreddit": "opiates"}], "8486mt": [{"0_Title": "Wtf. Who knows their shit cause this oily meff is freaking me out. Smells strong and I hope it’s not Fucking raidddd.", "1_Text": "Yeah no never. I think that would, like, pickle my brain and leave me completely beyond help. And yeah, it’s nothing that you’re missing out on, I never go for the pukey feeling now. Fuck that noise.", "2_Subreddit": "Stims"}], "859n6b": [{"0_Title": "I don’t think I can ever live and be loved as a normal person and I can’t keep living this way either. I feel more alone than I ever have. I wish I had the courage to end it or be something better than whatever this thing is. I think if I did, I would have gotten better by now. This isn’t living.", "1_Text": "Yeah no never. I think that would, like, pickle my brain and leave me completely beyond help. And yeah, it’s nothing that you’re missing out on, I never go for the pukey feeling now. Fuck that noise.", "2_Subreddit": "recovery"}]}]}]}