{"Fearzebu": [{"0_comments": [{"dvd8434": [{"0_Comment Submission": "When toss and wash fails and you have to improvise. #Beatsbeingsick Kratom is a godsend, those who have suffered through withdrawals but never tried this wonderfully effective and amazingly disgusting plant are in for a surprise", "1_Text": "Firstly, I don’t want to 56 pills an hour, and second, I don’t have capsules. I do however have a wide throat and can swallow a much larger amount in fruit roll up form than the largest capsule sold at my local supermarket, and fruit roll ups serve the alternate purpose of being delicious without any kratom, while I won’t just eat 00 capsules for fun", "2_Subreddit": "opiates"}], "dvd8mjo": [{"0_Comment Submission": "When toss and wash fails and you have to improvise. #Beatsbeingsick Kratom is a godsend, those who have suffered through withdrawals but never tried this wonderfully effective and amazingly disgusting plant are in for a surprise", "1_Text": "Yeah I had a 35 straight successful toss and wash streak...until I didn’t. And .8x30...24 grams in 10-15 minutes?? What kind of shit kratom were you on bro", "2_Subreddit": "opiates"}], "dvd98sb": [{"0_Comment Submission": "When toss and wash fails and you have to improvise. #Beatsbeingsick Kratom is a godsend, those who have suffered through withdrawals but never tried this wonderfully effective and amazingly disgusting plant are in for a surprise", "1_Text": "Oh haha that makes more sense. What a load of work though", "2_Subreddit": "opiates"}], "dvsf92j": [{"0_Comment Submission": "cold copping story", "1_Text": "That was actually brilliant writing man, keep it up we want more stories! Can for sure tell that you’ve been in the game awhile, always thinking first “how’s this dude tryna rip me off...” lol. For real drop some more stories around here though, don’t forget us", "2_Subreddit": "opiates"}], "dvsppw3": [{"0_Comment Submission": "Is Bernie a real socialist? He has three houses and is pretty rich? Which raises a bigger question: can \"rich\" people, whatever that means, be helpful in a revolution? Can they be part of the team in the end?", "1_Text": "All of the conductors and stationmasters on the underground were white and benefited economically from slavery, yet were essential to and definitely on the right side of the struggle. I would equate that to being reasonably wealthy today, whereas owning slaves themselves would be more along the lines of owning a company yourself and not paying your workers well in an attempt to directly benefit from exploitation. There’s nothing wrong with accepting those in positions of economic power to join the fight for freedom and equality, in fact I would say it’s far better for us to do so in the long run and worry about them later on", "2_Subreddit": "Socialism_101"}], "dvstd3z": [{"0_Comment Submission": "Do I change gyms?", "1_Text": "For the price I’d certainly stay, but make sure to discretely bring this issue up with your coach. Having to be away from the gym to progress on a personal level in order to further teach his students is necessary, but he shouldn’t have a shit backup instructor if he wants to keep his students involved", "2_Subreddit": "bjj"}], "dvye6gm": [{"0_Comment Submission": "Convenient things have inconvenient prices.", "1_Text": "It’s certainly possible, not that I think the impoverished are being helped out *too much-* quite the opposite. But while it really isn’t all thaaat difficult for people of simple and basic tastes to live on easily less than $100 monthly (I eat mostly ramen) that doesn’t mean we should be issuing such a low maximum amount of fiscal aid to the poor that it’s almost like issuing a challenge to even survive, which takes a lot of forethought and severely limits one’s options. We easily have the money to literally double or at least substantially increase our social safety net programs, and choose not to with many politicians claiming budget deficit while our it would be more than possible by simply shaving off a mere 1%+< our annual military budget. Regardless, it isn’t like you can very easily spend your food stamp cards on meth or anything of the sort, they’re worth far more when purchasing allowed items anyway and it’s pretty obviously more efficient to just spend them on food for your family directly. I’m certain that the majority of us could hardly stand even using foodstamps at stores, yet we focus so much on regulating exactly how much financial assistance we supply to our rapidly growing population of impoverished citizens. Our priorities are completely fucked when you realize we’re, say, spending hundreds of millions annually to combat harmless drug use like weed while other nations are regulating and taxing the hell out of it while turning around and investing that money right back into public healthcare and other social programs, or education, which allows a larger percentage of the population to pursue better paying jobs which in turn results in this growing educated percentage of the population paying more in tax dollars and subsequently providing our government with even more tax revenue etc, not to mention competing with the workforce of other nations a lot more effectively. Yet our current administration is focused on what, again, right now? Trying to build a giant wall? What a fantastic plan...that’ll *surely* help our deficit 🙄 I’m progressively losing faith in the intelligence of our population and the republic that governs over it.", "2_Subreddit": "quityourbullshit"}], "dvygn4g": [{"0_Comment Submission": "Convenient things have inconvenient prices.", "1_Text": "Are you sure about your figures? I’ll come right out and say I’ve not researched it whatsoever and I’ll take your word for it but personally I’ve always heart that our total military spending is closer to $800billion than $600 nowadays, and amounts to something close to 40% of our entire budget. I’ve heard that the food and agricultural spending is a infinitesimally minuscule fraction by comparison and within that small sliver resides the food stamp program that conservatives blame in large part for our budget deficit, which even if my numbers are WAY off there’s still no way that what we spend on foodstamps amounts to anything truly substantial in the grand scheme of things. Other, significantly-easier-to-rectify and much larger problems exist, such as our absolutely useless, senseless, and economically idiotic war on drugs when we could mitigate the problem far more effectively through decriminalization, funding rehabilitation, and legally regulating the harmless drugs on the list such as marijuana, which by the was is classified currently as a schedule 1 narcotic in a league with methamphetamine, heroin, and crack cocaine. Even with our current opiate epidemic, oxicodone and other extremely addictive pharmaseusicals are classified  no higher than schedule 2 due to their proven medicinal applicability, as if weed has no medicinal value whatsoever and (even surrendering that point), assumes that it has a high potential to cause serious physical harm, psychological potential for addiction, severe risk of physical dependence, and a significantly high level of lethality, each point being just as patently absurd as the last. Take the money we’re pouring into private prison contracts, judicial fees, and especially law enforcement out of our spending column while simultaneously generating insane margins of tax revenue through the taxation of low risk substances like we’ve already done with alcohol and tobacco, and you’re looking at more than enough money to put all the funding in the world towards proven effective rehabilitation programs, clean needle and naloxone exchanges to curb the rapidly worsening opioid epidemic, and you’ll have plenty left over to expand our public healthcare programs, potentially even resulting in very practical taxpayer funded services like governmentally funded ambulance services as opposed to sticking the poor sick citizens with an $800 bill for a two mile drive, and hell we’d probably have enough money left over to increase teacher pay by a fair amount and better our standard of education to more effectively compete with the rapidly growing educated workforce of a few specific other countries. Even if only half of these suggestions were to pan out, it wouldn’t do anything but benefit society as a whole and improve the quality of life for millions. Yet, for some reason, we’re suffocating government assistance programs for the working class and talking about how tall our wall should be to keep out the immigrants who wouldn’t make enough money working to pay taxes anyway. Neoconservatives are terrified of immigrants coming into our country without documentation for allegedly economic reasons, when in reality they wouldn’t be in a taxable income bracket anyway and would simply reap the financial benefits given to the extremely impoverished, doing nothing but costing us money as opposed to working without documentation, still paying sales tax among other ways of benefiting society as a whole, and working in fields that Americans by and large don’t pursue.\n\nSorry I wrote a book\nTl;Dr: stop talking about a fucking wall, legalize weed, fund rehabilitation that actually works instead of mandatory minimum prison sentences for nonviolent drug offenses, legalize weed completely nationwide and tax the living hell out of it, invest saved money and new tax revenue into social assistance programs, healthcare, higher education, and actually proven effective methods of combating the rapidly growing drug epidemic, and you’ll be amazed at the changes we see in a very relatively short time span. Raising taxes in specific areas while decreasing unnecessary spending is the key to undoing the damage Reagan did to our national debt. Reagan *decreased* taxation on the highest income bracket, losing lots of revenue, increased taxation on lower income groups, squeezing our ever dwindling middle class half to extinction without generating much revenue, minimizing the ability of the average citizen to achieve the now-mythical American Dream that we once held so dear in this “land of opportunity” we all loved, and drastically increased spending on things like our already massive military budget and other such programs that don’t result in a net gain to tax revenue over time, unlike higher education and teacher pay which demonstrably pays for itself and then some when surplus revenue is invested. To undo the damage we’ve allowed to accumulate over the last 40 or so years, we have no choice but to reduce spending and increase taxation on the highest income brackets once again, just like FDR’s famous New Deal programs (you know, the only president who was overwhelmingly re-elected to not two or even three but FOUR terms in office, setting historical records in terms of the popular vote and voter turnout in general? Yeah, that guy, the one the American population absolutely adored and who clearly and demonstrably improved the standard of living in this country and accelerated us further ahead of our international competitors in several different ways? Yeah, like him)\n\nTl;Dr to the Tl;Dr: vote for a progressive who actually has some level of understanding of how important the governmental decisions that his administration could make will affect our nation, economically and socially, as well as the quality of life of every citizen therein. NOT the funny orange clown this time, if you don’t mind. While it was a good laugh, it’s gone on far longer than any joke needs to and is starting to become actually problematic\n\nP.S. Considering the fact that our current military spending dwarfs that of any nation capable of causing us the most remote sort of threat, in fact it is higher than that of the next twelve highest spending countries ALL COMBINED including China, Russia, several major EU nations and India, I think that about a 12% decrease to our annual military spending wouldn’t exactly be the end of the world, and considering the massive beneficial difference that amount of money could make if put towards something more practical, I’m not against a decrease of that magnitude in the least, provided it’s carefully calculated and implemented over some given timespan by those who are better educated on the priorities our military should have regarding it’s budget and which aspects have the most room to lose funding. Plenty of people in positions of power such that they could influence these excellent decisions and take steps necessary to put them into motion choose not to do so for personal financial gain or otherwise some aggregious misscalculation of our nation’s priorities, and such people need desperately to be replaced with those who better understand the biggest economic and social issues facing our country and have the will and ability to begin to change things for the better. Continuing to elect and re-elect establishment democrats and establishment republicans alike will get us absolutely nowhere, and the more time we waste the further we dig ourselves down into this already frighteningly deep economic hole. If we don’t act swiftly, our middle class will evaporate and our working poor will become even less wealthy by the month, opportunities for personal advancement and economic gain will begin to disappear completely and the wealthy elite will gain enough power that these detrimental changes will become nearly irreversible. We’ve already wasted this four year term, we can’t afford to blow many more. Worst case scenario-the United States ceases to exist as we know it today, will cease to be a world superpower either militarily or economically, and will fade into the same background as other once world-powers not unlike the fall of the Roman Empire, but for more easily preventable reasons. Why so many people fail to see the bigger picture of our current political sphere as it stands now continues to baffle me\n\nEdit: Apologies for slight misinformation, as it happens, the highly addictive and obviously dangerous neurotoxic street drug methamphetamine is actually classified as a schedule 2 narcotic, not schedule 1, meaning it allows for at least some amount of limited but effective medicinal properties, as select active ingredients from the methamphetamine family of drugs are occasionally prescribed in extremely small doses for thinks like narcolepsy. Conversely, marijuana is classified as a highly addictive and lethally dangerous narcotic with zero proven medicinal properties and a high potential for abuse. Worse than meth. Yeah, the DEA lists weed, an extremely commonly used recreational substance in maaany states as well as a drug prescribed for everything from glaucoma to fibromyalgia due to its proven effect at treating many such diseases, is listed as being highly dangerous, extremely addictive, and WORSE THAN CRYSTAL METH. But yeah, let’s keep wasting tens o millions of tax dollars by leavig the hundreds of thousands of nonviolent drug offenders to clog our prisons and courtrooms and live entirely off the state unable to work or seek the help they may desperately need. That’s definitely what our country needs, more prisoners who committed such heinous crimes as smoking a joint alone in their own home, for example. Way to go USA", "2_Subreddit": "quityourbullshit"}], "dvzmahk": [{"0_Comment Submission": "Literally every single problem of opiate use stems from it's illegality.", "1_Text": "No amount of decriminalization or regulation can prevent any and every human body from developing a physical dependence when consistently exposed to strong opiates over any significant length of time. Were you being vaguely satirical...? I hope it’s a joke, because by far the most detrimental result of a long term heroin habit (assuming zero possibility of fent cuts and the like, for the sake of argument) is the absolutely unavoidable natural tolerance increase over time paired with the constantly worsening physical dependency that is the core of what makes an opiate habit so excruciatingly difficult to kick. If you’ve somehow spent any amount of time in this game and have been fortunate enough thus far to somehow not even consider the physical and mental withdrawal symptoms as a negative effect of use, then you’re in for a rude awakening when you go broke or decide you’d like to get sober for awhile. I wish you the best of luck if and when you realize just how detrimental a habit like this can be to your overall quality of life. I wish you the best, friend", "2_Subreddit": "opiates"}], "dw6usgi": [{"0_Comment Submission": "Mixing gabapentin, hydrocodone, and dope??", "1_Text": "I’m him and it’s a nonrefillable script of 14 5-325 Norcos, 3250mg of acetaminophen wont hurt me  whatsoever and even if it did would be definitely preferable to staying in pain, stop worrying so much lol", "2_Subreddit": "opiates"}], "dw6uwbz": [{"0_Comment Submission": "Mixing gabapentin, hydrocodone, and dope??", "1_Text": "The hydro is helping to hold me over and even let me get some sleep. Picking up dope as we speak", "2_Subreddit": "opiates"}], "dw6vk4x": [{"0_Comment Submission": "Mixing gabapentin, hydrocodone, and dope??", "1_Text": "It’s sweet that you care so much but I promise I’m fine", "2_Subreddit": "opiates"}], "dw70dq8": [{"0_Comment Submission": "Mixing gabapentin, hydrocodone, and dope??", "1_Text": "What do you mean exactly?", "2_Subreddit": "opiates"}], "dwbuf96": [{"0_Comment Submission": "Two grams. The difference is amazing; what used to look like sticky melted black goup, the smell of which would make normal people want to yak, to us looks like the most shiny delicious “sticky black goup” worth its weight in gold, the smell of which makes me salivate with eager anticipation. 😍😋😋", "1_Text": "Haha true that. Unfortunately, the same is very true with kratom. When you need it, it’s even harder than normal to get down", "2_Subreddit": "opiates"}], "dwddrwm": [{"0_Comment Submission": "Two grams. The difference is amazing; what used to look like sticky melted black goup, the smell of which would make normal people want to yak, to us looks like the most shiny delicious “sticky black goup” worth its weight in gold, the smell of which makes me salivate with eager anticipation. 😍😋😋", "1_Text": "Lmao that’s literally every time, here. Always end up soaking the wrapper to get every last bit", "2_Subreddit": "opiates"}], "dweh94w": [{"0_Comment Submission": "Two grams. The difference is amazing; what used to look like sticky melted black goup, the smell of which would make normal people want to yak, to us looks like the most shiny delicious “sticky black goup” worth its weight in gold, the smell of which makes me salivate with eager anticipation. 😍😋😋", "1_Text": "When I’m just smoking that’s actually a good idea, will try that", "2_Subreddit": "opiates"}], "dwo17p7": [{"0_Comment Submission": "OP is chock-full of bullshit today", "1_Text": "No you need to finish your", "2_Subreddit": "quityourbullshit"}], "dwo18nq": [{"0_Comment Submission": "OP is chock-full of bullshit today", "1_Text": "Even so, without definitive proof of bullshit it isn’t appropriate for the sub. I think I speak for most of us here when I say we generally want true, quality QYBS posts over just a large quantity of suspect material", "2_Subreddit": "quityourbullshit"}], "dwsvbtf": [{"0_Comment Submission": "PDF overtakes Christianity and becomes second most popular religion.", "1_Text": "I just want you to know that your comment was both informative and very funny to me, and that you are appreciated by another anonymous redditor", "2_Subreddit": "atheism"}], "dwufa4o": [{"0_Comment Submission": "adidas Customer Support", "1_Text": "I like good pussy and I like good trees", "2_Subreddit": "facepalm"}], "dwvw3gq": [{"0_Comment Submission": "When toss and wash fails and you have to improvise. #Beatsbeingsick Kratom is a godsend, those who have suffered through withdrawals but never tried this wonderfully effective and amazingly disgusting plant are in for a surprise", "1_Text": "They’re trying to make it a scheduled narcotic like opioids, many legislators and the DEA/FDA are considering making it schedule 2 like oxy and a bunch of other strong opiates. It will be essentially illegal Bc I doubt it will ever be prescribed. It’s completely ridiculous, but pharmaceutical companies definitely have a hand in funding this attack on kratom, anything that has such a strong ability to break one’s dependence on opioids is a threat to their profits. The movement to schedule this plant is full of lies and misinformation, and not enough people are fighting it. If it becomes illegal nationwide and not simply on the state level, they will monitor online sales and criminalize both the vendors and the buyers, but we should have some time before it goes into effect if they ever do succeed in this effort. Personally, I’ll stock up on several kilos of my favorite strains when I get enough cash to do so. I’ll be prepared to weather the storm", "2_Subreddit": "opiates"}], "dwwacdd": [{"0_Comment Submission": "YOU GUYS WANNA KNOW HOW TO MAKE BIG BUCKS LIKE ME? I made this in just one week!!! I hope my dboy takes ones......", "1_Text": "On the opiates sub? Or just in general on all online pics...? The “lol” bit was probably a poor decision by the way, I’ve never cut but I’m certain a lot of people here can relate and it’s really pretty sad. I know you were joking/being sarcastic though but people might take it as sort of rude if you know what I mean. But yeah did you mean just the junkies have those old scars of depression or everyone who posts online? Because I don’t think the latter is at all", "2_Subreddit": "opiates"}], "dwwae4n": [{"0_Comment Submission": "YOU GUYS WANNA KNOW HOW TO MAKE BIG BUCKS LIKE ME? I made this in just one week!!! I hope my dboy takes ones......", "1_Text": "I’m her boyfriend and when she gave me the cash to put in my wallet I immediately rotated the five. It fucked with me head for ages until she finally posted and I was able to fix it😂", "2_Subreddit": "opiates"}], "dwwaqk2": [{"0_Comment Submission": "YOU GUYS WANNA KNOW HOW TO MAKE BIG BUCKS LIKE ME? I made this in just one week!!! I hope my dboy takes ones......", "1_Text": "Lmao. She’s thinking about getting it covered up, but it’s good to take your time and make sure the cover tat is amazing, double cover ups are never a good situation lmao", "2_Subreddit": "opiates"}], "dwxd535": [{"0_Comment Submission": "YOU GUYS WANNA KNOW HOW TO MAKE BIG BUCKS LIKE ME? I made this in just one week!!! I hope my dboy takes ones......", "1_Text": "Thanks for the clarification, I got you homie. A lot of people on this sub (at least of the ones who are active or rehabilitated opiate addicts, not the non-using lurkers or chippers) seem to have a TON of similarities and almost all of us fall into one of just a few categories, all depressed and with some past life trauma or severe emotional pain that is the underlying cause of their use. A lot of non-addicts don’t realize that addicts are all sad people, and aren’t just using drugs to feel great physically or whatever, but to just feel normal, to recapture the desire to be alive, even if only for fleeting moments and for exorbitant amounts of money, and at the cost of being sick most of their life, all accompanied by universal hatred and disgust from the majority of the population, risking imprisonment and felony charges that can ruin their life even if they manage to achieve perpetual sobriety, and even worse risking severe health issues and a very high mortality rate from unprofessionally cut dope with fentanyl, often with hotspots, and with narcan continuously made difficult to obtain not to mention illegal in many areas, and even EMT’s and medical professionals who have sworn to save lives aren’t required to administer narcan like they are CPR and the use of defibrillators and epi pens etc", "2_Subreddit": "opiates"}]}], "1_submissions": [{"6hkztp": [{"0_Title": "How many commies we got up in here?? If you're a lefty like me comment **☭☭Stalin did nothing wrong☭☭** let's see if we've got the numbers to collectivize our dope and seize the means of heroin production, opi comrades! Down with the dope price hikes and Junkie exploitation!", "1_Text": "Firstly, I don’t want to 56 pills an hour, and second, I don’t have capsules. I do however have a wide throat and can swallow a much larger amount in fruit roll up form than the largest capsule sold at my local supermarket, and fruit roll ups serve the alternate purpose of being delicious without any kratom, while I won’t just eat 00 capsules for fun", "2_Subreddit": "opiates"}], "6j6ai5": [{"0_Title": "Anyone else dining like royalty tonight? Our peace may be fleeting but the beauty of it cannot be questioned. We know our pain to always return, but in that momentary silence, we are all truly free💔💉❤️ and freedom tastes so sweet with extra cheese...", "1_Text": "Firstly, I don’t want to 56 pills an hour, and second, I don’t have capsules. I do however have a wide throat and can swallow a much larger amount in fruit roll up form than the largest capsule sold at my local supermarket, and fruit roll ups serve the alternate purpose of being delicious without any kratom, while I won’t just eat 00 capsules for fun", "2_Subreddit": "opiates"}], "6o6xbb": [{"0_Title": "Jiu jitsu saved me from serious injury today.", "1_Text": "Firstly, I don’t want to 56 pills an hour, and second, I don’t have capsules. I do however have a wide throat and can swallow a much larger amount in fruit roll up form than the largest capsule sold at my local supermarket, and fruit roll ups serve the alternate purpose of being delicious without any kratom, while I won’t just eat 00 capsules for fun", "2_Subreddit": "bjj"}], "6wmvma": [{"0_Title": "Why is it that around this time of year we get the most wannabe junkies in this sub? Since when did pretending to be a drug addict make you seem cool...?", "1_Text": "Firstly, I don’t want to 56 pills an hour, and second, I don’t have capsules. I do however have a wide throat and can swallow a much larger amount in fruit roll up form than the largest capsule sold at my local supermarket, and fruit roll ups serve the alternate purpose of being delicious without any kratom, while I won’t just eat 00 capsules for fun", "2_Subreddit": "opiates"}], "73wruq": [{"0_Title": "What is the red thingy on our alien mascot?", "1_Text": "Firstly, I don’t want to 56 pills an hour, and second, I don’t have capsules. I do however have a wide throat and can swallow a much larger amount in fruit roll up form than the largest capsule sold at my local supermarket, and fruit roll ups serve the alternate purpose of being delicious without any kratom, while I won’t just eat 00 capsules for fun", "2_Subreddit": "opiates"}], "74ie7k": [{"0_Title": "Finished reading Dumbledore's Army and the Year of Darkness", "1_Text": "Firstly, I don’t want to 56 pills an hour, and second, I don’t have capsules. I do however have a wide throat and can swallow a much larger amount in fruit roll up form than the largest capsule sold at my local supermarket, and fruit roll ups serve the alternate purpose of being delicious without any kratom, while I won’t just eat 00 capsules for fun", "2_Subreddit": "harrypotter"}], "74wyzn": [{"0_Title": "Shinier than my PS3, blacker than my homeboy ODB", "1_Text": "Firstly, I don’t want to 56 pills an hour, and second, I don’t have capsules. I do however have a wide throat and can swallow a much larger amount in fruit roll up form than the largest capsule sold at my local supermarket, and fruit roll ups serve the alternate purpose of being delicious without any kratom, while I won’t just eat 00 capsules for fun", "2_Subreddit": "opiates"}], "75chqk": [{"0_Title": "Anyone else keep rigs behind their ear?", "1_Text": "Firstly, I don’t want to 56 pills an hour, and second, I don’t have capsules. I do however have a wide throat and can swallow a much larger amount in fruit roll up form than the largest capsule sold at my local supermarket, and fruit roll ups serve the alternate purpose of being delicious without any kratom, while I won’t just eat 00 capsules for fun", "2_Subreddit": "opiates"}], "75mzgl": [{"0_Title": "It's a fugly trend", "1_Text": "Firstly, I don’t want to 56 pills an hour, and second, I don’t have capsules. I do however have a wide throat and can swallow a much larger amount in fruit roll up form than the largest capsule sold at my local supermarket, and fruit roll ups serve the alternate purpose of being delicious without any kratom, while I won’t just eat 00 capsules for fun", "2_Subreddit": "iamverybadass"}], "76n23v": [{"0_Title": "Which kratom strain is best for withdrawals?", "1_Text": "Firstly, I don’t want to 56 pills an hour, and second, I don’t have capsules. I do however have a wide throat and can swallow a much larger amount in fruit roll up form than the largest capsule sold at my local supermarket, and fruit roll ups serve the alternate purpose of being delicious without any kratom, while I won’t just eat 00 capsules for fun", "2_Subreddit": "opiates"}], "76t84d": [{"0_Title": "Who here has quit smoking?", "1_Text": "Firstly, I don’t want to 56 pills an hour, and second, I don’t have capsules. I do however have a wide throat and can swallow a much larger amount in fruit roll up form than the largest capsule sold at my local supermarket, and fruit roll ups serve the alternate purpose of being delicious without any kratom, while I won’t just eat 00 capsules for fun", "2_Subreddit": "opiates"}], "798u1j": [{"0_Title": "IV users, how often do you shoot up?", "1_Text": "Firstly, I don’t want to 56 pills an hour, and second, I don’t have capsules. I do however have a wide throat and can swallow a much larger amount in fruit roll up form than the largest capsule sold at my local supermarket, and fruit roll ups serve the alternate purpose of being delicious without any kratom, while I won’t just eat 00 capsules for fun", "2_Subreddit": "opiates"}], "79f4yf": [{"0_Title": "What's better than dope? Eating like a king AND dope😍 (I'm a big fan of fruit, and you all should be too.) P.S.: nothing helps withdrawals quite as much as eating fresh fruit as soon as you can keep it down. P.P.S.: ain't nobody tryna fuck wit scurvy, mate", "1_Text": "Firstly, I don’t want to 56 pills an hour, and second, I don’t have capsules. I do however have a wide throat and can swallow a much larger amount in fruit roll up form than the largest capsule sold at my local supermarket, and fruit roll ups serve the alternate purpose of being delicious without any kratom, while I won’t just eat 00 capsules for fun", "2_Subreddit": "opiates"}], "7bvavy": [{"0_Title": "Have we become so popular and edgy that people want to lie to pretend to be like us...? Is it the new cool thing to be a recovering addict? Jesus Christ", "1_Text": "Firstly, I don’t want to 56 pills an hour, and second, I don’t have capsules. I do however have a wide throat and can swallow a much larger amount in fruit roll up form than the largest capsule sold at my local supermarket, and fruit roll ups serve the alternate purpose of being delicious without any kratom, while I won’t just eat 00 capsules for fun", "2_Subreddit": "opiates"}], "7cai4c": [{"0_Title": "Finally noticed my first “nodding hole” in my favorite OKC Thunder blanket. They told me dope would cost me money, my job, my family and friends, my freedom, my quality of life, my sanity, and my hope for happiness; but they never told me about THIS. This is some horseshit right here😡", "1_Text": "Firstly, I don’t want to 56 pills an hour, and second, I don’t have capsules. I do however have a wide throat and can swallow a much larger amount in fruit roll up form than the largest capsule sold at my local supermarket, and fruit roll ups serve the alternate purpose of being delicious without any kratom, while I won’t just eat 00 capsules for fun", "2_Subreddit": "opiates"}], "7n4emy": [{"0_Title": "Gonna be a good night, folks😎 who else is having a blast tonight, or is sick/sober and wishes they were feeling good? Share your nights guys, I’ve been gone awhile. How’re you all doing???", "1_Text": "Firstly, I don’t want to 56 pills an hour, and second, I don’t have capsules. I do however have a wide throat and can swallow a much larger amount in fruit roll up form than the largest capsule sold at my local supermarket, and fruit roll ups serve the alternate purpose of being delicious without any kratom, while I won’t just eat 00 capsules for fun", "2_Subreddit": "opiates"}], "7pzgvv": [{"0_Title": "Anyone remember that Allison Medical free-rig promo?? They finally came, months later!! Keep an eye on your mail boys and girls, it wasn’t a hoax after all!", "1_Text": "Firstly, I don’t want to 56 pills an hour, and second, I don’t have capsules. I do however have a wide throat and can swallow a much larger amount in fruit roll up form than the largest capsule sold at my local supermarket, and fruit roll ups serve the alternate purpose of being delicious without any kratom, while I won’t just eat 00 capsules for fun", "2_Subreddit": "opiates"}], "7t1754": [{"0_Title": "Hydrocodone for heroin withdrawal?", "1_Text": "Firstly, I don’t want to 56 pills an hour, and second, I don’t have capsules. I do however have a wide throat and can swallow a much larger amount in fruit roll up form than the largest capsule sold at my local supermarket, and fruit roll ups serve the alternate purpose of being delicious without any kratom, while I won’t just eat 00 capsules for fun", "2_Subreddit": "opiates"}], "7uk7uj": [{"0_Title": "Super basic question, since I can’t seem to find a bioavailability chart anywhere.", "1_Text": "Firstly, I don’t want to 56 pills an hour, and second, I don’t have capsules. I do however have a wide throat and can swallow a much larger amount in fruit roll up form than the largest capsule sold at my local supermarket, and fruit roll ups serve the alternate purpose of being delicious without any kratom, while I won’t just eat 00 capsules for fun", "2_Subreddit": "Stims"}], "7y1yui": [{"0_Title": "To those of you who’ve gotten clean", "1_Text": "Firstly, I don’t want to 56 pills an hour, and second, I don’t have capsules. I do however have a wide throat and can swallow a much larger amount in fruit roll up form than the largest capsule sold at my local supermarket, and fruit roll ups serve the alternate purpose of being delicious without any kratom, while I won’t just eat 00 capsules for fun", "2_Subreddit": "opiates"}], "81986h": [{"0_Title": "Girlfriend is in hardcore wd AND starting period with, as usual, absolutely horrible period cramps", "1_Text": "Firstly, I don’t want to 56 pills an hour, and second, I don’t have capsules. I do however have a wide throat and can swallow a much larger amount in fruit roll up form than the largest capsule sold at my local supermarket, and fruit roll ups serve the alternate purpose of being delicious without any kratom, while I won’t just eat 00 capsules for fun", "2_Subreddit": "opiates"}], "82teui": [{"0_Title": "When toss and wash fails and you have to improvise. #Beatsbeingsick Kratom is a godsend, those who have suffered through withdrawals but never tried this wonderfully effective and amazingly disgusting plant are in for a surprise", "1_Text": "Firstly, I don’t want to 56 pills an hour, and second, I don’t have capsules. I do however have a wide throat and can swallow a much larger amount in fruit roll up form than the largest capsule sold at my local supermarket, and fruit roll ups serve the alternate purpose of being delicious without any kratom, while I won’t just eat 00 capsules for fun", "2_Subreddit": "opiates"}], "86dgus": [{"0_Title": "IMMEDIATE ADVICE NEEDED", "1_Text": "Firstly, I don’t want to 56 pills an hour, and second, I don’t have capsules. I do however have a wide throat and can swallow a much larger amount in fruit roll up form than the largest capsule sold at my local supermarket, and fruit roll ups serve the alternate purpose of being delicious without any kratom, while I won’t just eat 00 capsules for fun", "2_Subreddit": "Stims"}], "86dmob": [{"0_Title": "Immediate advice desperately required", "1_Text": "Firstly, I don’t want to 56 pills an hour, and second, I don’t have capsules. I do however have a wide throat and can swallow a much larger amount in fruit roll up form than the largest capsule sold at my local supermarket, and fruit roll ups serve the alternate purpose of being delicious without any kratom, while I won’t just eat 00 capsules for fun", "2_Subreddit": "Stims"}], "87bkr1": [{"0_Title": "Two grams. The difference is amazing; what used to look like sticky melted black goup, the smell of which would make normal people want to yak, to us looks like the most shiny delicious “sticky black goup” worth its weight in gold, the smell of which makes me salivate with eager anticipation. 😍😋😋", "1_Text": "Firstly, I don’t want to 56 pills an hour, and second, I don’t have capsules. I do however have a wide throat and can swallow a much larger amount in fruit roll up form than the largest capsule sold at my local supermarket, and fruit roll ups serve the alternate purpose of being delicious without any kratom, while I won’t just eat 00 capsules for fun", "2_Subreddit": "opiates"}]}]}]}