{"No_More_Rocket_Balls": [{"0_comments": [{"dwph0o3": [{"0_Comment Submission": "So with the Titans, Jaguars, and Dolphins all getting new uniforms, and Nike being extended through 2028, who should be next?", "1_Text": "No they dont... AZ has a lot of white. I like both jerseys.", "2_Subreddit": "nfl"}], "dwph459": [{"0_Comment Submission": "So with the Titans, Jaguars, and Dolphins all getting new uniforms, and Nike being extended through 2028, who should be next?", "1_Text": "Ours are just fine. Top 5 in the league easy. I think our number font is sick.", "2_Subreddit": "nfl"}], "dwph8u3": [{"0_Comment Submission": "So with the Titans, Jaguars, and Dolphins all getting new uniforms, and Nike being extended through 2028, who should be next?", "1_Text": "Fuck that, raiders arguably have the best unis in the league.", "2_Subreddit": "nfl"}], "dwphvd2": [{"0_Comment Submission": "What Game Is the Hardest For You To Watch ?", "1_Text": "08 for me. That AFC championship game was the first football game I watched as a true fan. The SB that year was bad too as I'm from Iowa and love kurt Warner (and Q obviously). 2011 was redeemed by 2012, along with the fact that we lost to the best team of the last two decades. Nothing to be ashamed of there, where as a loss to the steelers is humiliating.", "2_Subreddit": "nfl"}], "dwpi3o7": [{"0_Comment Submission": "What Game Is the Hardest For You To Watch ?", "1_Text": "That was a great game.", "2_Subreddit": "nfl"}], "dwpi51c": [{"0_Comment Submission": "What Game Is the Hardest For You To Watch ?", "1_Text": "How did you choke away the 16 point lead?", "2_Subreddit": "nfl"}], "dwpick2": [{"0_Comment Submission": "What Game Is the Hardest For You To Watch ?", "1_Text": "John fox did the same thing at the end of regulation in the mile high miracle game. 50-ish seconds and PFM and you take a knee. Typical foxy ball.", "2_Subreddit": "nfl"}], "dwpigng": [{"0_Comment Submission": "So with the Titans, Jaguars, and Dolphins all getting new uniforms, and Nike being extended through 2028, who should be next?", "1_Text": "The title is literally who SHOULD be next, not who will be next...", "2_Subreddit": "nfl"}], "dwpimnt": [{"0_Comment Submission": "What Game Is the Hardest For You To Watch ?", "1_Text": "I was actually rooting for the Pats that game. I really admire Brady and Belichik. ¯\\_(ツ)_/¯\n\nI was really happy for eli though. He's one of my favorite players.\n\nEDIT: Yeah yeah, commence the downvotes. God forbid I be a fan of football and not just the ravens.", "2_Subreddit": "nfl"}], "dwpiqb8": [{"0_Comment Submission": "How long after stopping Naltrexone do I need to wait before I can take an opiate?", "1_Text": "Really? Shit...", "2_Subreddit": "opiates"}], "dwq50ot": [{"0_Comment Submission": "What Game Is the Hardest For You To Watch ?", "1_Text": "Mankind may never have answers to these tough philosophical questions.", "2_Subreddit": "nfl"}], "dwq954t": [{"0_Comment Submission": "Perhaps the deadliest juke in NFL history", "1_Text": "His ability to stay upright and keep moving while juking, changing direction, AND being hit is otherworldly. I once heard someone describe him as having ball bearings in his hips and knees that he could pivot around on while the rest of us were stuck with regular joints and I think that's pretty accurate.", "2_Subreddit": "nfl"}], "dwqkbjg": [{"0_Comment Submission": "What Game Is the Hardest For You To Watch ?", "1_Text": "I've never really understood all the hate they get whereas everybody loves guys like Jordan, gretzky, and popovich. I get that the \"Patriot Way\" is grating and their non-answer press conferences get old, but people should at least understand WHY they do those things and be able to appreciate their greatness. Like the guys I mentioned earlier we'll never again see anything like it after they're gone.", "2_Subreddit": "nfl"}], "dwqlvta": [{"0_Comment Submission": "Tomase: Bill Belichick shouldn't change, not even for Tom Brady or Gronk", "1_Text": ">If the coach isn't in charge, then what's the fucking point of having a coach.\n\nI think if anyone would or should be an exception to Belichikian policy it would be Tom Brady.\n\nAs for Gronk I think the Pats would be wise to get what they can for him now. His days as a player are, I believe, numbered.", "2_Subreddit": "nfl"}], "dwqm2np": [{"0_Comment Submission": "Tomase: Bill Belichick shouldn't change, not even for Tom Brady or Gronk", "1_Text": ">He would still have 3 SBs without Brady, and potentially more.\n\nHow do you figure that? Brady led game winning drives in all three of those games.\n\nEDIT: Quotation", "2_Subreddit": "nfl"}], "dwqsrtq": [{"0_Comment Submission": "Drew Brees was scammed by a jeweler into buying an 8 million diamond ring. Jeweler says \"Brees has no one to blame but himself\"", "1_Text": "Drew \"Pyramid Scheme\" Brees suing over dishonest business practices. I'm going to need a chainsaw to cut through irony this thick.", "2_Subreddit": "nfl"}], "dwqu1yx": [{"0_Comment Submission": "Busy week for Washington DT Tevita Tuliakiono Tuipuloto Mosese Va'hae Faletau Vea. Tevita Tuliakiono Tuipuloto Mosese Va'hae Faletau Vea is scheduled to visit Tampa Bay, Dallas and Green Bay.", "1_Text": "I still can't believe he fucked that up. He was the second overall pick! Goodell must have heard his name said thousands of times during his playing career and during the build up to the draft. That's not even a hard name!", "2_Subreddit": "nfl"}], "dwquuk8": [{"0_Comment Submission": "Iowa DB Josh Jackson, one of the top players at his position, has a top 30 pre-draft visit to the #Bears today, source said. They pick No. 8. He has the #Dolphins next.", "1_Text": "Yep, and with how well Desmond king played last year I doubt Jackson waits long  to hear his name called.\n\nWe may not have the most raw talent, but any player coming out of Iowa is well coached and fundamentally sound.", "2_Subreddit": "nfl"}], "dwqx3ty": [{"0_Comment Submission": "Tomase: Bill Belichick shouldn't change, not even for Tom Brady or Gronk", "1_Text": "No he's not and suggesting that would be stupid. However, you claimed that Belichik would have won those three super bowls, and possibly MORE (???) on his own If he didnt have Brady. I don't think any other QB has three game winning drives in the SB for their CAREER. Brady is the best big game, big pressure quarterback we've ever seen, and I have a hard time believing anybody else could have pulled off what he did in ALL THREE of those games.", "2_Subreddit": "nfl"}], "dwslpbd": [{"0_Comment Submission": "Patriots are trading WR Brandin Cooks and a fourth-round pick to LA Rams for the 23rd overall pick in the first round of the 2018 NFL Draft and a sixth-round pick, league sources told ESPN", "1_Text": "This is 100% happening.", "2_Subreddit": "nfl"}], "dwsm20t": [{"0_Comment Submission": "Patriots are trading WR Brandin Cooks and a fourth-round pick to LA Rams for the 23rd overall pick in the first round of the 2018 NFL Draft and a sixth-round pick, league sources told ESPN", "1_Text": ">Terrell Suggs\n\nNO >:(", "2_Subreddit": "nfl"}], "dwsmhf6": [{"0_Comment Submission": "One more note on Brandin Cooks: #Rams are getting an incredibly productive WR who Sean McVay has coveted. But #Patriots didn’t see him as a true No. 1 for them... and from what I understand, Tom Brady is not sad about this move. Despite his numbers, Cooks wasn’t a great fit.", "1_Text": "Are you me?", "2_Subreddit": "nfl"}], "dwsmoh1": [{"0_Comment Submission": "One more note on Brandin Cooks: #Rams are getting an incredibly productive WR who Sean McVay has coveted. But #Patriots didn’t see him as a true No. 1 for them... and from what I understand, Tom Brady is not sad about this move. Despite his numbers, Cooks wasn’t a great fit.", "1_Text": "I always thought that cooks was an odd choice for new england. Doesn't really fit what they do, and they have a poor man's version of him in Chris hogan who is also a lot cheaper. This is a great trade for the pats.", "2_Subreddit": "nfl"}], "dwtwk2p": [{"0_Comment Submission": "What common product has a feature you’re not sure everyone is aware of?", "1_Text": "The hero we need.", "2_Subreddit": "AskReddit"}], "dwxdo8a": [{"0_Comment Submission": "[OC] Why History Overrates Michael Vick", "1_Text": "I've always thought that vick had one of the most beautiful spirals of all time. He was such a gifted thrower.", "2_Subreddit": "nfl"}]}], "1_submissions": [{"822ma4": [{"0_Title": "Does anyone else really hate Caveira's Pistol?", "1_Text": "No they dont... AZ has a lot of white. I like both jerseys.", "2_Subreddit": "Rainbow6"}], "88tylf": [{"0_Title": "How long after stopping Naltrexone do I need to wait before I can take an opiate?", "1_Text": "No they dont... AZ has a lot of white. I like both jerseys.", "2_Subreddit": "opiates"}]}]}]}