{"bunythelifegard5": [{"0_comments": [{"dfodyar": [{"0_Comment Submission": "Trying opiates for the first time how to best prepare ?", "1_Text": "Am I the only asshole that giggles like a school girl at this shit... im from Baltimore iv been shooting dope for 8 years, war torn tired of 24/7 grinding for my drugs, too many friends on their way to a casket or already in it, iv died myself 3 times, and quite frankly i find the most cynical humor in this sub reddit then on the rest of the internet. Im turning 26 and iv just moved out of sw baltimore to the midwest.. iv been through hell and back but the only regret i have is having the notion that you are only effecting your own self if you can support yourself without stealing, rippin, running. Anyone that cared/cares about u is dieing inside. Opiates are a selfish fuckin choice, but having been through the ringer and hopefully continueing to see the light i find the whole thing comical. Go out and score some raw kid.. and if u make it through the war find your higher power and kiss his fuckin feet til u croke. Doesnt change fact your choice to let the devil in wasnt fuckin retarded but ill laugh at the human brain and the collateral damage before i try to change its bullheaded tendencys", "2_Subreddit": "opiates"}], "dfoerf5": [{"0_Comment Submission": "There's a medical problem that marijuana might be able to help that no one is talking about - \"The idea behind High Sobriety is simple: Help addicts stop abusing the substances that are causing them the most harm, and use cannabis as a tool to do so.\"", "1_Text": "As a pothead since 12 and a junkie most my life... using any substance everyday is not really a valid way to beat substance abuse. If I had chronic pain that i couldnt handle I would probably use some killer bud instead of opiates, and im not knocking the alcoholic who chose daily marijuanna as a much more functional option as I have some family who iv witnessed do this successful. However, a plain old addict shouldnt use anything everyday and the human brain does not function properly on any substance especially using daily. The brains chemical levels get all fuckd even from marijuanna. Hence why your not hungry for a month or dont sleep well when you quit pot. Not to mention dreams are an extremely important component of dealing with stresses and shit we dont even fuckin know enough about. Dont believe me go get high for years on anything and stop (for at LEAST a year btw) and tell me your body and mind doesnt function better. I dont knock anyones life choices as i have my own battles to fight but damn if someones gonna convince me substituting pot for any substance abuse is really the \"cure\" of addicts. - btw i fucking love marijuanna,and id love to continue smoking it daily, but you aint running at 100% when ya do", "2_Subreddit": "Futurology"}], "dfofhk5": [{"0_Comment Submission": "Just got some morphine ampoules, time for some pharma grade IV", "1_Text": "Last i checked when i shoot drugs i dont get paranoid about bits of glass and doing things like a fuckin doctor lol", "2_Subreddit": "opiates"}], "dfpqjr1": [{"0_Comment Submission": "As good as pharmaceutical morphine ampoules are, I'd rather have access to phrarma grade diamorphine (heroin)", "1_Text": "Thats legit", "2_Subreddit": "opiates"}], "dfpqkq4": [{"0_Comment Submission": "As good as pharmaceutical morphine ampoules are, I'd rather have access to phrarma grade diamorphine (heroin)", "1_Text": "Upvote for the stones", "2_Subreddit": "opiates"}], "dfpqur1": [{"0_Comment Submission": "Just because your an addict. ..", "1_Text": "Hahahaha", "2_Subreddit": "opiates"}], "dgape24": [{"0_Comment Submission": "[I ate] King Soft-shell Crab Sandwich, Hurricane Alley, Boynton Beach, FL", "1_Text": "there 100% blue crabs i grew up on the chesapeake bay.. i didnt know people ate any other kind of soft shell I wouldnt eat one unless i was in baltimore", "2_Subreddit": "food"}], "dgapgyt": [{"0_Comment Submission": "As good as pharmaceutical morphine ampoules are, I'd rather have access to phrarma grade diamorphine (heroin)", "1_Text": "track marks and daddy issues baby", "2_Subreddit": "opiates"}], "dgappqk": [{"0_Comment Submission": "What video game are you the most nostalgic about?", "1_Text": "Iv been stuck playing the old Rome Total War for like a year straight now.. not much more satisfying then a long and bloody Thrace campaign and eventually slaying the never ending roman armies one by one till your marching up the italian peninsula...", "2_Subreddit": "AskReddit"}], "dgapy1d": [{"0_Comment Submission": "A literal shit post but an important shit post.", "1_Text": "just stop eating food and live on haagan daz n heroin", "2_Subreddit": "opiates"}], "dgaq0if": [{"0_Comment Submission": "A literal shit post but an important shit post.", "1_Text": "lmao you had a piece of your shit on a fork.. its tough out here", "2_Subreddit": "opiates"}], "dgc5zn3": [{"0_Comment Submission": "A literal shit post but an important shit post.", "1_Text": "if im not mistaken its called a rusty astronaut... u shit in a condom tie it off.. freeze it and then commence to use it as a dildo", "2_Subreddit": "opiates"}], "dnsbnsu": [{"0_Comment Submission": "How real is The Wire?", "1_Text": "pratt and payson", "2_Subreddit": "opiates"}], "dowa8ze": [{"0_Comment Submission": "I've noticed that people use 'the fact I use opiates' as an immediate way to insult me", "1_Text": "lolzz", "2_Subreddit": "opiates"}], "dpr8emn": [{"0_Comment Submission": "I’m not 100% clean from opiates, I do some oxy here and there. And still use Coke much too often. But I’ve done heroin, and binged on it before and stopped fucking with dope completely.", "1_Text": "cool story bro", "2_Subreddit": "opiates"}], "dpr9s38": [{"0_Comment Submission": "Jerry's back and noddin harder than ever !", "1_Text": "except hed have that straight persian raw", "2_Subreddit": "opiates"}], "dpr9uy0": [{"0_Comment Submission": "Jerry's back and noddin harder than ever !", "1_Text": "old dark star guitarist played with further", "2_Subreddit": "opiates"}], "dscpyka": [{"0_Comment Submission": "Someone requested “the hustle” meme", "1_Text": "call me retarded but i thought hustling involved making money not selling something for less lol", "2_Subreddit": "opiates"}], "dslqqfl": [{"0_Comment Submission": "How real is The Wire?", "1_Text": "lol southwest baltimore livin it up hahaha", "2_Subreddit": "opiates"}], "dwiql6r": [{"0_Comment Submission": "After a year of Trump drastically cutting regulations, Wyoming adds a total of five coal mining jobs", "1_Text": "I dont normally post on political nonsense but me and 5 other kids got hired out of trade school starting this summer at a Wyoming coal mine.. and I know about 5 more from last year.  So apparently I know everyone of these ppl lolzzzz.. food for thought..", "2_Subreddit": "Trumpgret"}], "dwnn71v": [{"0_Comment Submission": "Anyone have a favorite dope fiend that they admire/idolize from the past or present?", "1_Text": "yup", "2_Subreddit": "opiates"}], "dwrwoby": [{"0_Comment Submission": "Update: I just discovered that I owe the IRS $50k that I don't have, because I traded in cryptos.", "1_Text": "if u win 10k on a slot machine an alarm goes off and someone from the casino is going to come and make u fill out paper work declaring the taxes.  I think you will even have to pay the taxes out of the winnings right there when the amount is above $2500 or some set amount. Im not sure how it would work on a card table, but I am sure there is a policy.", "2_Subreddit": "personalfinance"}], "dwrxahz": [{"0_Comment Submission": "Posted awhile back from here. Still laughing.... lol", "1_Text": "damn bro, Im sorry you had to go through that.  You gotta get better at this manipulation thing.. get what u want she gets what she wants lolzz", "2_Subreddit": "opiates"}], "dwrxbch": [{"0_Comment Submission": "Posted awhile back from here. Still laughing.... lol", "1_Text": "..yet", "2_Subreddit": "opiates"}], "dwrxjyn": [{"0_Comment Submission": "Gave this guy a dollar to take a pic of his sign.", "1_Text": "lol i always hooked that dude up with some nug", "2_Subreddit": "funny"}]}], "1_submissions": [{"3z34vw": [{"0_Title": "My Brain Is Imprinted With Rauchy Subliminal Porno Ad Clips From Searching Porno Videos", "1_Text": "Am I the only asshole that giggles like a school girl at this shit... im from Baltimore iv been shooting dope for 8 years, war torn tired of 24/7 grinding for my drugs, too many friends on their way to a casket or already in it, iv died myself 3 times, and quite frankly i find the most cynical humor in this sub reddit then on the rest of the internet. Im turning 26 and iv just moved out of sw baltimore to the midwest.. iv been through hell and back but the only regret i have is having the notion that you are only effecting your own self if you can support yourself without stealing, rippin, running. Anyone that cared/cares about u is dieing inside. Opiates are a selfish fuckin choice, but having been through the ringer and hopefully continueing to see the light i find the whole thing comical. Go out and score some raw kid.. and if u make it through the war find your higher power and kiss his fuckin feet til u croke. Doesnt change fact your choice to let the devil in wasnt fuckin retarded but ill laugh at the human brain and the collateral damage before i try to change its bullheaded tendencys", "2_Subreddit": "creepy"}]}]}]}