{"always-lurkingg": [{"0_comments": [{"dw2thnn": [{"0_Comment Submission": "Out patient rehab question", "1_Text": "Usually you must be seen by a dr before they just give you a sub so it really depends...", "2_Subreddit": "opiates"}], "dw3edfc": [{"0_Comment Submission": "Today's pickup. Payday tomorrow, this will hold me over until then", "1_Text": "What’s the pink powder in the middle ?", "2_Subreddit": "opiates"}], "dw3ei8w": [{"0_Comment Submission": "After last year of jus doin opiates last 2 days I been on a bender wit my bro this is our rock for the night and i got a few buns for myself for a few low key speedball bumps", "1_Text": "That looks pretty fire mang", "2_Subreddit": "opiates"}], "dw3f5m0": [{"0_Comment Submission": "Today's pickup. Payday tomorrow, this will hold me over until then", "1_Text": "I feel you ... maybe try sniffing then if your not blasted then try banging a tiny bit idk or don’t risk it lol i would probably risk it though haha", "2_Subreddit": "opiates"}], "dw6pguz": [{"0_Comment Submission": "Another picture of yesterday's pickup. 7G's", "1_Text": "That looks Bomb bro enjoy !!", "2_Subreddit": "opiates"}], "dw799m3": [{"0_Comment Submission": "sometimes drugs feel better than sex lol am I weird ?", "1_Text": "Iv heroin over everything every time lol", "2_Subreddit": "opiates"}], "dw79npo": [{"0_Comment Submission": "kinda miss black tar", "1_Text": "I did a ton of powder h when living in nyc but now that I’m in Cali getting pretty fire tar I don’t miss the powered as much... but I usually always want what I can’t have lol...", "2_Subreddit": "opiates"}], "dw99zaf": [{"0_Comment Submission": "Can anyone tell me if they believe this is an Abscess?", "1_Text": "If it is an abscess I would use warm compress as much as possible on top of the site. I even have used like hand warmers on top of any would be abscess. Also if it is hurting (hot to the touch) this could mean abscess. If you have any antibiotics that also may help if they are the correct ones! Good luck brother", "2_Subreddit": "opiates"}], "dw9ozij": [{"0_Comment Submission": "How does this tar look? Cold copped off of CL.", "1_Text": "That looks horrendous", "2_Subreddit": "opiates"}], "dwafwa3": [{"0_Comment Submission": "(Dope porn) #3 and Tar", "1_Text": "Damn that all looks real good man 🤗", "2_Subreddit": "opiates"}], "dwal5zz": [{"0_Comment Submission": "Remember, YOUR VOTE COUNTS! Speedball or Goofball; keep in mind, I have LOADS of experience with all three drugs.", "1_Text": "Speedball all day... I too hate meth but have also done my fair share of it (lots of goofballs) but prefer fire white and fire black over fire clear...", "2_Subreddit": "opiates"}], "dwbhqg0": [{"0_Comment Submission": "Preferred Opiate/Opioid", "1_Text": "Taking into account price, accessibility, and feeling produced I would have to vote iv heroin..", "2_Subreddit": "opiates"}], "dwbucb6": [{"0_Comment Submission": "How much are you paying for heroin where you're at?", "1_Text": "On the west coast bth paying 100 a gram... used to get for 65 a g but my dude got locked up... fucking sucks", "2_Subreddit": "opiates"}], "dwbxq49": [{"0_Comment Submission": "ECP in the west coast", "1_Text": "Used to get it all the time in CA but it was always more expensive than tar", "2_Subreddit": "opiates"}], "dwc73my": [{"0_Comment Submission": "ECP in the west coast", "1_Text": "I’m in SoCal too!! Near Los Angeles", "2_Subreddit": "opiates"}], "dwc8wzo": [{"0_Comment Submission": "Current dwelling", "1_Text": "California", "2_Subreddit": "opiates"}], "dwdr3cz": [{"0_Comment Submission": "The average d-boy.", "1_Text": "Lol agreed at 1 hour and 15 mins in the lobby.... “still here is someone coming down ?”", "2_Subreddit": "opiates"}], "dwgn60q": [{"0_Comment Submission": "An eighth of some fire tar", "1_Text": "Looks like fire brotha ! Nice score", "2_Subreddit": "opiates"}], "dwka6lz": [{"0_Comment Submission": "Will I ever stop?", "1_Text": "Been in that exact same situation less than a week ago... very shitty feeling that’s why I threw away all my dope and rigs today picked up some wax and some bars and am going to try and stop while I still can.. only been a few weeks so I figure the sooner the better.", "2_Subreddit": "opiates"}], "dwqpeov": [{"0_Comment Submission": "Will I ever stop?", "1_Text": "Haha I always say that ... lol I talk myself into justification of getting high just one more time or copping one more gram lol", "2_Subreddit": "opiates"}], "dwu128h": [{"0_Comment Submission": "Kind of annoyed", "1_Text": "Boo this man 👻", "2_Subreddit": "opiates"}], "dwu20mn": [{"0_Comment Submission": "Help me get off this ride... advice for OTC meds for WDing etc", "1_Text": "I agree with parts of what a lot of people have commented with on here. I’ve tried Kratom during withdrawals and it didn’t do shit for me. Like literally Zero. What I use for withdrawals is Xanax 2mg bars, Suboxone 8mg strips, about a g of good ice, about a g of good ketamine, Imodium 2 bottles, Advil/ibuprofen for muscle aches and pains, bath salts to use in a hot bath and one gram of some fire wax from the shop in a cartridge with a pen so all you gotta do is press the button. Everyone is different though so some things may not work and others may work great... I just know for me to detox I need to be distracted and pretty lit up on other substances if I’m quitting my H habit... Best of luck..", "2_Subreddit": "opiates"}], "dwu284x": [{"0_Comment Submission": "I'm Eric Hafner, I'm running for U.S. Congress in Portland, Oregon (OR-3). I want to legalize all drugs, including opiates, but offer ibogaine therapy too, and free drugs for addicts via prescription.", "1_Text": "This is amazing and would love to live in Portland now... sounds like the most humane treatment of junkies I’ve ever heard of by a politician in this country.", "2_Subreddit": "opiates"}], "dwu2fy8": [{"0_Comment Submission": "today would’ve been your 23rd birthday. i miss you everyday darlin’ 💔", "1_Text": "Wow so pretty, so sorry for your loss... She is resting in peace now  .", "2_Subreddit": "opiates"}], "dwu2mlb": [{"0_Comment Submission": "I'm Eric Hafner, I'm running for U.S. Congress in Portland, Oregon (OR-3). I want to legalize all drugs, including opiates, but offer ibogaine therapy too, and free drugs for addicts via prescription.", "1_Text": "I agree 100 percent... I’ve been an iv heroin user for the last 7 years and am in my mid 20s now. I would love to see my life change because of the type of policies you are trying to enact. I couldn’t even imagine how different life would be.. best of luck to you hope you win :)", "2_Subreddit": "opiates"}]}], "1_submissions": [{"87pdc7": [{"0_Title": "After a couple days of getting so so stuff I decided to treat myself ... happy nods All :)", "1_Text": "Usually you must be seen by a dr before they just give you a sub so it really depends...", "2_Subreddit": "opiates"}]}]}]}