{"CandiFlippin": [{"0_comments": [{"dvglvdh": [{"0_Comment Submission": "Would a guy be in a relationship with a ‘dirty’ girl?", "1_Text": "Lady in the streets, freak in the sheets", "2_Subreddit": "sex"}], "dvgn42u": [{"0_Comment Submission": "Would a guy be in a relationship with a ‘dirty’ girl?", "1_Text": "You were on the right track 😊", "2_Subreddit": "sex"}], "dvhqsap": [{"0_Comment Submission": "Women of r/sex, what is your opinion on the cuckold fetish?", "1_Text": "I like to fantasize about it when I am masturbating sometimes. I think the idea is really hot. In reality I do not think I could ever do this with my husband. If he asked me to do it I would want to find a way to satisfy his desire though I would worry about the impact on our relationship. I also fantasize about FFM threesomes with him and sometimes we do dirty talk while we are having sex about it. If I was actually watching my husband go down on or fuck another woman I think it would be hard for me emotionally", "2_Subreddit": "sex"}], "dvhr0po": [{"0_Comment Submission": "I was being choked and forgot where I was", "1_Text": "How do you go about it safely?", "2_Subreddit": "sex"}], "dviuz1x": [{"0_Comment Submission": "Dead bedroom in recovery", "1_Text": "Thanks so much", "2_Subreddit": "DeadBedrooms"}], "dviuz6o": [{"0_Comment Submission": "Dead bedroom in recovery", "1_Text": "Thank you!", "2_Subreddit": "DeadBedrooms"}], "dviv3uc": [{"0_Comment Submission": "Dead bedroom in recovery", "1_Text": "I’m so sorry, I truly understand how frustrating and disheartening it is. I wish I had a quick fix for everyone because I get how devastating it can be for a relationship. \n\nI remember when I was feeling NO sex drive at all feeling like something was wrong with me and wondering if I was going to feel this way for the rest of my life. \nEven though you aren’t on the pill it could still be hormonal, maybe it’s worth a talk at your next Gyno appt?", "2_Subreddit": "DeadBedrooms"}], "dviywyl": [{"0_Comment Submission": "Dead bedroom in recovery", "1_Text": "Thank you! 🙏", "2_Subreddit": "DeadBedrooms"}], "dvja7em": [{"0_Comment Submission": "Dead bedroom in recovery", "1_Text": "You are right, hormones clearly play such an important role and I was completely oblivious. I just made other excuses in my head to rationalize why I wasn’t feeling horny. You would think mind over matter but not in this case I guess.", "2_Subreddit": "DeadBedrooms"}], "dvjyi0e": [{"0_Comment Submission": "Married ladies how do you not get tired of sex?", "1_Text": "I have been with the same guy for 10 years and I am not tired of him or sex. I love sex and love orgasming. If things get a little stale we switch it up, go away for the weekend for change of scenery or try some new positions or try a new role play etc. \nThere is something really amazing about being with someone who knows exactly what you like, who isn’t judging anything you find sexy, who is going to love and want you whether you haven’t showered or put on make-up or when you are feeling lazy or off your game. This kind of intimacy only grows with time. \n\nDead Bedrooms are complex and I think there are many factors that influence couples no longer having sex. It could be changing life styles, relationship issues causing resentment to grow and hormonal issues to name a few reasons.", "2_Subreddit": "sex"}], "dvn3kau": [{"0_Comment Submission": "Dead bedroom in recovery", "1_Text": "Thank you for saying that. That’s part of why I wanted to post because so often I read the advice to the sex-starved partner is to leave and it makes me sad. I certainly would not encourage a friend to stay in a situation where they are miserable so I understand where that advice is rooted. I also see the other side and would hope that people are trying to maintain open communication and work through things is that’s an option.", "2_Subreddit": "DeadBedrooms"}], "dvn3w6o": [{"0_Comment Submission": "Dead bedroom in recovery", "1_Text": "That makes sense, I feel naive saying so but it never occurred to me something was off with my hormones.", "2_Subreddit": "DeadBedrooms"}], "dvn4xg7": [{"0_Comment Submission": "Hoping for some input on a relationship - Not sure if DB or she's just inexperienced", "1_Text": "I know your question is about what do women say to let men know they are interested. Which for me would probably seem a little weird because a lot of our dirty/initiating talk is either silly or really direct. \n\n I also wanted to ask a question about your situation. Is your girl the type to get observably excited about non-sexual things? For example, a fun vacation, a promotion at work or some other presumably happy time?\n\nHave you talked with her about it? Maybe she has a belief that men should initiate.. maybe you letting her know how hot you think it would be for her to initiate sex or dirty talk or something would give her permission to open up.", "2_Subreddit": "DeadBedrooms"}], "dvnkld9": [{"0_Comment Submission": "I am so disgusted at myself! It is crazy what you will do while horny.", "1_Text": "Everyone has different preferences and sexual desires. Sexy time is a time to break away from your social mask. I don’t hear anything that sounds particularly shameful. You enjoyed yourself, you didn’t hurt anyone... what’s the problem?", "2_Subreddit": "sex"}], "dvns627": [{"0_Comment Submission": "Dead bedroom in recovery", "1_Text": "I started BC when I was probably 15 and I was on it until stopping a year ago (I am 30 now). I have had multiple prescribing doctors over the years and not one ever said decreased libido was a side effect. \nI suppose someone could also argue I didn’t take the time to research side effects - maybe I would have done better on a BC with low hormones for example. I had an IUD for a few years too. It was recommended I get one with hormones and the change in my mood was so drastic I had it removed early.  Before having it removed, when I spoke to my Gyno about having severe mood swings I had never experienced before she literally said “Maybe it’s just you”. I remember it because it was like a knife to the heart... like fuck... I guess I am just a psycho bitch...? IUD removed and immediate change that month... mood swings gone. You’ve got me thinking... I need a new Gyno mine sucks \n\nSpeaking to the SSRI’s I am a therapist by profession and I have seen some devastating results of people having side effects to medications prescribed by irresponsible physicians. Psychotropic  medication  is not to be taken lightly and should be closely monitored when changes are made.", "2_Subreddit": "DeadBedrooms"}], "dvnvt2k": [{"0_Comment Submission": "Give me a few good reasons that legalizing, and selling opiates would be beneficial to the mass population.", "1_Text": "And to piggy back on this... legal marijuana state research is demonstrating  use rates with marijuana have remained the same... meaning those that are going to use are going to do so regardless of legality. I realize opiates are different than marijuana in many ways but we could still make some assumptions for legal opiates.", "2_Subreddit": "opiates"}], "dvwyjfj": [{"0_Comment Submission": "Ladies, is untrimmed pubic hair a turn off for you?", "1_Text": "I prefer trimmed not shaved... I want to be with a man not a boy... too long of hair makes oral a little annoying at times", "2_Subreddit": "sex"}], "dvwyyoa": [{"0_Comment Submission": "Ladies, is untrimmed pubic hair a turn off for you?", "1_Text": "Was this shaming? My apologies - I was speaking to my personal preference. Would it be acceptable to say, if I am with a man who removes his pubic hair then I feel like I am with a boy?", "2_Subreddit": "sex"}], "dw6uwb5": [{"0_Comment Submission": "Does a real man feel just as good as toys?", "1_Text": "I think a penis is better. I like the warmth and feel of it over an artificial vibration. A vibrator on my clit with a penis inside me is heaven", "2_Subreddit": "sex"}], "dwctr3f": [{"0_Comment Submission": "Me [34M], my girlfriend [33F] and the sad realization that were not really a couple anymore", "1_Text": "Oh my honey, I don’t even know you and I want to hug you. 🤗", "2_Subreddit": "relationships"}], "dwdmel7": [{"0_Comment Submission": "What you all think is a realistic sexpectation?", "1_Text": "Wow! I really appreciate your response with research. Thank you 😊", "2_Subreddit": "DeadBedrooms"}], "dwiaxo9": [{"0_Comment Submission": "This Fetish is becoming the only way Im completely satisfied", "1_Text": "Have you role played the scenario?", "2_Subreddit": "sex"}], "dwln0vs": [{"0_Comment Submission": "i’m fiending like a bitch rn", "1_Text": "What is this creature?", "2_Subreddit": "opiates"}], "dwlnfge": [{"0_Comment Submission": "i’m fiending like a bitch rn", "1_Text": "Oh my! Haha", "2_Subreddit": "opiates"}], "dwmew60": [{"0_Comment Submission": "i’m fiending like a bitch rn", "1_Text": "I mean... he is kind of cute in a horrifically ugly way. I think someone fed him after midnight though", "2_Subreddit": "opiates"}]}], "1_submissions": [{"7znh8r": [{"0_Title": "So... Blumpkins", "1_Text": "Lady in the streets, freak in the sheets", "2_Subreddit": "sex"}], "82ee35": [{"0_Title": "Is hot tub sex a thing?", "1_Text": "Lady in the streets, freak in the sheets", "2_Subreddit": "sex"}], "83kcw5": [{"0_Title": "Dead bedroom in recovery", "1_Text": "Lady in the streets, freak in the sheets", "2_Subreddit": "DeadBedrooms"}], "87havq": [{"0_Title": "What you all think is a realistic sexpectation?", "1_Text": "Lady in the streets, freak in the sheets", "2_Subreddit": "DeadBedrooms"}]}]}]}