{"Equal2None": [{"0_comments": [{"dum6yhf": [{"0_Comment Submission": "Adam Silver wants to restructure the play-offs. Let's restructure the league.", "1_Text": "sorry to pile on, but the ideas provided suck pretty badly buddy, lol. Surprised you didn’t suggest the highly demanded 4-Pointer..", "2_Subreddit": "nba"}], "dum7clc": [{"0_Comment Submission": "i know the answer but let's see what the know it alls have to say. real or fake", "1_Text": "This is an easy one, champ.. Its Really-Fake.", "2_Subreddit": "opiates"}], "dum8paw": [{"0_Comment Submission": "i know the answer but let's see what the know it alls have to say. real or fake", "1_Text": "I guess you are not fluent in sarcasm, my apologies for the language barrier..😢", "2_Subreddit": "opiates"}], "dur5e6v": [{"0_Comment Submission": "What's the difference between a Superstar and a Star?", "1_Text": "so AI wasn’t a superstar?", "2_Subreddit": "nba"}], "dur68l2": [{"0_Comment Submission": "What's the difference between a Superstar and a Star?", "1_Text": "more for the hip hop scene than he did for basketball? Thats an absurd take lol.. I just cant agree that rings make you a superstar.. So Toney Parker is a superstar? Like currently you don’t think Harden or Westbrook are superstars? Rings for sure help the resume, but they are not a defining factor at all.. \nThings like big endorsement deals,visibility,relevancy are keys off the court.. On the court to be a superstar you must be entertaining, MVP caliber play for several seasons.. Longevity is important as well.. but I guess we will just have to agree to disagree..", "2_Subreddit": "nba"}], "dur6fpt": [{"0_Comment Submission": "What's the difference between a Superstar and a Star?", "1_Text": "you seem to be confused lol. Winning a ring is very important, just not a defining factor in if one is a superstar or not and damnit you’ve caught me...Ive never won a NBA championship.. but since you have would you mind giving lil ol me your signature?", "2_Subreddit": "nba"}], "durdnzw": [{"0_Comment Submission": "What's the difference between a Superstar and a Star?", "1_Text": "why are you fantasizing about me and gay porn?  You have to be like 15 Years old or a troll (Not even a good one).. Either way you are irrelevant.. If you disappeared tomorrow, no one would even notice you were gone.. Thats got to hurt deep down. But keep making new reddit accounts attempting to form a personality you wish you could be in real life.. but hey regardless of how I just body bagged you.. I still think you are a superstar 😘", "2_Subreddit": "nba"}], "duu9j1j": [{"0_Comment Submission": "Some thoughts about my situation..", "1_Text": "thottie! lol JK do you mama..", "2_Subreddit": "opiates"}], "duu9mms": [{"0_Comment Submission": "Used to post here. Like the community. Need girl help ASAP", "1_Text": "don’t be naive bro.. you seen enough, and you need to trust that gut instinct.. You already know shes cheating, you just don’t want to believe it..", "2_Subreddit": "opiates"}], "dv58tav": [{"0_Comment Submission": "The Jones’s..... real bad (prob. A shit post)", "1_Text": "Based on you being so indecisive, Id just sit this one out.. If you REALLY wanted to get high, you would have left already. The fact that you are contemplating it, shows that you already have some type of self control.. or fuck it don’t listen to me.. maybe you’ve had a hard week at work.. maybe you’ve recently accomplished a goal you’ve had set out and this can be a reward or a chance to celebrate.. Either way shit or get off the pot.. best of luck champ!", "2_Subreddit": "opiates"}], "dv5atph": [{"0_Comment Submission": "First time in a while", "1_Text": "I pop once a decade, I personally love how Im using.. This 5 MG oxy has me nodding the fuck out!", "2_Subreddit": "opiates"}], "dv69bwz": [{"0_Comment Submission": "[B/R Kicks] J.R. Smith x Supreme", "1_Text": "reminds me of the old jeans and hats they used to have with all the logos lol.. I was a kid in 8th grade wearing a 2x, when I needed a medium.", "2_Subreddit": "nba"}], "dv7cxuh": [{"0_Comment Submission": "KOBE gets an Oscar!", "1_Text": "Innocent untill proven guilty, thats how it works.. But lucky for kobe it didnt come down to that, she dropped the charges? Gotta love America! \n\nPS \n\nJordan and LeBron will never win an oscar.", "2_Subreddit": "Oscars"}], "dvcujta": [{"0_Comment Submission": "Stumbled upon some pink NP 12s... good beginner dose?", "1_Text": "if 2 5MG Pills got you feeling good, just take one of the Pink pill seeing as they are 10 MGs or fuck it take 2 and NOD ya balls off", "2_Subreddit": "opiates"}], "dvhlms2": [{"0_Comment Submission": "Hot Cheetos", "1_Text": "while all this is happening, some white girl is getting every hole she has to offer punished by the basketball team..", "2_Subreddit": "funny"}], "dvil2bn": [{"0_Comment Submission": "Thank you Desus and Mero for helping me through a break up", "1_Text": "Call me crazy, but I think you two should date now..", "2_Subreddit": "bodegaboys"}], "dvjahns": [{"0_Comment Submission": "Why do rappers brag about selling drugs?", "1_Text": "Sometimes its bragging, other times its just telling the story of ones life.. Most rappers will say in interviews that its not to glorify the lifestyle..Outsiders tend to get it confused, the goal is to get yourself and family out the hood. No one wants to sell drugs forever, some people in certain neighborhoods are left with not many other options to provide other than selling drugs.", "2_Subreddit": "opiates"}], "dvu2vna": [{"0_Comment Submission": "THe sick joke we play on ourselves", "1_Text": "you are appreciated!", "2_Subreddit": "opiates"}], "dvu6eea": [{"0_Comment Submission": "Sex & opiates, what is your experience with these combined?", "1_Text": "Lost my ex girlfriend because I wouldn’t cum or get hard at times.. She swore I was either no longer attracted to her or seeing someone else.. I hardly jack off these days, have absolutely NO SEX DRIVE.. Yet I continue to gracefully nod in a bliss.", "2_Subreddit": "opiates"}], "dwm31aa": [{"0_Comment Submission": "I just opened up to my friends and I wish I didn't", "1_Text": "you might be taking it the wrong way.. Not everyone is good at dealing with emotions, especially someone else's. Her silence might be a result of her not knowing what to say, and being cautious to not say the wrong thing, or something that would offend you.I know we all wont compassion and to be understood and to have someone to talk to, but some folks are just not good at it. YOU cant depend on others to make you feel good, its hard but you have to find that within yourself. I love you though, so keep that chin up!", "2_Subreddit": "depression"}], "dwm34q3": [{"0_Comment Submission": "NSFW Tittyfucking", "1_Text": "Im a guy, and I have never been into it. Ill rather place my member in the vagina or mouth of some lucky lady.. Not stroke her fun bags, but thats me..", "2_Subreddit": "unpopularopinion"}], "dwm393d": [{"0_Comment Submission": "In defense of Adam22; he's done some great things for the culture", "1_Text": "he hasn't done anything for hip hop pal, don't be silly.", "2_Subreddit": "hiphopheads"}], "dwr1kfm": [{"0_Comment Submission": "The NBA's Official Top 10 Plays for the 1999-2000 Season", "1_Text": "top ten assist*", "2_Subreddit": "nba"}], "dwr1seb": [{"0_Comment Submission": "Flying to Pakistan shitpost", "1_Text": "done that same thing, but flight was to mexico. On the last day I finished what I brought, so possibly bring a little extra.", "2_Subreddit": "opiates"}], "dwrbg44": [{"0_Comment Submission": "Flying to Pakistan shitpost", "1_Text": "Id go with having the VR and the D both in the bottle.. Id just put the D capsules in first, then cover those with the actual VR.", "2_Subreddit": "opiates"}]}], "1_submissions": [{}]}]}