{"heroinista": [{"0_comments": [{"dwk3pyi": [{"0_Comment Submission": "Zoom zoom!", "1_Text": "Generic for 10mg Adderall Instant Release", "2_Subreddit": "opiates"}], "dwk81l3": [{"0_Comment Submission": "My First experience with an Overdose", "1_Text": "Yes, it looks like 40 states have \"some version\" of a Good Samaritan Law when it comes to opioid overdoses. Unfortunately, not all state's laws are created equally... A lot of the states that claim to have a Good Samaritan Law in place still give police the authority to make arrests for offenses such as possession of a controlled substance, possession of drug paraphernalia, and more.\n\nI recommend checking this page out to see what the law looks like in your home state!\n\nhttps://www.samhsa.gov/capt/sites/default/files/resources/good-samaritan-law-tool.pdf", "2_Subreddit": "opiates"}], "dwk9hfy": [{"0_Comment Submission": "The worst feeling", "1_Text": "Just don't give up. You'll find what it is that makes life important for you to live eventually. 💕", "2_Subreddit": "opiates"}], "dwk9rz7": [{"0_Comment Submission": "First time help me please! :)", "1_Text": "So as a heroin addict, I feel it is my duty to suggest that you don't mess with opiates first and foremost. They will ruin your life eventually.\n\nNow, since you're probably going to do them anyways, I'd recommend you take all 3 at once on an empty stomach. Anticipate that there is a real possibility that you might throw up. Additionally, you may very likely appear to be impaired while you are high so I wouldn't do it around anyone you wouldn't want to find out. \n\nWith that being said, enjoy the feeling!", "2_Subreddit": "opiates"}], "dwkas35": [{"0_Comment Submission": "The worst feeling", "1_Text": "I get where you're coming from. You can have what appears to be the perfect life to everyone that is on the outside looking in and still feel complete emptiness/loneliness. Try not to let the bad feelings consume you. Always remember to be thankful for all that you do have because even though you may not be fully satisfied with your life, there's someone out there who wishes they had a fraction of the things you do. \n\nI know I'd trade some of my happiness for some financial stability in a heart beat. Hell, I'd sell my soul for the right price at this point in my life lol.", "2_Subreddit": "opiates"}], "dwkbgtc": [{"0_Comment Submission": "First time help me please! :)", "1_Text": "You'll feel more of the effects of the drug on an empty stomach. If you're trying to get high than you may as well catch the best high you possibly can right? 15mg isn't a very large dose so if it's taken with food you're going to lose a lot of the high. If you take it on the empty stomach, the worst that will happen is you might get nauseous, MAYBE you'll throw up a bit but you'll feel so good you won't care. The way I see it, the *worst case scenario *is if you take the pills with food and don't end up getting high at all because then you will have missed out on a great time and you'll need a do over.  Lol", "2_Subreddit": "opiates"}], "dwkbo58": [{"0_Comment Submission": "The worst feeling", "1_Text": "When you're not happy it is easy to forget how good you might actually have it. Your feelings are real and they are valid. You just have to find something that helps you feel a little better. For me, helping someone else always makes me feel a little better. Obviously you can't depend on other people to make you happy all the time but I think it's a good place to start.", "2_Subreddit": "opiates"}], "dwkcc91": [{"0_Comment Submission": "Meanwhile in Portland, Oregon...", "1_Text": "[kitty picture](https://scontent-sea1-1.xx.fbcdn.net/v/t31.0-8/fr/cp0/e15/q65/27628600_1788733014531799_6210368980518621279_o.jpg?_nc_cat=0&efg=eyJpIjoidCJ9&oh=b2463ceac9521b2695b52e087e44d5f4&oe=5B3A7144)", "2_Subreddit": "trashy"}], "dwkcd0k": [{"0_Comment Submission": "My First experience with an Overdose", "1_Text": "I sure can", "2_Subreddit": "opiates"}], "dwke5ty": [{"0_Comment Submission": "like mother, like daughter.", "1_Text": "It was still trashy in 2013.", "2_Subreddit": "trashy"}], "dwkejl4": [{"0_Comment Submission": "Good Samaritan Laws in the United States & How to Prevent Cops from Responding to an Opioid OD", "1_Text": "Of course! It's so important for people to understand the law as it applies to them. I think it's disappointing that we have these Good Samaritan Laws that are inconsistent and could cause serious legal repercussions for people just trying to save a life.", "2_Subreddit": "opiates"}], "dwkf0sl": [{"0_Comment Submission": "My First experience with an Overdose", "1_Text": "Glad to be of service!", "2_Subreddit": "opiates"}], "dwkf4df": [{"0_Comment Submission": "What's up to my dysfunctional family", "1_Text": "Amen. I've never felt like I fit in amongst my family or peers, but I know I'm definitely with my people when I'm surrounded by addicts.", "2_Subreddit": "opiates"}], "dwkf7pu": [{"0_Comment Submission": "How many of you have an accompanying mental disorder ?", "1_Text": "As a teenager I was diagnosed bipolar. As I got older my diagnosis changed from being bipolar to having anxiety and ADHD.", "2_Subreddit": "opiates"}], "dwkg9ln": [{"0_Comment Submission": "Meanwhile in Portland, Oregon...", "1_Text": "Here's the top definition from UrbanDictionary.com \n\n**gutter slut**\nA cheap street whore that will kneel down in an alley gutter and blow you for 50 cents\n*\"I met this bar whore last nite, man what a cum guzzling gutter slut she was!\"*", "2_Subreddit": "trashy"}], "dwkgbcq": [{"0_Comment Submission": "Meanwhile in Portland, Oregon...", "1_Text": "[UrbanDictionary.com: gutter slut](https://www.urbandictionary.com/define.php?term=gutter%20slut&amp=true)", "2_Subreddit": "trashy"}], "dwkigya": [{"0_Comment Submission": "Good Samaritan Laws in the United States & How to Prevent Cops from Responding to an Opioid OD", "1_Text": "I would have assumed the same. I live in Washington which is a fairly liberal state so I was surprised when my local needle exchange was explaining to me what to say to a 911 dispatcher to prevent police officers from showing up if I needed to call to report an OD.", "2_Subreddit": "opiates"}], "dwkq50c": [{"0_Comment Submission": "What's up to my dysfunctional family", "1_Text": "I couldn't agree with you more! I think that generally addicts are very caring and empathic people. We might have our faults but everyone does.", "2_Subreddit": "opiates"}], "dwkqn84": [{"0_Comment Submission": "Anyone everr tried these? Also a .5 of some DANK tar.", "1_Text": "I saw those ones but went with the other Slurpee flavored gummy worms. They were cherry, blue raspberry, and cola flavors... Amazing. Best gummy worms I've ever eaten! Next on my list of things to try is the lemonade flavor Sour Patch Kids!", "2_Subreddit": "opiates"}], "dwyauxf": [{"0_Comment Submission": "Friend killed himself Tuesday.", "1_Text": "I'm sorry for your loss. I hope that you get some answers and that those answers can give you some closure.", "2_Subreddit": "opiates"}], "dwyblq9": [{"0_Comment Submission": "Friend died of a heroin overdose today.", "1_Text": "So sorry for your loss. I wish you could have been able to spend more time together and get to know each other better too.", "2_Subreddit": "opiates"}], "dwycylm": [{"0_Comment Submission": "Does anyone here sell their plasma? I just have a few (?s) to ask.", "1_Text": "Ask away. My boyfriend and I used to do it.", "2_Subreddit": "opiates"}], "dwydr44": [{"0_Comment Submission": "Does anyone here sell their plasma? I just have a few (?s) to ask.", "1_Text": "They let you know that they reserve the right to drug test, but none of our donations ever were tested. If they do test you and something comes up in your blood that makes you ineligible to donate in the future, they send you some generic letter thanking you for your but declining future donations.", "2_Subreddit": "opiates"}], "dwyevy2": [{"0_Comment Submission": "Does anyone here sell their plasma? I just have a few (?s) to ask.", "1_Text": "It never happened to us after probably 20 donations between the two of us. I wouldn't be concerned.", "2_Subreddit": "opiates"}], "dwyfh0e": [{"0_Comment Submission": "I think it's time to fire her make up artist...", "1_Text": "The top 1/4-1/8\" across her brow line is just powder. Her natural brows are still very full but someone went overboard.", "2_Subreddit": "awfuleyebrows"}]}], "1_submissions": [{"7sldzl": [{"0_Title": "I've been so excited to get my court date over and done with today...", "1_Text": "Generic for 10mg Adderall Instant Release", "2_Subreddit": "opiates"}], "7t9sws": [{"0_Title": "I just overdosed for the second night in a row.", "1_Text": "Generic for 10mg Adderall Instant Release", "2_Subreddit": "opiates"}], "88b8cu": [{"0_Title": "my life has gotten exponentially worse since trying to get clean;", "1_Text": "Generic for 10mg Adderall Instant Release", "2_Subreddit": "opiates"}], "88dfh6": [{"0_Title": "Meanwhile in Portland, Oregon...", "1_Text": "Generic for 10mg Adderall Instant Release", "2_Subreddit": "trashy"}], "88g3mw": [{"0_Title": "like mother, like daughter.", "1_Text": "Generic for 10mg Adderall Instant Release", "2_Subreddit": "trashy"}], "88gb3h": [{"0_Title": "Good Samaritan Laws in the United States & How to Prevent Cops from Responding to an Opioid OD", "1_Text": "Generic for 10mg Adderall Instant Release", "2_Subreddit": "opiates"}], "8afu3s": [{"0_Title": "Imagine what she looks like when she raises her eye brows...", "1_Text": "Generic for 10mg Adderall Instant Release", "2_Subreddit": "awfuleyebrows"}], "8afw2l": [{"0_Title": "I think it's time to fire her make up artist...", "1_Text": "Generic for 10mg Adderall Instant Release", "2_Subreddit": "awfuleyebrows"}]}]}]}