{"Iledahorsetowater": [{"0_comments": [{"dwrr5vz": [{"0_Comment Submission": "i couldn’t decide if this was the Northern Lights or Buzz Lightyear hair 🌌", "1_Text": "Omg lol already following. Love her", "2_Subreddit": "FancyFollicles"}], "dwrxuwc": [{"0_Comment Submission": "[IMAGE] take your time", "1_Text": "Like me!", "2_Subreddit": "GetMotivated"}], "dws7s5s": [{"0_Comment Submission": "[IMAGE] take your time", "1_Text": "I was due to take my mcat at 22 but dipped out before I finished my last semester of ochem and physics. Fucked around with a bachelors of nursing to get a DO in NP. Then became a fkng barber lol I am so so so so so so happy. It would have taken me until 35ish to finally get thru rotations and start a practice. The doctors I shadowed said run for the hills.", "2_Subreddit": "GetMotivated"}], "dws8teq": [{"0_Comment Submission": "Revlon Colorstay Creme Eyeshadow Pan", "1_Text": "Use the chocolate one all the time for a smudgy hurried eye look lol", "2_Subreddit": "PanPorn"}], "dws8upa": [{"0_Comment Submission": "Some baby pan on my urban decay beach bronzer in bronzed :)", "1_Text": "I’ve had this panned for like a year and it still won’t quit. I’m not big into matters tho. It’s nice.", "2_Subreddit": "PanPorn"}], "dws90fj": [{"0_Comment Submission": "[Haul] Got a Lush giftcard for my birthday! :-)", "1_Text": "I use eucerin oil body wash as shave. All the oil body washes. Glossier. Cera ve. Eucerin p50f.", "2_Subreddit": "SkincareAddiction"}], "dws96ge": [{"0_Comment Submission": "[PSA] Using annotated pictures-harsh but honest pics-and notepad inserts is a great way to not just remember how you looked, but how you felt! (Left pic was front facing hence the better complexion) Hoping this helps me find my HG products!", "1_Text": "Wowbwas gonna start a paper skincare journal. Def downloading this app", "2_Subreddit": "SkincareAddiction"}], "dwse1yy": [{"0_Comment Submission": "[PSA] Paula’s Choice Peptide Booster page has gone live (...prematurely)", "1_Text": "Yay or nay?", "2_Subreddit": "SkincareAddiction"}], "dwsh3cs": [{"0_Comment Submission": "[haul] I’ve been collecting mini/travel-sized products for my holiday, I thought they were too cute not to share", "1_Text": "Batiste got its rep for a reason. I used it yesterday and it fluffs your hair up like a cloud!", "2_Subreddit": "SkincareAddiction"}], "dwsh8ig": [{"0_Comment Submission": "[Routine Help] Where to put vit C in routine with Drunk Elephant T.L.C. Framboos", "1_Text": "I want frambroos so bad and have a very similar routine. Very oily skins.", "2_Subreddit": "SkincareAddiction"}], "dwt8ta4": [{"0_Comment Submission": "[Shelfie] My natural, cruelty-free skincare regimen", "1_Text": "It is seriously one of the best. I go back to that glycerin one and thayers alcohol free. Hada Labo next... I am going to try. But damn that one is so good and makes your makeup just sink in and look instantly perfect but actually moisturizes your skin without being greasy. Wish they made a spray spf!\n\nIf you can get your paws on the 1% HA rose water serum...!HA never exceeds 2% and any ha claiming 99% pure would be a hard rock bc sodium hyluronate is.. a salt. So it would be a rock of salt. This stuff puffed up my nasolabial folds. Patting and kind of slapping your face like Korean Beauty people do def makes a difference in absorption too! \n\nBut yeah. I have been doing a comparison of son and parks beauty water. Thayers. Pixi glow tonic. Burt’s bees daisy brightening tonic. A ton of toners. These two are still my top...", "2_Subreddit": "SkincareAddiction"}], "dwtc1oo": [{"0_Comment Submission": "[product question] anti-aging for the body?", "1_Text": "I use the cera ve SA body wash (doubles as face). Cera ve SA lotion. Exuviance heel elbow repair is very very strong combo of acids for feet and elbows but sometimes ill use it on my body. \n\n- cera ve sa body wash\n- cera ve sa renewal body lotion\n- exuviance heel elbow repair \n- the ordinary 30% aha on my chest and shoulders bc it’s so cheap \n\n\nDef picking up the deciem retina body oil and lipikar +baume!!", "2_Subreddit": "SkincareAddiction"}], "dwtcb0u": [{"0_Comment Submission": "[product question] physical sunscreen recommendations?", "1_Text": "Same. Got the body one too. Like it. Face once is tinted and alright but I like my sunscreens more dewy less matte. The tint is on point though. Def not orange. Nice neautral beige that basically just disappears and boots out redness.", "2_Subreddit": "SkincareAddiction"}], "dwtch46": [{"0_Comment Submission": "[Acne] Dimethicone", "1_Text": "It is not bad! I love it! I use pure monistat chafing powder gel as my primer and have for 7 years. It is breathable. And helps keep moisture in your skin. It’s not that bad, but you don’t want stuff on your skin allllll the time. So I give it a break. It’s not that bad dude. \nIt does irritate some people tho. \n\n\nSmashbox primer is like pure dimethicone that they charge $30 for.", "2_Subreddit": "SkincareAddiction"}], "dwu4qq6": [{"0_Comment Submission": "[B&A] skin after one month sticking to my routine", "1_Text": "I finally met someone who has used lrp toleraine ultra!!! Do you like it?", "2_Subreddit": "SkincareAddiction"}], "dwu4y7b": [{"0_Comment Submission": "[Product Question] TO Granactive Retinoid 2% in Squalane vs the Granactive Retinoid 2% in Emulsion. Which one do you prefer and why?", "1_Text": "Buying 5% Squalene", "2_Subreddit": "SkincareAddiction"}], "dwu5103": [{"0_Comment Submission": "[Acne] La Roche Posay Reformulates Effaclar Duo [+]", "1_Text": "Lmao right", "2_Subreddit": "SkincareAddiction"}], "dwudcr7": [{"0_Comment Submission": "[Acne] Probiotics in helping acne", "1_Text": "I take vsl#3 for medical reasons. It has literally like. Zero break outs.’my hormonal acne along my jawline and chin has stopped. I also started going to an herbalist at the same time, and always run out the same time as my probiotics. But the probiotics are a miracle and mine have cured a yeast problem I’ve had for 4 years. Vsl#3 is pharmaceutical grade and I use the packets which are $103 a month... steep as fuck. But I’d rather not be sick. They have a step down (mine r middle) for $60 and they blow over the counter probtioics out of the water. Your search will be over. So the money is worth it in my eyes to not have to take 9 diflucan in a row to nonavail.\n\nThere is such a correlation between gut health and skin health. Our gut processes everything we put in our body and our skin is our biggest organ. Don’t you think our skin is the biggest external factor we have for seeing how things are going on the inside? So when something is off balance, it shows. Rashes, psoriasis, acne.", "2_Subreddit": "SkincareAddiction"}], "dwudg2f": [{"0_Comment Submission": "[Misc] My boyfriend surprised me with this awesome vintage lighted vanity mirror", "1_Text": "Same here but come to think of it they probably work awsome bc those light modes made me look like shit. All of them. So itd be great to have now I’d be blending like a mfer.", "2_Subreddit": "SkincareAddiction"}], "dwudmhi": [{"0_Comment Submission": "[PSA] Free SkinCeuticals cleanser samples", "1_Text": "Lol just signed up. For redness and fine lines. My address and the rents haha hope it comes by 2019", "2_Subreddit": "SkincareAddiction"}], "dwwrlc9": [{"0_Comment Submission": "Spring has arrived to Timisoara, Romania", "1_Text": "Looks like where I live... when it’s unedited like that. I can’t even believe those are the same picture. \n\nMy whole downtown is lined with them, my street included and they look so pretty blowing those cottony flowers.", "2_Subreddit": "europe"}], "dwxsyah": [{"0_Comment Submission": "recent empties - not repurchasing any of these except for the avene mist", "1_Text": "Hope you are feeling better ! Crossing that cicaplast lip baume off my wishlist :) thank you.", "2_Subreddit": "PanPorn"}], "dwxt86a": [{"0_Comment Submission": "St. Tropez gradual tan in shower in the shade light to medium.Pan story in the first comment! THIS STUFF IS AMAZING", "1_Text": "I went to ulta during the sale but missed out on this bc I didn’t even know about it!! So sad. \n\nIt only has 3 stars on ulta app that’s so weird.", "2_Subreddit": "PanPorn"}], "dwyhzfl": [{"0_Comment Submission": "St. Tropez gradual tan in shower in the shade light to medium.Pan story in the first comment! THIS STUFF IS AMAZING", "1_Text": "Have you seen the one you do before the shower? I am thinking that route. Idk which one. Or waterless!", "2_Subreddit": "PanPorn"}], "dwyimys": [{"0_Comment Submission": "Panning a $100 palette is bittersweet...", "1_Text": "Is your career in this or a hobby? How did you pan this?\n\nYou straight killed the orange.", "2_Subreddit": "PanPorn"}]}], "1_submissions": [{"7dxylp": [{"0_Title": "Sepia or b&w portrait Kurt contain", "1_Text": "Omg lol already following. Love her", "2_Subreddit": "cross_stitch"}], "7eesal": [{"0_Title": "How many of yall do done the right way?", "1_Text": "Omg lol already following. Love her", "2_Subreddit": "Methadone"}], "7fjfwz": [{"0_Title": "What is the ideal pharmacy customer?", "1_Text": "Omg lol already following. Love her", "2_Subreddit": "pharmacy"}], "7fwd5y": [{"0_Title": "I can hear them perkys callin", "1_Text": "Omg lol already following. Love her", "2_Subreddit": "opiates"}], "7h6b7f": [{"0_Title": "Redditors with kids, do you think it’s possible to raise a kid(s) in a small downtown apartment?", "1_Text": "Omg lol already following. Love her", "2_Subreddit": "AskReddit"}], "7hrrwf": [{"0_Title": "Hundreds of maggots falling from bedroom ceiling. Hit telephone pole head on in a no fault state. Boyfriend and I are on the fritz. I’m losing my mind. Guy at gas station just tried to sell me kilos of “crystal” he wouldn’t let up. Is there a black cloud over me?", "1_Text": "Omg lol already following. Love her", "2_Subreddit": "Vent"}], "7hrvwn": [{"0_Title": "Hundreds of maggots falling out of ceiling. Squirrel/rodent problems.", "1_Text": "Omg lol already following. Love her", "2_Subreddit": "pestcontrol"}], "7k40ov": [{"0_Title": "Cbd+anxiety+addiction and methadone", "1_Text": "Omg lol already following. Love her", "2_Subreddit": "CBD"}], "7kk83u": [{"0_Title": "How often do you all see the doctor", "1_Text": "Omg lol already following. Love her", "2_Subreddit": "Methadone"}], "7lv7uu": [{"0_Title": "Fucked to hell. Woke up late on take home day before Christmas. Will my holidays be hell?", "1_Text": "Omg lol already following. Love her", "2_Subreddit": "Methadone"}], "7nqpo5": [{"0_Title": "Middle of November I fixed a noose out of an exercise band and tied it around my neck. I held my boyfriends glock while he was at work. I googled & found how to aim for your brain stem. Then I suddenly decided to take a nap.", "1_Text": "Omg lol already following. Love her", "2_Subreddit": "opiates"}], "7o736j": [{"0_Title": "What is the junkiest works you all have ever seen?", "1_Text": "Omg lol already following. Love her", "2_Subreddit": "opiates"}], "7p0j3d": [{"0_Title": "Beginner I want to spend my money right. Daniel Smith Jane Blundell palette or Sennelier 18 hp Palette. What would you buy?", "1_Text": "Omg lol already following. Love her", "2_Subreddit": "Watercolor"}], "7rfx2m": [{"0_Title": "Lime Crime $44 and 15% off 1 purchase class action rebate (if you got sent breech email, check and see).", "1_Text": "Omg lol already following. Love her", "2_Subreddit": "MakeupAddiction"}], "7rg7op": [{"0_Title": "Need help. Hit me with your all’s best liquid liner (NO pens).", "1_Text": "Omg lol already following. Love her", "2_Subreddit": "MakeupAddiction"}], "7w8503": [{"0_Title": "Methadone & weight loss/gain", "1_Text": "Omg lol already following. Love her", "2_Subreddit": "Methadone"}], "7y9k2u": [{"0_Title": "[Product Question] Acure Blue Tansy Oil vs Herbivore Lapis Oil. Same ingredients same order.", "1_Text": "Omg lol already following. Love her", "2_Subreddit": "SkincareAddiction"}], "7yd1vk": [{"0_Title": "Weed vs opiates. Why is it easier to cold turkey smoking for years straight?", "1_Text": "Omg lol already following. Love her", "2_Subreddit": "opiates"}], "7zq5er": [{"0_Title": "Give me your best drug movie to watch today.", "1_Text": "Omg lol already following. Love her", "2_Subreddit": "opiates"}], "83i2uw": [{"0_Title": "@Target currently $5 helped me organize bathroom clutter.", "1_Text": "Omg lol already following. Love her", "2_Subreddit": "SkincareAddiction"}], "83i80k": [{"0_Title": "[Personal] At Target currently for $5, perfect for bathroom clutter.", "1_Text": "Omg lol already following. Love her", "2_Subreddit": "SkincareAddiction"}], "84aoro": [{"0_Title": "[Misc] Buying your own skincare machine to cut out the derm", "1_Text": "Omg lol already following. Love her", "2_Subreddit": "SkincareAddiction"}], "86pkco": [{"0_Title": "Son&parks beauty water sucks", "1_Text": "Omg lol already following. Love her", "2_Subreddit": "AsianBeautyRehab"}], "87tr8u": [{"0_Title": "[News] I emailed Cera Ve regarding formula changes (removing MVE time released formula) this was their response.", "1_Text": "Omg lol already following. Love her", "2_Subreddit": "AsianBeauty"}], "88bk48": [{"0_Title": "[Skincare] herbivore Blue Tansy resurfacing clarity mask VS glow recipe watermelon mask", "1_Text": "Omg lol already following. Love her", "2_Subreddit": "SkincareAddiction"}]}]}]}