{"DemandTruth316": [{"0_comments": [{"dsct9yr": [{"0_Comment Submission": "Some panda porn for you all, and some ir30s. Enjoy!", "1_Text": "He is definitely not terminal, thank God, just been on high power opiates over 20 years starting with OC40s in like 1996 I believe ( I was 6 at that time so idk the year for sure). Been prescribed pretty stupid high doses that whole period of time, so now Dr's have practically no choice but to keep using their Happy pens and pads of magic paper.", "2_Subreddit": "opiates"}], "dsdu9xu": [{"0_Comment Submission": "Greetings everyone.", "1_Text": "No after you get to a stable dose, stay there for several months or years then detox down and off over a 4 or 6 months your tolerance will be significantly lower, at least it was for me as I can only speak from personal experience. Now unfortunately tolerance climbs and does return quickly. This may not be true for everyone as we are all idividuals and our experiences can/will vary exponentially.", "2_Subreddit": "opiates"}], "dsduv2i": [{"0_Comment Submission": "Some panda porn for you all, and some ir30s. Enjoy!", "1_Text": "I personally, like most, prefer the m-box 30s or the a215s. I have been doing them and the \"annas\" since 2010 so 7 or 8 years. Basically we got one script of OCs that had like 10 of the og good ones and the rest OPs (we didn't know about the new formulation until that day). The very next appointment was when the switch to opana (the OG stop signs at the time) was made. Now I had known of and heard about opana in like 2008 but I couldn't get my dad to switch no matter how hard I tried because at that time the ocs were still the original ones and he didn't see any reason to switch.", "2_Subreddit": "opiates"}], "dsdvaiu": [{"0_Comment Submission": "Some panda porn for you all, and some ir30s. Enjoy!", "1_Text": "I have to agree hands down, no better pharm out there imo. I have never experienced fentanyl, not once, but from what I have heard it seems to be over rated... Yeah it's stupid potent but imo if there isn't any legs and its juay gonna knock me out then what's the point? I'd rather blow 2 panda 40s and not see straight for 8 hours haha", "2_Subreddit": "opiates"}], "dsdvii5": [{"0_Comment Submission": "Some panda porn for you all, and some ir30s. Enjoy!", "1_Text": "Also I know I will get hated on for this admission but the pandas are very nice to smoke every now and then as well. Crushing up a whole 40 and blowing 3/4 of it and smoking the remaining 1/4 will give one a beautifully dreamy high.", "2_Subreddit": "opiates"}], "dsed8m1": [{"0_Comment Submission": "Some panda porn for you all, and some ir30s. Enjoy!", "1_Text": "Well if you decide to try it, Rember the following:\n they DO NOT slide so you must crush it really fine and basically put the powder into a uniform  line on the foil, you can just fold the foil and use the resulting crease, be sure to keep the tip of the flame about a half inch to inch away from the foil and inhale slowly and lightly as the powder should be fairly fine.", "2_Subreddit": "opiates"}], "dseo19g": [{"0_Comment Submission": "Some panda porn for you all, and some ir30s. Enjoy!", "1_Text": "Yeah you can do it with the irs as well. You gotta crush them too, I personally prefer snorting them... however they also do iv really nice if you are into that sort of thing", "2_Subreddit": "opiates"}], "dsfujyc": [{"0_Comment Submission": "Some panda porn for you all, and some ir30s. Enjoy!", "1_Text": "Yes this is true, I personally prefer the mboxes simply because they were the first ones I ever experienced.", "2_Subreddit": "opiates"}], "dsgj8gl": [{"0_Comment Submission": "Opana HELP", "1_Text": "Yeah you will be fine man, however you said you snorted it at 10:30pm so you are gonna be real good and high another 3 hours atleast. They usually last about 8 hours all together for me when snorted. It also takes exactly 47 minutes from the time of insffulation for it to hit me, every single time( yes I have timed it multiple  times, for science!!)", "2_Subreddit": "opiates"}], "dshc3ol": [{"0_Comment Submission": "Opana HELP", "1_Text": "Yeah I know it sounds it off but I have timed it multiple times, I also do have an obnoxiously slow metabolism, to the point that they had to do this medical test that involved me eating food covered with nuclear waste or some shit and using a special camera to watch and time digestion. Hell I can even dose only every other day at the methadone clinic and feel completely fine and I am only at a 50mg daily dose.", "2_Subreddit": "opiates"}], "dshovlp": [{"0_Comment Submission": "I have $13 dollars. If I put it all on roulette and win I'll have enough for a dub and enough gas until Friday. Taking votes if I should so it and if so what color?", "1_Text": "I concur, put it all on red!!", "2_Subreddit": "opiates"}], "dshtby0": [{"0_Comment Submission": "Opana HELP", "1_Text": "Shit then I have no idea, but for what ever reason it takes 47 minutes. Now that is for it to fully come on, I first start to feel it after about 15 or 20min", "2_Subreddit": "opiates"}], "dshyrnt": [{"0_Comment Submission": "Natural High", "1_Text": "The absolute hands down best and most strong natural high I have ever personally experienced was when I got my prince Albert piercing, it was absolutely fucking amazing... I also have never bled so much in my life.", "2_Subreddit": "opiates"}], "dsi9av3": [{"0_Comment Submission": "Anyone else playing Fortnite?", "1_Text": "I have been playing since Thanksgiving almost daily, I fucking love that game, My gamer tag Is NakedSabotage if you wanna add me, I'm on xbox", "2_Subreddit": "opiates"}], "dsi9ta7": [{"0_Comment Submission": "Anyone else playing Fortnite?", "1_Text": "Noooooo. Well damn I looking forward to playing with you.", "2_Subreddit": "opiates"}], "dskt09c": [{"0_Comment Submission": "Some panda porn for you all, and some ir30s. Enjoy!", "1_Text": "They have 114 on them, scored.", "2_Subreddit": "opiates"}], "dt9xnlh": [{"0_Comment Submission": "Does certo work?", "1_Text": "Yes it works, at least it has for me and everyone I personally know that have used it.", "2_Subreddit": "opiates"}], "dta8erp": [{"0_Comment Submission": "Does certo work?", "1_Text": "From personal experience and the experience of people I personally know to have tried this method... it has worked for Mary jane, cocaine, oxy, and benzos... with it working for oxy I would think it would work for other opiates but I am not positive unfortunately.", "2_Subreddit": "opiates"}], "dtphcbj": [{"0_Comment Submission": "Yellow + blue = green", "1_Text": "I'm sure it is just the pattern on the table/ counter top surface but at first glance it looks like that is lined up or spilled in a perfect line on carpet haha", "2_Subreddit": "opiates"}], "dwja7ah": [{"0_Comment Submission": "Just a curiosity question and potential conversation starter.", "1_Text": "It's was on cable last night actually most nights it is, csnbc the money channel basically haha", "2_Subreddit": "opiates"}], "dwka4rd": [{"0_Comment Submission": "Running back and forth threw the city all day on busses. My dude hooked me up w some of both for 0$. Bout to b home in 20 mins; gonna do a huge speedball. Hi (:", "1_Text": "It's been 15min... He gonna need some MILK! Someone get him some milk!! Haha", "2_Subreddit": "opiates"}], "dwu4ppy": [{"0_Comment Submission": "When people say eat them when referring to pills are they saying to chew them or just swallow?", "1_Text": "Chew that shit", "2_Subreddit": "opiates"}], "dwuog7a": [{"0_Comment Submission": "MDMA while in addiction", "1_Text": "It would appear you answered your own question, I'd you feel ok then go for it... there isn't gonna be a single simple answer that applies to everyone across the boars.", "2_Subreddit": "opiates"}], "dwup46v": [{"0_Comment Submission": "Opana drug test question", "1_Text": "I'm on MMT and every time I have pissed dirty from using opana only(besides methadone) It flags me for both oxy and opiates (morphine)", "2_Subreddit": "opiates"}], "dwvow59": [{"0_Comment Submission": "What do y’all think?", "1_Text": "100% fake as fuck, some of the worst presses I have seen haha, I however do free testing and can verify the active chemical.", "2_Subreddit": "opiates"}]}], "1_submissions": [{"7omkul": [{"0_Title": "Greetings everyone.", "1_Text": "He is definitely not terminal, thank God, just been on high power opiates over 20 years starting with OC40s in like 1996 I believe ( I was 6 at that time so idk the year for sure). Been prescribed pretty stupid high doses that whole period of time, so now Dr's have practically no choice but to keep using their Happy pens and pads of magic paper.", "2_Subreddit": "opiates"}], "7ovkhp": [{"0_Title": "New experience?", "1_Text": "He is definitely not terminal, thank God, just been on high power opiates over 20 years starting with OC40s in like 1996 I believe ( I was 6 at that time so idk the year for sure). Been prescribed pretty stupid high doses that whole period of time, so now Dr's have practically no choice but to keep using their Happy pens and pads of magic paper.", "2_Subreddit": "opiates"}], "7ovos9": [{"0_Title": "Some panda porn for you all, and some ir30s. Enjoy!", "1_Text": "He is definitely not terminal, thank God, just been on high power opiates over 20 years starting with OC40s in like 1996 I believe ( I was 6 at that time so idk the year for sure). Been prescribed pretty stupid high doses that whole period of time, so now Dr's have practically no choice but to keep using their Happy pens and pads of magic paper.", "2_Subreddit": "opiates"}], "8885jh": [{"0_Title": "Just a curiosity question and potential conversation starter.", "1_Text": "He is definitely not terminal, thank God, just been on high power opiates over 20 years starting with OC40s in like 1996 I believe ( I was 6 at that time so idk the year for sure). Been prescribed pretty stupid high doses that whole period of time, so now Dr's have practically no choice but to keep using their Happy pens and pads of magic paper.", "2_Subreddit": "opiates"}]}]}]}