{"EthelWinters": [{"0_comments": [{"dwf4ta6": [{"0_Comment Submission": "It's been a while, here's my reaction to episode 6.", "1_Text": "U-571 haha ya that movie was all make believe as far as i know", "2_Subreddit": "BandofBrothers"}], "dwf5hql": [{"0_Comment Submission": "SADDD", "1_Text": "it gets better every time you rewatch start to notice background characters who became stars for a while during the early 2000s", "2_Subreddit": "BandofBrothers"}], "dwmpoxm": [{"0_Comment Submission": "I've been taking codeine for years and never built a tolerance", "1_Text": "That might work for you but the majority of us end up in this for life I’ve been an addict for 14 years and I have yet to meet a recreational heroin user.", "2_Subreddit": "opiates"}], "dwmq4mg": [{"0_Comment Submission": "Fucking fuck", "1_Text": ".", "2_Subreddit": "opiates"}], "dwn8aof": [{"0_Comment Submission": "Two things: 1) Withdrawing while ill. 2) Vaping H from a bag.", "1_Text": "You sound European I would just smoke that shit off foil dude will prob work better than the vape and #3 dope is supposed to smoke quite nicely", "2_Subreddit": "opiates"}], "dwoep5z": [{"0_Comment Submission": "My brother always has my back. He was a meth and heroin addict for 25 years and he’s been clean for almost four years now.", "1_Text": "Great job man keep coming back your brother couldn’t be more right! On another note can we please talk about how you have 97 unread texts! Unless that’s the plug asking if you’re good 97 times I think it’s time to start answering people.", "2_Subreddit": "opiates"}], "dwoet3h": [{"0_Comment Submission": "Can H be pre-mixed? Can someone mix a batch with water and use it throughout the day?", "1_Text": "I believe 24+ hours", "2_Subreddit": "opiates"}], "dwqdanm": [{"0_Comment Submission": "I know I relapsed the other day, but I can do this, guys!", "1_Text": "Hell ya man U got this!", "2_Subreddit": "opiates"}], "dwsol7k": [{"0_Comment Submission": "Do you guys ever get tired of this life?", "1_Text": "Every goddamn day active or not but that’s just my “disease” fucking with me I guess. I feel like I’ll never have a normal life as it goes even rn sober I am so quick to forget how bad active addiction was and yearn for the chaos and self destruction like it’s cool or something. Idk if this is helpful or not but end rant.", "2_Subreddit": "opiates"}], "dwstfuk": [{"0_Comment Submission": "Do you guys ever get tired of this life?", "1_Text": "Not well at the moment I’m out of my fucking mind in one of those “remember when dope was fun” trains of thought. I’m less than 90 days clean and all I can think about is saying fuck it and diving straight back into heroin hell. It’s crazy because I have a fantastic gf who doesn’t use any drugs and a family that is there in varying levels of support. I just can’t for the life of me figure out why I am so willing to throw that all away for this shit. But hey I’m somehow still not using so there’s that.", "2_Subreddit": "opiates"}], "dwstoki": [{"0_Comment Submission": "Nothing like waking up sick with a hit just waiting", "1_Text": "Thinking about a fat wake shot rn I can almost taste it. Glad you held out and saved for the morning that’s some responsible junking.", "2_Subreddit": "opiates"}], "dwstt0g": [{"0_Comment Submission": "When you have enough to keep from full w/d but not enough to get you right.", "1_Text": "Can you get your hands on subs? I would rip tiny lil pieces off like seriously tiny in order to prevent build up and stay pretty comfortable til I was able to cop.", "2_Subreddit": "opiates"}], "dwstwti": [{"0_Comment Submission": "What is your WD tv show.", "1_Text": "The office for sure", "2_Subreddit": "opiates"}], "dwszm90": [{"0_Comment Submission": "Do you guys ever get tired of this life?", "1_Text": "Nah once I’m back it at it a fire gets lit in my bones and I lose all control. I’ve tried in the past but every time I go back it ends up worse than the last.", "2_Subreddit": "opiates"}], "dwtllkq": [{"0_Comment Submission": "today would’ve been your 23rd birthday. i miss you everyday darlin’ 💔", "1_Text": ".", "2_Subreddit": "opiates"}], "dwumyse": [{"0_Comment Submission": "How can I find a dealer for brown now that craigslist is done for?", "1_Text": "Head for the hood try and get the attention of some urban gentlemen congregating outside of the local corner store and wait for them to ask what you need. Or you can always try homeless street punx travelers etc. another idea use backpage hookers always know where to find drugs. And lastly hit a needle exchange or worst case learn dnm.", "2_Subreddit": "opiates"}], "dwunp34": [{"0_Comment Submission": "Need Legal Advice Asap", "1_Text": "Just remember if this is arraignment just let the public defender enter a plea of not guilty and hopefully the prosecutor doesn’t ask for too much in the way of outpatient or pre-sentence supervision.", "2_Subreddit": "opiates"}], "dwunxfz": [{"0_Comment Submission": "Need Legal Advice Asap", "1_Text": "If you are without representation they’ll reschedule and tell you to either bring one or have one appointed. Sometimes someone else’s private attorney will stand in for you pro bono especially if your case has been dragged out for a long time. It sounds like she is going to arraignment on a sort of desk appearance ticket type deal (nys that’s what they do) and at arraignment there will usually be a public defender or a private attorney who is kind of like a volunteer who will represent you for that day.", "2_Subreddit": "opiates"}], "dwuo9qp": [{"0_Comment Submission": "Going to be flying with ~23 Oxy blues. Planning to just put them in a Tylenol bottle. Is it okay check that bottle with my luggage or do I need to carry it on for some reason?", "1_Text": "Tsa doesn’t give a fuck about your 23 blues shit you ever seen a tsa officer they probably sell blues after work. I’ve flown with many a substance even flew with a loaded syringe in my backpack once to Vermont. Put em loose in a bottle of pills doesn’t even have to look like the other pills and chuck em in your carry on.", "2_Subreddit": "opiates"}], "dwvfawm": [{"0_Comment Submission": "Help ? Need input on these.", "1_Text": "Try the coke method everyone always talks about maybe since they’re extended release? I really don’t know much about pills as im a heroin user when active. Hope this is helpful.", "2_Subreddit": "opiates"}], "dwvfnyq": [{"0_Comment Submission": "Fentanyl detection times for probation?", "1_Text": "I believe it all depends on the analog you end up using.", "2_Subreddit": "opiates"}], "dwvi6ad": [{"0_Comment Submission": "Hey its mr.blackout back with some more hospital goodies", "1_Text": "Idk man seems like a pretty weak stash the morphine is cool but realistically a very small dosage pulse 15/975 mgs of hydro? I’m not hating just hardly seems brag worthy.", "2_Subreddit": "opiates"}], "dwvi972": [{"0_Comment Submission": "Help ? Need input on these.", "1_Text": "Coca Cola put them in a glass and over night they gel up and become instant release", "2_Subreddit": "opiates"}], "dwvtprg": [{"0_Comment Submission": "Heroin movie you probably haven't watched, starring 1971 Al Pacino as a dope fiend.", "1_Text": "It was on Netflix a few years ago. It’s been posted about a few times this past year. The movie is not nearly as obscure as you think.", "2_Subreddit": "opiates"}], "dww7w6b": [{"0_Comment Submission": "24+ hours WDS - Been taking tons of tramadol for about 3 years", "1_Text": "Back page hookers make excellent middles", "2_Subreddit": "opiates"}]}], "1_submissions": [{"72ti7v": [{"0_Title": "RIP", "1_Text": "U-571 haha ya that movie was all make believe as far as i know", "2_Subreddit": "opiates"}], "7iycqi": [{"0_Title": "Rip Veronica B", "1_Text": "U-571 haha ya that movie was all make believe as far as i know", "2_Subreddit": "opiates"}], "7ql2p6": [{"0_Title": "Shit post", "1_Text": "U-571 haha ya that movie was all make believe as far as i know", "2_Subreddit": "opiates"}], "7rt0we": [{"0_Title": "Finally feel like I can do this...", "1_Text": "U-571 haha ya that movie was all make believe as far as i know", "2_Subreddit": "opiates"}], "7tho45": [{"0_Title": "9 days!", "1_Text": "U-571 haha ya that movie was all make believe as far as i know", "2_Subreddit": "OpiatesRecovery"}], "7um1q1": [{"0_Title": "2 weeks!", "1_Text": "U-571 haha ya that movie was all make believe as far as i know", "2_Subreddit": "OpiatesRecovery"}], "7xekts": [{"0_Title": "Seen on r/trashy sorry if this is a repost", "1_Text": "U-571 haha ya that movie was all make believe as far as i know", "2_Subreddit": "opiates"}], "7yz2ix": [{"0_Title": "Facts", "1_Text": "U-571 haha ya that movie was all make believe as far as i know", "2_Subreddit": "opiates"}], "81b51k": [{"0_Title": "42 days", "1_Text": "U-571 haha ya that movie was all make believe as far as i know", "2_Subreddit": "OpiatesRecovery"}], "825n0n": [{"0_Title": "Arraignment day", "1_Text": "U-571 haha ya that movie was all make believe as far as i know", "2_Subreddit": "opiates"}], "84vzpq": [{"0_Title": "That obsession is back", "1_Text": "U-571 haha ya that movie was all make believe as far as i know", "2_Subreddit": "opiates"}], "85us0l": [{"0_Title": "First time viewer", "1_Text": "U-571 haha ya that movie was all make believe as far as i know", "2_Subreddit": "TheWire"}], "87lwl3": [{"0_Title": "Dmt after blow?", "1_Text": "U-571 haha ya that movie was all make believe as far as i know", "2_Subreddit": "Stims"}]}]}]}