{"FeatheredDrake": [{"0_comments": [{"dwjlq7t": [{"0_Comment Submission": "A little question about Amazon...", "1_Text": "Wait, can I do that? Where?", "2_Subreddit": "Drugs"}], "dwmd4tr": [{"0_Comment Submission": "How long does your obsession last?", "1_Text": "My current obsession has been torturing e for at least 8 months now.", "2_Subreddit": "OCD"}], "dwmezwv": [{"0_Comment Submission": "I finally understand why people like dissociatives.", "1_Text": "Same here dude. I've been suffering from depersonalization/derealization disorder for years now, which is a dissociative condition. Basically you're dissociated 24/7, you can't remember anything about your past, you don't know who you are, what you like, what you dislike, you don't have a sense of self etc. When I tried DXM, it was pure bliss. People say it's a cheap, ineffective substance for lousy high school kids, but experiencing a DXM trip will completely change your perspective on the substance. I was suffering from dissociation, but somehow I wanted to dissociate even more, to drift from the pain and the confusion brought my my condition even if that meant dissociating even more. DXM somehow dissociated me from dissociating, if that makes sense, lol. It gave me relief from my usual dissociation by allowing me to experience a much pleasant and better state of dissociation.", "2_Subreddit": "Drugs"}], "dwmfa3c": [{"0_Comment Submission": "Best LEGAL psychedelics?", "1_Text": "Thanks buddy. I will.", "2_Subreddit": "Drugs"}], "dwmffda": [{"0_Comment Submission": "Best LEGAL psychedelics?", "1_Text": "Why am I getting downvoted....?", "2_Subreddit": "Drugs"}], "dwmn48b": [{"0_Comment Submission": "Best LEGAL psychedelics?", "1_Text": "Robitussin IS DXM. That's why I mentioned DXM in my post. It's prescription-only and there's no other way to get it in my country because it stopped being OTC years ago", "2_Subreddit": "Drugs"}], "dwms0aa": [{"0_Comment Submission": "Best LEGAL psychedelics?", "1_Text": "Romania.", "2_Subreddit": "Drugs"}], "dwms1ef": [{"0_Comment Submission": "Best LEGAL psychedelics?", "1_Text": "Yeah, sorry, I can't really distinguish between dissociatives and psychedelics. I thought the high feels the same", "2_Subreddit": "Drugs"}], "dwms2gg": [{"0_Comment Submission": "Best LEGAL psychedelics?", "1_Text": "Thanks!!", "2_Subreddit": "Drugs"}], "dwn8xdp": [{"0_Comment Submission": "I finally understand why people like dissociatives.", "1_Text": "Are you feeling better buddy? I hope so. I could really use some hope right now. I can relate to everything you said.", "2_Subreddit": "Drugs"}], "dwnd43q": [{"0_Comment Submission": "I finally understand why people like dissociatives.", "1_Text": "I'm in the same boat. I'm thinking of tripping tomorrow night because I just need some relief now. I live in a constant state of derealization, panic and despair and nothing ever makes me feel better except getting drunk or high. I'm just tired of feeling numb and apathetic towards everything. Life is just routine and pain.", "2_Subreddit": "Drugs"}], "dwne9sn": [{"0_Comment Submission": "I finally understand why people like dissociatives.", "1_Text": "I know right!! I'm actually going through a full blown existential crisis right now. 'What if the world is owned by elite?', as you say. What if the government wants us all dead? What if feelings aren't real? What if the only reason why we don't kill each other is because we're fooling ourselves with man-made concepts which aren't universal and natural? What if the world is going to end? What happens when we die? Etc. These thoughts won't leave me alone and I feel like I'm going insane.\n\nAnd yes, I desperately need change because I, too, feel like my current environment is maintaining my depression so I think some change would make me feel better. But yeah, at least I feel refreshed and happy while tripping...", "2_Subreddit": "Drugs"}], "dwotp3l": [{"0_Comment Submission": "u/FeatheredDrake's circle", "1_Text": "WHAT IS THIS", "2_Subreddit": "CircleofTrust"}], "dwownpm": [{"0_Comment Submission": "I cannot take it any longer...i'M killing myself in 3 hours", "1_Text": "Can I PM you?", "2_Subreddit": "depression"}], "dwoys89": [{"0_Comment Submission": "How do you deal with not liking your favorite stuff anymore?", "1_Text": "Exactly. Everything feels like a chore, even the things that I used to absolutely adore. It's such a shitty place to be in. I, too, am trying to build a 'new' life. If doing new stuff and breaking away from my old life will not bring me any relief, then I don't deserve to live because I am unable to be happy. I hope it gets easier for you.", "2_Subreddit": "depression"}], "dwuwr1o": [{"0_Comment Submission": "What kind of OCD do you have?", "1_Text": "I used to have religious OCD, then ROCD and now my OCD just picks at everything that I love, giving me intrusive thoughts about everything that means something to me\n\nEdit: also, forgot to mention existential OCD. It's been torturing me for months now.", "2_Subreddit": "OCD"}], "dwux4y2": [{"0_Comment Submission": "Can ocd change over time?", "1_Text": "Yup. Mine changed from religious OCD to ROCD and now it just picks at everything that I love. I also developed contamination OCD.", "2_Subreddit": "OCD"}], "dwv59ru": [{"0_Comment Submission": "How do you know you like something or not if you have OCD around that thing? (ROCD TRIGGER WARNING)", "1_Text": "My OCD is centered around music so I'm avoiding listening to music at the moment. It's mostly fear of music awakening painful memories or associating bad vibes with my favorite music so pretty much fear of contamination. First I started to avoid one of my favorite bands then I started to avoid similar artists then I started to avoid the whole genre and I ended up avoiding all music in general. Video games aren't fun anymore, and I can't focus on movies either because I'm always zoning out. I feel really stuck.", "2_Subreddit": "OCD"}], "dwv5pnn": [{"0_Comment Submission": "How do you know you like something or not if you have OCD around that thing? (ROCD TRIGGER WARNING)", "1_Text": "I don't have any pets yet, but I'm planning to buy a dog or a cat. I like drawing though, I might consider drawing now. Thanks for the piece of advice <3", "2_Subreddit": "OCD"}], "dwvdoe9": [{"0_Comment Submission": "dad found 3 cough syrup bottles", "1_Text": "I told my mother about my dxm use and she was suspicious at first but, with time, she understood that it wasn't something dangerous and that I was careful with it. She's very understanding now and she doesn't care about it. I don't know how open minded your father is, but I think you should tell him the truth.", "2_Subreddit": "dxm"}], "dwwkzi1": [{"0_Comment Submission": "pure O, solipsism and obsession about obsession", "1_Text": "Yes yes!!! I've been suffering from this kind of obsession for months now. It's starting to get better but a few months ago it was hell. I felt constantly confused, I believed that feelings were just man-made concepts and I was numb to all positive feelings. I was in a state of misery, guilt and paranoia all the time. I just wanted to die but I was too afraid to actually kill myself. I had obsessive existential thoughts, like what if life isn't real and death isn't real either, what if i go to purgatory and i'll be stuck there, is love real, what if i'm just crazy and everyone is normal? Also I couldn't distinguish between real thoughts and fake OCD thoughts anymore. I couldn't distinguish the real world from my imagination and I thought I was going crazy.\n\nIf you want to talk about it, I'm always here. Send me a PM.", "2_Subreddit": "OCD"}], "dwyrc75": [{"0_Comment Submission": "Have any of you had intrusive thoughts that made you question whether you still liked your hobby, or passion, or whatever else, and how do you stop it from affecting what you do?", "1_Text": "Same here. I'm just like that when it comes to the things that I like, always questioning whether I still like them or not. It's so fucking exhausting. I feel you.", "2_Subreddit": "OCD"}], "dwys477": [{"0_Comment Submission": "Ocd : obsessing about understanding ocd", "1_Text": "I do the same thing, so I get you, buddy. I get an OCD thought, then I try to understand it by overthinking it then I see many sides of that thought and I try to put them back together. It's so annoying and it just makes me feel worse. Wish I had any advice for you, but I'm still fighting this myself", "2_Subreddit": "OCD"}], "dwyverb": [{"0_Comment Submission": "OCD and not being able to enjoy anything anymore", "1_Text": "Sadly, no one except my best friend really tries to understand me. My parents don't even believe in OCD and they think I can just magically accept or dismiss thoughts and feel a certain way and every time I try to open up to them I just get hurt so I stopped doing that. My best friend is amazing and he understands me and gives me advice but I don't want to bug him anymore with my issues because I know my OCD doesn't really make sense to those who have never experienced it so there's no sense in forcing someone to listen to my pointless OCD rants. I just wish that one day things would change.", "2_Subreddit": "OCD"}], "dwyyigf": [{"0_Comment Submission": "OCD and romantic relationships", "1_Text": "I haven't found a way to cope with it, but certain sounds and feelings drive me crazy, specifically people coughing, sneezing and not just sounds...also simply touching paper or anything that's not soft. Touching cotton or handkerchiefs makes me go nuts.", "2_Subreddit": "OCD"}]}], "1_submissions": [{"83b7g8": [{"0_Title": "Describe each Nirvana album with just ONE word (feeling)", "1_Text": "Wait, can I do that? Where?", "2_Subreddit": "Nirvana"}], "83fcc4": [{"0_Title": "Smile for the camera", "1_Text": "Wait, can I do that? Where?", "2_Subreddit": "Nirvana"}], "843wa9": [{"0_Title": "Can you boof alcohol? If so, how?", "1_Text": "Wait, can I do that? Where?", "2_Subreddit": "Drugs"}], "84hhcx": [{"0_Title": "I'm back and ready to give boofing another try. DXM it is, this time", "1_Text": "Wait, can I do that? Where?", "2_Subreddit": "Drugs"}], "84qgf9": [{"0_Title": "Do you think Kurt was open minded?", "1_Text": "Wait, can I do that? Where?", "2_Subreddit": "Nirvana"}], "84tdl5": [{"0_Title": "Really tired of having symptoms I don't know how to explain", "1_Text": "Wait, can I do that? Where?", "2_Subreddit": "OCD"}], "8530qr": [{"0_Title": "Can OCD make you feel confused or even hateful towards the things you previously liked?", "1_Text": "Wait, can I do that? Where?", "2_Subreddit": "OCD"}], "8565il": [{"0_Title": "Which plateau is good for enjoying music?", "1_Text": "Wait, can I do that? Where?", "2_Subreddit": "dxm"}], "85md0t": [{"0_Title": "Depression or OCD or god knows what this is, but it's making me miserable", "1_Text": "Wait, can I do that? Where?", "2_Subreddit": "depression"}], "860bc9": [{"0_Title": "Will the high ever go away?", "1_Text": "Wait, can I do that? Where?", "2_Subreddit": "dxm"}], "878ike": [{"0_Title": "I had a day without depression", "1_Text": "Wait, can I do that? Where?", "2_Subreddit": "depression"}], "882wnr": [{"0_Title": "Proper way to do a CWE?", "1_Text": "Wait, can I do that? Where?", "2_Subreddit": "opiates"}], "88cpka": [{"0_Title": "A little question about Amazon...", "1_Text": "Wait, can I do that? Where?", "2_Subreddit": "Drugs"}], "88dqa6": [{"0_Title": "Oddly specific", "1_Text": "Wait, can I do that? Where?", "2_Subreddit": "Nirvana"}], "88poig": [{"0_Title": "Fear of contamination with music", "1_Text": "Wait, can I do that? Where?", "2_Subreddit": "OCD"}], "88q1c9": [{"0_Title": "Best LEGAL psychedelics?", "1_Text": "Wait, can I do that? Where?", "2_Subreddit": "Drugs"}], "88uict": [{"0_Title": "I experience OCD in dissociative phases that keep me in a state of DP/DR 24/7", "1_Text": "Wait, can I do that? Where?", "2_Subreddit": "dpdr"}], "88uq51": [{"0_Title": "Guilty for not being empathetic enough?", "1_Text": "Wait, can I do that? Where?", "2_Subreddit": "depression"}], "891djf": [{"0_Title": "Help me understand the fanbase of popular bands/artists and their fascination with merch", "1_Text": "Wait, can I do that? Where?", "2_Subreddit": "CasualConversation"}], "893n1w": [{"0_Title": "u/FeatheredDrake's circle", "1_Text": "Wait, can I do that? Where?", "2_Subreddit": "CircleofTrust"}], "8943pq": [{"0_Title": "How do you deal with not liking your favorite stuff anymore?", "1_Text": "Wait, can I do that? Where?", "2_Subreddit": "depression"}], "8a1skh": [{"0_Title": "How do you know you like something or not if you have OCD around that thing? (ROCD TRIGGER WARNING)", "1_Text": "Wait, can I do that? Where?", "2_Subreddit": "OCD"}], "8a2ixt": [{"0_Title": "OCD over feelings...", "1_Text": "Wait, can I do that? Where?", "2_Subreddit": "OCD"}], "8ah2ca": [{"0_Title": "OCD made me delete my Facebook profile", "1_Text": "Wait, can I do that? Where?", "2_Subreddit": "OCD"}], "8ai1m9": [{"0_Title": "OCD and not being able to enjoy anything anymore", "1_Text": "Wait, can I do that? Where?", "2_Subreddit": "OCD"}]}]}]}