{"pdxdems": [{"0_comments": [{"dwvefmq": [{"0_Comment Submission": "I'm Eric Hafner, I'm running for U.S. Congress in Portland, Oregon (OR-3). I want to legalize all drugs, including opiates, but offer ibogaine therapy too, and free drugs for addicts via prescription.", "1_Text": "Thank you and whether or not we agree on the details, I can pretty much promise you'd be a lot happier with me in office than any alternative. I would be a hard working, and very accessible Congresscritter who is based on principles, not serving corporations like incumbent Blumenauer. Even someone with a very different ideology can appreciate someone with an open door to dialog.", "2_Subreddit": "opiates"}], "dwvhz54": [{"0_Comment Submission": "I'm Eric Hafner, I'm running for U.S. Congress in Portland, Oregon (OR-3). I want to legalize all drugs, including opiates, but offer ibogaine therapy too, and free drugs for addicts via prescription.", "1_Text": "Glad to discuss things with you. It is important for everyone (including myself) to get new perspectives and ideas on issues. In government, if you can't have constructive dialog with those with different views, it is impossible to create policies that everyone can support.", "2_Subreddit": "opiates"}], "dwvi28e": [{"0_Comment Submission": "I'm Eric Hafner, I'm running for U.S. Congress in Portland, Oregon (OR-3). I want to legalize all drugs, including opiates, but offer ibogaine therapy too, and free drugs for addicts via prescription.", "1_Text": "Perhaps people being disgusted with what has been going on in the White House will give birth to something new, but who knows what could happen given what we've seen since 2016.", "2_Subreddit": "opiates"}], "dwviai4": [{"0_Comment Submission": "IamA Democratic candidate for U.S. Congress in Portland Oregon AMA!", "1_Text": "There would be more than one insurance company, and there is still a huge gun lobby that would want you to buy guns. The door would not be shut for gun ownership. Also, settlements and claims involving a mass shooting would be extremely expensive, so at times they would take huge hits financially.", "2_Subreddit": "IAmA"}], "dwvieuv": [{"0_Comment Submission": "*UPDATED* Eric Hafner Democrat for U.S. Congress 3rd District Portland, Oregon 2018", "1_Text": "Again, we are headed towards bans right now. It's either compromise, or lose.", "2_Subreddit": "oregon"}], "dwvimzc": [{"0_Comment Submission": "I'm Eric Hafner, I'm running for U.S. Congress in Portland, Oregon (OR-3). I want to legalize all drugs, including opiates, but offer ibogaine therapy too, and free drugs for addicts via prescription.", "1_Text": "It is all unfortunate, and I would hope that perhaps you may find some relief in medical cannabis, specifically CBD extracts for your condition.\n\nCannabis can be an exit drug as well. Consider an anonymous blog. You are not alone, a very large percentage of the population has been impacted by mental health concerns.\n\nIt is unfortunate the public does not have a good understanding of how these genetic differences and disabilities impact people, and how most mentally ill people are not at all violent, mean, or bad in anyway. It is a second punch from life for people already struggling when others are not compassionate and rational in approaching mental health.", "2_Subreddit": "opiates"}], "dwvis8j": [{"0_Comment Submission": "I'm Eric Hafner, I'm running for U.S. Congress in Portland, Oregon (OR-3). I want to legalize all drugs, including opiates, but offer ibogaine therapy too, and free drugs for addicts via prescription.", "1_Text": "If I get elected, you better come to DC and bring a bag of stale chips when you come visit, because you're sure to get the munchies after visiting my office. Thank you very much. Thanks again and great conversation.", "2_Subreddit": "opiates"}], "dwvj7ur": [{"0_Comment Submission": "I'm Eric Hafner, I'm running for U.S. Congress in Portland, Oregon (OR-3). I want to legalize all drugs, including opiates, but offer ibogaine therapy too, and free drugs for addicts via prescription.", "1_Text": "People use drugs anyway. Prohibition has failed. Doctors would be the gatekeepers, but if you are addicted to heroin, they would legally be allowed to put you on a heroin maintenance regime with legally prescribed heroin, or any other drug you are addicted to. It would destroy the cartels and black market overnight if every addict went to the pharmacy instead of the street corner. And it would also stop the overdose deaths from bad products. There is growing public support and other countries (like the Netherlands) already have such policies.\n\nRight now if you're addicted to heroin and have a $200 a day habit, no job, and no money you are stealing to pay for that. That is a ton of property crime. It would be better for society to have someone going to a clinic, where they would be under medical supervision and also be encouraged to go to rehab. Producing heroin and giving it to addicts is cheaper than the associated health, law enforcement, and quality of life costs of black market addiction.\n\nRemember heroin and fentanyl are already here for those who want them. This doesn't make anything available that wasn't already there, it just reduces the harm caused to the addict, their family, and community from the addiction. We've reach a point where the laws do more harm than the substances in many cases, and the impurities, inconsistent potency, as well as cutting agents of the black market make the risk of overdose much more likely.\n\nIt is saying this is a problem, let's manage it better, even if it is still harmful, because we've tried to eradicate it and that has failed. Drugs are stronger and more available then ever, we have more addicts, full court dockets, packed prisons, and gang warfare. We can at least make it kinda like alcoholism or cigarette smoking, bad for you but not as bad as the side effects of prohibition. The government doesn't protect you from unhealthy behaviors anyway, otherwise they'd be shutting down Burger King.", "2_Subreddit": "opiates"}], "dwvjapd": [{"0_Comment Submission": "*UPDATED* Eric Hafner Democrat for U.S. Congress 3rd District Portland, Oregon 2018", "1_Text": "This isn't about me, look at how many bills are in state legislatures right now. This is the only way to save your gun rights. I'm actually doing gun owners a big favor in offering an alternative.", "2_Subreddit": "oregon"}], "dwvjk44": [{"0_Comment Submission": "I'm Eric Hafner, I'm running for U.S. Congress in Portland, Oregon (OR-3). I want to legalize all drugs, including opiates, but offer ibogaine therapy too, and free drugs for addicts via prescription.", "1_Text": "Thank you. And not to mention how many people get injured or have surgery and end up becoming addicted, but their Doctors cut them off and they end up first buying pills, then the pills cost too much so heroin. It's your body, your health, your decision. But we also forget that many people also have underlying mental or physical conditions that their substance use manages in one way or another, and that isn't normally discussed. And yes, adderall is the wonder drug of productivity, on college campuses and even in business. The War on Drugs isn't even a war on all drugs, just the ones the government and Big Pharma doesn't have their hands in and want you using for their own benefit. You can drink a gallon of vodka a day and no one will call you a criminal, but in many states a joint will be seen otherwise. It is not rational or fair. It is corrupt and can be traced back to when alcohol prohibition ended Harry Anslinger had to create a new job for himself, and the answer was drug prohibition and the Federal Bureau of Narcotics (now DEA).", "2_Subreddit": "opiates"}], "dwvjo85": [{"0_Comment Submission": "I'm Eric Hafner, I'm running for U.S. Congress in Portland, Oregon (OR-3). I want to legalize all drugs, including opiates, but offer ibogaine therapy too, and free drugs for addicts via prescription.", "1_Text": "Sour cream and onion, or maybe some Doritos. Stop by my Congressional office if I get elected and we can spend the day eating chips and blowing weed smoke out the office at angry old conservatives.", "2_Subreddit": "opiates"}], "dwvmg6g": [{"0_Comment Submission": "I'm Eric Hafner, I'm running for U.S. Congress in Portland, Oregon (OR-3). I want to legalize all drugs, including opiates, but offer ibogaine therapy too, and free drugs for addicts via prescription.", "1_Text": "I am running for U.S. Congress, in that position I would be responsible for federal legislation, but I could also preempt state prohibition laws with federal law. Actual heroin being prescribed to addicts is not a fantasy, but a normal day in the Netherlands.\n\nThere are not enough rehab spaces for all the addicted people who want help, and if you do not have private health insurance your options (if any) are very limited.\n\nConsider that the U.S. government has no problem handing out speed in a pill to 5 year olds, and hydrocodone has been prescribed for many people who later got addicted after what was supposed to be a short-term usage, but in some cases could have been avoided altogether were it not for Big Pharma's marketing.\n\nLegal access to heroin maintenance is coming, to America, sooner or later. I'd like to do it sooner before anyone else dies. I have seen the dead bodies of teenagers who overdosed on heroin at funerals, at it is not a pretty sight.\n\nOur society is racist and classist, so now that educated white people are losing their kids due to ODs, people may reconsider. When it was just poor people and minorities using heroin for the most part, no one cared.", "2_Subreddit": "opiates"}], "dwvmhgr": [{"0_Comment Submission": "I'm Eric Hafner, I'm running for U.S. Congress in Portland, Oregon (OR-3). I want to legalize all drugs, including opiates, but offer ibogaine therapy too, and free drugs for addicts via prescription.", "1_Text": "Thank you, perhaps in a few years. Unfortunately, the age requirements for President are much higher. Heck, even Congress is too high requiring people be at least 25. You can vote at 18, you should be able to be a candidate in any race if you can vote.", "2_Subreddit": "opiates"}], "dwvmj3z": [{"0_Comment Submission": "I'm Eric Hafner, I'm running for U.S. Congress in Portland, Oregon (OR-3). I want to legalize all drugs, including opiates, but offer ibogaine therapy too, and free drugs for addicts via prescription.", "1_Text": "Exactly.", "2_Subreddit": "opiates"}], "dwvmkou": [{"0_Comment Submission": "I'm Eric Hafner, I'm running for U.S. Congress in Portland, Oregon (OR-3). I want to legalize all drugs, including opiates, but offer ibogaine therapy too, and free drugs for addicts via prescription.", "1_Text": "People have always used drugs and psychedelic drugs are very important part of human life. We have locked out psychedelic drugs from our mainstream society, and wonder why mental health is in such a poor state.", "2_Subreddit": "opiates"}], "dwvmt2s": [{"0_Comment Submission": "I'm Eric Hafner, I'm running for U.S. Congress in Portland, Oregon (OR-3). I want to legalize all drugs, including opiates, but offer ibogaine therapy too, and free drugs for addicts via prescription.", "1_Text": "I want to take his seat and drop his ass of at a Nike Sweatshop in Asia where he can be beaten and worked to death for pennies. Watch that Behind the Swoosh video I linked to on my website (right sidebar) about the Nike Sweatshops. That is his biggest source of campaign income my friend, he is a complete scumbag. He might wear a bowtie, but underneath is a Nike shirt. And he claims to value human rights? LOL. If Earl Blumenauer values human rights, Donald Trump is a radical feminist.\n\nAs a child, I actually met the guy who made that video. Jim Keady is now running for Congress back in New Jersey. Small world, and full circle. Who knew I would take up the Anti-Nike cause years later myself and seek to unseat Nike's go-to-guy in Congress.", "2_Subreddit": "opiates"}], "dwvmv1l": [{"0_Comment Submission": "I'm Eric Hafner, I'm running for U.S. Congress in Portland, Oregon (OR-3). I want to legalize all drugs, including opiates, but offer ibogaine therapy too, and free drugs for addicts via prescription.", "1_Text": "January 2019 bitches, we will take over. I will say, Earl this is now my office GTFO don't let a box of Nikes hit you on the way out.", "2_Subreddit": "opiates"}], "dwvmxw7": [{"0_Comment Submission": "I'm Eric Hafner, I'm running for U.S. Congress in Portland, Oregon (OR-3). I want to legalize all drugs, including opiates, but offer ibogaine therapy too, and free drugs for addicts via prescription.", "1_Text": "It's politics and is confusing. You have to be a political degenerate to keep track of this. Politics is really basically just high school for adults. Everyone wants to be Class President and bang the popular pretty girl (even if the popular pretty girl is like 50, which is young in political years).", "2_Subreddit": "opiates"}], "dwvn3ol": [{"0_Comment Submission": "I'm Eric Hafner, I'm running for U.S. Congress in Portland, Oregon (OR-3). I want to legalize all drugs, including opiates, but offer ibogaine therapy too, and free drugs for addicts via prescription.", "1_Text": "When Earl Blumenauer says \"Think of the children\" he is thinking of how their tiny hands can produce Nike products  in sweatshops so well...", "2_Subreddit": "opiates"}], "dwvrqj0": [{"0_Comment Submission": "I'm Eric Hafner, I'm running for U.S. Congress in Portland, Oregon (OR-3). I want to legalize all drugs, including opiates, but offer ibogaine therapy too, and free drugs for addicts via prescription.", "1_Text": "They hide behind a web of supposed \"subcontractors\" that are all overseas. U.S. law doesn't apply in those places and the local legal system is very corrupt and life is cheap in those places unfortunately. Without being in the U.S., no American law has been violated and they are corrupt countries where money talks. Nike is a big company so they basically do whatever they want in those places, and Nike is the biggest contributor to Earl Blumenauer's campaign. Blumenauer works for Nike, not the people of the 3rd District. Behind the bowtie and glasses, he is really dressed head to toe in Nike's sweatshop money. To be honest, I'm surprised no one else has attacked him on these very clear deal breakers for Portland voters.", "2_Subreddit": "opiates"}], "dwvrsms": [{"0_Comment Submission": "I'm Eric Hafner, I'm running for U.S. Congress in Portland, Oregon (OR-3). I want to legalize all drugs, including opiates, but offer ibogaine therapy too, and free drugs for addicts via prescription.", "1_Text": "Yup.", "2_Subreddit": "opiates"}], "dwvsm4s": [{"0_Comment Submission": "IamA Democratic candidate for U.S. Congress in Portland Oregon AMA!", "1_Text": "The SCOTUS has been very clear from the DC v Heller case - 2nd amendment prohibits an outright ban on guns https://www.oyez.org/cases/2007/07-290\n\nSo unless there is a constitutional amendment (possible if enough support exists), gun ownership is a legal right in the United States as per the SCOTUS, and they're opinion is the final word legally.\n\nRequiring gun insurance nationally wouldn't change local gun laws, which could deal with the screening issues you've discussed, but would keep a Parkland type case from happening.\n\nBut at the end of the day, many household items can be used to serious injure. We also have to address the root causes of violence too.\n\nBut here's something to remember: the gun industry would not want to go out of business, and more than one company would sell insurance. These factors mean gun insurance wouldn't be too expensive nor would it be impossible to get for the average stable adult.\n\nThere are many stable adults though who are sloppy with how they store their weapons. Even cops sometimes leave their guns under the seats of their cars and they get stolen (sometimes by teenagers), which is an absolute violation of weapons handling protocol. Gun insurance wouldn't stop everything, but if an insurance company has to cut a check if your gun is stolen and is used in a crime, money will make people become a lot more responsible.\n\nThe government wouldn't say you can't own 20 guns, but your insurance company might tell you they would only insure you for a certain amount at a time under your policy, so you might need to securely store other weapons you are not using, if you didn't want to pay a higher rate. There are lots of options on how this could work, but too it would be good for taxpayers as costs associated with a shooting would be picked up by the gun's insurance company, not the public.\n\nNow if you're a middle aged person living in the wilderness and you have a shotgun, your insurance costs would be very low. If you're 18 years old, live in a city, and don't even have a job, who would insure you for an AR-15?\n\nGun insurance would be a way to keep the government from deciding who can have a gun more than they already do. We already have criminal and mental health records checks for gun ownership.\n\nI haven't heard anything from the NRA though on the fact many places tell medical marijuana patients they can't have a firearm or CCW permit.\n\nInsurance would also mean there would probably be maintenance requirements and very specific storage requirements for weapons, so it would force people to be responsible more than they are now.\n\nBut remember I'm running for Congress. I am a human, not a deity. Writing laws can help at times, but I can't wave a magic wand and say okay I got this bill passed, no one will ever got shot again in the United States.\n\nDon't forget people can build guns at home, and other items can be used to hurt people. If you want to kill but can't get a gun, a trip to Home Depot and the gas station would provide everything you need to blow shit up. We can't bubble wrap the world unfortunately, only reduce the chances of problems.", "2_Subreddit": "IAmA"}], "dwvspyt": [{"0_Comment Submission": "I'm Eric Hafner, I'm running for U.S. Congress in Portland, Oregon (OR-3). I want to legalize all drugs, including opiates, but offer ibogaine therapy too, and free drugs for addicts via prescription.", "1_Text": "Before now the people in office did a good job lying to the public about their shenanigans, Trump just basically says fuck you to your face. The whole system is broken and has been going to hell for quite some time. I hope people will really wake up and elect some good people after what happened in 2016. Thank you for the support.", "2_Subreddit": "opiates"}], "dww6282": [{"0_Comment Submission": "IamA Democratic candidate for U.S. Congress in Portland Oregon AMA!", "1_Text": "1. There are many folks who could probably open carry without any problem, but the more guns floating around the more opportunity for them to end up being used when a shooting would have otherwise been avoided. Define law abiding citizen. What about non-violent crimes that are still felonies? Medical marijuana patients have not been allowed CCW permits based on their status, and under ATF interpretation can't own a gun. This isn't fair. But in rural areas, it would be more sensible and safer to have open carry. For open carry, I see more merit in an insurance policy over some stupid license that is just a piece of paper.\n\n2. Background checks don't mean much, it just means you haven't gotten caught (yet). There is a creepy side to licensing. I would honestly prefer insurance requirements over licensing. Licensing is stupid bureaucracy, insurance is money. As long as money is on the line, the insurance companies will make sure the money doesn't go anywhere.\n\n3. Who is buying what and for what reason can mean a lot. But permits don't mean much to me and again, I'd prefer a private insurance policy over a government licensing program.", "2_Subreddit": "IAmA"}], "dwwy9nj": [{"0_Comment Submission": "IamA Democratic candidate for U.S. Congress in Portland Oregon AMA!", "1_Text": "1. Homemade guns are definitely an issue to consider and in places where guns are totally illegal, they're a lot more common and also remember they are effectively untraceable. Whatever we do, we have to hit a balance between respecting the rights of law abiding people who own guns, protecting public safety, and not making it to easy for a crazy person to do something crazy (not that we can stop it anyway, but at least avoiding perhaps a heat of the moment bad decision). A lot of the open carry question could probably be best addressed as a more local issue. I guess I would probably trust more rural people to be responsible than a lot of city dwellers with firearms, but I would rather let local areas figure out what works best. I don't see this as a completely black and white issue but one that will require compromise and dialog with everyone. The SCOTUS is clear, under the 2nd Amendment, Americans have gun rights, and absent a constitutional amendment, that is the law we all must follow. But we also need to figure out what common sense policies everyone can agree on. This a conversation that requires rational analysis and should not be an emotional reaction when making law.\n\n2. I just see it as when money is involved, people tend to be a lot more responsible, and if they're not someone is going to pay millions so there will be a reaction. If you want to see the devil emerge from the depths of hell, all you need to do is take a single dollar from a rich person's pocket.", "2_Subreddit": "IAmA"}]}], "1_submissions": [{"89t2d5": [{"0_Title": "IamA Democratic candidate for U.S. Congress in Portland Oregon AMA!", "1_Text": "Thank you and whether or not we agree on the details, I can pretty much promise you'd be a lot happier with me in office than any alternative. I would be a hard working, and very accessible Congresscritter who is based on principles, not serving corporations like incumbent Blumenauer. Even someone with a very different ideology can appreciate someone with an open door to dialog.", "2_Subreddit": "IAmA"}], "89t5n5": [{"0_Title": "(Pro-Legalization candidate) Eric Hafner Democrat for U.S. Congress 3rd District Portland, Oregon 2018", "1_Text": "Thank you and whether or not we agree on the details, I can pretty much promise you'd be a lot happier with me in office than any alternative. I would be a hard working, and very accessible Congresscritter who is based on principles, not serving corporations like incumbent Blumenauer. Even someone with a very different ideology can appreciate someone with an open door to dialog.", "2_Subreddit": "trees"}], "89tdq2": [{"0_Title": "Pro-Legalization Candidate (updated) Eric Hafner Democrat for U.S. Congress 3rd District Portland, Oregon 2018", "1_Text": "Thank you and whether or not we agree on the details, I can pretty much promise you'd be a lot happier with me in office than any alternative. I would be a hard working, and very accessible Congresscritter who is based on principles, not serving corporations like incumbent Blumenauer. Even someone with a very different ideology can appreciate someone with an open door to dialog.", "2_Subreddit": "Drugs"}], "89th44": [{"0_Title": "Pro-Legalization Candidate (UPDATED) Eric Hafner Democrat for U.S. Congress 3rd District Portland, Oregon 2018", "1_Text": "Thank you and whether or not we agree on the details, I can pretty much promise you'd be a lot happier with me in office than any alternative. I would be a hard working, and very accessible Congresscritter who is based on principles, not serving corporations like incumbent Blumenauer. Even someone with a very different ideology can appreciate someone with an open door to dialog.", "2_Subreddit": "LSD"}], "89tkfv": [{"0_Title": "Pro-Legalization Candidate (UPDATED) Eric Hafner Democrat for U.S. Congress 3rd District Portland, Oregon 2018", "1_Text": "Thank you and whether or not we agree on the details, I can pretty much promise you'd be a lot happier with me in office than any alternative. I would be a hard working, and very accessible Congresscritter who is based on principles, not serving corporations like incumbent Blumenauer. Even someone with a very different ideology can appreciate someone with an open door to dialog.", "2_Subreddit": "MDMA"}], "89tnob": [{"0_Title": "DEM Running against incumbent who voted against gay marriage - Eric Hafner Democrat for U.S. Congress 3rd District Portland, Oregon 2018 (UPDATED SITE)", "1_Text": "Thank you and whether or not we agree on the details, I can pretty much promise you'd be a lot happier with me in office than any alternative. I would be a hard working, and very accessible Congresscritter who is based on principles, not serving corporations like incumbent Blumenauer. Even someone with a very different ideology can appreciate someone with an open door to dialog.", "2_Subreddit": "lgbt"}], "89tvix": [{"0_Title": "Pro-LGBT candidate running against an incumbent who voted to ban gay marriage - Eric Hafner Democrat for U.S. Congress 3rd District Portland, Oregon 2018", "1_Text": "Thank you and whether or not we agree on the details, I can pretty much promise you'd be a lot happier with me in office than any alternative. I would be a hard working, and very accessible Congresscritter who is based on principles, not serving corporations like incumbent Blumenauer. Even someone with a very different ideology can appreciate someone with an open door to dialog.", "2_Subreddit": "ainbow"}], "89u3sg": [{"0_Title": "UPDATED WEBSITE - Eric Hafner Democrat for U.S. Congress 3rd District Portland, Oregon 2018", "1_Text": "Thank you and whether or not we agree on the details, I can pretty much promise you'd be a lot happier with me in office than any alternative. I would be a hard working, and very accessible Congresscritter who is based on principles, not serving corporations like incumbent Blumenauer. Even someone with a very different ideology can appreciate someone with an open door to dialog.", "2_Subreddit": "Portland"}], "89u6ua": [{"0_Title": "*UPDATED* Eric Hafner Democrat for U.S. Congress 3rd District Portland, Oregon 2018", "1_Text": "Thank you and whether or not we agree on the details, I can pretty much promise you'd be a lot happier with me in office than any alternative. I would be a hard working, and very accessible Congresscritter who is based on principles, not serving corporations like incumbent Blumenauer. Even someone with a very different ideology can appreciate someone with an open door to dialog.", "2_Subreddit": "oregon"}], "89ua5h": [{"0_Title": "Eric Hafner Democrat for U.S. Congress 3rd District Portland, Oregon 2018", "1_Text": "Thank you and whether or not we agree on the details, I can pretty much promise you'd be a lot happier with me in office than any alternative. I would be a hard working, and very accessible Congresscritter who is based on principles, not serving corporations like incumbent Blumenauer. Even someone with a very different ideology can appreciate someone with an open door to dialog.", "2_Subreddit": "Gresham"}], "89ud2g": [{"0_Title": "Eric Hafner Democrat for U.S. Congress 3rd District Portland, Oregon area 2018", "1_Text": "Thank you and whether or not we agree on the details, I can pretty much promise you'd be a lot happier with me in office than any alternative. I would be a hard working, and very accessible Congresscritter who is based on principles, not serving corporations like incumbent Blumenauer. Even someone with a very different ideology can appreciate someone with an open door to dialog.", "2_Subreddit": "hillsboro"}], "89ufuy": [{"0_Title": "I'm Eric Hafner, I'm running for U.S. Congress in OR-3 Portland, Oregon and I want to legalize all drugs including shrooms.", "1_Text": "Thank you and whether or not we agree on the details, I can pretty much promise you'd be a lot happier with me in office than any alternative. I would be a hard working, and very accessible Congresscritter who is based on principles, not serving corporations like incumbent Blumenauer. Even someone with a very different ideology can appreciate someone with an open door to dialog.", "2_Subreddit": "shrooms"}], "89uiq1": [{"0_Title": "I'm Eric Hafner, I'm running for U.S. Congress in Portland, Oregon (OR-3). I want to legalize all drugs, including opiates, but offer ibogaine therapy too, and free drugs for addicts via prescription.", "1_Text": "Thank you and whether or not we agree on the details, I can pretty much promise you'd be a lot happier with me in office than any alternative. I would be a hard working, and very accessible Congresscritter who is based on principles, not serving corporations like incumbent Blumenauer. Even someone with a very different ideology can appreciate someone with an open door to dialog.", "2_Subreddit": "opiates"}], "89ulkd": [{"0_Title": "Eric Hafner Democrat for U.S. Congress 3rd District Portland, Oregon area 2018", "1_Text": "Thank you and whether or not we agree on the details, I can pretty much promise you'd be a lot happier with me in office than any alternative. I would be a hard working, and very accessible Congresscritter who is based on principles, not serving corporations like incumbent Blumenauer. Even someone with a very different ideology can appreciate someone with an open door to dialog.", "2_Subreddit": "beaverton"}], "89uqiz": [{"0_Title": "Eric Hafner Democrat for U.S. Congress 3rd District Portland, Oregon 2018", "1_Text": "Thank you and whether or not we agree on the details, I can pretty much promise you'd be a lot happier with me in office than any alternative. I would be a hard working, and very accessible Congresscritter who is based on principles, not serving corporations like incumbent Blumenauer. Even someone with a very different ideology can appreciate someone with an open door to dialog.", "2_Subreddit": "Cascadia"}], "89uu7x": [{"0_Title": "Eric Hafner Democrat for U.S. Congress 3rd District Portland, Oregon 2018", "1_Text": "Thank you and whether or not we agree on the details, I can pretty much promise you'd be a lot happier with me in office than any alternative. I would be a hard working, and very accessible Congresscritter who is based on principles, not serving corporations like incumbent Blumenauer. Even someone with a very different ideology can appreciate someone with an open door to dialog.", "2_Subreddit": "Bend"}], "89uwzs": [{"0_Title": "Eric Hafner Democrat for U.S. Congress 3rd District Portland, Oregon 2018", "1_Text": "Thank you and whether or not we agree on the details, I can pretty much promise you'd be a lot happier with me in office than any alternative. I would be a hard working, and very accessible Congresscritter who is based on principles, not serving corporations like incumbent Blumenauer. Even someone with a very different ideology can appreciate someone with an open door to dialog.", "2_Subreddit": "albanyor"}], "89vedh": [{"0_Title": "Eric Hafner Democrat for U.S. Congress 3rd District Portland, Oregon 2018", "1_Text": "Thank you and whether or not we agree on the details, I can pretty much promise you'd be a lot happier with me in office than any alternative. I would be a hard working, and very accessible Congresscritter who is based on principles, not serving corporations like incumbent Blumenauer. Even someone with a very different ideology can appreciate someone with an open door to dialog.", "2_Subreddit": "BlackLivesMatter"}], "89vicx": [{"0_Title": "Eric Hafner Democrat for U.S. Congress 3rd District Portland, Oregon 2018", "1_Text": "Thank you and whether or not we agree on the details, I can pretty much promise you'd be a lot happier with me in office than any alternative. I would be a hard working, and very accessible Congresscritter who is based on principles, not serving corporations like incumbent Blumenauer. Even someone with a very different ideology can appreciate someone with an open door to dialog.", "2_Subreddit": "uspolitics"}], "89vldi": [{"0_Title": "Eric Hafner Democrat for U.S. Congress 3rd District Portland, Oregon 2018", "1_Text": "Thank you and whether or not we agree on the details, I can pretty much promise you'd be a lot happier with me in office than any alternative. I would be a hard working, and very accessible Congresscritter who is based on principles, not serving corporations like incumbent Blumenauer. Even someone with a very different ideology can appreciate someone with an open door to dialog.", "2_Subreddit": "Oregon_Politics"}], "89vp9x": [{"0_Title": "Eric Hafner Democrat for U.S. Congress 3rd District Portland, Oregon 2018", "1_Text": "Thank you and whether or not we agree on the details, I can pretty much promise you'd be a lot happier with me in office than any alternative. I would be a hard working, and very accessible Congresscritter who is based on principles, not serving corporations like incumbent Blumenauer. Even someone with a very different ideology can appreciate someone with an open door to dialog.", "2_Subreddit": "progressive"}], "89vrru": [{"0_Title": "Eric Hafner Democrat for U.S. Congress 3rd District Portland, Oregon 2018", "1_Text": "Thank you and whether or not we agree on the details, I can pretty much promise you'd be a lot happier with me in office than any alternative. I would be a hard working, and very accessible Congresscritter who is based on principles, not serving corporations like incumbent Blumenauer. Even someone with a very different ideology can appreciate someone with an open door to dialog.", "2_Subreddit": "democrats"}], "89vww7": [{"0_Title": "I'm Eric Hafner, I'm a Democratic candidate for U.S. Congress in Portland, Oregon (OR-3) I want to create a Tupac Shakur Holiday and Legalize Drugs", "1_Text": "Thank you and whether or not we agree on the details, I can pretty much promise you'd be a lot happier with me in office than any alternative. I would be a hard working, and very accessible Congresscritter who is based on principles, not serving corporations like incumbent Blumenauer. Even someone with a very different ideology can appreciate someone with an open door to dialog.", "2_Subreddit": "hiphopheads"}], "89w7b1": [{"0_Title": "Eric Hafner Democrat for U.S. Congress 3rd District Portland, Oregon 2018", "1_Text": "Thank you and whether or not we agree on the details, I can pretty much promise you'd be a lot happier with me in office than any alternative. I would be a hard working, and very accessible Congresscritter who is based on principles, not serving corporations like incumbent Blumenauer. Even someone with a very different ideology can appreciate someone with an open door to dialog.", "2_Subreddit": "socialism"}], "89wzxg": [{"0_Title": "Eric Hafner socialist Democrat for U.S. Congress 3rd District Portland, Oregon 2018", "1_Text": "Thank you and whether or not we agree on the details, I can pretty much promise you'd be a lot happier with me in office than any alternative. I would be a hard working, and very accessible Congresscritter who is based on principles, not serving corporations like incumbent Blumenauer. Even someone with a very different ideology can appreciate someone with an open door to dialog.", "2_Subreddit": "communism"}]}]}]}