{"lauferdragon": [{"0_comments": [{"dv5kv13": [{"0_Comment Submission": "Good old Saturday.", "1_Text": "lol, I was reading my post over and over trying to figure out what i fucked up :-) Thanks man lol", "2_Subreddit": "opiates"}], "dv5s8ye": [{"0_Comment Submission": "Good old Saturday.", "1_Text": "Yes exactly lol. I have been a fan of Edgar for the longest of times, but I think its time for him to retire, as much as I hate  to say that...", "2_Subreddit": "opiates"}], "dv6uj7p": [{"0_Comment Submission": "Nurse Jackie", "1_Text": "It is such a good show lol. I just started watching it and cant stop, now she is what you call a very \"functional junkie\" lol.", "2_Subreddit": "opiates"}], "dv8hotq": [{"0_Comment Submission": "Happy Monday!!", "1_Text": "Right on homie. I like to mix the both, especially like using the girl because it makes me not smoke my boy so fast therefore I have more to go around lol.", "2_Subreddit": "opiates"}], "dw4clb7": [{"0_Comment Submission": "Happy Thursday Everybody!", "1_Text": "Good job man :-)", "2_Subreddit": "opiates"}], "dw4cm7y": [{"0_Comment Submission": "Happy Thursday Everybody!", "1_Text": "I don't mind any day as long as I can score :-)", "2_Subreddit": "opiates"}], "dw4cny6": [{"0_Comment Submission": "Happy Thursday Everybody!", "1_Text": "Yeah its coming down here in the mountains. Im up in the \"hi\" hi desert :-)", "2_Subreddit": "opiates"}], "dw6ndou": [{"0_Comment Submission": "Took a 5 month break. Picked up some tar. Any good methods to dose appropriately till I figure out my tolerance?", "1_Text": "Agree with the above, put a little bit on foil and go from there... Stay safe fam :-)", "2_Subreddit": "opiates"}], "dw6qjhy": [{"0_Comment Submission": "Day 6 no poopy", "1_Text": "Just like everybody else has already said, water, water water... Got to drink water, even with the stool softeners or the stool softeners will not work as well. Hope all this info helps you out fam :-)", "2_Subreddit": "opiates"}], "dw7qf2x": [{"0_Comment Submission": "What's a good starting dose for clear?", "1_Text": "Each ROA is different high when it comes to meth.. I would go buy a oil burner (meth pipe) from your local head shop and start off that way. Snorting it does burn but I believe is the second best way to take it. I would suggest shooting it when you have more experience because, from my own experiences its such a different high then any other way.. Smoking on foil, once again to me, is just a waste..", "2_Subreddit": "opiates"}], "dw7rjo2": [{"0_Comment Submission": "What's a good starting dose for clear?", "1_Text": "The high from snorting and shooting well, you will feel the both instantly, but shooting it has longer legs. Like honestly when you shoot it you will instantly feel your heart beating way faster, of course, but honestly you could be awake for like 24 hours or more. Snorting not so long.. I hope this helps fam stay safe :-)", "2_Subreddit": "opiates"}], "dwa5uq8": [{"0_Comment Submission": "Question so I was trying to find a vein this is my arm and I didn’t even injections or find a vein and know I have these 2 odd bumps I’m not sure if I couldn’t find a vein is because I was dehydrated but does anyone know what these bumps are and are they doctor check up worthy thank you 🙏🏼", "1_Text": "Yes its just a reaction from a little bit of drugs coming out of the needle and sitting under the skin. Nothing to worry about mate\n\nDisclaimer: Of course non of us are doctors so these are personal opinions and nothing else :-)", "2_Subreddit": "opiates"}], "dwcf9cj": [{"0_Comment Submission": "ECP in the west coast", "1_Text": "Also in SoCal and whats funny is I just picked up like 15 minutes ago and it was exactly this lol. I still consider it tar because I can breathe on it and push it together so its better for smoking, you know one clump instead of a bunch of powder.... So whenever I do get \"powder\" its always like this so I still consider it gunpowder.. What do you east coasters think? Is this ECP?", "2_Subreddit": "opiates"}], "dwcfopb": [{"0_Comment Submission": "How much are you paying for heroin where you're at?", "1_Text": "So finally got hooked up with the actually plug, finally, lol. SoCal prices are as follows, 50 for a 1.5, 30 for 1 and 15 for a .5 Now if I buy in bulk, as in anything over 6 grams, I get the grams for $20 dollars. So 5 for 100, 120 for 6 and 240 for a half piece, BTH all the way all the time, keep in mind I had to be the driver and the drug mule for about 4 years before I finally got it in good with the main plug :-)", "2_Subreddit": "opiates"}], "dwdlfle": [{"0_Comment Submission": "ECP in the west coast", "1_Text": "Wow if it does not bunch back up, then I believe you have straight ecp.. I guess that is good lol. Yeah my stuff runs super clear on foil too..", "2_Subreddit": "opiates"}], "dwgix0g": [{"0_Comment Submission": "hydrocodone acetamin 5-325 MG, norco 5-325?", "1_Text": "Yeah Hydrocodone or \"Norcos\" is what got me started on my active addition. Of course when I started I was taking 10/1000 mg Vicodin's..", "2_Subreddit": "opiates"}], "dwhxqbq": [{"0_Comment Submission": "Is this tar or what? Never seen dope like this the more I breathe on it the more it melts down happy nodding!", "1_Text": "Looks like gunpowder, but if it tastes like coffee might be cut with coffee grounds.. What is your ROA?", "2_Subreddit": "opiates"}], "dwjudmf": [{"0_Comment Submission": "Feels like oxy is becoming impossible to find", "1_Text": "Any people cant seem to figure out why heroin is becoming super in demand, and why people switch from pills to heroin. Just kinda seems like a vicious cycle...", "2_Subreddit": "opiates"}], "dwnb7rx": [{"0_Comment Submission": "What do people call dope where you live?", "1_Text": "SoCal, we call it just straight up \"black\". Because meth and heroin go side by side out here they are refereed to, black and white, dark and clear, up and down, chocolate and sugar and H and M.", "2_Subreddit": "opiates"}], "dwnjf8r": [{"0_Comment Submission": "What do people call dope where you live?", "1_Text": "Yep black and white is actually the most used terms where SWIM is from for heroin and meth. White could be mistaking for coke I guess in come cases, but where SWIM resides coke is way expensive so its heroin and meth that go hand in hand hence black and white :-)\n\nEDIT: I think the replacement is fine, if not moderators please let me know. FYI this is going to become stupid with this rule and I think a lot of people are going to leave this sub Reddit because of this..", "2_Subreddit": "opiates"}], "dwozsur": [{"0_Comment Submission": "Prices in your state", "1_Text": "West Coast 30 a g BTH.", "2_Subreddit": "opiates"}], "dwp0jck": [{"0_Comment Submission": "Prices in your state", "1_Text": "Edited sorry about that :-)", "2_Subreddit": "opiates"}], "dwp0me7": [{"0_Comment Submission": "Prices in your state", "1_Text": "Its really good, I think I'm in one of the cheapest areas on the West Coast, thank god lol. I do have to put it our there that I had to build up years of trust, years of risky my freedom and years of being a drug taxi before I was able to get these prices..", "2_Subreddit": "opiates"}], "dwujbzc": [{"0_Comment Submission": "Need Legal Advice Asap", "1_Text": "I agree with all the above, they are going to ask how you plea, you say NOT GUILTY, they will ask if you have a lawyer or can afford one, no and no, they will appoint you a public defender and start your pre trial anywhere from 45 to 90 days. :-)", "2_Subreddit": "opiates"}], "dwumqto": [{"0_Comment Submission": "Need Legal Advice Asap", "1_Text": "Unless any of us in here are really lawyers, these are just our opinions and probably some of us, not all of us, personal experience. That being said, where I reside we all go to court together, get to listen to all the traffic violations, then misdemeanors then onto the convicts. First time in court its your arraignment where the judge will read off the convictions and asks how do you plead. Not guilty is exactly that, not incriminating yourself and would like to be represented my council and proceed to trial. In my courtroom the public defenders office was in the same building, walk over get representation, schedule the beginning of a pre trial. If I tell the judge I need time to find my own lawyer, he would postpone it till a further date.. But either way I had to enter a plea..\n\nOnce again my  own experience in my own city, hope it helps :-)", "2_Subreddit": "opiates"}]}], "1_submissions": [{"7hlljh": [{"0_Title": "First .2 in a week, NODDING lol.", "1_Text": "lol, I was reading my post over and over trying to figure out what i fucked up :-) Thanks man lol", "2_Subreddit": "opiates"}], "7hwltm": [{"0_Title": "Got that half of g of that bth fire finally, only took 30 minutes to cop lol.", "1_Text": "lol, I was reading my post over and over trying to figure out what i fucked up :-) Thanks man lol", "2_Subreddit": "opiates"}], "7la7gk": [{"0_Title": "Finally lol!", "1_Text": "lol, I was reading my post over and over trying to figure out what i fucked up :-) Thanks man lol", "2_Subreddit": "opiates"}], "7ot49c": [{"0_Title": "Couple Questions?", "1_Text": "lol, I was reading my post over and over trying to figure out what i fucked up :-) Thanks man lol", "2_Subreddit": "opiates"}], "7p3jfs": [{"0_Title": "Hope everybody is doing good!!", "1_Text": "lol, I was reading my post over and over trying to figure out what i fucked up :-) Thanks man lol", "2_Subreddit": "opiates"}], "7p5t0r": [{"0_Title": "Learn something new every day...", "1_Text": "lol, I was reading my post over and over trying to figure out what i fucked up :-) Thanks man lol", "2_Subreddit": "opiates"}], "81vkbt": [{"0_Title": "Good old Saturday.", "1_Text": "lol, I was reading my post over and over trying to figure out what i fucked up :-) Thanks man lol", "2_Subreddit": "opiates"}], "821xzk": [{"0_Title": "Nurse Jackie", "1_Text": "lol, I was reading my post over and over trying to figure out what i fucked up :-) Thanks man lol", "2_Subreddit": "opiates"}], "829886": [{"0_Title": "Happy Monday!!", "1_Text": "lol, I was reading my post over and over trying to figure out what i fucked up :-) Thanks man lol", "2_Subreddit": "opiates"}], "86e0dr": [{"0_Title": "Happy Thursday Everybody!", "1_Text": "lol, I was reading my post over and over trying to figure out what i fucked up :-) Thanks man lol", "2_Subreddit": "opiates"}], "8954er": [{"0_Title": "u/lauferdragon's circle", "1_Text": "lol, I was reading my post over and over trying to figure out what i fucked up :-) Thanks man lol", "2_Subreddit": "CircleofTrust"}]}]}]}