{"Pfloyd90210": [{"0_comments": [{"dw2z8sg": [{"0_Comment Submission": "Passover holiday", "1_Text": "Thanks for the heads up! You are a gentleman and a scholar!", "2_Subreddit": "PoppyTea"}], "dw2zabv": [{"0_Comment Submission": "What is good to buy right now or in the close next future?", "1_Text": "You can pm me if you want. I can lead you in the right direction.", "2_Subreddit": "PoppyTea"}], "dw302qw": [{"0_Comment Submission": "Sn 11/26 T1R1748 question", "1_Text": "I find that seeds feel nothing like oxy or any pharmaceuticals derived from thebaine. I get a good deal of stimulation from pharms like that. Seeds feel like morph pills or heroin to me, with an added effect from the other alkaloids of course. It's hard to say why your feeling like this though. Different seeds all feel different from each other as well. Its also hard to say what alkaloids have an effect, and what one's don't\n\nOur body has 3 types of opioid receptors. Kappa, mu, and Delta receptors. When they are activated each one has it's own effects. Certain opiates/opioids will trigger them in different ways as well. When a chemical effects the Kappa receptor more it wont feel as euphoric and will give you negative side effects that we don't want. It's worth looking into. Its really interesting stuff. I'm doing a paper on it actually. Lol. I hope to post it here when I'm done.", "2_Subreddit": "PoppyTea"}], "dw30bj9": [{"0_Comment Submission": "What is good to buy right now or in the close next future?", "1_Text": "Sorry man. I wasn't ignoring you though, trust me. The pm design on reddit is flawed. I have a hard time seeing what one's are new and all that. I'm gonna send you a message now.", "2_Subreddit": "PoppyTea"}], "dw327j1": [{"0_Comment Submission": "Sn 11/26 T1R1748 question", "1_Text": "Exactly. Real opiates are much better than opioids IMO. They give me more euphoria and don't give me that weird stimulating feeling. It's almost like it feel synthetic and not a natural feeling like morphine/ heroin. Technically heroin is an opioid since its not naturally from the plant but it's not synthesized like other phatms like oxy and methodone is ya know? The natural alkaloids feel way better I think.", "2_Subreddit": "PoppyTea"}], "dw32eqk": [{"0_Comment Submission": "Sn 11/26 T1R1748 question", "1_Text": "Yeah I know what you mean. It might be worth it to try out a new brand or take a short break. Don't you think that your tolerance has a lot to do with it or no? I'd wait until your sick next time you drink it. I bet that way you'll feel much different.\n\nI'm doing a ton of research for that paper though. A lot of the info I'm just learning as of recently. But yeah I find it super interesting too. If only I can turn that into a job of some sort. Lol. Fuck this college bull shit. College is for losers I'm finding out. Lol. Jk", "2_Subreddit": "PoppyTea"}], "dw32s4l": [{"0_Comment Submission": "Australia, Holland, Spain and England! Which country has what I want?", "1_Text": "All countries can have good seeds. As of lately though, the English seeds are what you want generally speaking. They grow pops for pharmaceuticals so if they aren't processed the seeds will at least be active. I've had amazing seeds from Austtalia and Spain though. Pretty much every country. Finding a kosher brand is most important though IMO. They don't process them as much due to religious reasons.", "2_Subreddit": "PoppyTea"}], "dw32xgs": [{"0_Comment Submission": "Sn 11/26 T1R1748 question", "1_Text": "Oh really? Yeah everyone is different. I like tea more but man do I miss those old OC's! Remember those? I used to get the 80s for 30 a piece and it was the greatest. The OP's just aren't the same, although their still good if you use a pill grinder.", "2_Subreddit": "PoppyTea"}], "dw3a3xj": [{"0_Comment Submission": "Itchy as fuck!", "1_Text": "Its my balls. Lol. I don't have VD either so its def the seeds. Maybe some wipes would work for that though. Ha. I just used some bag balm for my face and shit. It def helps. Thanks for the tip!", "2_Subreddit": "PoppyTea"}], "dw3aatq": [{"0_Comment Submission": "Australia, Holland, Spain and England! Which country has what I want?", "1_Text": "Hey man I just like helping people. For all we know the op has medical problems or has chronic pain and needs it. I'd rather have people use PST than heroin or suffer through the pain. People in this life deserve to live comfortably. If he's getting seeds anyways I'd rather have him get something that's worth it and not blow money on garbage ya know? We were all new users at one point. I had to figure shit out on my own and it sucked. Haha", "2_Subreddit": "PoppyTea"}], "dw3acns": [{"0_Comment Submission": "Australia, Holland, Spain and England! Which country has what I want?", "1_Text": "Just be careful man. The seeds online will probably be stronger depending on what seeds you got locally. Have you looked into kratom though? That's worth looking into and its a much better alternative to seeds. Tread lightly bro.", "2_Subreddit": "PoppyTea"}], "dw3f8n5": [{"0_Comment Submission": "Itchy as fuck!", "1_Text": "The seeds that make me itchy like this are the best for me. I find the more itchy I am, the better the buzz. It's just a pain in the ass to deal with sometimes. Haha. I can't complain too much though.", "2_Subreddit": "PoppyTea"}], "dw3f99s": [{"0_Comment Submission": "What is good to buy right now or in the close next future?", "1_Text": "I already sent you a message", "2_Subreddit": "PoppyTea"}], "dw3ff6n": [{"0_Comment Submission": "Australia, Holland, Spain and England! Which country has what I want?", "1_Text": "Its Good to think that way but seeds from the store can be strong too. I've had store seeds just as good as sn. But yeah overall your right. Most store bought seeds aren't even close to the strength as good online seeds. A lot are bunk honestly, although I've gotten fire seeds from my local supermarket before. It was a great find I'll tell ya.", "2_Subreddit": "PoppyTea"}], "dw3fgn0": [{"0_Comment Submission": "Australia, Holland, Spain and England! Which country has what I want?", "1_Text": "What are you ordering? Be careful man. Pm me before you try them. I'll give you some safety tips to follow. Don't wanna baby you or anything man, I just want people to be safe!", "2_Subreddit": "PoppyTea"}], "dw3gfi2": [{"0_Comment Submission": "Herbal Salvations sample pack", "1_Text": "1, 3, 9, 14, 16.", "2_Subreddit": "kratom"}], "dw3ghm5": [{"0_Comment Submission": "Two Full Weeks Off of Subutex", "1_Text": "That's so awesome man! Congrats! I've been using kratom on and off to combat my opiate addiction as well. When I get my next order in I plan on quitting for good. We got this man! We gotta stay strong.\n\nYou said you're 2 weeks in, so at first how much did the kratom take away wd's? 50%, 75%? What dose did you start at? Also when did it start becoming easier, and to where you can start enjoying the positive effects? The first 3 days on kratom it took away 75% of my physical wd's but I was still very lazy and I was in a crummy mood. On the 4th day I started to get some energy back and start enjoying it. Unfortunately I haven't got past the first week but that's gonna change next week!", "2_Subreddit": "kratom"}], "dw8f2zr": [{"0_Comment Submission": "Come join the discord - open for all users, no matter who you are. If you need help installing just ask.", "1_Text": "Does the 1st amendment stand? Lol.", "2_Subreddit": "PoppyTea"}], "dwk4xxk": [{"0_Comment Submission": "A ? For any1 who been in the seed game for 8-15 yrs", "1_Text": "Oh yeah for sure. Back in 09, 2010 I found that the seeds weren't very good then fast forward to 2015 and the seeds were absolute fire. There's still fire seeds available right now but not from the main 2 brands that used to be good.\n\n It all depends on the harvest. The big 3 aren't \"washing\" their seeds, it's just the crops didn't produce as well. I'm hoping in the summer when they get new seeds in that they go back to the way things were. Back when I first started using a lot more brands from grocery stores were actually decent seeds. Now 90% of them suck. However, I feel that recently it's easier to get fire seeds online. It just sucks paying 12 bucks a pound.", "2_Subreddit": "PoppyTea"}], "dwrjgu5": [{"0_Comment Submission": "An oldie but a goodie", "1_Text": "You ever see his pupils? I'd say Mac knows a thing or two about opiates. Ha", "2_Subreddit": "opiates"}], "dwrxwmq": [{"0_Comment Submission": "Is ODing on poppy seed tea painful?", "1_Text": "Fuck yeah. It feels toxic", "2_Subreddit": "PoppyTea"}], "dwwh87u": [{"0_Comment Submission": "Why are there so many Dumb(Lack Self Awareness) People?", "1_Text": "Ms? Monkey scrotum?", "2_Subreddit": "PoppyTea"}], "dwwtoix": [{"0_Comment Submission": "(x-post from the recovery sub) What the hell is going on?", "1_Text": "Yeah bro the kratom you are using is making a world of a difference. It's stronger than a lot of people think. Kratom imo is the best thing for opiate addiction. Congrats on your recovery though man! That's awesome. I'm getting my k today and I plan on making the switch over. I'm gonna stay on it for at least a month. I hope your getting good quality k, and at a good price!", "2_Subreddit": "PoppyTea"}], "dwwu94z": [{"0_Comment Submission": "Are my seeds good for a re-wash if it's been 12 hours? Will they be germy / taste disgusting?", "1_Text": "A second wash at this point won't yield any results. A second wash is only good if you do it right away to collect the water that is left over. After a couple hours all the water that was left over will go into the seeds, and they'll swell up. That's my opinion by im almost positive its right. \n\nLike let's say you do your first wash and use 16oz of water. When you strain it out you won't get all the water back, and an estimate is about 12oz. So if you do a second wash right after this will collect the 4oz left over. A second wash for me is about 25 to 30% as strong as the first which makes sense since your getting 25% of your water back.\n\n After the seeds sit though the water left over will swell up and the 4oz will be trapped sadly. I've done a second wash many hours after my first when I was desperate and it didn't do a thing. I'd say you don't wanna wait longer than an hour. Plus its really disgusting as you alluded and it could leave sick from the bacteria.", "2_Subreddit": "PoppyTea"}], "dwwukh7": [{"0_Comment Submission": "Are my seeds good for a re-wash if it's been 12 hours? Will they be germy / taste disgusting?", "1_Text": "Freezing the seeds or doing a second wash right away and freezing the tea? I find that a second wash doesn't do anything if I wait longer than an hour, even if I freeze the seeds. The leftover water gets trapped in the seeds causing them to swell. IMO I think the water that's leftover from the first wash is the reason why a second wash is worth it. \n\nIf I use 16oz of water I'll only get about 12 back so that makes my second wash about a quarter of the strength. It's def worth it when your sick though you know? I do a second wash right away and store it in a bottle and put it in the fridge or freezer. Idk about you but I think that's the best way.", "2_Subreddit": "PoppyTea"}]}], "1_submissions": [{"7n1hv3": [{"0_Title": "Customers who bought \"this\" also bought.... Lol", "1_Text": "Thanks for the heads up! You are a gentleman and a scholar!", "2_Subreddit": "PoppyTea"}], "7oegi4": [{"0_Title": "Got the day off bitches! Good day for Netflix and Hulu!", "1_Text": "Thanks for the heads up! You are a gentleman and a scholar!", "2_Subreddit": "PoppyTea"}], "7ofsd0": [{"0_Title": "I need to bring something up..", "1_Text": "Thanks for the heads up! You are a gentleman and a scholar!", "2_Subreddit": "PoppyTea"}], "7oidy9": [{"0_Title": "Calling someone retarded is offensive but calling them blind is not?", "1_Text": "Thanks for the heads up! You are a gentleman and a scholar!", "2_Subreddit": "Showerthoughts"}], "7ontsd": [{"0_Title": "Weird way to taper?", "1_Text": "Thanks for the heads up! You are a gentleman and a scholar!", "2_Subreddit": "PoppyTea"}], "7q2kfm": [{"0_Title": "Ice cube and ice T would make a great rap duo, and a great drink", "1_Text": "Thanks for the heads up! You are a gentleman and a scholar!", "2_Subreddit": "Showerthoughts"}], "7qogqq": [{"0_Title": "Remember back in the day?", "1_Text": "Thanks for the heads up! You are a gentleman and a scholar!", "2_Subreddit": "PoppyTea"}], "7qudbp": [{"0_Title": "How do vendors import kratom into the country?", "1_Text": "Thanks for the heads up! You are a gentleman and a scholar!", "2_Subreddit": "kratom"}], "7sdgzb": [{"0_Title": "Weird looks when buying seeds?", "1_Text": "Thanks for the heads up! You are a gentleman and a scholar!", "2_Subreddit": "PoppyTea"}], "7waro1": [{"0_Title": "11 days off of tea with Minimal withdrawals now. Did a dose today", "1_Text": "Thanks for the heads up! You are a gentleman and a scholar!", "2_Subreddit": "PoppyTea"}], "7x5llb": [{"0_Title": "Everyone try to be like Miles Davis and be cool...", "1_Text": "Thanks for the heads up! You are a gentleman and a scholar!", "2_Subreddit": "PoppyTea"}], "7x6yzj": [{"0_Title": "Metizolam questions.", "1_Text": "Thanks for the heads up! You are a gentleman and a scholar!", "2_Subreddit": "researchchemicals"}], "7xbgny": [{"0_Title": "Strange slang words", "1_Text": "Thanks for the heads up! You are a gentleman and a scholar!", "2_Subreddit": "opiates"}], "7z949o": [{"0_Title": "Well... I fucked up", "1_Text": "Thanks for the heads up! You are a gentleman and a scholar!", "2_Subreddit": "PoppyTea"}], "80jbjx": [{"0_Title": "New brand I tried on the river", "1_Text": "Thanks for the heads up! You are a gentleman and a scholar!", "2_Subreddit": "PoppyTea"}], "80k2fr": [{"0_Title": "New brand I tried on the river", "1_Text": "Thanks for the heads up! You are a gentleman and a scholar!", "2_Subreddit": "PoppyTea"}], "80lj7x": [{"0_Title": "Is Canopy not as popular anymore?", "1_Text": "Thanks for the heads up! You are a gentleman and a scholar!", "2_Subreddit": "kratom"}], "82kwjh": [{"0_Title": "Antidepressants and tea", "1_Text": "Thanks for the heads up! You are a gentleman and a scholar!", "2_Subreddit": "PoppyTea"}], "82lqh9": [{"0_Title": "Opiates and antidepressants", "1_Text": "Thanks for the heads up! You are a gentleman and a scholar!", "2_Subreddit": "opiates"}], "8406on": [{"0_Title": "Suffering through WD? Get some kratom", "1_Text": "Thanks for the heads up! You are a gentleman and a scholar!", "2_Subreddit": "PoppyTea"}], "840a50": [{"0_Title": "Sand in my bag of kratom?", "1_Text": "Thanks for the heads up! You are a gentleman and a scholar!", "2_Subreddit": "kratom"}], "84arrc": [{"0_Title": "It would be nice for some competition.", "1_Text": "Thanks for the heads up! You are a gentleman and a scholar!", "2_Subreddit": "PoppyTea"}], "867qfc": [{"0_Title": "Itchy as fuck!", "1_Text": "Thanks for the heads up! You are a gentleman and a scholar!", "2_Subreddit": "PoppyTea"}], "869zkc": [{"0_Title": "Herbal Salvations sample pack", "1_Text": "Thanks for the heads up! You are a gentleman and a scholar!", "2_Subreddit": "kratom"}], "89jn8x": [{"0_Title": "(F)uck (T)he Fast(l)ane. I gotta slow down.", "1_Text": "Thanks for the heads up! You are a gentleman and a scholar!", "2_Subreddit": "PoppyTea"}]}]}]}