{"High_and_Lonely": [{"0_comments": [{"dox4114": [{"0_Comment Submission": "HMB while I do the splits and down this bottle", "1_Text": "Thank you for this advice I will remain single", "2_Subreddit": "holdmybeer"}], "dox83of": [{"0_Comment Submission": "HMB while I do the splits and down this bottle", "1_Text": "tell me how you really feel", "2_Subreddit": "holdmybeer"}], "dp8pnzu": [{"0_Comment Submission": "I saw this woman at last year's Chicago marathon. It made me smile huge. So this year, I made her my sign. And saw her again with her same sign! Her name is Rose Stortzman and she's got what it takes!", "1_Text": "maybe they're giving you the cardboard because they think you need a place to sleep", "2_Subreddit": "MadeMeSmile"}], "dpt3z2b": [{"0_Comment Submission": "Iman Shumpert keeping it real after his 0 Pts, 0 Asts, 5 TOs, 4 Rebs, 3 fouls in 20 minutes performance against the Knicks", "1_Text": "HAHAHA this makes me so happy for some reason", "2_Subreddit": "nba"}], "dqa87lt": [{"0_Comment Submission": "Have you ever been to an NBA game? How was it?", "1_Text": "I went to a Pistons - Lakers game with my dad back in probably 2003/2004, I don't remember much about the gameplay other than it wasn't a very high energy game, but it was close at least.  I was about 12 or 13 and my family didn't get to do a lot of \"expensive\" things when I was younger, and going to that game is still a really good memory.  I still have my corny #8 Kobe bobblehead I got in the giftshop.  \n\nHe and I are planning on going to another game this spring, and I hope it will be just as good.  We don't bond over much anymore, he and I are both silent types, but sometimes it's nice to do something with your old man like the good olds.  Love basketball games.", "2_Subreddit": "nba"}], "dro4dej": [{"0_Comment Submission": "2017: The Year Nintendo’s Messaging Finally Got it Right - HardcoreGamer", "1_Text": "True, except I wish 2017 was the year Nintendo got *actual* messaging right.  You know, like messaging friends on your friends list?", "2_Subreddit": "NintendoSwitch"}], "droe4zo": [{"0_Comment Submission": "Disney isn't ruining Star Wars, but the internet might be.", "1_Text": "If you ask a question, don't get mad if the responses \"bring the brigade out.\"  People are allowed to dislike something just as much as you appear to love it.  **Don't take it so personally** that a large part of a fanbase disagrees with you on some things. \n\nedit:  and also, you're sort of asking for the internet to stop having open discussion on a movie franchise.  Be realistic.", "2_Subreddit": "StarWars"}], "dspulik": [{"0_Comment Submission": "The Cavs enter tonight's game vs the Warriors on a 13-game winning streak at home", "1_Text": "*Takes deep breath in thru nose*  \n\nAAhhhh what a great day to break a streak", "2_Subreddit": "nba"}], "dspvz3c": [{"0_Comment Submission": "Triple Point: liquid freezes and boils at the same time", "1_Text": "So let me understand this:  in highschool, you thought that you would achieve *boiling* and *freezing* of water at the same time **just by putting it on the stove?**  You thought that putting water on a stove could somehow freeze the water...?", "2_Subreddit": "educationalgifs"}], "duk0np4": [{"0_Comment Submission": "This color sorting machine", "1_Text": "i legitimately feel bad for people who's first assumption was not that it's computer-rendered.  There will be infinitely many ads and commercials in the near future that take advantage of people who immediately believe what they see.", "2_Subreddit": "oddlysatisfying"}], "dvdznhd": [{"0_Comment Submission": "Steph casually banking in a shot from behind his back 🐐", "1_Text": "Mark it here, if steph makes one of these in-game, I will post a video of myself eating a SC #30 jersey.", "2_Subreddit": "nba"}], "dvftul5": [{"0_Comment Submission": "REMINDER: Smash WiiU/3DS took only 2.5 years to develop", "1_Text": "I could see it being a Mario Kart 8 Deluxe situation, where characters like Link have been updated to match BOTW but the \"core\" of WiiU smash is still built on.  I hope its a fully new title.", "2_Subreddit": "NintendoSwitch"}], "dvgbl3n": [{"0_Comment Submission": "[OC] How rare are true 7 footers in the NBA, what are the odds of you being 7 feet or taller and becoming an NBA player?:", "1_Text": "While hissing and shedding his skin", "2_Subreddit": "nba"}], "dvk8qul": [{"0_Comment Submission": "Jokic with the most casual score of all time", "1_Text": "Jokic is ALWAYS playing ymca afternoon casual ball.", "2_Subreddit": "nba"}], "dw1t7w2": [{"0_Comment Submission": "A death row inmate's dementia means he can't remember the murder he committed. According to Locke, he is not *now* morally responsible for that act, or even the same person who committed it", "1_Text": "Am I allowed to weigh in with an opinion?  I have epilepsy that sometimes erases the past few days of my memory, that doesn't absolve me of what I did during those days though...", "2_Subreddit": "philosophy"}], "dw1wvuj": [{"0_Comment Submission": "A death row inmate's dementia means he can't remember the murder he committed. According to Locke, he is not *now* morally responsible for that act, or even the same person who committed it", "1_Text": "I'm having a hard time seeing how it's different than if someone lost their memory due to alcohol", "2_Subreddit": "philosophy"}], "dw56rm8": [{"0_Comment Submission": "Looking for: NOT-Fortnite/PUBG, single player, that has potential for 10s (or 100s) of hours", "1_Text": "I will also note that a main reason I’m looking at Monster Hunter World Unite is because it’s pay-once-and-done, and it’s a direct 100% clone of a PSP release (some say even better than the PSP version).  I hate MTXs that block game progress.", "2_Subreddit": "iosgaming"}], "dw584zv": [{"0_Comment Submission": "Looking for: NOT-Fortnite/PUBG, single player, that has potential for 10s (or 100s) of hours", "1_Text": "Let's say, hypothetically, I had weird toe-thumbs that are huge (hypothetically, of course) would the controls be too difficult?  I'm not trying to bring a controller with me everywhere, the ONLY gripe i see in reviews is the controls can be tough to accurately hit", "2_Subreddit": "iosgaming"}], "dw5emgo": [{"0_Comment Submission": "Looking for: NOT-Fortnite/PUBG, single player, that has potential for 10s (or 100s) of hours", "1_Text": "i've never played a text based game like this one and i'm intrigued, thanks!", "2_Subreddit": "iosgaming"}], "dw5exsr": [{"0_Comment Submission": "Looking for: NOT-Fortnite/PUBG, single player, that has potential for 10s (or 100s) of hours", "1_Text": "i'm not in asia", "2_Subreddit": "iosgaming"}], "dw5f7f3": [{"0_Comment Submission": "Looking for: NOT-Fortnite/PUBG, single player, that has potential for 10s (or 100s) of hours", "1_Text": "This sounds awesome!  Thank you,  definitely downloading right now", "2_Subreddit": "iosgaming"}], "dw9hboq": [{"0_Comment Submission": "[NRL] Chip, chase, flick pass, try!", "1_Text": "Not normally a rugby watcher, but are those ads overlaid digitally onto the pitch?", "2_Subreddit": "sports"}], "dwildpx": [{"0_Comment Submission": "Breaking down Westbrooks last 5 possessions of the OKC-Spurs game:", "1_Text": "nephew.jpg", "2_Subreddit": "nba"}], "dwuydps": [{"0_Comment Submission": "[SI - Jenkins] How Damian Lillard Redefined the Meaning of 'Dame Time'", "1_Text": "Seriously, didn’t he “define” it by creating the term?  Any “redefinition” by the creator is just the definition.", "2_Subreddit": "nba"}], "dwwz0u8": [{"0_Comment Submission": "going to end up homeless soon..any tips?", "1_Text": "This is what I would do:  I would probably head to a McDonald’s/cafe/anywhere with WiFi and a 24 hour schedule.  I would save as much of that money as possible, and NOT take those bars right now, because you might do something you regret (like spending cash or whatever).  Maybe reach out to friends to ask if you can sleep on their floor for a while, and meanwhile put out job applications everywhere you can.  It’s MUCH easier to get a job before you’ve spent 3 months outside on the streets.  And I would try to stay positive, even though it’s a shitty situation and it’s hard.  If you try to keep going you will find this can be just a temporary phase, but if you give up now you are guaranteeing your situation.", "2_Subreddit": "opiates"}]}], "1_submissions": [{"81vipz": [{"0_Title": "If you didn’t give birth, you are a useless scum bag", "1_Text": "Thank you for this advice I will remain single", "2_Subreddit": "gatekeeping"}], "86hqqo": [{"0_Title": "Looking for: NOT-Fortnite/PUBG, single player, that has potential for 10s (or 100s) of hours", "1_Text": "Thank you for this advice I will remain single", "2_Subreddit": "iosgaming"}], "8993zh": [{"0_Title": "[Pacific Time Zone] 26/M; playing Overwatch and Far Cry 5 Campaign coop (have decent steam library though)", "1_Text": "Thank you for this advice I will remain single", "2_Subreddit": "GamerPals"}], "8ae4s1": [{"0_Title": "[Far Cry 5] Weird bouncey truck spawn glitch", "1_Text": "Thank you for this advice I will remain single", "2_Subreddit": "GamePhysics"}], "8aem73": [{"0_Title": "26 [M4R] Looking for video game friends (PC)", "1_Text": "Thank you for this advice I will remain single", "2_Subreddit": "r4r"}], "8afs72": [{"0_Title": "[PC, Pacific Time] Far Cry 5 coop?", "1_Text": "Thank you for this advice I will remain single", "2_Subreddit": "GamerPals"}]}]}]}