{"5y64r1t3": [{"0_comments": [{"dwns1h0": [{"0_Comment Submission": "Anyone else literally not *able* to black out?", "1_Text": "I’d pass out. That’s what I’m saying. Y’all in here calling me autistic and shit.", "2_Subreddit": "benzodiazepines"}], "dwnsc11": [{"0_Comment Submission": "Anyone else literally not *able* to black out?", "1_Text": "What are you confused too? I’m not sure what the fuck these other fools thought I was saying, All I said was I can take a lot of benzos and stay awake but I just pass the fuck out before I black out, is there something wrong with that?", "2_Subreddit": "benzodiazepines"}], "dwnsjy9": [{"0_Comment Submission": "Anyone else literally not *able* to black out?", "1_Text": "Lol I tried to reply to your other comment but you deleted. I didn’t even like state an opinion or anything I’m not sure what y’all think you’re here for", "2_Subreddit": "benzodiazepines"}], "dwnsq84": [{"0_Comment Submission": "How do I tell if seeds are washed or not?", "1_Text": "Yeah, next time you don’t even wanna shake it for that long actually. 300g is still way, way too much, unless you’re coming over from a bad habit with something else. I’d start with no more than 40 if you get your hands on something better fr", "2_Subreddit": "PoppyTea"}], "dwntcl3": [{"0_Comment Submission": "How do I tell if seeds are washed or not?", "1_Text": "Yeah I’ve seen people recommend shit like a pound it’s crazy, I’m sure people have gotten used to weak seeds and whatnot but you gotta treat em at first like they’re strong, definitely before going 100+. Good seeds are powerful af", "2_Subreddit": "PoppyTea"}], "dwnub8n": [{"0_Comment Submission": "Anyone else literally not *able* to black out?", "1_Text": "I have lol, I’ve overdosed several times too. Would that be the same mechanism? I figured I was just asleep/dead", "2_Subreddit": "benzodiazepines"}], "dwoyjkm": [{"0_Comment Submission": "Know how to Inject Yourself", "1_Text": "One of these days I’m gonna get it. I’ve had a daily IV habit in the past at times, when I had someone around who could hit me. I guess I have “rollers”, idk, I’ve been told I have “rockstar veins” by people who then had trouble hitting me as well. I’ve sat with a rig poking myself over and over, anytime I’ve registered i lose it right away and end up pushing and missing a little before I just stop. Maybe I should practice with something cheaper than dope", "2_Subreddit": "opiates"}], "dwoyydy": [{"0_Comment Submission": "Know how to Inject Yourself", "1_Text": "Yeah I should try to pump them up a bit next time. I have very visible veins tho. I’m also a bit squeamish about needles, which doesn’t help.", "2_Subreddit": "opiates"}], "dwrtfwg": [{"0_Comment Submission": "Making moves with the plug", "1_Text": "Good tar comes as “gunpowder”, which is why you come across wannabe gunpowder that stays powdered bc it’s cut to shit. It makes sense for smuggling, the water weight on that scale would account for enough to make it worth it. The best tar I’ve had we’re powder, and my guy was buying  a piece at a time. \n\nGod that was a fuckin annoying situation, this guy was middling for me and me and his plug would drive an hour from the same place to come meet him, but the plug wouldn’t meet me, or so he said you know.", "2_Subreddit": "opiates"}], "dws4pdu": [{"0_Comment Submission": "Making moves with the plug", "1_Text": "Yeah some people call it “huff” cause a bit of moisture and it turns to tar immediately. You can tell when it’s cut too much, you huff on it and see separate balls of tar and the rest stays powder.", "2_Subreddit": "opiates"}], "dwv6046": [{"0_Comment Submission": "The ultimate Fentanyl and Analog thread", "1_Text": "Lol yeah take it from me. I actually managed to use it to quit heroin for a couple months last year, cause I got a quarter and switched over to it, ramped my tolerance up real quick until I got to where I couldn’t sniff any more cause my nose was so fucked up on both sides. I obv could’ve figured out a way to stay well until it cleared up, but it was so disgusting and painful it helped me get in the right mindset that I just quit, and the WD’s only lasted a day or two.", "2_Subreddit": "fentanyl"}], "dwvj4xq": [{"0_Comment Submission": "Barsbarsbars", "1_Text": "Why bars?", "2_Subreddit": "benzodiazepines"}], "dwvj5wc": [{"0_Comment Submission": "My current baby stash, 2 grams coke, 10 1mg alprazolam, 1 sheet 100ug ALD-52, 2.5 grams 4-Aco-Dmt, and one big ol bag of mimosa hostilis (havent had time to extract yet)", "1_Text": "Lemme get a bump pls", "2_Subreddit": "DrugStashes"}], "dwvkle0": [{"0_Comment Submission": "has anyone heard/had experience with so called \"red hand\" ecstasy?", "1_Text": "You check pillreports? Try any synyonyms (palm, high five, etc)? \n\nEven then, good pills often get mimicked. Can’t know what you have unless you test it/get it tested, even then there could easily be unidentified active ingredients. And you can’t really know the dosage, even if you test others from the same batch. \n\nX pills are just kinda like that. It’s definitely sketchy as all hell but usually you gotta just ask around for someone else that’s tried that batch, use a home reagent test kit to see if you can confirm the presence of MD/speed/whatever. Most X pills have caffeine, some amt of amps, and some amt of mdxx, usually nothing that’ll kill you but you never know. Years ago I got some off a guy outside a rave. He offered k too and I told him I’d try and find him later for that, so he knew I was down w ket. Hour later my friend (who started w 3 pills) is sitting on the floor halfway in a khole. I only had one but there was def mdma and ket in there.", "2_Subreddit": "askdrugs"}], "dwvkw2h": [{"0_Comment Submission": "Barsbarsbars", "1_Text": "Ha that’s one theory for sure lol, I was thinkin they just wasted their time looking at dumb shit on their phone etc, two aren’t mutually exclusive anyway\n\nSide note: who the hell downvotes a comment like this? Ppl are mad sensitive takin everything as insults or s/t, idek", "2_Subreddit": "benzodiazepines"}], "dwvlv4l": [{"0_Comment Submission": "(x-post from the recovery sub) What the hell is going on?", "1_Text": "Well that’s a pretty low dose of lope but remember, lope *does* cross BBB, and kratom is an opioid too. IME even a really low dose of any opioid keeps me comparatively well, even with a solid habit. Of course I don’t feel high or even that well but when I’m goin thru it it makes a *huge* difference.\n\nDef sounds like you’re just a bit lucky, too. There are all kinds of weird physiological and mental conditions that have an effect on this, idk how your WD’s usually are but you could’ve just got lucky this time. Or maybe you’re just lucky in general and it’ll always be like this. Maybe the kindling effect will still apply and it’ll get worse if you keep doing it. Who knows, I’d be curious for a follow up, like let us know how you’re feelin in a few days, or next time you WD (if you’re not quitting for good. If you are, Godspeed!)", "2_Subreddit": "PoppyTea"}], "dwvo1ia": [{"0_Comment Submission": "HAPPY for once !", "1_Text": "Yeah I’m really interested in the whole “less is more” part of bupe therapy. I’m on 8mg/day, usually taken at once sublingually, or insufflated over an hour or so. Keeps me so well, and really helps with cravings, which surprised me cause I’m really hardheaded, could never be hypnotized or anything like that, never notice subtle drug effects, but bupe means the difference b/w me obsessing over opis constantly and doin what I can to try to get some money together to try to get a little bit less sick. Less sick, not high, not buzzed. Hell, couple times a year I might even nod out, at least get a little buzz. \n\nWould love to take it down to 2mg, or even a little less. I still use, just not every day, too, so I figure that would keep my tolerance low and make it less difficult/expensive when I do get high. Plus of course that way I could stockpile 3 months worth every month which would add up real nice and could save me a bunch of money. I get Mylan brand subutex from CVS in the sealed mfg bottle too so if I find buyers I could get some real cash even. Ha, I’m scheming now, but seriously it seems like tapering down to 2 wouldn’t be too bad, and there seem to be so many benefits to being on a lower dose.", "2_Subreddit": "OpiatesRecovery"}], "dwvo9j3": [{"0_Comment Submission": "My current baby stash, 2 grams coke, 10 1mg alprazolam, 1 sheet 100ug ALD-52, 2.5 grams 4-Aco-Dmt, and one big ol bag of mimosa hostilis (havent had time to extract yet)", "1_Text": "Bet thanks man preciate that, lemme jus refill my 3D cocaine cartridge on my printer first", "2_Subreddit": "DrugStashes"}], "dwvoui6": [{"0_Comment Submission": "Barsbarsbars", "1_Text": "Yeah I’ve noticed that about this sub sometimes too. I made a thread a few days ago about how I never, ever black out (for w/e reason, I do dumb shit but I remember all of it) and this one comment thread got so nasty with these two guys calling me autistic and shit. Mods threatened all of us w the banhammer too cause it looked like I was participating. \n\nWonder why that is, guess maybe just cause lower inhibitions make ppl speak their mind more. Sucks tho cause it’s def not a bad sub and I don’t wanna have to worry about shit like that. I still have no idea what those guys were on about but they were just being straight mean about it. Like they thought I was lying for attention or something I think, which is just weird to me.\n\nAnd lol of course a single downvote is different but it still seems like such an inconsequential thing to take issue with. 😄", "2_Subreddit": "benzodiazepines"}], "dwvpd0w": [{"0_Comment Submission": "has anyone heard/had experience with so called \"red hand\" ecstasy?", "1_Text": "Think you mean 220mg hehe. I’ve seen pills advertised at that dose and I’m sure they exist but it’s likely a “doublestack” situation where ofc you’re not getting .2 but they also prob do hit. Unless you got em off a trusted vendor, then they might well be two points. Either way you prob don’t wanna end up accidentally coming up on a whole gram at once (best to stagger doses like that hehe) so I’d treat em like they’re strong, start with one, even a half, I’m sure you know the drill. And enjoy!", "2_Subreddit": "askdrugs"}], "dwvr9as": [{"0_Comment Submission": "HAPPY for once !", "1_Text": "Thanks for the advice 🙏 I’m def not going *off* them anytime soon. I got on them bc last time I withdrew fully I told myself if I fucked up and seriously relapsed again I had to get on subs. Made it a couple months after that before I started chipping like a dumbass Bc I was stressed and depressed from smoking a half gram of meth a day and living w a crazy, abusive girlfriend. Spent like 6 more months strung out with her, of course ended up pretty much supporting her and somehow keeping us both well most of the time (ofc she’d tell you she pulled her weight, lmaokmspls). \n\nI was in a bad situation (kept getting ripped off on top of all that) so when my family found out and had a lil intervention for me I said fuck it and got on bupe. It seriously helped me so much, I was stuck in a really shitty cycle and was somehow able to break it and mostly stick to my prescription. I’ve quit a bunch of different ways without maintenance, and it’s worked ok at times, but my cravings are so overwhelming i really do need *something* to satisfy them a little bit. Maybe that’ll change someday but I think it’s more likely I’d have to switch to something heavier like methadone tbh. I don’t rly have any side effects from the bupe, it just mostly satisfies my basic need for *something* on my opi receptors.\n\nIt really does work for depression, which is one of the primary roots of the problems i self medicate for. I guess it’s not even self medicating anymore now that I have a prescription. I’ve tried different approaches to medication and therapy and haven’t had much luck, but cannabis + buprenorphine is one of the most effective (and simple!) combos for me for sure. It’s not ideal, I really would like to be clean tbh, but I’ve tortured myself unnecessarily to meet that goal for too long, and now I’m actually a little bit happy, for like the first time ever.", "2_Subreddit": "OpiatesRecovery"}], "dwvs5ml": [{"0_Comment Submission": "Barsbarsbars", "1_Text": "Yeah idk like I said it’s usually totally chill in here but I’ve def had a couple weird interactions too. Can obv happen anywhere but I’d hate to see it become a trend", "2_Subreddit": "benzodiazepines"}], "dww6s6e": [{"0_Comment Submission": "[W2C] High End Dog accessories", "1_Text": "My dogs super photogenic and like 1 day after I got him my phone was already full of pics of him so I made one for him and now he’s 3 and he has like 300 followers incl some artists like Hannah diamond that don’t even follow me lmao. It’s kind of like subverting the whole concept tho, like quasi-satirical, but it’s also an earnest thing cause I love my dog and ppl like seeing his pics. I write captions for him with hashtags about doing yoga on the beach and shit like he’s an IG fitness model or something.", "2_Subreddit": "DesignerReps"}], "dww8s7g": [{"0_Comment Submission": "Looking for dog clothes lol", "1_Text": "Ha yeah I’ve actually seen that page too, pretty cute but a lot of the reps are cheaper and the parody ones are cute but they kinda remind me of like Brian lichtenburg/freak city BS when that was all the rage 8 years ago or whatever. But yeah some of them are cute maybe I’ll buy him something from there 😄", "2_Subreddit": "FashionReps"}], "dwwa1za": [{"0_Comment Submission": "Looking for dog clothes lol", "1_Text": "Oh shit I did that with some other links and I even had that post open before but I guess I didn’t click on their store but I think that’s the one I saw before! Thanks!", "2_Subreddit": "FashionReps"}]}], "1_submissions": [{"7n7uzp": [{"0_Title": "kratom + codeine? dxm? halp", "1_Text": "I’d pass out. That’s what I’m saying. Y’all in here calling me autistic and shit.", "2_Subreddit": "opiates"}], "7p4ea4": [{"0_Title": "WD meds turn up/intervention", "1_Text": "I’d pass out. That’s what I’m saying. Y’all in here calling me autistic and shit.", "2_Subreddit": "opiates"}], "7prlrp": [{"0_Title": "It's been ~8 days w/o dope/fent. First day w/ no sub. Trying to figure out where to go from here...", "1_Text": "I’d pass out. That’s what I’m saying. Y’all in here calling me autistic and shit.", "2_Subreddit": "opiates"}], "7r7w0k": [{"0_Title": "My girl and I been thru crazy meth addiction all summer then months more on dope too, just finally got clean, I’m on subs, was so ready for us to just be happy and spend some quality time... then I get dumped, second day on subs. Lol", "1_Text": "I’d pass out. That’s what I’m saying. Y’all in here calling me autistic and shit.", "2_Subreddit": "opiates"}], "7rf653": [{"0_Title": "My-renew MAF = valeryl-f?", "1_Text": "I’d pass out. That’s what I’m saying. Y’all in here calling me autistic and shit.", "2_Subreddit": "fentanyl"}], "7rfzj6": [{"0_Title": "Oh hey y’all", "1_Text": "I’d pass out. That’s what I’m saying. Y’all in here calling me autistic and shit.", "2_Subreddit": "BPDlovedones"}], "7rhfnw": [{"0_Title": "Dumped by pwBPD gf, holy fuck", "1_Text": "I’d pass out. That’s what I’m saying. Y’all in here calling me autistic and shit.", "2_Subreddit": "BPD"}], "7rmftg": [{"0_Title": "Help me learn how to use and abuse by new subutex prescription", "1_Text": "I’d pass out. That’s what I’m saying. Y’all in here calling me autistic and shit.", "2_Subreddit": "opiates"}], "7v58up": [{"0_Title": "Got clean for my gf.. and my mom to a lesser extent. I go on sub and got dumped immediately. Been smoking crack and shit but no dope whatsoever, but I’ve been planning relapses since day 1", "1_Text": "I’d pass out. That’s what I’m saying. Y’all in here calling me autistic and shit.", "2_Subreddit": "OpiatesRecovery"}], "7v5o4w": [{"0_Title": "Piss (I assume) test on the 12th, been taking etizolam, I can’t take anymore tonight huh I gotta flush my system out", "1_Text": "I’d pass out. That’s what I’m saying. Y’all in here calling me autistic and shit.", "2_Subreddit": "opiates"}], "7xt6wa": [{"0_Title": "When?", "1_Text": "I’d pass out. That’s what I’m saying. Y’all in here calling me autistic and shit.", "2_Subreddit": "FashionReps"}], "7y2swh": [{"0_Title": "Getting high around sub doses. Help me not go into PWD or anything like that 💞", "1_Text": "I’d pass out. That’s what I’m saying. Y’all in here calling me autistic and shit.", "2_Subreddit": "opiates"}], "7y4h7l": [{"0_Title": "My skin has a pretty serious reaction with nickel and some other metals, I assume most of these reps are made out of cheap shitty metal? Are they ever not? Is there any way to tell? I mostly wear sterling silver for jewelry but I can do surgical stainless steel usually", "1_Text": "I’d pass out. That’s what I’m saying. Y’all in here calling me autistic and shit.", "2_Subreddit": "RepTime"}], "7yalyh": [{"0_Title": "Smoking crack on/in Weed", "1_Text": "I’d pass out. That’s what I’m saying. Y’all in here calling me autistic and shit.", "2_Subreddit": "opiates"}], "7zng80": [{"0_Title": "Crack", "1_Text": "I’d pass out. That’s what I’m saying. Y’all in here calling me autistic and shit.", "2_Subreddit": "opiates"}], "823ulj": [{"0_Title": "She had a rivalry with my dog lol", "1_Text": "I’d pass out. That’s what I’m saying. Y’all in here calling me autistic and shit.", "2_Subreddit": "BPDlovedones"}], "84090f": [{"0_Title": "How long after tapering off til I can take more benzos?", "1_Text": "I’d pass out. That’s what I’m saying. Y’all in here calling me autistic and shit.", "2_Subreddit": "benzodiazepines"}], "8421rf": [{"0_Title": "[W2C] Come Tees Duppy Painted Jeans. Did anyone ever rep these?", "1_Text": "I’d pass out. That’s what I’m saying. Y’all in here calling me autistic and shit.", "2_Subreddit": "DesignerReps"}], "842ezy": [{"0_Title": "[W2C] my fav fantasy bootleg piece lol, 160 on kickwho, anyone know anyone w these for cheaper? I’ll rock em lol", "1_Text": "I’d pass out. That’s what I’m saying. Y’all in here calling me autistic and shit.", "2_Subreddit": "FashionReps"}], "842h5y": [{"0_Title": "Hell yaaa got .1 fent comin to me, hopefully within a week, $0.50/mg 😫 thank JJ", "1_Text": "I’d pass out. That’s what I’m saying. Y’all in here calling me autistic and shit.", "2_Subreddit": "opiates"}], "85qupj": [{"0_Title": "Best bet off the wall these days?", "1_Text": "I’d pass out. That’s what I’m saying. Y’all in here calling me autistic and shit.", "2_Subreddit": "PoppyTea"}], "85wb8y": [{"0_Title": "Question about going to the ER...", "1_Text": "I’d pass out. That’s what I’m saying. Y’all in here calling me autistic and shit.", "2_Subreddit": "benzodiazepines"}], "88sitp": [{"0_Title": "Hate when people say they’ve been up for X days but they’ve really been napping/microsleeping", "1_Text": "I’d pass out. That’s what I’m saying. Y’all in here calling me autistic and shit.", "2_Subreddit": "Stims"}], "892mfy": [{"0_Title": "Superbuy refund problems", "1_Text": "I’d pass out. That’s what I’m saying. Y’all in here calling me autistic and shit.", "2_Subreddit": "FashionReps"}], "8a6c15": [{"0_Title": "Looking for dog clothes lol", "1_Text": "I’d pass out. That’s what I’m saying. Y’all in here calling me autistic and shit.", "2_Subreddit": "FashionReps"}]}]}]}