{"420illad": [{"0_comments": [{"dub3wde": [{"0_Comment Submission": "OD for the first time.", "1_Text": "Sorry to hear that :(", "2_Subreddit": "opiates"}], "dub5439": [{"0_Comment Submission": "OD for the first time.", "1_Text": "OOh ok yeah I got ya", "2_Subreddit": "opiates"}], "dubo3q8": [{"0_Comment Submission": "New to the app and looking for advice, What is the downside to years of sniffing pills", "1_Text": "What is the proper way to snort to avoid it getting into the lungs?  Slow/not deep?", "2_Subreddit": "opiates"}], "dubo6k9": [{"0_Comment Submission": "DEAR MODS; Clean Subreddit?", "1_Text": "Yeah /r/opiatesrecovery is great!  Kinda depresses me I haven't been on there in forever", "2_Subreddit": "opiates"}], "dupt9e9": [{"0_Comment Submission": "The streets of Philly", "1_Text": "Do you live near the Gallery/Market East ?  There is a methadone clinic there..", "2_Subreddit": "IASIP"}], "duptbd7": [{"0_Comment Submission": "The streets of Philly", "1_Text": "Methadone clinic near the Gallery", "2_Subreddit": "IASIP"}], "dupyadd": [{"0_Comment Submission": "TIL the Catholic Church has accepted Darwinian evolution as compatible with Christianity since 1950.", "1_Text": "Me too--introduced to Harry Potter by my 6th grade Catholic school teacher before it was really known.", "2_Subreddit": "todayilearned"}], "dvxz9bt": [{"0_Comment Submission": "Literally every single problem of opiate use stems from it's illegality.", "1_Text": "You are blaming the wrong people.  Many pain patients have also overdosed on heroin because they have been unable to get their meds.  The War on \"Drugs\" is a disgusting lie that has destroyed countless lives.", "2_Subreddit": "opiates"}], "dwdlpkq": [{"0_Comment Submission": "This is me making fun of those memes where people label their money for specific shit and try to show it off but also I’m sure some of you can actually relate to this so", "1_Text": "Lol this is me so bad.  Got $2 until Thursday but at least I have cigs and some bags lol", "2_Subreddit": "opiates"}], "dwdm6cn": [{"0_Comment Submission": "The best part of waking up is pandas in the butt!... and a little oxy on the side to add that stimulating buzz", "1_Text": "Lol how many of those speedway cards do you have?  The cashier gives me one everyday like she doesn't remember me.", "2_Subreddit": "opiates"}], "dwf6l1i": [{"0_Comment Submission": "They prevalent in you area ? (Are in my city)", "1_Text": "I think I'm in the same city--of brotherly love hah.  I sniff dope now but was doing 30s for 3 years before and seems like As and Ms are most common.  Price was always 25-and from one guy I knew 20.  But lately I heard that everyone has moved up to $30 which is bullshit.", "2_Subreddit": "opiates"}], "dwf6qz6": [{"0_Comment Submission": "Pray JJ helps me", "1_Text": "I have yet to meet this guy--but hope you find him!", "2_Subreddit": "opiates"}], "dwf6wud": [{"0_Comment Submission": "1 day without I'm seething", "1_Text": "Im in the same boat--called out of work today because I only had one bag left--I thought I was going to be dry since Monday but luckily got a front yesterday.  Today I have some schemes that hopefully work out and tomorrow is pay day thank God.", "2_Subreddit": "opiates"}], "dwj3y0r": [{"0_Comment Submission": "Robbed my connect", "1_Text": "Did you only come clean because your other connect walked off with $300?  Lol", "2_Subreddit": "opiates"}], "dwj49rd": [{"0_Comment Submission": "\"It's happening. We're getting pulled over.\"", "1_Text": "One of the best feelings is seeing those cop lights speed past you when you think you're being pulled over lol.", "2_Subreddit": "opiates"}], "dwj4i6e": [{"0_Comment Submission": "Trying to understand bioavailability..", "1_Text": "Makes me sad those poor opanas are not realizing their true potential lol", "2_Subreddit": "opiates"}], "dwjbh3a": [{"0_Comment Submission": "Why is Getting Help So Hard", "1_Text": "I do have private insurance though hah!  She said they only take medicaid.   Thanks though I really appreciate the offer--I will write soon.", "2_Subreddit": "opiates"}], "dwjfps6": [{"0_Comment Submission": "Why is Getting Help So Hard", "1_Text": "Yeah that's what's this place is plus the other shit.   I'll probably call the number for substance abuse on the back of my insurance card and see whatsup.  Thanks tho", "2_Subreddit": "opiates"}], "dwjiy8y": [{"0_Comment Submission": "Why is Getting Help So Hard", "1_Text": "Wow really?  That'd be nice-I actually do remember talking with someone on here about a place like that in Florida and I think he said they also cover airfare.  Thanks again-I just have to do the research", "2_Subreddit": "opiates"}], "dwjjbgz": [{"0_Comment Submission": "Robbed my connect", "1_Text": "Ahh yeah gotcha.  I have a friend that has beat ppl (but I think pays eventually ) and they still do business with him lol.", "2_Subreddit": "opiates"}], "dwl3all": [{"0_Comment Submission": "Epidemic...I feel like our government (US) couldn't of made the epidemic much worse if they tried", "1_Text": "lol people like you are funny.  You'd rather raise your children in what we have now with record number of drug overdoses and massive drug markets that are violent and push dangerous substances-young kids find it easier to obtain illegal drugs than alcohol today since dealers don't ID. \n\n Not only is prohibition not the norm  (\"drugs\" have been legal for 99.9% of human existence-the war on \"drugs\" has just been a failed experiment built on racism and lies) but it doesn't work and creates massive problems like gang violence, dangerous black markets that serve unknown substances with huge ranges in purity.  You have been lied to--I know it is hard to come to terms with that.", "2_Subreddit": "opiates"}], "dwvlc37": [{"0_Comment Submission": "I'm Eric Hafner, I'm running for U.S. Congress in Portland, Oregon (OR-3). I want to legalize all drugs, including opiates, but offer ibogaine therapy too, and free drugs for addicts via prescription.", "1_Text": "Why don't you think beyond what our Government is today?  Of course no program will be successful with a corrupt Government that is owned and controlled by corrupt and greedy corporations and special interest-but ending the disastrous war on \"drugs\" is a major repair in Government and civil rights that will lead to others.  It is up to the people to demand change in government and to prosecute those that have lied cheated and stolen to enrich themselves.  And of course, you offer no alternative..", "2_Subreddit": "opiates"}], "dwvm0tl": [{"0_Comment Submission": "I'm Eric Hafner, I'm running for U.S. Congress in Portland, Oregon (OR-3). I want to legalize all drugs, including opiates, but offer ibogaine therapy too, and free drugs for addicts via prescription.", "1_Text": "Agreed---but it was never intended to \"be won\".  It was literally a way for Government to mass-imprison people that may get in the way-namely blacks, hippies and anti-war stoners during the Vietnam era.  It is the longest and costliest war in US history-manufactured on lies and eerily similar to the now raging War on \"Terror\".   These wars are not meant to be won---they are meant to be prolonged, grown and dragged out as long as possible--with shifting enemies and players.  They are global wars that can be fought in any country or area deemed a threat.   It is an underhanded way to progressively curtail civil liberties and rights as the wars rage.  It is insane that people accept this fuckery.", "2_Subreddit": "opiates"}], "dwwkr9r": [{"0_Comment Submission": "I'm Eric Hafner, I'm running for U.S. Congress in Portland, Oregon (OR-3). I want to legalize all drugs, including opiates, but offer ibogaine therapy too, and free drugs for addicts via prescription.", "1_Text": "Not really--the War on Drugs is what is immoral as fuck.  Using the Government to kidnap people and lock them in cages for possessing a plant that grows naturally all over the Earth is what is immoral as fuck. \n And tax money is already used to prescribe people suboxone and methadone and countless medications--why not diacetylmorphine like in other countries?  It has a shorter half-life and less intense withdraws than sub/done.  Why not allow people to grow poppies and marijuana in their yards?   It is already dirt cheap to manufacture compared to other drugs including suboxone--allowing personal growth will make it even cheaper. \n\n Cost is not a reasonable excuse considering what we spend today (TRILLIONS AND TRILLIONS $$$$) on a war that is perpetuating street violence and death from dangerous substances like fentanyl and carfent-not to mention destroying the lives of Millions of people that are effectively thrown out of society.   This is not some philosophical question that we as a society have time to debate-we are not starting from baseline here-we are starting from a horrible point in time with the #1 cause of accidental death in the nation (for the first time in history) being legal drug overdose and Millions of non-violent \"offenders\" rotting in cages.  We need legalization and expanded treatment NOW.\n\nI just don't understand how anyone can complain about Government spending money on their own citizens-when our Government spends more money blowing things up and rebuilding them in various nations WE SHOULD NOT BE IN.  Want to curtail Government waste?  End the wars and stop enriching the war profiteers that have kept us spending TRILLIONS every year for decades now with no end in sight.", "2_Subreddit": "opiates"}], "dwx62j2": [{"0_Comment Submission": "I'm Eric Hafner, I'm running for U.S. Congress in Portland, Oregon (OR-3). I want to legalize all drugs, including opiates, but offer ibogaine therapy too, and free drugs for addicts via prescription.", "1_Text": "But that's not realistic--we will always have a Government so long as we have a nation-so it's more practical to identify corruption/waste in Government and work toward a remedy.  At least in a Democracy Government is supposed to represent the people and their interests-and theoretically decision makers and their ideas/plans are elected into office via direct input from the people.  Corporations are nationless and have no loyalty to anyone but shareholders-and even that is not always true.", "2_Subreddit": "opiates"}]}], "1_submissions": [{"5xtgdb": [{"0_Title": "Another Day 1..Sub/Kratom help", "1_Text": "Sorry to hear that :(", "2_Subreddit": "OpiatesRecovery"}], "612i7t": [{"0_Title": "Does your plug use opiates?", "1_Text": "Sorry to hear that :(", "2_Subreddit": "opiates"}], "61acpc": [{"0_Title": "Feeling Hopeless", "1_Text": "Sorry to hear that :(", "2_Subreddit": "OpiatesRecovery"}], "63dqy3": [{"0_Title": "Does it sound like i should be over physical w/d?", "1_Text": "Sorry to hear that :(", "2_Subreddit": "OpiatesRecovery"}], "66buor": [{"0_Title": "First Time Cold Copping", "1_Text": "Sorry to hear that :(", "2_Subreddit": "opiates"}], "6cibxb": [{"0_Title": "Librarians in Kensington have overdose drills and regularly have to administer Narcan.", "1_Text": "Sorry to hear that :(", "2_Subreddit": "opiates"}], "6f7s75": [{"0_Title": "Did I just Waste My Last Bag by Eating it?", "1_Text": "Sorry to hear that :(", "2_Subreddit": "opiates"}], "7r4u8h": [{"0_Title": "Frankie Beverly And Maze - Before I Let Go [R&B] (1981)", "1_Text": "Sorry to hear that :(", "2_Subreddit": "Music"}], "7smpow": [{"0_Title": "Safe injection sites to fight opioid overdose deaths get green light from Philadelphia officials--", "1_Text": "Sorry to hear that :(", "2_Subreddit": "opiates"}], "7wxex8": [{"0_Title": "FLY EAGLES FLY", "1_Text": "Sorry to hear that :(", "2_Subreddit": "opiates"}]}]}]}