{"FallenXH2": [{"0_comments": [{"dwfjl1e": [{"0_Comment Submission": "Man escapes from county jail Indiana Jones style under a closing garage door.", "1_Text": "Yeah I think a lot of people say that until the day comes when they realize that they are addicted. They make you bring back the bottles from your take-home doses to show them that you aren’t selling your doses.", "2_Subreddit": "videos"}], "dwfps89": [{"0_Comment Submission": "Man escapes from county jail Indiana Jones style under a closing garage door.", "1_Text": "Yeah I guess you could sell your doses but to be honest I don’t really know anyone that would buy methadone lol.  I mean the whole point of getting on methadone is to stay away from other opiates. I guess some people do but I don’t think I would, I’m really happy with the way things are going for me and it’s the only thing that’s honestly ever worked for me", "2_Subreddit": "videos"}], "dwfpw2f": [{"0_Comment Submission": "Man escapes from county jail Indiana Jones style under a closing garage door.", "1_Text": "I knew a lot of junkies who didn’t have a connect so I would get dope for them and charge them for it. Plus I was working so I had a steady income on top of being a middleman for other users.", "2_Subreddit": "videos"}], "dwgxk61": [{"0_Comment Submission": "I got a two months of membership for the price of one", "1_Text": "What a cunt", "2_Subreddit": "2007scape"}], "dwgybah": [{"0_Comment Submission": "am_i_disabled.jpg", "1_Text": "Just block him?", "2_Subreddit": "2007scape"}], "dwgyqlq": [{"0_Comment Submission": "Maximus Black completes MEP2 puzzle after 16 hours", "1_Text": "It’s funny that he talks about how toxic this community is when he’s being toxic himself, pretty ironic. Just take a look at his reply to your comment lol! When people resort to personal attacks it’s because they can’t think of anything else to say or they are just extremely immature.", "2_Subreddit": "2007scape"}], "dwj1rri": [{"0_Comment Submission": "You can't die to cows right?", "1_Text": "Having a bad day or something bud? Lol", "2_Subreddit": "2007scape"}], "dwj290m": [{"0_Comment Submission": "You can't die to cows right?", "1_Text": "I think row only increases the chance of getting drops from the rare drop table like a rune/dragon spear. So say you are killing abyssal demons, it doesn’t increase your chance of getting a whip. It doesn’t increase the chance that you get a roll for the rare drop table, but if you do get a roll on the rare drop table it increase your chance of getting an item such as a rune or dragon spear. I’m like 99% positive about this but I could be wrong. Also I do think your idea about smite would be pretty cool but I don’t think they would consider it :/", "2_Subreddit": "2007scape"}], "dwj30kf": [{"0_Comment Submission": "TIL you can spawn as many black demons as you want during legends quest", "1_Text": "What are the benefits of doing wilderness slayer tasks besides the extra slayer points? I was considering doing a few wilderness tasks but I really dunno if it would be worth it. I get pretty good tasks as it is and I already have everything I want unlocked.", "2_Subreddit": "2007scape"}], "dwj34tb": [{"0_Comment Submission": "TIL you can spawn as many black demons as you want during legends quest", "1_Text": "How would you use it to escape from a duel (I assume you mean at the dueling arena)? Were you able to take the hat with you wherever you want?", "2_Subreddit": "2007scape"}], "dwj393z": [{"0_Comment Submission": "You can't die to cows right?", "1_Text": "Yeah I usually only use it on tasks where there are a lot of coin drops so that I don’t have to bother picking them up and it does it automatically. Those coins actually add up pretty quick and overtime it can add up to a decent chunk of change. Especially at tasks like Gargoyles or Nechryaels.", "2_Subreddit": "2007scape"}], "dwj3bpw": [{"0_Comment Submission": "TIL you can spawn as many black demons as you want during legends quest", "1_Text": "This made me actually lol! Haha thanks for that 😂👍", "2_Subreddit": "2007scape"}], "dwjmczo": [{"0_Comment Submission": "TIL you can spawn as many black demons as you want during legends quest", "1_Text": "You didn't have to be such a dick to them lol. You could have just asked for a source politely like a normal person instead of being a jackass. Dunno why people in this subreddit have to be so toxic sometimes.", "2_Subreddit": "2007scape"}], "dwjmji6": [{"0_Comment Submission": "TIL you can spawn as many black demons as you want during legends quest", "1_Text": "Man I bet that dude that said it wasn't true feels like a moron now haha. That sure is an interesting bug, I'm surprised I'm just now hearing about it", "2_Subreddit": "2007scape"}], "dwjo8xc": [{"0_Comment Submission": "You can't die to cows right?", "1_Text": "Yeah to be honest with you the only reason I really use it is because it picks up coins. Some people don’t bother doing it but in the long run all those coins really do add up. If you don’t have hundreds of millions the few extra hundred K over a couple slayer tasks can really help out. Especially on tasks where coins are dropped frequently and at higher rates. A penny saved is a penny earned", "2_Subreddit": "2007scape"}], "dwjolzi": [{"0_Comment Submission": "TIL you can spawn as many black demons as you want during legends quest", "1_Text": "You explained what I was thinking perfectly. It’s a shame because this sub could be so much better but the assholes like you described can really ruin it for other people. I can’t understand why people are so hostile right off the bat. I can understand if someone insulted you and then you respond accordingly but to be a dick right from the start is just unnecessary. I know I have bad days too and can be kind of a dick sometimes but I try to not take it out on other people. It just seems like I see it so much more often on this sub compared to any other sub :(", "2_Subreddit": "2007scape"}], "dwk1i1y": [{"0_Comment Submission": "Jake Paul", "1_Text": "Ok I don’t think they deserve to die but I agree with the first part of your post :P", "2_Subreddit": "Paladins"}], "dwk1mzx": [{"0_Comment Submission": "Failed a drug test today", "1_Text": "The picture is really bad quality and I can’t read a thing on it :( maybe it’s just my phone, I’m not sure. But thanks for the info", "2_Subreddit": "kratom"}], "dwk22ai": [{"0_Comment Submission": "H.R. Supplies Offer", "1_Text": "I think this is a great idea. But you might have some problems with the political side of it. Dunno if it is against the rules or not. It would really upset me if it was tbh. But I support this for sure!! Some people just don’t have access to this kind of stuff and it’s such a shame. You are a kind soul and I commend you for doing this. I wish there were more people in the world like you and with your attitude. Much love <3", "2_Subreddit": "opiates"}], "dwk2wv5": [{"0_Comment Submission": "Jake Paul", "1_Text": "I don’t think you know what irony means my friend haha. Next time if you are being sarcastic, which I think that’s what you meant to say instead of ironic cause that’s just not the case here, throw a /s in there and make it a little more obvious. Sarcasm doesn’t translate through text very well, no reason to get butt-hurt over it though bud. Also the :P should have made it pretty clear that I was just messing around with you.", "2_Subreddit": "Paladins"}], "dwk34kp": [{"0_Comment Submission": "Jake Paul", "1_Text": "No problem :D I literally had to google it one day because I was so confused when I saw it. I really didn’t mean to offend you I was just joking around.", "2_Subreddit": "Paladins"}], "dwkq06t": [{"0_Comment Submission": "H.R. Supplies Offer", "1_Text": "Nope I meant like the politics of this subreddit :p which I’m sure that you are already aware of since I see that the content of your post has been removed:( but if you follow through, get something organized, and show the mods that you are serious, I think they will allow it and you will be able to do a lot for this community ;) thanks again and I really do hope things work out and you can get something going :D", "2_Subreddit": "opiates"}], "dwr2xbx": [{"0_Comment Submission": "Please help— real or fake A-214? Thank you in advance!", "1_Text": "Look real to me as well, the color looks a little off IMO but that could just be the lighting. Always good to stay on the safe side and get them tested, or just start out small and go from there.", "2_Subreddit": "opiates"}], "dwuuo48": [{"0_Comment Submission": "today would’ve been your 23rd birthday. i miss you everyday darlin’ 💔", "1_Text": "I came here to say the same. Addiction is one hell of a beast. It’s patient and cunning, even when you think you have it under control that can change in a heartbeat. I’m sure she wanted to get clean but it’s just not that simple. I do feel for her children though and I hope that they won’t follow the same path. Maybe if the United States actually provided help for addicts some of these unnecessary deaths can be prevented. It’s really sad", "2_Subreddit": "opiates"}], "dwvaij2": [{"0_Comment Submission": "today would’ve been your 23rd birthday. i miss you everyday darlin’ 💔", "1_Text": "Also rehab in the states is a joke from what I’ve experience. Also ridiculously expensive like you said", "2_Subreddit": "opiates"}]}], "1_submissions": [{"7cce55": [{"0_Title": "Fent", "1_Text": "Yeah I think a lot of people say that until the day comes when they realize that they are addicted. They make you bring back the bottles from your take-home doses to show them that you aren’t selling your doses.", "2_Subreddit": "opiates"}], "7dq5zm": [{"0_Title": "Friday Night Shitpost", "1_Text": "Yeah I think a lot of people say that until the day comes when they realize that they are addicted. They make you bring back the bottles from your take-home doses to show them that you aren’t selling your doses.", "2_Subreddit": "opiates"}], "7l6a0l": [{"0_Title": "First OD yesterday", "1_Text": "Yeah I think a lot of people say that until the day comes when they realize that they are addicted. They make you bring back the bottles from your take-home doses to show them that you aren’t selling your doses.", "2_Subreddit": "opiates"}], "7orxt2": [{"0_Title": "Subs or Done?", "1_Text": "Yeah I think a lot of people say that until the day comes when they realize that they are addicted. They make you bring back the bottles from your take-home doses to show them that you aren’t selling your doses.", "2_Subreddit": "opiates"}], "7p73y3": [{"0_Title": "Update on MMT/Suboxone Maintenance Decision", "1_Text": "Yeah I think a lot of people say that until the day comes when they realize that they are addicted. They make you bring back the bottles from your take-home doses to show them that you aren’t selling your doses.", "2_Subreddit": "opiates"}], "7pfyq5": [{"0_Title": "Support", "1_Text": "Yeah I think a lot of people say that until the day comes when they realize that they are addicted. They make you bring back the bottles from your take-home doses to show them that you aren’t selling your doses.", "2_Subreddit": "Paladins"}], "7pg2lj": [{"0_Title": "Party up?", "1_Text": "Yeah I think a lot of people say that until the day comes when they realize that they are addicted. They make you bring back the bottles from your take-home doses to show them that you aren’t selling your doses.", "2_Subreddit": "Paladins"}], "7pocd3": [{"0_Title": "Servers Down", "1_Text": "Yeah I think a lot of people say that until the day comes when they realize that they are addicted. They make you bring back the bottles from your take-home doses to show them that you aren’t selling your doses.", "2_Subreddit": "Paladins"}]}]}]}