{"Orang3JuiceJones": [{"0_comments": [{"dvv25j5": [{"0_Comment Submission": "The contents of this cicis cup seep though it in under a week", "1_Text": "They are designed to be biodegradable so its doing exactly what it was supposed to.", "2_Subreddit": "CrappyDesign"}], "dvv2a21": [{"0_Comment Submission": "Maybe don't encourage Chads to use glass bottles where people swim?", "1_Text": "I would consider the fact that your more than likely get dirt in the mouth of your beverage more of a design flaw.", "2_Subreddit": "CrappyDesign"}], "dvwbfg6": [{"0_Comment Submission": "I got a tweaker this delivers anything I want to my window at all times of the night", "1_Text": "I was homeless, i had a cell phone that was paid for by some crack whore's sugar daddy after she got fucked up and dropped it. I swear dude paid for it for about a year before it got cutoff.", "2_Subreddit": "opiates"}], "dvwhqmb": [{"0_Comment Submission": "Broke and need to get high...what's your cash scheme?", "1_Text": "Armed Robbery", "2_Subreddit": "opiates"}], "dvwieec": [{"0_Comment Submission": "When you're getting to know someone and they say, 'I'd be a pothead if it weren't such am expensive habit.'", "1_Text": "Hell yea, how can we expect normies to trust us when we cant even trust eachother?", "2_Subreddit": "opiates"}], "dvwixkk": [{"0_Comment Submission": "Can Oxy make your heart spasm and stop?", "1_Text": "I feel like your much less likely to go into cardiac arrest with opiates in your system since your heart is not working as hard. I have terrible fucking anxiety about this shit with stims but oxy? You'll be fine.", "2_Subreddit": "opiates"}], "dvwkpvq": [{"0_Comment Submission": "Friends Vs Junkie Friends", "1_Text": "Whats the difference?", "2_Subreddit": "opiates"}], "dw3kfpj": [{"0_Comment Submission": "Reddit content policy update", "1_Text": "Thats what armslist is for, I remember when they shut the facebook gun groups down but we really were buying, selling and trading guns on there.", "2_Subreddit": "opiates"}], "dwf43ym": [{"0_Comment Submission": "Kratom not doing dick for anyone else?", "1_Text": "Suboxone gives me hella energy. In fact, its the main reason I still use it after being free of dope.", "2_Subreddit": "opiates"}], "dwff0xc": [{"0_Comment Submission": "Girlfriend and her friend got popped over the weekend. Fml.", "1_Text": "Haven't had one in 15 years. It will cost me 2250 at the very least and I must complete my court ordered alcohol classes in the county I was arrested in, I don't live there anymore... There is a rule if your out of state you can take your classes where you currently live, im still in state so i must travel 8 hours a day to the county where the charges are at.", "2_Subreddit": "opiates"}], "dwfgp5m": [{"0_Comment Submission": "Advice: Best way to use what I have?", "1_Text": "Boofing can be a complete waste if you have any shit in your colon. I'd go with the sure thing and eat them on an empty stomach or snort them.", "2_Subreddit": "opiates"}], "dwgvlzj": [{"0_Comment Submission": "Girlfriend and her friend got popped over the weekend. Fml.", "1_Text": "Actually thats your brain telling your body, I NEED THAT SHIT INSIDE ME RIGHT FUCKING NOW. Just saying, you kind of had it backwards.", "2_Subreddit": "opiates"}], "dwgz86h": [{"0_Comment Submission": "Roxies AND chasing/smoking ECP? worth it or a total waist?", "1_Text": "I would often do both funds permitting, i think  heroin and oxy complement eachother.", "2_Subreddit": "opiates"}], "dwh92gr": [{"0_Comment Submission": "Dude, you have no idea I did like so much drugs is college.....", "1_Text": "There was a little chinese kid in rehab with us who was there for weed, his parents sent him. Most of us were all there by court order.", "2_Subreddit": "opiates"}], "dwh9z1n": [{"0_Comment Submission": "basically", "1_Text": "They cut out the pile of vomit beside him", "2_Subreddit": "opiates"}], "dwhcdmy": [{"0_Comment Submission": "Jesus fucking Christ. “The Doctors” show is stalking about narcan parties..", "1_Text": "Guns tend to hold thier value and unlike a lot of shit dboys will trade dope on the dollar for guns.", "2_Subreddit": "opiates"}], "dwhdeq2": [{"0_Comment Submission": "Did They Overdose?", "1_Text": "Sleep paralysis can be used to jump into lucid state, since you are between sleep and wake. I would will my \"soul\" out of my body and go fly around the neighborhood or some shit.", "2_Subreddit": "opiates"}], "dwhdoij": [{"0_Comment Submission": "Question about methadone dosing", "1_Text": "They say high doses over 50mg or so will block opiates. No experience with methadone other than i took 30mg in mild withdrawal and felt pretty damn good all day.", "2_Subreddit": "opiates"}], "dwj7uhh": [{"0_Comment Submission": "I’m getting my kids back, just gonna use this one last time", "1_Text": "One day", "2_Subreddit": "opiates"}], "dwjktjv": [{"0_Comment Submission": "Update", "1_Text": "Exactly, in the moment it seems reasonable and you can justify it with literally anything. Its like someone lives with you and has major sugery, \"how dare that bitch to have multiple spinal fusions and bring opiates into the house because they need them for legitimate medical reasons.\" \"Fuck it ima get me some a dem perks.\"", "2_Subreddit": "opiates"}], "dwjlj2g": [{"0_Comment Submission": "Haven't had Any opiates in over a week will 2mg of bupe provide a decent high ? My cute barber said she could get me one", "1_Text": "Depends on your previous tolerence, after a week off of a heavy heroin habit i doubt you would get \"high\". You would probably feel a hell of a lot better tho. After a month off I snorted 2mg of subutex and felt pretty damn good. Def not a euphoric high but energetic and a general good feeling.", "2_Subreddit": "opiates"}], "dwlbzo5": [{"0_Comment Submission": "Found this on the alcoholic sub", "1_Text": "Hell yea. Coming off fent i sneezed maybe 1000 times a day.", "2_Subreddit": "opiates"}], "dwlc4c4": [{"0_Comment Submission": "I feel like I’m in an on and off again relationship with dope", "1_Text": "Cadillacs on 22s. I aint done nothin in my life but stay true, pimp my voice and mack these beats, pray to the lord for these Mississippi streets ayy ayy ayy", "2_Subreddit": "opiates"}], "dwsf34l": [{"0_Comment Submission": "/trashy is plentiful with cold cop methods today! This is inside a porta john.", "1_Text": "She's in the next stall", "2_Subreddit": "opiates"}], "dwszw6n": [{"0_Comment Submission": "In love with a user", "1_Text": "\"I recently met up with her and she told me her boy is about to be sent back to prison for some other battery shit that happened last year. The reason why she’s with him is because she’s all he’s got right now in the world and she feels for him.\"  \n\nThis is bullshit bro, she is saying that to keep you on the hook. They are ride or die, rest assured soon as he gets out of prison she will be right back on his dick. I mean look at the situation, she'd rather live on the street with him than be with you warm, safe and secure in a home.", "2_Subreddit": "opiates"}]}], "1_submissions": [{"7yh7at": [{"0_Title": "Shit dope", "1_Text": "They are designed to be biodegradable so its doing exactly what it was supposed to.", "2_Subreddit": "opiates"}], "7z773t": [{"0_Title": "Posting in CL", "1_Text": "They are designed to be biodegradable so its doing exactly what it was supposed to.", "2_Subreddit": "opiates"}], "7z8dfh": [{"0_Title": "Still waiting", "1_Text": "They are designed to be biodegradable so its doing exactly what it was supposed to.", "2_Subreddit": "opiates"}], "7zh77e": [{"0_Title": "CL connect", "1_Text": "They are designed to be biodegradable so its doing exactly what it was supposed to.", "2_Subreddit": "opiates"}], "7zi4mn": [{"0_Title": "Apologies", "1_Text": "They are designed to be biodegradable so its doing exactly what it was supposed to.", "2_Subreddit": "opiates"}], "7zim1g": [{"0_Title": "All's well that ends well", "1_Text": "They are designed to be biodegradable so its doing exactly what it was supposed to.", "2_Subreddit": "opiates"}], "7zogf7": [{"0_Title": "What is the average weight", "1_Text": "They are designed to be biodegradable so its doing exactly what it was supposed to.", "2_Subreddit": "opiates"}], "7zy84j": [{"0_Title": "Fun Trip", "1_Text": "They are designed to be biodegradable so its doing exactly what it was supposed to.", "2_Subreddit": "opiates"}], "804tck": [{"0_Title": "Somebody posted a music video w/ a guy shooting dope?", "1_Text": "They are designed to be biodegradable so its doing exactly what it was supposed to.", "2_Subreddit": "opiates"}], "81mhh2": [{"0_Title": "Quick Question Subutex Pills", "1_Text": "They are designed to be biodegradable so its doing exactly what it was supposed to.", "2_Subreddit": "opiates"}]}]}]}