{"gearshake": [{"0_comments": [{"dwftl1n": [{"0_Comment Submission": "What are your favorite IV rushes?", "1_Text": "I understand. For what it’s worth I didn’t know anyone into IV use either until after I started on my own. It does seem very mystical to someone has never experienced it.", "2_Subreddit": "Drugs"}], "dwftv2q": [{"0_Comment Submission": "What are your favorite IV rushes?", "1_Text": "I have to say that the “just one time” mentality with cocaine will not work. The drug will take hold of your mind and you will use everything you have until you have no more and you will sit there, depressed, on a rough comedown, craving more cocaine as if you’re in a desert starving and you haven’t had any water in 3 days. It is sick and twisted how it makes you feel. I don’t know anyone or have ever heard of anyone successfully shooting coke just once. It’s not entirely impossible I guess, but very, very unlikely. \n\nEdit: My efforts are not to convince you not to do it, btw. If your mind is set, there is nothing I can do. But expect this to happen.", "2_Subreddit": "Drugs"}], "dwfuqsq": [{"0_Comment Submission": "What are your favorite IV rushes?", "1_Text": "You’re right about oral MDMA providing a rush, at least for me. It doesn’t seem to gradually come on, it just slams me into the roll. Very intense for a few minutes and then it subsided into bliss. Also what do you mean by snowballs. Speedballs? I loved me some speedballs, but would rather slam coke first then slam dope after the rush.", "2_Subreddit": "Drugs"}], "dwfv4xw": [{"0_Comment Submission": "What are your favorite IV rushes?", "1_Text": "I had a similar “oh shit this is it I’m dying I guess it was a good run” when I first smoked DMT. I had accepted it. It was happening. My mom was gonna find me in the bathroom with a crack pipe in my hand on the floor. Lol. I was so happy to be alive when I came back to the real world. The needle is really a separate addiction for me. Equally hard to kick.", "2_Subreddit": "Drugs"}], "dwfv9av": [{"0_Comment Submission": "What are your favorite IV rushes?", "1_Text": "The concern comes from not wanting other people to feel how horribly I felt. I wish there was a way to do it without all the shitty sides. If you’re gonna do it, be as safe as possible.", "2_Subreddit": "Drugs"}], "dwg0qv8": [{"0_Comment Submission": "What are your favorite IV rushes?", "1_Text": "How long the drug lasts.", "2_Subreddit": "Drugs"}], "dwg0ugn": [{"0_Comment Submission": "What are your favorite IV rushes?", "1_Text": "Interesting. Thanks for the input. I’d imagine IV MDMA would be so ridiculously intense. Taken orally it’s already so intense for me.", "2_Subreddit": "Drugs"}], "dwjzo6h": [{"0_Comment Submission": "Plants seem to think that last batch from our friends who are leaving the benzo scene, are not in fact 12mg/ml but instead still 4mg/ml. Thoughts?", "1_Text": "It reads 12mg/30mL which comes out to 4mg /mL\n\nEdit: upon closer inspection it appears I made a mistake, and the bottle actually reads 12mg/mL @ 30mL, so it would be correct to assume that the advertised dosage is indeed 12mg/mL. If many people believe it to be underdosed, one of two things could have happened in my opinion:\n\n1. The label was misprinted and the manufacturer meant to advertise 12mg/mL \n\nor\n\n2. The label was not misprinted and the manufacturer placed it there to maybe confuse people/make more sales, and the solution is, in fact, underdosed at somewhere near 4mg/mL.\n\nAnother scenario I can see happening is that the manufacturer intended to make a 12mg/mL solution, but somehow messed up the math and/or didn’t mess up the math but lost/destroyed a large amount of etizolam during the (surprisingly easy) process of making the solution. \n\nEither way this isn’t cool. Has anyone tried to contact the vendor about this?", "2_Subreddit": "TheRealEtizolam"}], "dwk6941": [{"0_Comment Submission": "New Jersey drug scene", "1_Text": "North Nj is also filled to the brim with heroin and crack coming from one specific city.", "2_Subreddit": "Drugs"}], "dwlo3wh": [{"0_Comment Submission": "Plants seem to think that last batch from our friends who are leaving the benzo scene, are not in fact 12mg/ml but instead still 4mg/ml. Thoughts?", "1_Text": "Ohhhhh you’re right didn’t see that\n\nEdit: thanks for the heads, was half asleep when I saw this, I’ll edit my OP now", "2_Subreddit": "TheRealEtizolam"}], "dwmzf6z": [{"0_Comment Submission": "Do you have to piss dirty for opiates to get a sub script?", "1_Text": "I didn’t have to. I was actually clean when I got on subs, did it as a preemptive measure to create a buffer if I wanted to use, which I did because of something tragic that happened in my family. Every doctor will vary though.", "2_Subreddit": "opiates"}], "dwn1wy3": [{"0_Comment Submission": "So easy to get prescription in thailand for drugs", "1_Text": "Hey man I fucked my Test due to steroids and opiates, mostly opiates. Get on TRT. Life changing and MUCHHHHH better than abusing drugs to deal with it. PM me for more info. Thailand should be easy to get a script too I would think.", "2_Subreddit": "Drugs"}], "dwn245w": [{"0_Comment Submission": "Cyclobenzaprine high?", "1_Text": "Never got high from it but it made me sooooooo so tired. Unlike anything else. Slept for like 16 hours and woke up groggy as fuck.", "2_Subreddit": "Drugs"}], "dwqel2g": [{"0_Comment Submission": "/r/Opiates can be a depressing place, but after a lot of research and thought I have determined that this user is the best user of /r/Opiates and possibly the best person on Reddit too!", "1_Text": "Lol 💜", "2_Subreddit": "opiates"}], "dwqevez": [{"0_Comment Submission": "What synthetic cannabinoids are floating around now? And is the damage caused by syncans caused because of the potpourri smoked or the chemical itself?", "1_Text": "I just got some 5F MDMB 2201. It’s my first noid experience. Very similar to weed but stronger and shorter lasting. Skyrocketed my tolerance more compared to equivalent weed usage. Putting it down for a bit, it’s very habit forming at least for me. I have it in E-Juice so I find myself hitting it and not really noticing because I use my vape so much.", "2_Subreddit": "researchchemicals"}], "dwqyfq7": [{"0_Comment Submission": "What's the best legal (USA) stimulant RC?", "1_Text": "Whoever else commented on this is shadowbanned", "2_Subreddit": "researchchemicals"}], "dwqz3ie": [{"0_Comment Submission": "What's the best legal (USA) stimulant RC?", "1_Text": "Weird. It says 3 comments on the post but it only shows 2, mine and your reply. Not sure what’s up", "2_Subreddit": "researchchemicals"}], "dwqzvud": [{"0_Comment Submission": "What's the best legal (USA) stimulant RC?", "1_Text": "Yea itheyregetting deleted", "2_Subreddit": "researchchemicals"}], "dws15fo": [{"0_Comment Submission": "Plants seem to think that last batch from our friends who are leaving the benzo scene, are not in fact 12mg/ml but instead still 4mg/ml. Thoughts?", "1_Text": "Yes read my edit", "2_Subreddit": "TheRealEtizolam"}], "dwum83k": [{"0_Comment Submission": "Queentilla onion site review", "1_Text": "Fucking A bro do you know what a sentence is?", "2_Subreddit": "TheRealEtizolam"}], "dwuq2xp": [{"0_Comment Submission": "Fuck my life (and my veins)", "1_Text": "Why do you care", "2_Subreddit": "opiates"}], "dwuteec": [{"0_Comment Submission": "I can't believe she registers with THAT (found on tumblr)", "1_Text": "I just had to use 3mL rig with 30g 1/2 inch lure lock and have used 25g quite unsuccessfully in the past. This last time the fucking NEEDLE TIPS KEPT GETTING CLOGGED WITH THE REGISTERS COULDNT SHOOT MY COKE PROPERLY lol. Wasted a bit. I LARGELY prefer insulin syringes. Even the 3mL was so fucking bulky I only use .3 or .5mL for shots. Unnecessary lol. I’m just salty I had to go through that bullshit. Wrecked my veins.", "2_Subreddit": "opiates"}], "dwutyjr": [{"0_Comment Submission": "What’re your other vices?", "1_Text": "I fucking HEAR YOU on the IV coke/crack that shit came outta NOWHERE. Blindsided me man, veins are all kinds of fucked up at the moment, I need to not lol.", "2_Subreddit": "opiates"}], "dwvkdj1": [{"0_Comment Submission": "Been craving IV cocaine something fierce.", "1_Text": "Fucking sameeee dude", "2_Subreddit": "opiates"}], "dwwnyv0": [{"0_Comment Submission": "Fuck my life (and my veins)", "1_Text": "You don’t even know the guy and it makes 0 difference in your life whether his handle is heroin holocaust or peanutbutterinmyasshole. My point isn’t that it’s not disrespectful, my point is who the fuck cares he’s just a guy on the internet. Is pointing out his handle and fighting about it gonna do anything at all?\n\nEdit: basically what I’m saying is save yourself the frustration. He won’t respond well and everyone will get angry and nothing good will come out of it.", "2_Subreddit": "opiates"}]}], "1_submissions": [{"7tgxhc": [{"0_Title": "IV 3-MeO-PCP?", "1_Text": "I understand. For what it’s worth I didn’t know anyone into IV use either until after I started on my own. It does seem very mystical to someone has never experienced it.", "2_Subreddit": "researchchemicals"}], "7y2wjs": [{"0_Title": "3-MeO-PCP and Serotonin?", "1_Text": "I understand. For what it’s worth I didn’t know anyone into IV use either until after I started on my own. It does seem very mystical to someone has never experienced it.", "2_Subreddit": "askdrugs"}], "7ys39u": [{"0_Title": "Looking for a fun, short acting psychedelic", "1_Text": "I understand. For what it’s worth I didn’t know anyone into IV use either until after I started on my own. It does seem very mystical to someone has never experienced it.", "2_Subreddit": "researchchemicals"}], "8503tz": [{"0_Title": "Opinions on Marijuana as Landing Gear (specifically IV cocaine)?", "1_Text": "I understand. For what it’s worth I didn’t know anyone into IV use either until after I started on my own. It does seem very mystical to someone has never experienced it.", "2_Subreddit": "Drugs"}], "86o3px": [{"0_Title": "Do all RC dissos pop for PCP?", "1_Text": "I understand. For what it’s worth I didn’t know anyone into IV use either until after I started on my own. It does seem very mystical to someone has never experienced it.", "2_Subreddit": "DissonautUniverse"}], "86oai6": [{"0_Title": "Do all RC dissos pop for PCP on urinalysis?", "1_Text": "I understand. For what it’s worth I didn’t know anyone into IV use either until after I started on my own. It does seem very mystical to someone has never experienced it.", "2_Subreddit": "researchchemicals"}], "87v46e": [{"0_Title": "What are your favorite IV rushes?", "1_Text": "I understand. For what it’s worth I didn’t know anyone into IV use either until after I started on my own. It does seem very mystical to someone has never experienced it.", "2_Subreddit": "Drugs"}], "8957fw": [{"0_Title": "Orlando FL", "1_Text": "I understand. For what it’s worth I didn’t know anyone into IV use either until after I started on my own. It does seem very mystical to someone has never experienced it.", "2_Subreddit": "mdma_rollcall"}]}]}]}