{"imapcnoob": [{"0_comments": [{"dpnuvj1": [{"0_Comment Submission": "Why is it so hard to piss on opiates?", "1_Text": "Eh, he's fine. It happens to a lot of people. Myself included.", "2_Subreddit": "opiates"}], "dpok5m5": [{"0_Comment Submission": "Finally noticed my first “nodding hole” in my favorite OKC Thunder blanket. They told me dope would cost me money, my job, my family and friends, my freedom, my quality of life, my sanity, and my hope for happiness; but they never told me about THIS. This is some horseshit right here😡", "1_Text": "Thunder up!!\n\nI need to get a Thunder blanket to hang on my wall. Super stoked we finally grabbed that W last night!", "2_Subreddit": "opiates"}], "dpol2pp": [{"0_Comment Submission": "Finally noticed my first “nodding hole” in my favorite OKC Thunder blanket. They told me dope would cost me money, my job, my family and friends, my freedom, my quality of life, my sanity, and my hope for happiness; but they never told me about THIS. This is some horseshit right here😡", "1_Text": "Dark humor is how most of us junkies cope with what our lives have become. \n\nHe meant no offense. Especially to his own crowd.", "2_Subreddit": "opiates"}], "dpom1a9": [{"0_Comment Submission": "Picked up 20 of them on Thursday night. Less than 48 hours and this is all I've got left. I love these little guys.", "1_Text": "Ohh I know. Just wish they'd last longer hahaha. I get them once a month and it's an awesome 2-3 days. Then I stay clean for about a month until she refills and enjoy them all over again!😊", "2_Subreddit": "opiates"}], "dpopa3p": [{"0_Comment Submission": "Whats left from yesterdays pickup", "1_Text": "Exactly. He never uses it so he has to post super incriminating pictures with it so everyone can see. 😝\n\nEdit: Guys, I think we made him delete his account cuz we were all poking fun at him 😂", "2_Subreddit": "opiates"}], "dposzzl": [{"0_Comment Submission": "Picked up 20 of them on Thursday night. Less than 48 hours and this is all I've got left. I love these little guys.", "1_Text": "I'm drooling from the shot 😴😜", "2_Subreddit": "opiates"}], "dpot66s": [{"0_Comment Submission": "Whats left from yesterdays pickup", "1_Text": "For sure. I don't care if you're not in the pic at all. Post your drugs, sure. Leave the effin gun out of it. It doesn't look as cool as you think and it's unnecessarily risky.", "2_Subreddit": "opiates"}], "dpoyjjl": [{"0_Comment Submission": "Why can't you guys just smoke weed?", "1_Text": "Holy cow, this guy has the answer peeps! No more wasting money, no more suffering or struggling. \n\nThe key to fixing our problem: \"Just stop buying it\"\n\nu/Nightcrawlerfan1, don't come in with the \"Holier than thou\" attitude if you're this naive.", "2_Subreddit": "opiates"}], "dpoymrq": [{"0_Comment Submission": "Why can't you guys just smoke weed?", "1_Text": "Just.... Lol\n\nLiterally every addict here said the same shit at one point.", "2_Subreddit": "opiates"}], "dpoyvgy": [{"0_Comment Submission": "How much do yall pay for \"bulk\"", "1_Text": "If it's a small amount like the $5 in your case, I've never gotten a discount, no matter how many I buy.\n\nBack in the day when I bought 30s, they were $30, but if I bought more than 20, they'd be $20-$25 ea.\n\nYour miles may vary. That's just how my connects worked.", "2_Subreddit": "opiates"}], "dpoz56t": [{"0_Comment Submission": "Took 5mg hydro for the first time felt warm and relaxed but underwhelmed I have 7.5 more is redosing an option I weigh 130 and have never done any opiates before and I smoked about 0.5g of top shelf with it", "1_Text": "I'd hold onto it till tomorrow and take it when you wake up. That's always been the best time for me.\n\nOr just throw it away and stay away from the shit. That's probably the most responsible advice I could give 😝", "2_Subreddit": "opiates"}], "dpozbls": [{"0_Comment Submission": "Everything is all sorts of fucked.", "1_Text": "Lol that's sooo fuckin ridiculous to where it's almost funny in a fucked up way. \n\nFuck our healthcare industry. I'm sorry", "2_Subreddit": "opiates"}], "dpozzxi": [{"0_Comment Submission": "Can you sniff Morphine M30's (burgandy)", "1_Text": "BA standpoint. Morphine is super weak if you're not gonna put it in your pooper or in your vein.", "2_Subreddit": "opiates"}], "dpp0d6t": [{"0_Comment Submission": "Fuck I wanna get high", "1_Text": "At first, I wasn't chipping successfully at all, no matter how much I wanted to cut back.\n\nI can still get 30s, fent, Opana, etc. But I just make a conscious decision not to. I decided on the Dillies cuz the high is the best of any opiate and it was by far the cheapest. It was a struggle to cut way back like that, but I didn't wanna go down that spiral again. \n\n\nI'm very aware that I could slip up again. I just hope I have the will power to keep myself in check, and for 3 years, thankfully I have.", "2_Subreddit": "opiates"}], "dpp0osc": [{"0_Comment Submission": "I'm sure this question has been asked too many times already, but I'm brand spankin' new to Reddit.... #amateurhour", "1_Text": "Everyone else has already explained why it's a bad idea far better than I could. So I'm just gonna reinforce it.\n\nListen to these people! Please don't pick up the needle.", "2_Subreddit": "opiates"}], "dppcykr": [{"0_Comment Submission": "Fuck I wanna get high", "1_Text": "No withdrawals really. Just get an insane opiate hangover that lasts all day. I'm pretty sure I've yet to go into withdrawals from the short time and use t6 U9", "2_Subreddit": "opiates"}], "dpr9wd0": [{"0_Comment Submission": "Fuck I wanna get high", "1_Text": "Damn dude. That effin blows. I'm glad I haven't had to put up with that.\n\nJust noticed, in my previous comment, that apparently I was super high yesterday based on the nonsense at the end there\n\n>use t6 U9\n\n? Haha", "2_Subreddit": "opiates"}], "dpra488": [{"0_Comment Submission": "Everything is all sorts of fucked.", "1_Text": "Dayyum.\n\nGood thing you caught it and I'm glad to hear you haven't had any complications yet. I hope it stays that way! 🙋", "2_Subreddit": "opiates"}], "dwk1ef0": [{"0_Comment Submission": "Its that time of month again! My favorite time!", "1_Text": "Will do, boss! They're definitely my favorite opiate. At $5 a piece, there's no greater value!", "2_Subreddit": "opiates"}], "dwk4vbk": [{"0_Comment Submission": "Its that time of month again! My favorite time!", "1_Text": "Oh I absolutely do. I get them from an elderly woman who, unfortunately, has breast cancer. But she doesn't like taking these. She just uses her fent patches and sells the dillies to me and one other person, exclusively, for some extra cash and buys weed for her and her husband.", "2_Subreddit": "opiates"}], "dwlm8q0": [{"0_Comment Submission": "Its that time of month again! My favorite time!", "1_Text": "She only sells to me and her granddaughter. She wants them gone as quickly as possible and will only sell to the 2 people she knows she can trust. That's why they're so cheap. I'm veeerrryyyy lucky to have met her.\n\nI know I could make a killing if I sold them. I'm just too in love with them.", "2_Subreddit": "opiates"}], "dwlznlq": [{"0_Comment Submission": "I can't begin to express how grateful I am for our guardian angel, Tracey. Thank you so much.", "1_Text": "Oh my God, don't apologize! Lol\n\nI hate that I even needed to ask you in the first place. I'm so incredibly grateful for the times you have helped me. I'm glad you're getting someone to help you out as well. Thank you so much.", "2_Subreddit": "opiates"}], "dwlzqcd": [{"0_Comment Submission": "I can't begin to express how grateful I am for our guardian angel, Tracey. Thank you so much.", "1_Text": "Right? I was using a super old beater before I asked her for help.", "2_Subreddit": "opiates"}], "dwmalln": [{"0_Comment Submission": "Barfing", "1_Text": "I've only actually thrown up once from opiate use. However, if I'm at a party and there's tequila involved, I'm absolutely gonna be throwing up in your yard. Then I'll feel bad and try cleaning up the mess we made while I'm trashed and falling over everything.", "2_Subreddit": "opiates"}], "dwmklv9": [{"0_Comment Submission": "Enjoying getting back into opiates", "1_Text": "Luckily(?) for me, my only real connect gets her script once a month and that one weekend a month is when I get to treat myself. I've been doing it for a couple years and I couldn't be happier. \n\nI still remember doing anything and everything, desperately trying to get high every day for years. Shits depressing to think about and I sincerely hope I can keep up what I've been doing.", "2_Subreddit": "opiates"}]}], "1_submissions": [{"2yz9rx": [{"0_Title": "Looking for a CPU/GPU combo <=$300", "1_Text": "Eh, he's fine. It happens to a lot of people. Myself included.", "2_Subreddit": "buildapcforme"}], "30f8wl": [{"0_Title": "CPU/Mobo/GPU for ~$400", "1_Text": "Eh, he's fine. It happens to a lot of people. Myself included.", "2_Subreddit": "buildapcforme"}], "33m9ik": [{"0_Title": "[Feature Request] Automatically open posts in browser.", "1_Text": "Eh, he's fine. It happens to a lot of people. Myself included.", "2_Subreddit": "reddit_news"}], "33nabv": [{"0_Title": "[Build help] I got a bad ass deal on a PC and need help deciding what to upgrade first.", "1_Text": "Eh, he's fine. It happens to a lot of people. Myself included.", "2_Subreddit": "buildapc"}], "3ne035": [{"0_Title": "Does no one play soul wars?", "1_Text": "Eh, he's fine. It happens to a lot of people. Myself included.", "2_Subreddit": "runescape"}], "3ujw0o": [{"0_Title": "Where can I find out which minigames are spotlighted?", "1_Text": "Eh, he's fine. It happens to a lot of people. Myself included.", "2_Subreddit": "runescape"}], "54mmmi": [{"0_Title": "Tracey is a life and vein saver. Thank you so much!!! (Bonus pic of the dart I was stuck using for far too long.)", "1_Text": "Eh, he's fine. It happens to a lot of people. Myself included.", "2_Subreddit": "opiates"}], "5wj1u1": [{"0_Title": "They'll be the death of me, but I'm gonna love every second.", "1_Text": "Eh, he's fine. It happens to a lot of people. Myself included.", "2_Subreddit": "opiates"}], "5wki7j": [{"0_Title": "Smokes, Dilaudid, and new Ray Bans. Today was a good day (2nd post)", "1_Text": "Eh, he's fine. It happens to a lot of people. Myself included.", "2_Subreddit": "opiates"}], "7cbheh": [{"0_Title": "Picked up 20 of them on Thursday night. Less than 48 hours and this is all I've got left. I love these little guys.", "1_Text": "Eh, he's fine. It happens to a lot of people. Myself included.", "2_Subreddit": "opiates"}], "81lz03": [{"0_Title": "Another pair of new Ray Bans and even more Dilaudid!", "1_Text": "Eh, he's fine. It happens to a lot of people. Myself included.", "2_Subreddit": "opiates"}], "88dyqx": [{"0_Title": "Its that time of month again! My favorite time!", "1_Text": "Eh, he's fine. It happens to a lot of people. Myself included.", "2_Subreddit": "opiates"}], "88mix0": [{"0_Title": "I can't begin to express how grateful I am for our guardian angel, Tracey. Thank you so much.", "1_Text": "Eh, he's fine. It happens to a lot of people. Myself included.", "2_Subreddit": "opiates"}]}]}]}