{"MorphiniusMaximus": [{"0_comments": [{"dwe3v33": [{"0_Comment Submission": "munchies on benzos?", "1_Text": "Xanax and alcohol give me the munchies more than any other drug, even weed. But especially Xanax. So no, you're not alone.", "2_Subreddit": "opiates"}], "dwe4cye": [{"0_Comment Submission": "Why I like the train over the bus, private bathrooms", "1_Text": "Whatcha shooting there?", "2_Subreddit": "opiates"}], "dwjxo0z": [{"0_Comment Submission": "Questions about Mescaline HCL", "1_Text": "For me it was about 8 hours of tripping my balls off, after 8 hours the effects wore off quickly. This was at 1,000MG. I took it at night indoors, and no it didn't feel like a waste, but it is normal for me to trip indoors at night.", "2_Subreddit": "Psychedelics"}], "dwjxx95": [{"0_Comment Submission": "Why is it called tweaking?", "1_Text": "One time I stayed up for 14 days straight. I guess you could say it was a two-weeker.", "2_Subreddit": "Drugs"}], "dwjz0j6": [{"0_Comment Submission": "Trip Emergency : San Pedro is disgusting", "1_Text": "Extract the SP powder with alcohol, roll the extract into pea-size balls and swallow with juice. Takes a few days tho, but worth it. San Pedro is by far the nastiest thing I've ever tasted.", "2_Subreddit": "Drugs"}], "dwl52c6": [{"0_Comment Submission": "Craigslist cold cooling", "1_Text": "I successfully cold coped a few days ago, after they took the personals down. Just search the for sale section.", "2_Subreddit": "opiates"}], "dwl9113": [{"0_Comment Submission": "You're stuck on an south pacific island by yourself but have been given the choice of an unlimited amount of a single drug to indulge in. What drug do you choose?", "1_Text": "Either opium or heroin.", "2_Subreddit": "Drugs"}], "dwlg96f": [{"0_Comment Submission": "Hiccups (shitpost)", "1_Text": "Yes, repeatedly, sometimes up to 10 times in one night. It's not a problem to get rid of them usually, just annoying as fuck that they keep coming back.", "2_Subreddit": "opiates"}], "dwm7yxf": [{"0_Comment Submission": "Just out of curiosity", "1_Text": "Ultra white, have met black junkies before tho. Can confirm it's a thing.", "2_Subreddit": "opiates"}], "dwm8d2k": [{"0_Comment Submission": "Do you have to piss dirty for opiates to get a sub script?", "1_Text": "Why would you want subs if you don't have any opiates in your system? If you did get the prescription, you would be flagged as a drug addict/drug seeker, doesn't seem worth it unless you're hurting from WD's.", "2_Subreddit": "opiates"}], "dwm8tqg": [{"0_Comment Submission": "We need to break through OP's!!!!", "1_Text": "Am I the only one who loves the OPs? IR oxycodone seems like such a cocktease to me but the OP's would have me high for 8-12 hours if I ate enough, and they used to be dirt cheap.", "2_Subreddit": "opiates"}], "dwnxso2": [{"0_Comment Submission": "2 Buns and 2.5oz of Hydro", "1_Text": "Bitch Lasagna stamp would be on point.", "2_Subreddit": "opiates"}], "dwny2gu": [{"0_Comment Submission": "Drug taking loophole", "1_Text": "\"...drink thursday, rail blow friday, smash amphetamines saturday\" Yeah dude you got this, sounds like a solid plan. What could go wrong??", "2_Subreddit": "opiates"}], "dwp4wxw": [{"0_Comment Submission": "Any Hallucinogens for daily use?", "1_Text": "Mescaline can be used for several days in a row with minimal tolerance buildup, as can DMT.", "2_Subreddit": "Drugs"}], "dwp55a6": [{"0_Comment Submission": "How y'all feel bout air duster?", "1_Text": "https://www.youtube.com/watch?v=Zl2ustwRJ1Y", "2_Subreddit": "Drugs"}], "dwt1ixt": [{"0_Comment Submission": "The true cause of the opioid epidemic", "1_Text": "I had 1, 2, and 3, and loved them all, but THUG will always hold a special place in my heart.", "2_Subreddit": "opiates"}], "dwt21jn": [{"0_Comment Submission": "Would you have switched to heroin if oxys were still everywhere?", "1_Text": "Yes, because for me oxycodone lasts for about an hour, where heroin lasts about 5-6. I also prefer the more sedating heroin high to the energizing oxy high.", "2_Subreddit": "opiates"}], "dwtc2zq": [{"0_Comment Submission": "Thanks doc", "1_Text": "The one time I had it IV in the hospital they gave me 8MG, and no it did not get me even slightly high. I have a big tolerance though.", "2_Subreddit": "opiates"}], "dwtcd14": [{"0_Comment Submission": "I wonder if anyone makes customized syringes with replaceable sharps", "1_Text": "How would you see to register? lol", "2_Subreddit": "opiates"}], "dwtcpa7": [{"0_Comment Submission": "Mixxx and a fixxx", "1_Text": "idk how you guys take pics of needles in your arms, i'd be way too scared of the needle slipping out of my vein while snapping the shot to even try this.", "2_Subreddit": "opiates"}], "dwtgkh6": [{"0_Comment Submission": "Pin point pupils", "1_Text": "I had a friend who would try to adjust the size of his pupils by taking meth if they were too small, and taking opiates if they were too big. It did not work out very well for him.", "2_Subreddit": "opiates"}], "dwtgzq6": [{"0_Comment Submission": "Why does dope have such a bad stigma?", "1_Text": "You don't know what your oxys are cut with either unless you get them from a pharmacy. Also with heroin you're more likely to switch to  the needle, which has a stigma of it's own. With oxys there isn't much point because there's no rush when IV'd and the IV bioavailability is only slightly higher than oral.", "2_Subreddit": "opiates"}], "dwti2b1": [{"0_Comment Submission": "Is this too much? (Jedi Flipping 800UG)", "1_Text": "Will you be able to sleep in 24 hours? It is possible, but I personally never sleep the night after an acid trip. \n\nHow fucked is this going to be?\nEntirely depends on set and setting, and you and your friend's psyche and mindset.\n\nWill it have any long-term effets?\nThe drugs themselves won't cause any long term effects, but it is possible that you may do something you regret under the influence that will.\n\nAlso 800mics is a fuckton, I would not recomend taking more than 300, and even that is a lot.", "2_Subreddit": "Drugs"}], "dwu0a5n": [{"0_Comment Submission": "I'm Eric Hafner, I'm running for U.S. Congress in Portland, Oregon (OR-3). I want to legalize all drugs, including opiates, but offer ibogaine therapy too, and free drugs for addicts via prescription.", "1_Text": "Have you yourself ever used opiates/opioids?", "2_Subreddit": "opiates"}], "dwubctt": [{"0_Comment Submission": "Why is snorting benzos so popular?", "1_Text": "Klonopin is nice to snort because it has a sweet menthol taste that opens up your sinuses. Yes it's a waste, I was a dumb kid and used to try to snort everything. But if I had some K-pins right now I would take a few orally and snort one, just for the minty sensation lol. It's nice.", "2_Subreddit": "Drugs"}]}], "1_submissions": [{"80rrjn": [{"0_Title": "I'm happy.", "1_Text": "Xanax and alcohol give me the munchies more than any other drug, even weed. But especially Xanax. So no, you're not alone.", "2_Subreddit": "PoppyTea"}], "8668o7": [{"0_Title": "Do you guys flavor your tea?", "1_Text": "Xanax and alcohol give me the munchies more than any other drug, even weed. But especially Xanax. So no, you're not alone.", "2_Subreddit": "PoppyTea"}]}]}]}