{"Addicted_turtle": [{"0_comments": [{"dveivim": [{"0_Comment Submission": "Never have as much fun sober - Shit post", "1_Text": "The difference for me is sober you dont get to choose when the happiness comes... and of course you cant shoot all the happiness at once lol", "2_Subreddit": "opiates"}], "dvtmbda": [{"0_Comment Submission": "People who’ve gotten clean, in what ways did your life improve?", "1_Text": "Yes, ive never been very happy and loved drugs.  Got sober... now im not happy but definitely happier than end stages of using.  And oddly enough happier than before i used. Please feel free to ask if you have any more specific inquiries.", "2_Subreddit": "opiates"}], "dvtmphs": [{"0_Comment Submission": "When your long time Oxy connect suddenly connect leaves the game...", "1_Text": "I think the bad looks come from two factors - one being all the negative attention from the media and two, mostly, its because they cant get them.  You know the sort, say they can get whatever you want but if they cant they just say, \"no way! I dont fuck with that shit!\" Shut the fuck up, you dont fuck with it because you cant get it. Fucking hate people who say they can get anything - never even remotely true.  I can gey anything almost always means i can get three things, two of which are weed and blow and can only reliably get one thing... sorry for the rant.", "2_Subreddit": "opiates"}], "dvtos0q": [{"0_Comment Submission": "People who’ve gotten clean, in what ways did your life improve?", "1_Text": "Hobbies and constant investment in your life.  Also the realization that happiness is never permanent.  Its fleeting and you gotta work so fucking hard for it.... i was doing great for a long time but still suffered a lot during.  I got my own place, new car, new job, long term girlfriend.  I heavily invested in my new hobby, indoor rock climbing.  Im in an extremely hard spot now... it all started several months ago... Shit, almost a year ago now.  I gave kratom a try and found a strain that straight up felt like a fistfull of vics... thats when my body and mind remembered oh hey, i can feel happy as hell without all the work.  I dabbled from time to time and then four months ago i bought two large bags and began daily consumption... and i took a shit ton.  It followed every path every drug ever has with me - gradual procession to extreme consumption and where all the negatives raged amd positives are all but gone. Finally i quit.  Shortly after i lost my decent paying job.  It wasnt my fault though, for the first time ever.  Just part of life and a companies downsizing.  Oh, and did i mention not long after i found kratom i decided a cup and binge watching game of thrones was more important than my new passion, rock climbing... so long story short im now sober, on the job hunt, but extremely depressed and its excruciatingly slow progress.  I know how to be happy again though.  And i have a hell of a lot more than when i started this sobriety journey... thats the thing though, there is no stagnate - if i stop pursuing my goals and ambitions its not a pause, its rewinding back to missery and addiction.  Also, keep in mind, life fucking sucks and its hard as hell.  It never gets easier... but it does get better.\nSorry for the story but ill tell you one thing and remind myself at the same time - when i started i had a shitty car, lived with my mom, and hard withdrawels, self loathing, and misery to wake up to every morning.  Im miserable and will experience much more misery. But here i sit, about two years in, at home, my home, reading with my son who i now have majority custody of, next to my dog who i love who was rescued from the pound by my gorgeous girlfriend, who will be home later to love me, and enough money in my account that though it hurts losing my job i have savings - savings i have and will keep because its not spent on the bottle or the bag... please, feel free to ask more if you want - lord knows i have time lol", "2_Subreddit": "opiates"}], "dvtoznd": [{"0_Comment Submission": "Still accidentally clean", "1_Text": "Just a heads up, kratom is a bitch to quit too and is a real drug that can definitely fuck with your life and body.", "2_Subreddit": "PoppyTea"}], "dvuhexu": [{"0_Comment Submission": "When your long time Oxy connect suddenly connect leaves the game...", "1_Text": "Nah bra - da best, fish scale, pure raw white gurl... hate those fucks, every single thing is \"absolute fire\". Fuck you, if you say the dope im buying is absolute fire and then immediately say the buritto you just ate was absolute fire youre an asshole.", "2_Subreddit": "opiates"}], "dvyes2h": [{"0_Comment Submission": "Sometimes I just can't lol", "1_Text": "Yeah, fucking kills me.  R/stims is even worse.  Tons of people with chemical break downs and a slew of supplements talking like a, they actually know their shit and didnt just read a bunch of half info and called it a ba in chemistry while spun and b, think because they know it all tgat somehow means they drug use is not a problem.  No, doesnt matter how much you know, doesnt matter how smart you are - youre a meth addict and youre story, if you dont stop, will end the same way all stories go, strung out with nothing left but your pipe...", "2_Subreddit": "opiates"}], "dw2cysh": [{"0_Comment Submission": "Boofing adderall XR?", "1_Text": "I have a ton of experience with this but never filtered it out.  Just crushed finely and drew the whole lot into an oral syringe and boofed.  Worked absolutely amazingly and yeah, you get more out of it and a better rush.", "2_Subreddit": "Stims"}], "dw4eqrm": [{"0_Comment Submission": "Woman Stuck in Basketball Hoop", "1_Text": "Hey, what did you do with all the time you saved by abbreviating the words \"fire fighters\"?", "2_Subreddit": "WTF"}], "dw5xkq0": [{"0_Comment Submission": "Dboy... Falling hard?", "1_Text": "Dont think it really matters... you're an addict and unless you get clean your relationship with him will go to shit eventually and in a messy car wreck of a way.  If you get sober to be with him chances are you won't learn the necessary skills to be sober and yourself without him amd in doing so youll ruin the relationship.  Good luck", "2_Subreddit": "opiates"}], "dw5ypqy": [{"0_Comment Submission": "Fentanyl madness", "1_Text": "This isnt exact but four salt grains is like 500 mics... micrograms are 1000 of a milligram... so yeah, three or four salt grains of carfent honestly could kill a non user without question.  Scary strong", "2_Subreddit": "opiates"}], "dw5yu06": [{"0_Comment Submission": "Dboy... Falling hard?", "1_Text": "Yeah, no doubt.  Im sure that's a majorly nice change.  Not shaming or anything at all but are you having any issues resolving the emotional fact you traded your body for dope? I remember the first time i stole for drugs and had a hard time rationalizing that...", "2_Subreddit": "opiates"}], "dw65thl": [{"0_Comment Submission": "Fentanyl madness", "1_Text": "Volumetric dosing is the only way to safely take it or cut other stuff with it", "2_Subreddit": "opiates"}], "dw66bf6": [{"0_Comment Submission": "Dboy... Falling hard?", "1_Text": "Thats good... problem is active addiction is not at all living life to the fullest.  Its actually hellish and has very little happiness. If you arent there then enjoy because soon enough it will be survival in a horrible mood most the time. A lot if addicts say im not hurting anyone and living life to the fullest means having the most fun possible.  Two things about that - one, if anyone cares about you at all i garuntee they are being hurt by your addiction and two, having the most fun possible is usually the last thing an end stage user has.  Most the posts on this sub are of misery and sorrow and personal prisons built by your own hands... i said the same though before i finally looked around, realized how much this shit sucks and realizing that not only had i hurt plenty of people, including hurting myself the most but i wasn't living life to the fullest at all... what used to be fun and bliss had long since turned to constant pain and misery.  And all i did was get fucked up and thats not \"fullest life possible\" in the least, or even mildly enjoyable... thats just me though... well, me and a ton of other users on and off this sub ive talked to, anyhow...", "2_Subreddit": "opiates"}], "dw7a5uh": [{"0_Comment Submission": "Losing my wallet saved my life yesterday", "1_Text": "Well, i mean, you wouldn't give anything to be sober because all you have to give up is your drugs... so you would give anything maybe, except your drugs...", "2_Subreddit": "opiates"}], "dwhxcnq": [{"0_Comment Submission": "What is the worst state in the United States and why?", "1_Text": "Im like 20 minutes from plainfield.  I love where i live.  Absolutely hate the political thought and alignment of the state though.", "2_Subreddit": "AskReddit"}], "dwhxn04": [{"0_Comment Submission": "What is the worst state in the United States and why?", "1_Text": "Lol youre the first person ive met from indy that says mate though", "2_Subreddit": "AskReddit"}], "dwj4pd5": [{"0_Comment Submission": "Kratom question", "1_Text": "Uuuuh yeah, daily use does decrease testosterone.", "2_Subreddit": "kratom"}], "dwkuw5u": [{"0_Comment Submission": "And I’m back", "1_Text": "And not just anyone, someone brand new to the program... low hanging fruit.", "2_Subreddit": "opiates"}], "dwmhytm": [{"0_Comment Submission": "weekend’s cocktail", "1_Text": "Definitely better snorted but honestly, if you boof three of those youll be amazed.  I have a ton of experience with addy, those soecifically (was prescribed two a day for years).  Boofing them is by far the greatest way.", "2_Subreddit": "opiates"}], "dwn7oje": [{"0_Comment Submission": "After 7 months I got my vyvanse prescription back! Forgot how much I liked them :) picking up some h today or tomorrow also 😍", "1_Text": "Yeah i was prescribed two 30mg er addy a day for years and snorted a TON of it... my nose is perfectly fine. Im not saying harm reduction is stupid by any means but some people (ESPECIALLY those in r/stims) get ridiculous with it. Just want to smack them and be like no, sorry, with all your crazy ass supplements and rules about rest and eating that isnt going to make your massive meth consumption care free and healthy... makes me mad.  Crush and snort those and youll be just fine.  Youre doing dope and stims, dont really think a touch of edible coating on tiny beads is gonna be the issue here...", "2_Subreddit": "opiates"}], "dwnlmwg": [{"0_Comment Submission": "This little girl wins April Fool's Day.", "1_Text": "Blew out my tire today... sad times... my projection is if we dont have any harsh winters in the next three years the following summer the roads will be nice again. Hopefully.", "2_Subreddit": "funny"}], "dwnpl7y": [{"0_Comment Submission": "This little girl wins April Fool's Day.", "1_Text": "Oh i know.  My girlfriend went to easter dinner in capris and i had to blast the heat on the drive home.  Honestly this feels like the real indiana.  Growing up, for me, it was always crazy like this.  Before this winter it was all pretty bland and mild, weather wise.", "2_Subreddit": "funny"}], "dwpcgyw": [{"0_Comment Submission": "[Homemade] Grilled Pork Banh Mi", "1_Text": "What the fuck? The bread is to be toasted and super fresh... if you think its supposed to be hard as a rock i feel bad for you man....", "2_Subreddit": "food"}], "dwt0opc": [{"0_Comment Submission": "People who’ve gotten clean, in what ways did your life improve?", "1_Text": "Yeah, there are definitely negatives to this plant.  If its kratom or dope, of course kratom is much better.  Its cheaper and you dont nod out and its legal but yes, definitely a drug, definitely not negative free, and definitely not like coffee, which ive heard a lot of people say.", "2_Subreddit": "opiates"}]}], "1_submissions": [{"82agx8": [{"0_Title": "It was who I was... not who I am", "1_Text": "The difference for me is sober you dont get to choose when the happiness comes... and of course you cant shoot all the happiness at once lol", "2_Subreddit": "opiates"}]}]}]}