{"MsMethadone": [{"0_comments": [{"dwm3ndr": [{"0_Comment Submission": "spotted on a car outside a walmart", "1_Text": "I can't...", "2_Subreddit": "trashy"}], "dwm57wz": [{"0_Comment Submission": "Driveway full of bread", "1_Text": "r/frugal\nr/frugal_jerk", "2_Subreddit": "WTF"}], "dwm5abv": [{"0_Comment Submission": "Driveway full of bread", "1_Text": "12 hours later...\n\nBIRD INVASION", "2_Subreddit": "WTF"}], "dwm5dp5": [{"0_Comment Submission": "Bumping of tails", "1_Text": "Ooops.. someone could have used a rear backup camera.  It's been a lifesaver having one in my vehicle.  Plus, now I can parallel park.", "2_Subreddit": "WTF"}], "dwm5ocw": [{"0_Comment Submission": "My dog found a piglet's head in a bush while we were on a walk", "1_Text": "Wtf, indeed.", "2_Subreddit": "WTF"}], "dwnljz8": [{"0_Comment Submission": "Where to buy couches that are decent quality?", "1_Text": "I get all of my furniture off of Wayfair and Overstock, and have been extremely satisfied.  Of course, you can't sit on it first, but I find that the customer reviews and item description is enough to make a good choice.  There are thousands of options and great prices, delivered right to your door.", "2_Subreddit": "kzoo"}], "dwoess1": [{"0_Comment Submission": "They sat here for hours.", "1_Text": "That is one fat cat; he could swallow that squirrel whole lol.", "2_Subreddit": "cats"}], "dwof934": [{"0_Comment Submission": "The look I’ve been loving for spring", "1_Text": "The light peachy eyeshadow is so flattering on you! Beautiful.", "2_Subreddit": "MakeupAddiction"}], "dwog3qq": [{"0_Comment Submission": "Do I REALLY need a fixing spray if I already use a primer, setting powder and Fix+?", "1_Text": "If you are already using a long-wear foundation and setting powder, you should be able to get 8 + hours of wear time from your makeup.  Fix + is a godsend for us dry skin girls, and if I had to choose between it and a setting spray, I would go with fix+ evertyime.  However,  there are affordable  setting sprays like Milani Make It Last for under 10 bucks.  Btw, in case you weren't aware, on April 7th, fix + will be on sale for $13 at Ulta.", "2_Subreddit": "Makeup"}], "dwogo9c": [{"0_Comment Submission": "Scheduled Lyft Never Arrived", "1_Text": "As a driver, I accept scheduled pick ups quite often, usually from hospitals.  I've always picked up the passenger at the requested time with no problem, however I do get annoyed with one thing... for example, I have a scheduled pick up for 10am.  So the app tells me to be online by 9:45 to accept the request. Ok, no problem.. except as soon as I sign on, I get requests from other passengers. Since I've already committed to the scheduled pick up, I have to decline any other requests, which lowers my acceptance rate.  Eventually, I get the request for my scheduled pick up, but almost always other trip requests come through before then.  \n\nI don't understand why the app sends trip requests to someone that has a scheduled pick up at the same time..", "2_Subreddit": "Lyft"}], "dwogymo": [{"0_Comment Submission": "Scheduled Lyft Never Arrived", "1_Text": "When your waiting for the ping from the scheduled ride to come through, you just have to decline any other requests that come through.  Eventually, you will get the request for the scheduled ride.  I have the same issue.  Tells you to go online at a certain time, then you get other requests coming through.  I wish they would change it so that when you accept a scheduled trip, no other requests are sent your way during that time, so you don't have to keep declining them & lowering your acceptance rate.", "2_Subreddit": "Lyft"}], "dwohdei": [{"0_Comment Submission": "Scheduled Lyft Never Arrived", "1_Text": "In a way, yes.  It especially sucks if you are trying to get a weekly bonus, which they offer occasionally, and one of the requirements is to keep your acceptance rate above 90%.  I'm surprised Lyft hasn't done something about the scheduled pick up issue, it seems like it would be such an easy fix on their end.  For me, because of the issues, I only take on scheduled pickups that have estimated earnings of  $15 or more.  Otherwise, it's not worth the headache and I'm better off taking regular trips on my own time.", "2_Subreddit": "Lyft"}], "dwohmxi": [{"0_Comment Submission": "Scheduled Lyft Never Arrived", "1_Text": "I also see the frustration from a passengers perspective.  If someone has to be to work or has to catch a flight, etc. scheduling ahead would make more sense than waiting until it's time to go and hoping there's a driver available in the area.", "2_Subreddit": "Lyft"}], "dwoibz1": [{"0_Comment Submission": "Fuck im old starterpack", "1_Text": "Gone are the days where I got free dial up internet by using a new AOL free trial disc every month.", "2_Subreddit": "starterpacks"}], "dwoivii": [{"0_Comment Submission": "Most women don't care about muscles as long as you have a good looking face and low bodyfat.", "1_Text": "I prefer more average looking bodies to those ripped,  muscular types.  A little definition is cool, but tbh I could care less.  Give me a guy that is 5'8\" or taller with broad shoulders, full head of hair, intelligent with a good sense of humor and I'm happy.", "2_Subreddit": "unpopularopinion"}], "dwoljue": [{"0_Comment Submission": "IsItBullshit: All those posts that say, “Upvote this so when someone googles [blank] it will be the first image on Google.”", "1_Text": "I wondered the same thing.. I feel like if there were any chance to make something the first search result,  it would take a ton of upvotes, making it almost impossible.", "2_Subreddit": "IsItBullshit"}], "dwolrog": [{"0_Comment Submission": "They sat here for hours.", "1_Text": "Same with my cat.  Not that there's anything wrong with a fat cat; I actually prefer fat cats, as long as they're not overly obese to the point that it's detrimental to their health.", "2_Subreddit": "cats"}], "dwqimu5": [{"0_Comment Submission": "People with dry skin, what are your favourite foundations?", "1_Text": "I second Loreal Pro Glow.  Love the finish and perfect amount of coverage.", "2_Subreddit": "Makeup"}], "dwrb7qj": [{"0_Comment Submission": "Posted awhile back from here. Still laughing.... lol", "1_Text": "Dayzie can knock on my door anytime; just show me the money lol.  Wallace, on the other hand, is shit outta luck..", "2_Subreddit": "opiates"}], "dwrcyx7": [{"0_Comment Submission": "Hating, blaming, fat people and fat acceptance is not an unpopular opinion. Just search \"fat\" in this thread. 90% of the web and public is against fat people. Stop acting like you are in the minority.", "1_Text": "Amen to that.  The only body I care about is my own.", "2_Subreddit": "unpopularopinion"}], "dws4d74": [{"0_Comment Submission": "Opioid lawsuit supported by majority of Kalamazoo County board.", "1_Text": "The whole crackdown on opioids accomplishes 2 things:\n\n1.  People with legitimate chronic pain are being denied medication because doctors can't distinguish those in pain from drug seekers.  Not to mention, many physicians are afraid of losing their license or going to prison amid the opioid crisis hysteria. \n\n2. The people who actually do abuse pain medication will just turn to heroin once they can no longer access prescription pills.", "2_Subreddit": "kzoo"}], "dws4mxr": [{"0_Comment Submission": "/trashy is plentiful with cold cop methods today! This is inside a porta john.", "1_Text": "Interesting.. BRB looking for nearest port-a-jon.", "2_Subreddit": "opiates"}], "dws4xf9": [{"0_Comment Submission": "Gay for opioids?", "1_Text": "I didn't see that coming...  lol", "2_Subreddit": "opiates"}], "dws9fkm": [{"0_Comment Submission": "Plaza in a poor suburb", "1_Text": "Yep, sounds about right.  I would probably replace Subway with something like Little Caesars tho.  Subway is a little expensive for some folks.  $5 pizza will feed the whole fam.", "2_Subreddit": "starterpacks"}], "dwvvz6x": [{"0_Comment Submission": "When you’re running out of people who will collab with you...", "1_Text": "I'm actually looking forward to these videos; I think they will be hilarious together. It's entertainment for me, regardless of how I feel about them personally.", "2_Subreddit": "BeautyGuruChatter"}]}], "1_submissions": [{"890rip": [{"0_Title": "My 2 ginger haired babies ❤", "1_Text": "I can't...", "2_Subreddit": "cats"}], "8a9vlb": [{"0_Title": "Man dies after eating 7 g of coke at traffic stop", "1_Text": "I can't...", "2_Subreddit": "cocaine"}]}]}]}