{"Aerobear116": [{"0_comments": [{"dtebn0p": [{"0_Comment Submission": "Anyone else or am I the only fan here?", "1_Text": "That part.", "2_Subreddit": "opiates"}], "dtek3b0": [{"0_Comment Submission": "Recovery and Counter Strike skills?", "1_Text": "When I quit I got so bad at FIFA. I was pretty decent when I was high af, half awake(if I stayed awake long enough). There were some games I lost like 8-0 from passing out during the load screens lol. Don’t know what it was. A lot of it is muscle memory and reflexes. Maybe it was because when I was in my stupor I didn’t think much, now maybe I overthink everything instead of letting it flow. I have eventually gotten back to a comparable level.", "2_Subreddit": "OpiatesRecovery"}], "dtgayr0": [{"0_Comment Submission": "I’m just tryna listen to some lil peep and nod off", "1_Text": "Woke up fucked up thought it was a dream...", "2_Subreddit": "opiates"}], "dtgdjx7": [{"0_Comment Submission": "A year clean and still feeling dull and lethargic constantly", "1_Text": "Try getting on some kind of exercise regiment or maybe changing up your diet. Work on a goal or project. Try to keep yourself busy. It’s a mindset, you just need to shake it. Fake it til you make it.", "2_Subreddit": "OpiatesRecovery"}], "dtns4cg": [{"0_Comment Submission": "[Post Game Thread] Nets lose to the Lakers", "1_Text": "He has active hands and rarely gets beat too easily. Had a good recovery block on Ingram one of the few times he did get beat.  He also prevented a couple of fast breaks by getting back.", "2_Subreddit": "GoNets"}], "dtp2l6d": [{"0_Comment Submission": "How much work did you guys miss due to this? I can't miss anymore, it's not an option.", "1_Text": "Family and Medical Leave Act", "2_Subreddit": "OpiatesRecovery"}], "dtps62e": [{"0_Comment Submission": "Can’t stop browsing this sub", "1_Text": "I’m over 8 months off opi’s and I feel the same way. Browsing the sub doesn’t seem to trigger me(except maybe when I see some opanas, but I can’t get them around me anyway). The withdrawal posts, ones waiting on the dboy, posts about middlemen being dbags and all the like remind me why I got out and should stay out.", "2_Subreddit": "opiates"}], "dtq88xs": [{"0_Comment Submission": "Wish me luck", "1_Text": "Loved working super bowl Sunday when I was a delivery boy. Think that was the most I ever got in tips except maybe when my coworker got into an accident falling asleep at the wheel and I had to take all the deliveries. He was a smack head way before I even touched a pill. Good luck my friend.", "2_Subreddit": "opiates"}], "dttld03": [{"0_Comment Submission": "What your favourite Sonic game says about you", "1_Text": "It was my first sonic game! Idk if it is trying to say if it’s pretty much only nostalgia that gives Sonic 2 any worth.", "2_Subreddit": "SonicTheHedgehog"}], "dujb7uj": [{"0_Comment Submission": "Drug usage and age started?! Favorites? Least favorites? Why?", "1_Text": "Currently 9 months off opioids and besides drinking I haven’t done any drugs in over 2 months. Messed around with Eth(an)ol at 11, and drank coffee around the same time. Met Mary Jane at 13 and she’s been my most consistent friend, always there for me. Had my flings with percs and xans at 15, xans and I have forgettable nights every now and then still. At 16 I had met Molly, and we’d hippy flip and candy flip a couple times per year til my mid-20s. Hung out with White girls at a couple parties at 17 but they were too fast for me, and they started me on cigs. Met Rox(i)anne who I thought was the love of my life at 18 in college. We were tight(even with me banging Addy 2 weeks a year).  Then I ran off with her sister Opana at 22 and it was absolute bliss. When she ran out on me I rebounded with Heroin at 24. Finally broke it off with that toxic chick at 26, she was almost straight fent by then, the short rush I had with her never made up for all the pain she caused me. \n\nLooking back if I had to choose, my favorites would be Opana, she still has my heart and Mary Jane for always being there, sucks I don’t get to see her much with my new job. But I think in phases of my life there were things that were my favorite. Molly and going to hookah lounges at one point of my life was the coolest thing then I(fucking ridiculously stupidly) thought blacking out from alcohol and xans was cool but if we’re talking solo then my first two choices. Least favorite definitely the later stages with Heroin, that gold digging bitch tapped my dry.", "2_Subreddit": "opiates"}], "dulagq3": [{"0_Comment Submission": "To any other addicts out there: If you’ve relapsed recently, do you know what to do? Get back on the horse - ride that bucking bronco! Set a new record!", "1_Text": "Might be a poor choice of words for some.", "2_Subreddit": "OpiatesRecovery"}], "duqdl6h": [{"0_Comment Submission": "WD time. This is all I got to handle it. You can tell I'm high class.", "1_Text": "Iirc drinking by itself tended to exacerbate my physical symptoms most of the time. Mixed with a bit of benzos would allow to me to get a bit of restful sleep that I couldn’t get just taking either alone, especially when insomnia was hitting hard. Like most on dope drinking stopped doing it for me but after some clean time off dope it’s slowly getting back into my rotation.", "2_Subreddit": "opiates"}], "dv75onm": [{"0_Comment Submission": "sigh", "1_Text": "Nets giveth Nets taketh away.", "2_Subreddit": "GoNets"}], "dv9achh": [{"0_Comment Submission": "i wish i could find opana again 😩", "1_Text": "Opanas would make me consider coming out of “retirement” I loved them so much. Best time in my addiction was when I got 50 40mg pills early on. Was the best 3-4 months(didn’t know the withdrawal shit storm that would follow being constantly high af). Since then they’ve disappeared off the menu around me for like the last 5 years.", "2_Subreddit": "opiates"}], "dv9n91u": [{"0_Comment Submission": "Heroin", "1_Text": "Quit before you even think about playing. If there’s someone who has done heroin once then never tried it again I have never met them.", "2_Subreddit": "opiates"}], "dvakm2z": [{"0_Comment Submission": "Heroin", "1_Text": "Congrats friend. You are way stronger than any junkie I’ve ever known.", "2_Subreddit": "opiates"}], "dvdnk22": [{"0_Comment Submission": "Thursday March 8th Daily Check In", "1_Text": "9 months and change. It seems so long and so short at the same time. Like what I’ve been able to do in them seems almost unbelievable to me. Crazy how much I can get done when I’m not in a perpetual haze. Then again it still feels close enough where one slip and I’m back at the bottom of the hole I was in. For the first time in a long time it feels like I’m almost back to the me I was before and I’m not gonna give that up.", "2_Subreddit": "OpiatesRecovery"}], "dwlzvee": [{"0_Comment Submission": "[Post Game Thread] 30 WINS INCOMING BOYS, NETS BEAT HEAT IN OT!", "1_Text": "LeVert so clutch. That scramble and Wade’s shot hanging on the rim were heart attack inducing though. Let’s get another W against the Pistons tomorrow. 30 wins would be an accomplishment given the season of bad calls late and injuries.", "2_Subreddit": "GoNets"}], "dwlzwwu": [{"0_Comment Submission": "Caris \"I AM THE PG NOW\" LeVert!", "1_Text": "Amen.", "2_Subreddit": "GoNets"}], "dwmb68e": [{"0_Comment Submission": "Let’s just overgrow the government with poppies ... ?", "1_Text": "Turn America into a chapter out of the Wizard of Oz. Can dig it.", "2_Subreddit": "opiates"}], "dwmcyon": [{"0_Comment Submission": "Let’s just overgrow the government with poppies ... ?", "1_Text": "Lol true. I, my friend, am a victim of unorganized thinking.", "2_Subreddit": "opiates"}], "dwq9s25": [{"0_Comment Submission": "fifa 18 is the worst game of the year", "1_Text": "I honestly chuckled.", "2_Subreddit": "FIFA18"}], "dwsjmlc": [{"0_Comment Submission": "Pre-Match Thread: Arsenal vs CSKA Moscow [Europa League]", "1_Text": "Hope Auba giving up his hat-trick to give Laca a goal gives him a boost tomorrow. Hopefully we don’t wait until halfway through the second half to get going.", "2_Subreddit": "Gunners"}], "dwsju14": [{"0_Comment Submission": "What is your WD tv show.", "1_Text": "Drugs Inc. Most of the time I just lol at how wrong they get some things.", "2_Subreddit": "opiates"}], "dwuljok": [{"0_Comment Submission": "N.J. drug overdose deaths in 2018 on a record-shattering pace", "1_Text": "I believe it. Seen a lot of fent in the NY, NJ, PA areas. So much so that anyone picking up dope now is gonna have a real hard time finding something that’s not cut with it to some extent.", "2_Subreddit": "opiates"}]}], "1_submissions": [{"6mg81v": [{"0_Title": "Guilt Over Not Helping Friends Still Using?", "1_Text": "That part.", "2_Subreddit": "OpiatesRecovery"}]}]}]}