{"bLueMerloni": [{"0_comments": [{"dvop97r": [{"0_Comment Submission": "I Still Can't Figure Out How They Be Tying These Small Little Knot Bags!?? 🤷‍♂️", "1_Text": "I know my dudes double bag the corners so they can swallow their shit if they get pulled over and throw it back up/shit it out", "2_Subreddit": "opiates"}], "dw089yd": [{"0_Comment Submission": "🙃", "1_Text": "You know what sucks? When you get accused of being high but it's that 1.1% of the time when your not and you're on edge already from WD.", "2_Subreddit": "opiates"}], "dw4fp2n": [{"0_Comment Submission": "Cold cop was a success", "1_Text": "These are actually 15s, t188.  The t189 are the 30s.", "2_Subreddit": "opiates"}], "dwbi1b9": [{"0_Comment Submission": "Found this on the floor at the nursing home i work at. I think nurses are pocketing pain meds and accidentally dropped some.", "1_Text": "Hey I know you prob know the deal at your own work better than me but I want to throw in my two cents.  At the assisted living place I used to have my great aunt and uncle in, they both would have their medication given to them daily by staff because they would forget if it were left up to them.  The nurses came in and give it to them out of a wax paper envelope thing with a similar sticker on it as shown in your picture.   If you think there’s a possibility someone made an honest mistake and a patient was left without their meds you should see if you can correct the situation.  I really hope the nurses aren’t stealing from someone, especially someone old who’s in pain.", "2_Subreddit": "opiates"}], "dwbjnp3": [{"0_Comment Submission": "Favorite Snack or drink while nodding?", "1_Text": "Milkshakes are great but honestly I’ll even just take some cold milk.  I swear when I’m on a run doing blues it feels like a could drink a gallon of cold 2% milk some nights.  I know it’s most likely in my head but sometimes it even makes me feel like the high is intensified.", "2_Subreddit": "opiates"}], "dwbjs79": [{"0_Comment Submission": "Favorite Snack or drink while nodding?", "1_Text": "I believe that’s an A 215 I believe making it a 30.  I hear you though,  I wouldn’t even be touched by 1 blue now a days, sadly.   I wish my tolerance was back to that of a normal person when a half would have me feeling nice.  That’s the game we play, chasing that first high.", "2_Subreddit": "opiates"}], "dwbk80b": [{"0_Comment Submission": "Scored a 100 pack of blues... Last hooray before getting sober for good", "1_Text": "Yea I wish it was like the old days.  I had a connect up here in the northeast where I could get 100 for 7 and 300+ for 5.  I remember going out to the bars and basically handing them to my friends in exchanges for the round they just bought me.   If we only knew the market was going to change so drastically....", "2_Subreddit": "opiates"}], "dwbk9ow": [{"0_Comment Submission": "Scored a 100 pack of blues... Last hooray before getting sober for good", "1_Text": "Yo my grandpa used to get beers for a nickel back in the day.", "2_Subreddit": "opiates"}], "dwbl57o": [{"0_Comment Submission": "What's Happening to Our Sub?", "1_Text": "I used to be here on a daily basis for years.  I had genuine friends I could inbox when I needed to talk to someone who wouldn’t judge and who understood the shit I was going through.   It was all ruined for me when those assholes at publichealthwatch came in the sub with their pitchforks.  I really started to see the change around then.  Not only did they threaten to ruin my career and relationship (which they failed) but they also would belittle people who were coming to the sub for alittle reassurance they could get though this addiction shit.  I can remember specifically some people would write a sincere thread about their struggles and how they were trying to get straight when those assholes would come in and make fun of us and make the posters feel like shit for no reason other than their lives must’ve sucked.  I’m sure there are a lot of factors that played into it but I really believe publichealthwatch contributed to losing some sincere memebers here and changing the sub completely.", "2_Subreddit": "opiates"}], "dwblbqm": [{"0_Comment Submission": "What's Happening to Our Sub?", "1_Text": "I also want to add I was never even posting my stash or anything that was to bad either.  The majority of my posts around that time were either talking about my struggle of tapering down my tolerance before quitting for a while, or trying to be there for some people who seemed like they needed to talk to someone.  I don’t know why they picked me or if they made threats to everyone they could find who was active here, but the amount of hate my inbox recieved was insane and I can only imagine how bad they made some people feel who were in a worse place than I was mentally at the time.", "2_Subreddit": "opiates"}], "dwjv3b9": [{"0_Comment Submission": "Feels like oxy is becoming impossible to find", "1_Text": "Ya it’s terrible around my parts lately.  I have already exhausted all options in terms of asking around and offering some people I know in the drug world a finders fee throw me their connect.  One kid I know from college is willing to introduce me to his guy for nothing (I still said I’d take care of him) but his dude is having problems recently too.  It’s interesting, since I saw those new yellow 189s come around recently I figured it might mean there would be more floating around the streets, boy was I wrong on that.  Also my main guy texted me saying he was upping the price a few bucks once he’s set again.  I can’t really blame him since his demand is way higher than his supply but fuck it all just sucks lately.  Really contemplating going on a break again until things get better (if they do).", "2_Subreddit": "opiates"}], "dwjwb7h": [{"0_Comment Submission": "Feels like oxy is becoming impossible to find", "1_Text": "Ya it’s funny you say that.  I reached out to a few people I know are in the opiate scene to see if they’d middle some blues for me.  Obviously no one  could help but two of the kids who I least expected offered to grab me dope.  Now I have plenty of friends who have done/currently do dope but these two kids shocked me because of how small their habits were recently.  One had been doing 30s for years but he always broke them in pieces and ate them throughout the day, he used to judge me for sniffing some of mine as recently as this past fall.  The other kid has only been doing blues daily for a few months but he grabbed dope to stay well during a dry spell, was introduced to the needle and can’t turn back.  A vicious cycle indeed.  \nI am lucky (or unlucky depending on how you look at it) that I didn’t enjoy dope the few times I tried sniffing ecp and also that I can’t shoot for a few different reasons.", "2_Subreddit": "opiates"}], "dwjwin6": [{"0_Comment Submission": "Feels like oxy is becoming impossible to find", "1_Text": "I don’t mind them, I’d rather have a regular old blue 30 or green 15 over them but I like the yellows over the big ones (224s or the big white ones) mainly because I sniff half of my dose usually.  But beggars can’t be choosers and I would be thrilled if my people came up with anything right now! \nHopefully it gets easier for both of us in the near future!", "2_Subreddit": "opiates"}], "dwjy1ts": [{"0_Comment Submission": "Feels like oxy is becoming impossible to find", "1_Text": "My guys don’t use man.  They are strictly in it for the cash.   Now my friends I asked to middle use, but most of them have been calling me more frequently than ever to find for them because of how dry it’s been.", "2_Subreddit": "opiates"}], "dwjyvgk": [{"0_Comment Submission": "Approaching three weeks cold turkey off all opiods after a 3+ year habit. Questions regarding vivid dreams/nightmares.", "1_Text": "Unfortunately it’s extremely common as others have said.  Last time I took a break  it did get better after a while but I still would have them every once in a while.  I am currently using most of the time but when I go in long stretches of taking pieces of sub to get by I will often dream about having a handful of blues and as soon as I’m about to get high in the dream I wake up.  Either that, or something goes wrong like you said.  I’ll drop the line and lose it or I’ll misplace the pills and end up waking up pissed off and sweating.  Shit sucks", "2_Subreddit": "opiates"}], "dwjzq0i": [{"0_Comment Submission": "Feels like oxy is becoming impossible to find", "1_Text": "I’m torn between jealous and happy.  Jealous I can’t find but happy to hear because it gives me hope that this shit is temporary since I’m also on the east coast and close to a major city.", "2_Subreddit": "opiates"}], "dwk0dic": [{"0_Comment Submission": "What's your secret stash spot ?", "1_Text": "I hide mine up my nose most of them time.", "2_Subreddit": "opiates"}], "dwk0mtz": [{"0_Comment Submission": "A bunch of subreddits were deleted? Can someone fill me in", "1_Text": "Honestly this sub would’ve been deleted too if the mods didn’t do such a good job keeping ahead of people trying to source on here.  Big ups to spin/fash and all the others who have kept this place in check over the years.", "2_Subreddit": "opiates"}], "dwmozlw": [{"0_Comment Submission": "What’s up with these oxy RP 15’s that look like tramadol?", "1_Text": "I haven’t seen these 15s but we used to get20s that came from Canada a few years back that were exactly like these.  I haven’t seen them in a couple years here (in north east) but I used to like them.", "2_Subreddit": "opiates"}], "dwmzx2c": [{"0_Comment Submission": "When you go to probation as an optimistic opportunist...", "1_Text": "These look extremely white.  I’m guessing it’s the pic and they are yellow in person?  Or am I completely wrong and looking at something other than what I’m thinking?", "2_Subreddit": "opiates"}], "dwn1aay": [{"0_Comment Submission": "When you go to probation as an optimistic opportunist...", "1_Text": "Nah man I wasn’t trying to be negative at all. Like I stated I was assuming it was the light but I wasn’t sure if they came in white too or something else that might explain its. I’m almost positive these aren’t common for presses yet.  I think it’s mostly As, Ms and Vs that get pressed, but nothing would surprise me anymore.  Anyways happy nods & happy Easter.", "2_Subreddit": "opiates"}], "dwp2j73": [{"0_Comment Submission": "So friend went out of town", "1_Text": "Past experience.  Use one of the express packages that are cardboard but the shape of a Manila folder that usps has on location, put a video game case or CD case inside with the ox wrapped inside the case.  Make sure to put the rox inside like tissue or a baggie\nSo they don’t rattle around in the plastic. \n\n If you want to really be safe, gift wrap the cd/game case and add a BS birthday card or something (that’s what I did at first but it’s not\nNeeded). I mailed successfully, through usps, from west to back home (NE) a million times like this.   It’s honesty prob overboard if you’re only mailing a couple, but if you want to be safe go for it.", "2_Subreddit": "opiates"}]}], "1_submissions": [{"85cw5p": [{"0_Title": "Fake M box with fent in MA", "1_Text": "I know my dudes double bag the corners so they can swallow their shit if they get pulled over and throw it back up/shit it out", "2_Subreddit": "opiates"}], "88du78": [{"0_Title": "Feels like oxy is becoming impossible to find", "1_Text": "I know my dudes double bag the corners so they can swallow their shit if they get pulled over and throw it back up/shit it out", "2_Subreddit": "opiates"}]}]}]}