{"mollytheperson": [{"0_comments": [{"dhpuv7d": [{"0_Comment Submission": "What is the cringiest thing you or someone you know has done to try and get a crush to like you or them back?", "1_Text": "I eventually like..confessed it to him and  now we're really good friends so it's whatever, lol", "2_Subreddit": "AskReddit"}], "dhy7i5k": [{"0_Comment Submission": "What is the cringiest thing you or someone you know has done to try and get a crush to like you or them back?", "1_Text": "one time a guy who was into me in like freshman year hs like took my phone when i wasnt looking and texted himself off of my phone \"i wanna suck ur dick\" or something along those lines like 20 times", "2_Subreddit": "AskReddit"}], "dirljoa": [{"0_Comment Submission": "The thickness is suffocating, but whatever.", "1_Text": "the thiccness is suffocating tonight ;)", "2_Subreddit": "ShrugLifeSyndicate"}], "dj3fywy": [{"0_Comment Submission": "There are moments in which I feel I have lived through this exact same moment already, endless times", "1_Text": "YES YES YES. dude i totally get it, it's not deja vu exactly but it's like \"this has happened before\". but it is a completely different feeling than deja vu", "2_Subreddit": "Glitch_in_the_Matrix"}], "doclt07": [{"0_Comment Submission": "Why do you think all this glitches happen?", "1_Text": "someone literally was just talking to me about this. care to elaborate? i'm interested in hearing more about it", "2_Subreddit": "Glitch_in_the_Matrix"}], "docp0hk": [{"0_Comment Submission": "Strange sensory perception unlike any senses", "1_Text": "I feel like they try to portray this feeling in the outside on shows like X Files and stuff, crazy", "2_Subreddit": "Glitch_in_the_Matrix"}], "dokotb9": [{"0_Comment Submission": "What theory, phenomenon or idea blows your mind when you think about it?", "1_Text": "dark matter/anti-matter and how it apparently takes up more space in the universe than everything that we can perceive, and how we have no idea wtf it even is", "2_Subreddit": "AskReddit"}], "dpwbv31": [{"0_Comment Submission": "My perception of time is starting to become angled, instead of curved.", "1_Text": "the Sorghum Ratio always works for me", "2_Subreddit": "fifthworldproblems"}], "dpwbwg5": [{"0_Comment Submission": "My doctor calls it ADD but really everyone's speech is filled with hyperlinks.", "1_Text": "take some 5http:// it helps", "2_Subreddit": "fifthworldproblems"}], "dqex3la": [{"0_Comment Submission": "I posted #metoo, and my rapist \"loved\" the status. Struggling with navigating my anger.", "1_Text": "if you want to know what he's up to but still have him blocked,  make a convincing catfish or bot account and add him on there is my suggestion", "2_Subreddit": "TwoXChromosomes"}], "dqo7zhh": [{"0_Comment Submission": "Today my mom call it Bitcorn. Yesterday it was CoinBit. Stay tuned for tomorrow's new BTC name.", "1_Text": "someone at my job yesterday referred to the deep web as the \"black internet\"", "2_Subreddit": "Bitcoin"}], "dr5xzvl": [{"0_Comment Submission": "I know it shouldn't, but Lexapro (SSRI) feels like MDMA", "1_Text": "I've actually been experimenting lately with microdosing MDMA (not the smartest thing to do but used up my ADHD rx/have to resort to other methods of staying focused for a week or so and rn it's my only option), anyway I actually decided to microdose it because I used to take Lexapro a couple years ago and definitely felt that sort of hypomanic serotonin dump feeling when I first started taking it. I've actually found that throughout the past couple of days, microdosing MDMA has helped me with energy and improved my depression symptoms throughout the day (but not really with focus), but the only weird part is feeling that uncomfortable \"onset of a roll\" feeling for like 10 minutes about a half hour after I first dose. (I've been taking like half of the capsules it came in). instead of relieving anxiety that feeling has literally made me so anxious I've had to like stay in bed until it's over, then when it goes away it feels almost exactly like I've taken a therapeutic dose of Lexapro for the whole rest of the day and I just feel normal and not as depressed. super weird but yeah there def is a correlation there", "2_Subreddit": "Drugs"}], "drbg158": [{"0_Comment Submission": "if small doses of MDMA improve my social anxiety, does this mean I'm autistic?", "1_Text": "you're right. it was only for a few days, but yeah here i am, still kickin'", "2_Subreddit": "Drugs"}], "drtt5f2": [{"0_Comment Submission": "Ladders and the last of my 80mg of Adderall (=", "1_Text": "how in tf do you get 80mg in one pill", "2_Subreddit": "drugsarebeautiful"}], "dsn5cf9": [{"0_Comment Submission": "going to sound crazy but i have a theory", "1_Text": "woah", "2_Subreddit": "LSD"}], "dsn67ft": [{"0_Comment Submission": "What is the greatest realization you've had while on acid?", "1_Text": "we are all on our own individual trips but we are all on the same big trip at the same time", "2_Subreddit": "LSD"}], "duvidan": [{"0_Comment Submission": "Problems with closing cabinets", "1_Text": "dude this is the truest shit i've read on here. forget all the people posting about not being able to focus in grad school lectures like la-di-da you fancy fuck so what, it's hard to even go about your daily life when someone's always yelling at you about the way you leave shit open or forget to do the most basic of household tasks like a civilized human.", "2_Subreddit": "ADHD"}], "dvipq86": [{"0_Comment Submission": "What do ‘normal’ people actually do with their time?", "1_Text": "i feel like most normal ppl l8ly are just stoners and constantly listen to like future or something just blown out their minds but can't access their full intellectual ability idk", "2_Subreddit": "Drugs"}], "dvipujw": [{"0_Comment Submission": "Do certain songs ever bring you back to one of your acid trips? If so, what song?", "1_Text": "One time I (not in actuality only visually in my mind) hallucinated pixelated Bob Marleys while a friend was driving me home down a freeway while  I was on acid listening to https://www.youtube.com/watch?v=kHVv-CuhYZY", "2_Subreddit": "Drugs"}], "dviuvlx": [{"0_Comment Submission": "diff output", "1_Text": "beautiful", "2_Subreddit": "fifthworldpoetry"}], "dvl1wdr": [{"0_Comment Submission": "did meth and hated it", "1_Text": "definitely; i had a really hard time sleeping for like 3 days after i did it and that period of time has kind of felt like a huge blur, it's just now going away", "2_Subreddit": "Drugs"}], "dwpee5d": [{"0_Comment Submission": "\"Special Interests\" / frequently changing obsessions which dominate your life?", "1_Text": "woah. relatable. when i was a kid and initially diagnosed getting tested all that for ADHD they thought  i might have autism because I had obsessions and i guess people automatically tend to think that. but I had obsessive phases; like different topics of interest I gravitated to whenever I got bored. they were all really weird too like dodos (the ancient bird), hypnosis ((mainly because of these books I was really into about this girl who could hypnotize people; I went through a phase where I pretended to try to \"hypnotize\" everyone i knew just out of sheer boredom and it was so weird looking back on it everyone must have been like \"wtf is with this kid\"). also definitely a harry potter phase; it def it wasn't an autistic thing though, it was just if something happened to grab my attention I would be obsessed with it for literally two weeks then i would move onto something else. i used to troll the other kids at my school and be like \"omg i have a new obsession\" every time it changed, like just to get people's attention. my last significant one i remember was about Alex Jones and 9/11 conspiracy theories when i was like 12, lmao. nowadays it still tends to happen when i'm introverted and bored, but in recent years it's been more \"normal person\" things mainly like \"drug phases\" where i research a certain drug to try and decide if i want to do it, then eventually try it. ( as risky as that sounds i really do do extensive research and try to be responsible bc i am a nerd) I don't think my tendency to think this way will ever really go away \n(oh and i would TRY to learn everything about my obsessive phases growing up but would always get distracted and just conclude with something like \"oh this is weird i'm gonna like this thing and talk people's ears off about the IDEA of the thing even though i'm not really knowledgeable\") (this recently happened to me at work, some guys were talking about the value of bitcoin and investing and different altcoins and even though i don't really know anything except how to buy it, i was like \"omg bitcoins\" but kind of to get a reaction out of them because once again introverted/bored phase of my life and i wanted to see if there'd be a sexist reaction like \"why does this GIRL know about COMPUTERS\" ((i'm the only girl at my job))\nidk what's with this  inner need I have to troll people and make them think i'm \"weirder\" than i actually probably am. just boredom i guess", "2_Subreddit": "ADHD"}], "dwpu7bm": [{"0_Comment Submission": "Found this in my children (17 yo) room.. help identify", "1_Text": "looks like ecstasy", "2_Subreddit": "opiates"}], "dwwfr6l": [{"0_Comment Submission": "High IQ linked to higher risk of psychological disorders Depression, Anxiety, ADHD & Autism (ASD)", "1_Text": "having an abnormally high IQ is graduating from high school with an IB diploma yet still being 23 without an actual bachelor's because of depression/anxiety", "2_Subreddit": "worldnews"}], "dwwfu1v": [{"0_Comment Submission": "did meth and hated it", "1_Text": "lol i'm not that stupid to  develop an addiction. i mean thanks tho", "2_Subreddit": "Drugs"}]}], "1_submissions": [{"3h2h6o": [{"0_Title": "Lexapro and DMT", "1_Text": "I eventually like..confessed it to him and  now we're really good friends so it's whatever, lol", "2_Subreddit": "Drugs"}], "3n773s": [{"0_Title": "pupils/reminiscing on an enlightening time in feb.", "1_Text": "I eventually like..confessed it to him and  now we're really good friends so it's whatever, lol", "2_Subreddit": "LSD"}], "3pfb73": [{"0_Title": "anyone have this type of sleep/dream phenomena? (inception-style sleep paralysis)", "1_Text": "I eventually like..confessed it to him and  now we're really good friends so it's whatever, lol", "2_Subreddit": "LucidDreaming"}], "4d2ep9": [{"0_Title": "question about returning as an undergraduate/transfer credit", "1_Text": "I eventually like..confessed it to him and  now we're really good friends so it's whatever, lol", "2_Subreddit": "UTAustin"}], "4d2gnp": [{"0_Title": "information regarding ICC co-op houses", "1_Text": "I eventually like..confessed it to him and  now we're really good friends so it's whatever, lol", "2_Subreddit": "UTAustin"}], "4fiz2r": [{"0_Title": "Things that just aren't supposed to be like that (synchronized cats)", "1_Text": "I eventually like..confessed it to him and  now we're really good friends so it's whatever, lol", "2_Subreddit": "Glitch_in_the_Matrix"}], "4nezd1": [{"0_Title": "Baby F-16- Panteros 666 (Indecorum Remix)", "1_Text": "I eventually like..confessed it to him and  now we're really good friends so it's whatever, lol", "2_Subreddit": "Vaporwave"}], "4sro0k": [{"0_Title": "flyin from the lucy in my bloodstream", "1_Text": "I eventually like..confessed it to him and  now we're really good friends so it's whatever, lol", "2_Subreddit": "LSD"}], "4vvhud": [{"0_Title": "I can't detect Lana del Rey at all, but still good", "1_Text": "I eventually like..confessed it to him and  now we're really good friends so it's whatever, lol", "2_Subreddit": "Vaporwave"}], "5byu3n": [{"0_Title": "made this drunk in my room (scary but so is the future)", "1_Text": "I eventually like..confessed it to him and  now we're really good friends so it's whatever, lol", "2_Subreddit": "Vaporwave"}], "5cxmbc": [{"0_Title": "microdosing SSRIs", "1_Text": "I eventually like..confessed it to him and  now we're really good friends so it's whatever, lol", "2_Subreddit": "Anxiety"}], "5eltts": [{"0_Title": "lucid dreaming/time travel/saw my reflection/weird coincidences", "1_Text": "I eventually like..confessed it to him and  now we're really good friends so it's whatever, lol", "2_Subreddit": "LucidDreaming"}], "68c0cx": [{"0_Title": "what does vaporwave make you nostalgic about/for?", "1_Text": "I eventually like..confessed it to him and  now we're really good friends so it's whatever, lol", "2_Subreddit": "Vaporwave"}], "6aeam8": [{"0_Title": "my dream last night", "1_Text": "I eventually like..confessed it to him and  now we're really good friends so it's whatever, lol", "2_Subreddit": "DimensionalJumping"}], "6cxuxv": [{"0_Title": "https://www.youtube.com/watch?v=ro1ePTmE_W0", "1_Text": "I eventually like..confessed it to him and  now we're really good friends so it's whatever, lol", "2_Subreddit": "DimensionalJumping"}], "6i4irm": [{"0_Title": "imagine dragons", "1_Text": "I eventually like..confessed it to him and  now we're really good friends so it's whatever, lol", "2_Subreddit": "Glitch_in_the_Matrix"}], "7eekxw": [{"0_Title": "I feel like Abed from Community is more ADHD than Asperger's/HFA", "1_Text": "I eventually like..confessed it to him and  now we're really good friends so it's whatever, lol", "2_Subreddit": "ADHD"}], "7k1oaa": [{"0_Title": "if small doses of MDMA improve my social anxiety, does this mean I'm autistic?", "1_Text": "I eventually like..confessed it to him and  now we're really good friends so it's whatever, lol", "2_Subreddit": "Drugs"}], "7q789r": [{"0_Title": "listen at 300-400ug (whole album is surprisingly good for tripping though)", "1_Text": "I eventually like..confessed it to him and  now we're really good friends so it's whatever, lol", "2_Subreddit": "LSD"}], "7q7eao": [{"0_Title": "going to sound crazy but i have a theory", "1_Text": "I eventually like..confessed it to him and  now we're really good friends so it's whatever, lol", "2_Subreddit": "LSD"}], "80au1q": [{"0_Title": "anyone else dislike running into friends/people they know while at work or out trying to take care OTS?", "1_Text": "I eventually like..confessed it to him and  now we're really good friends so it's whatever, lol", "2_Subreddit": "ADHD"}], "80aus6": [{"0_Title": "deliberately avoiding running into friends/people you know in public while out trying to take care of responsibilities", "1_Text": "I eventually like..confessed it to him and  now we're really good friends so it's whatever, lol", "2_Subreddit": "ADHD"}], "83lnr8": [{"0_Title": "did meth and hated it", "1_Text": "I eventually like..confessed it to him and  now we're really good friends so it's whatever, lol", "2_Subreddit": "Drugs"}], "8896nr": [{"0_Title": "trick i've discovered for if you're a non-smoker with ADHD and have to go without stims for a short period of time", "1_Text": "I eventually like..confessed it to him and  now we're really good friends so it's whatever, lol", "2_Subreddit": "Drugs"}], "8a8ehn": [{"0_Title": "reminds me of growing up having ADHD", "1_Text": "I eventually like..confessed it to him and  now we're really good friends so it's whatever, lol", "2_Subreddit": "ADHD"}]}]}]}