{"amy-traphouse": [{"0_comments": [{"dvm7p3i": [{"0_Comment Submission": "I'm not millenial-bashing, but for people who seem to complain about the difficulties of finding jobs these days, you are almost impossible to contact after your resume is received", "1_Text": "or they’ve already found another job by the time the potential employer finally decides to get back to them..", "2_Subreddit": "self"}], "dw0hmkv": [{"0_Comment Submission": "[Shelfie] I was going to make an order but I underestimated the number of products I have (:", "1_Text": "the color coordination😍🤗😌", "2_Subreddit": "SkincareAddiction"}], "dw0skgg": [{"0_Comment Submission": "Took 100mg of tramadol this morning like 5 hours ago, will it blocl the effects of the morphine if i take 200mg of morphine ?", "1_Text": "no. it won’t block morphine. if anything, it may increase the effects as both are downers.", "2_Subreddit": "opiates"}], "dw65uug": [{"0_Comment Submission": "Strange banner image on lil peeps old twitter?", "1_Text": "whats the twitter handle ?", "2_Subreddit": "LilPeep"}], "dw7a90i": [{"0_Comment Submission": "Anybody else like to get faded and then nod to bizarre-but-tingly ASMR videos?", "1_Text": "wut.. this is a thing ? this would ruin my whole high ! that is about the most irritating thing i have EVER listened to😅 oh my.", "2_Subreddit": "opiates"}], "dw8ffc6": [{"0_Comment Submission": "A guy in my town makes these skeleton displays!", "1_Text": "hella morbid. that’s gnarly !!!", "2_Subreddit": "mildlyinteresting"}], "dwcpfp0": [{"0_Comment Submission": "This is me making fun of those memes where people label their money for specific shit and try to show it off but also I’m sure some of you can actually relate to this so", "1_Text": "ahhhh yes.. “drug budgeting”. i’ve found i don’t even count my money in monetary increments anymore, i.e $50, $100, $200, etc.. but more like $half a gram, $one gram, $two grams, etc.. 😂😂", "2_Subreddit": "opiates"}], "dwsnkvi": [{"0_Comment Submission": "going rehab #12 tomorrow", "1_Text": "my immediate family,( my mom, dad, younger brother and older sister do know. they are all supportive. i’m  very fortunate to have a family that is so supportive and mostly understanding. it hurts me that they’ve done so much to get me clean and keep me clean each time and i always blow it. i really don’t deserve for them to still be there, but some how they are💖 once my family found out ( about a year or two into my use) i’ve been very open and honest about what’s been going on with me. it’s actually been nice to not have to lie about it. but it hurts to constantly disappoint the people you love. \n\nif you want to get clean, you should look into some programs near you and see if they offer a medical detox ! it would really help you get clean and give you the tools and resources you need to stay clean ! good luck to you too girl(:", "2_Subreddit": "opiates"}]}], "1_submissions": [{"89me92": [{"0_Title": "going rehab #12 tomorrow", "1_Text": "or they’ve already found another job by the time the potential employer finally decides to get back to them..", "2_Subreddit": "opiates"}]}]}]}