{"amphboy": [{"0_comments": [{"dws6l8x": [{"0_Comment Submission": "best cigarette for cocaine, cloves, menthol, kretek?", "1_Text": "Kamel Reds were my go to heroin cigarette, but I mostly smoked Marlboro reds because it’s what I started on and they’re just so reliable and nice.", "2_Subreddit": "Drugs"}], "dwsg78h": [{"0_Comment Submission": "How to counter Lion.", "1_Text": "Anyday big boy", "2_Subreddit": "Rainbow6"}], "dwsgh8w": [{"0_Comment Submission": "How much does the average rehab cost? How do you pay for your stay, insurance or out of pocket?", "1_Text": "Typical average-higher end  primary care facilities are around $1,000 a day. \n\nExtended care facilities are usually around $250-350 a day. \n\nin my lifetime I’ve spent 6 months at different facilities and ended up having to pay around 120,000 dollars, my parents had to borrow money and sell vehicles, take out loans etc. \n\nit is usually quite expensive, but most of the time insurance will cover most of it until a certain degree.\n\nAlso depending on the area you’re in or looking to go, my last treatment facility was very good and really helped me out a lot. For some reason I don’t feel like saying it here, if you’d like the name you can PM me but they only accept ages 18-25", "2_Subreddit": "opiates"}], "dwsgkip": [{"0_Comment Submission": "I just smoked weed saw someone in the bush heard people screaming saw a ufo and witnessed gang racing please help", "1_Text": "sorta sounds like my days in meth psychosis", "2_Subreddit": "Drugs"}], "dwsisy7": [{"0_Comment Submission": "Trying out r6 siege", "1_Text": "A little bit of advice I have, do not buy the starter edition because for one, you have to pay an insanely high amount to unlock new operators and only get a few to start. Also you cannot upgrade later on and would have to buy the full version with no discount. \n\nIf you do want to try it for free, usually every few months there is a FTP weekend (free to play) which will let you access it for a weekend. \n\nIf you like FPS shooters and have a decent-higher end system I’d highly recommend you buy the full game, it is by far my favorite FPS I’ve ever played and is really fun once you get past the learning curve which is pretty steep at first, but I can understand wanting to try to game for free before spending your money on it.\n\nAlso keep in mind that with steam, you can refund your game for the full purchase amount within 2 hours of gameplay. That isn’t a lot of time to decide wether you like the game or not but it’s a fallback Incase you don’t want to wait for FTP weekend.", "2_Subreddit": "Rainbow6"}], "dwskb5p": [{"0_Comment Submission": "Attackers don't hear Jackal's scan lines", "1_Text": "this is a little off topic but everytime I active vigils ability when there are attacker’s all around me and I’m in some discrete corner and he goes “dawiwanlabege” or whatever he says I yell in my head “SHHHHH THEY HEAR YOU” \n\nI’ve played jackal a bit but I never noticed what you described, probably because no one on my team has pointed out they can’t hear it.", "2_Subreddit": "Rainbow6"}], "dwskfhr": [{"0_Comment Submission": "Trying out r6 siege", "1_Text": "I believe full game is $25? Not 100% sure. \n\nThere are quite a few maps with different play styles, the ranked playlist is more restricted but the casual playlist has more maps. Every attacker/defender usually has 2-3 weapons they can choose from for primary, and 1-2 for secondary. Also they all have 2 gadgets they can choose between.", "2_Subreddit": "Rainbow6"}], "dwskk05": [{"0_Comment Submission": "Trying out r6 siege", "1_Text": "Also I forgot to add, with the full edition all original ops are free now as well as their weapon attachments, usually they cost 100/1500/2000/2500 renown. The DLC ops still cost 25,000 renown but the starter edition does not get the free ops and still has to pay for them.", "2_Subreddit": "Rainbow6"}], "dwskts2": [{"0_Comment Submission": "Trying out r6 siege", "1_Text": "That sounds about right, that’s including DLC ops too. I believe there are roughly 20 original ops and the rest are DLC", "2_Subreddit": "Rainbow6"}], "dwslwie": [{"0_Comment Submission": "Trying out r6 siege", "1_Text": "you will need to buy them with the in game currency or purchase R6 credits with real money to unlock them instantly, but reguardless of version everyone has to do it this way. But it makes sense because they’re DLC ops and Ubisoft wants them to be more exclusive.", "2_Subreddit": "Rainbow6"}], "dwsm3dt": [{"0_Comment Submission": "Attackers don't hear Jackal's scan lines", "1_Text": "I get a massive chub when thermite says “a big fucking hole coming right up”", "2_Subreddit": "Rainbow6"}], "dwsmvc8": [{"0_Comment Submission": "Did anyone try medication such as Zoloft?", "1_Text": "I was on multiple different SSRI’s over the years, it did nothing outstanding but it definitely did help my SA and depression somewhat. I’d say on a scale of 0-100% , 0% being no effect and 100% being total relief of anxiety SSRI’s like Zoloft gave me 25-30% relief. \n\nEver since I had my first benzodiazepine that’s all I wanted for anxiety which is part of the reason I didn’t like SSRI’s because in my head even if the antidepressants helped me I wanted the xanax or klonopin to be totally anxiety free, but benzos get nasty when you use them long term and aren’t really sustainable to take daily and contribute to society etc. \n\nI would say SSRI’s are a good first line to try medication, they didn’t do amazing things for me but they did help which was better than nothing, but because of the side effects I quit them and I’m on no antidepressant medication now. My main side effects were sexual dysfunction and not feeling any emotion... I never felt happy but I never felt sad which I didn’t like. I’d rather feel both good and bad emotions than feel nothing at all, and as far as anxiety goes I did some verbal therapy which helped but my SA is still there but it’s not crippling like the past so I just live with it today.", "2_Subreddit": "socialanxiety"}], "dwsmzn6": [{"0_Comment Submission": "Shouldn't Vigil's ability...", "1_Text": "IMO I think vigils ability should counter lion. In vigils description it says his device blocks his image from cameras and drones, which technically means since lions drone detects movement he wouldn’t be hidden. But I do think it would of been cool and made some sense because he is invisible to “drones” which is what lions device is. \n\nOverall the argument could go both ways on vigil vs lion and I think both sides have logical standpoints.", "2_Subreddit": "Rainbow6"}], "dwsn6qc": [{"0_Comment Submission": "What the hell is with those neckshots?", "1_Text": "I don’t think this is a hit reg problem, it’s a recoil problem. Ubisoft has implemented a potential fix to this in TTS and might bring it to full game.\n\nBasically right now the shots do not land directly where crosshairs is, if you want to see there are videos on YouTube of slow motion shooting at a wall. Ubisoft is trying to fix it so bullets land directly on crosshair.\n\nI’m all for the fix, but in reality/realism your bullets would not land directly on crosshair everyshot, especially on fully automatic your bullets would be all over the place at anywhere further than short range, but it is a videogame and id like my shots to be accurate 😝", "2_Subreddit": "Rainbow6"}], "dwsnbjt": [{"0_Comment Submission": "What the hell is with those neckshots?", "1_Text": "I don’t think this is a hit reg problem, it’s a recoil problem. Ubisoft has implemented a potential fix to this in TTS and might bring it to full game.\n\nBasically right now the shots do not land directly where crosshairs is, if you want to see there are videos on YouTube of slow motion shooting at a wall. Ubisoft is trying to fix it so bullets land directly on crosshair.\n\nI’m all for the fix, but in reality/realism your bullets would not land directly on crosshair everyshot, especially on fully automatic your bullets would be all over the place at anywhere further than short range, but it is a videogame and id like my shots to be accurate 😝", "2_Subreddit": "Rainbow6"}], "dwsnq56": [{"0_Comment Submission": "What the hell is with those neckshots?", "1_Text": "I don’t think this is a hit reg problem, it’s a recoil problem. Ubisoft has implemented a potential fix to this in TTS and might bring it to full game.\n\nBasically right now the shots do not land directly where crosshairs is, if you want to see there are videos on YouTube of slow motion shooting at a wall. Ubisoft is trying to fix it so bullets land directly on crosshair.\n\nI’m all for the fix, but in reality/realism your bullets would not land directly on crosshair everyshot, especially on fully automatic your bullets would be all over the place at anywhere further than short range, but it is a videogame and id like my shots to be accurate 😝", "2_Subreddit": "Rainbow6"}], "dwsofef": [{"0_Comment Submission": "Will my family hate me?", "1_Text": "In my experience my family seemed pretty anti-gay, well some situations happened and I ended up coming out to them a few months ago and to my surprise my parents were extremely accepting. \n\nFor example here are a few things that happened:\n\nMe and my dad saw two gay guys holding hands and my dad goes “here’s a couple gay guys” right as we walked past and they heard him \n\nMy grandma was with my family and somehow the topic of a gay friend got brought up and my grandma said “we haven’t had one of those in our family” \n\nSince coming out my dad was accepting but him and I haven’t talked about it and just don’t which I respect, my mom on the other hand has been very accepting and talked to me quite a bit about it on a car ride for about 30 minutes. \n\nI understand your situation and family is different than mine, but just try to keep in mind if you do want to come out you don’t know how it will turn out, for me I always expected the worst and never expected it to go well, which gave me anxiety and kept me from doing it. With the way society is in 2018 I would believe your parents would not flip shit over it, they may disapprove or not like it but at the end of the day you’re their son, they’ve raised and been with you for 17 years and love you and your sexuality should not change any of that. \n\nP.S: both my parents are religious (Christians) and had no problem with my sexuality and didn’t even bring up their religious side of things.", "2_Subreddit": "askgaybros"}], "dwsoz9b": [{"0_Comment Submission": "Is it fair to blame just the drugs?", "1_Text": "well the truth is, everyone and I mean everyone experiences some sort of serious trauma in their life, if you haven’t then it just hasn’t happened yet because life isn’t all pretty and happiness. Some people are dealt worse cards than others but we all experience it to some degree. \n\nWith addiction it is environment, genetics, and experiences. I do believe that addiction can be partially blamed on things that happen in life, but drug addicts are typically people who do not know how to cope with situations. I think society does look down on addicts because of the stigma and because of what we do to other people, but if you exhibit some passion to get help society is pretty accepting. \n\nTLDR: we all experience bad shit in life, some know how to cope and some don’t so they turn to the drug lifestyle. It is both the drug users fault for using the drugs, and society’s fault for not trying to assist that person in need or reach out to them, but society can’t do much if you don’t let people in on what’s going on in your head.", "2_Subreddit": "Stims"}], "dwspca6": [{"0_Comment Submission": "When is the recoil update ?", "1_Text": "not sure either, haven’t found a credible post about a date. It is on the TTS now, I would expect it to possibly be in the full game within 1-2 weeks.", "2_Subreddit": "Rainbow6"}], "dwssolq": [{"0_Comment Submission": "Men are so confusing", "1_Text": "I am in a similar situation as you, I was bullied a lot in elementary and middle school, high school I went off the deep end with drugs so no one bullied me then because I was always loaded. \n\nI try to just be myself, and not worry too much about what other males think. If they don’t like who I am then we probably should be together/hangout because I don’t like putting up a front or faking. \n\nI have maybe 1-2 close make friends and they accept me for who I am/my personality. I haven’t tried getting into a relationship yet because that will be a lot more stressful lol", "2_Subreddit": "gay"}], "dwt3a4d": [{"0_Comment Submission": "[rant] I'm super offended rn", "1_Text": "sounds like your “friends” who are still in school are young and inexperienced in the real world and just spewing stuff to make conversation. I’ve found most of the time straight people don’t care much about gays, if someone is overly homophobic they are most likely gay/bisexual and want to push it away and seem all masculine.", "2_Subreddit": "LGBTeens"}], "dwt3ijk": [{"0_Comment Submission": "relationships and other questions [relationships]", "1_Text": "I turned 18 and have yet to hit a gay bar because there are none around, but to meet guys you gotta put yourself out there. No gay guys will know you are into them if they think you’re straight! \n\nAlso the whole religion thing people could debate for hours, my take on it no matter the religion is he who you are, don’t let a religion try to change something about you (sexuality). If there is a god/heaven/afterlife then we will be just fine. I’m not religious myself but don’t they always say “god created you just how you are”", "2_Subreddit": "LGBTeens"}], "dwt3n6s": [{"0_Comment Submission": "Combating anxiety without therapy?", "1_Text": "medication is an option but it’s a very slippery slope into abuse and addiction, I’m on no medications and doing no therapy and my social anxiety has been minimal. I think I’ve just accepted myself for who I am and accept I will have anxiety at times.\n\nComing to complete terms with my sexuality has been huge and now I don’t have the constant paranoia over if people notice I’m gay, wonder why I don’t talk about females, etc...", "2_Subreddit": "askgaybros"}], "dwt571r": [{"0_Comment Submission": "How do I fix random stuttering", "1_Text": "if it is stuttering I believe that is most likely a CPU problem. I had a high overclock on my old computers cpu and got stuttering and as soon as I turned it off the stuttering got much less worse. \n\nMight also be a GPU problem, what refresh rate is your monitor at? At 60 I got stuttering but at 144 I’ve been fine.", "2_Subreddit": "Rainbow6"}], "dwwcpt2": [{"0_Comment Submission": "My lungs are in perfect condition!!", "1_Text": "LMAO ME AND MY BOY HIGH AS SHIT AND WE BEEN LAUGHING N CRYING FOR 10 mins", "2_Subreddit": "Rainbow6"}]}], "1_submissions": [{"6jaa6g": [{"0_Title": "WOW... is all i can say. i had trouble hitting a vein but when i finally did man oh man it was amazing, also took 1 mg alprazolam and just laid down and watched hgtv the rest of the nite 😉", "1_Text": "Kamel Reds were my go to heroin cigarette, but I mostly smoked Marlboro reds because it’s what I started on and they’re just so reliable and nice.", "2_Subreddit": "opiates"}], "6jjest": [{"0_Title": "it's go time ;) ~ stay safe", "1_Text": "Kamel Reds were my go to heroin cigarette, but I mostly smoked Marlboro reds because it’s what I started on and they’re just so reliable and nice.", "2_Subreddit": "opiates"}], "6l0zkm": [{"0_Title": "haven't posted here before, but thought i'd share this. i'm coming down at the moment i shot that bag in 1 shot at 8 pm last night.", "1_Text": "Kamel Reds were my go to heroin cigarette, but I mostly smoked Marlboro reds because it’s what I started on and they’re just so reliable and nice.", "2_Subreddit": "Stims"}], "6nra92": [{"0_Title": "Seattle is amazingly open to LGBT", "1_Text": "Kamel Reds were my go to heroin cigarette, but I mostly smoked Marlboro reds because it’s what I started on and they’re just so reliable and nice.", "2_Subreddit": "LGBTeens"}], "6ntoot": [{"0_Title": "[Rant] Seattle is amazing and very lgbt friendly", "1_Text": "Kamel Reds were my go to heroin cigarette, but I mostly smoked Marlboro reds because it’s what I started on and they’re just so reliable and nice.", "2_Subreddit": "LGBTeens"}], "6oef9t": [{"0_Title": "I think I may be finally ready to come out to my parents.", "1_Text": "Kamel Reds were my go to heroin cigarette, but I mostly smoked Marlboro reds because it’s what I started on and they’re just so reliable and nice.", "2_Subreddit": "comingout"}], "6osjcs": [{"0_Title": "i have been clean for 2 weeks. But i'm with some friends and i could of IV'd tonight , but i decided to just buy a pipe and if i go back to using consistently i'm going to strive to not pick IV back up. Man i love crystal", "1_Text": "Kamel Reds were my go to heroin cigarette, but I mostly smoked Marlboro reds because it’s what I started on and they’re just so reliable and nice.", "2_Subreddit": "Stims"}], "6oyv1k": [{"0_Title": "Half gram of heroin cut with fentanyl. Today my buddy of 10 years hit me up and said he had the strongest dope of his life and his dealer told him it was fentanyl. It had its differences from heroin and was definitely a stronger rush /nod/sedation but euphoria wise wasn't any better than heroin.", "1_Text": "Kamel Reds were my go to heroin cigarette, but I mostly smoked Marlboro reds because it’s what I started on and they’re just so reliable and nice.", "2_Subreddit": "opiates"}], "6q1rup": [{"0_Title": "i love my meff", "1_Text": "Kamel Reds were my go to heroin cigarette, but I mostly smoked Marlboro reds because it’s what I started on and they’re just so reliable and nice.", "2_Subreddit": "Stims"}], "6qcu50": [{"0_Title": "Day 6 about to smoke this then pickup more.", "1_Text": "Kamel Reds were my go to heroin cigarette, but I mostly smoked Marlboro reds because it’s what I started on and they’re just so reliable and nice.", "2_Subreddit": "Stims"}], "7lo0gx": [{"0_Title": "4 months clean", "1_Text": "Kamel Reds were my go to heroin cigarette, but I mostly smoked Marlboro reds because it’s what I started on and they’re just so reliable and nice.", "2_Subreddit": "StopSpeeding"}], "7ls8ol": [{"0_Title": "Should I come out to everyone (social media)", "1_Text": "Kamel Reds were my go to heroin cigarette, but I mostly smoked Marlboro reds because it’s what I started on and they’re just so reliable and nice.", "2_Subreddit": "askgaybros"}], "7nzfz9": [{"0_Title": "[Crushes] on a straight boy", "1_Text": "Kamel Reds were my go to heroin cigarette, but I mostly smoked Marlboro reds because it’s what I started on and they’re just so reliable and nice.", "2_Subreddit": "LGBTeens"}], "7o3pom": [{"0_Title": "[Rant] not into hookups?", "1_Text": "Kamel Reds were my go to heroin cigarette, but I mostly smoked Marlboro reds because it’s what I started on and they’re just so reliable and nice.", "2_Subreddit": "LGBTeens"}], "7rjekj": [{"0_Title": "5 months since active addiction, I can finally say my life is starting to get better.", "1_Text": "Kamel Reds were my go to heroin cigarette, but I mostly smoked Marlboro reds because it’s what I started on and they’re just so reliable and nice.", "2_Subreddit": "opiates"}], "7u135e": [{"0_Title": "messed up on when I’m supposed to work", "1_Text": "Kamel Reds were my go to heroin cigarette, but I mostly smoked Marlboro reds because it’s what I started on and they’re just so reliable and nice.", "2_Subreddit": "socialanxiety"}], "7v26kd": [{"0_Title": "gay people seem to be overall nicer people?", "1_Text": "Kamel Reds were my go to heroin cigarette, but I mostly smoked Marlboro reds because it’s what I started on and they’re just so reliable and nice.", "2_Subreddit": "gay"}], "7v2hld": [{"0_Title": "might relapse, need opinions", "1_Text": "Kamel Reds were my go to heroin cigarette, but I mostly smoked Marlboro reds because it’s what I started on and they’re just so reliable and nice.", "2_Subreddit": "Drugs"}], "7vw91u": [{"0_Title": "weird tic when masturbating", "1_Text": "Kamel Reds were my go to heroin cigarette, but I mostly smoked Marlboro reds because it’s what I started on and they’re just so reliable and nice.", "2_Subreddit": "Tourettes"}], "7yumfh": [{"0_Title": "estimated time on Alienware Aurora to ship.", "1_Text": "Kamel Reds were my go to heroin cigarette, but I mostly smoked Marlboro reds because it’s what I started on and they’re just so reliable and nice.", "2_Subreddit": "Alienware"}], "846qkl": [{"0_Title": "looking to put together a 5 man team", "1_Text": "Kamel Reds were my go to heroin cigarette, but I mostly smoked Marlboro reds because it’s what I started on and they’re just so reliable and nice.", "2_Subreddit": "Rainbow6"}], "8474gl": [{"0_Title": "looking for 5 man team", "1_Text": "Kamel Reds were my go to heroin cigarette, but I mostly smoked Marlboro reds because it’s what I started on and they’re just so reliable and nice.", "2_Subreddit": "R6STeams"}], "85v6yy": [{"0_Title": "most OP operator you can think of?", "1_Text": "Kamel Reds were my go to heroin cigarette, but I mostly smoked Marlboro reds because it’s what I started on and they’re just so reliable and nice.", "2_Subreddit": "Rainbow6"}], "894kr3": [{"0_Title": "HELP please, 144 hertz issue with monitor/graphics card.", "1_Text": "Kamel Reds were my go to heroin cigarette, but I mostly smoked Marlboro reds because it’s what I started on and they’re just so reliable and nice.", "2_Subreddit": "gaming"}], "89nkzh": [{"0_Title": "How to counter Lion.", "1_Text": "Kamel Reds were my go to heroin cigarette, but I mostly smoked Marlboro reds because it’s what I started on and they’re just so reliable and nice.", "2_Subreddit": "Rainbow6"}]}]}]}