{"kimakiya": [{"0_comments": [{"dw2v29t": [{"0_Comment Submission": "Does anyone remember the exact moment that made you think “Wow, I have a problem” ? and what was it!", "1_Text": "I had just copped and my dad and I never spoke a lot but he followed me to my room looked at me and broke down. He told me he loved me so much and seeing me kill my self felt like he was holding a noose around his neck and his heart was going to break. I had already taken dope and felt nothing.\n\nIt wasn't until I got to school to take a math test that all the feelings started to hit and it crushed me. I had to postpone the test and the professor let me take it in their office since I was crying so much. \n\nI felt for the first time that I had died a while ago in my addiction and I was just killing everyone around me too. I entered rehab 2 weeks after.", "2_Subreddit": "opiates"}], "dw2v73i": [{"0_Comment Submission": "Out patient rehab question", "1_Text": "Mine was dosed. Since I was an animal and did dope less than 24 hours like they told me they gave me half a 4mg strip and gave me the other half to take home for later until I picked up my subs the next day.", "2_Subreddit": "opiates"}], "dw3ulte": [{"0_Comment Submission": "I’m working on an all dog town and we just opened our dog park today 🐶🎾", "1_Text": "Omg I'm jealous af!", "2_Subreddit": "AnimalCrossing"}], "dw8w08p": [{"0_Comment Submission": "My days of stockpiling ore has finally paid off!", "1_Text": "Omg I DREAM about this day. Fook! You're so lucky!!!!!", "2_Subreddit": "AnimalCrossing"}], "dwbjf31": [{"0_Comment Submission": "Prime Minister Shinzo Abe wants to repeal a Japanese law requiring broadcasters to show impartiality, a step critics fear will lead to sensational reporting and polarize views, just as a similar move has been blamed for doing in the United States", "1_Text": "Omg good fucking bot", "2_Subreddit": "worldnews"}], "dwconme": [{"0_Comment Submission": "We had to put Summer to rest in November, but she tippy tapped 'til the very end.", "1_Text": "Mannnn I'm crying looking at my two pooches. I hate thinking about the fact that they'll die in a few years. I just try to enjoy the present as much as possible.\n\nI'm sorry for your loss and wish you peace and healing.", "2_Subreddit": "tippytaps"}], "dwdmzl8": [{"0_Comment Submission": "My worst nightmare if I’m in a hostage/gunman situation", "1_Text": "Omg lmao r/MurderedByWords", "2_Subreddit": "BlackPeopleTwitter"}], "dwdnjq1": [{"0_Comment Submission": "Expectation vs Reality", "1_Text": "Lol we had to use netbeans for our beginner cs classes.", "2_Subreddit": "ProgrammerHumor"}], "dwgefp3": [{"0_Comment Submission": "For Saturday noddz!", "1_Text": "Yooo weed chocolate/gummies always got me fucked up. Have fun!", "2_Subreddit": "opiates"}], "dwgfhwd": [{"0_Comment Submission": "What is the legal status / enforcement of opiates in Costa Rica, Ecuador and Peru?", "1_Text": "Going to Ecuador in a few months, so imma comment to keep track of this lol.", "2_Subreddit": "opiates"}], "dwgfk2k": [{"0_Comment Submission": "Do you guys know / like the God Of War games ?", "1_Text": "I played the psp version soooo much. I forgot the names but I had GOW2 i think for ps2 and something else. Great games, really enjoyed them!", "2_Subreddit": "opiates"}], "dwhb1kt": [{"0_Comment Submission": "[WDYWT] Weatherproof", "1_Text": "Oof I really like that jacket!", "2_Subreddit": "streetwear"}], "dwhul7d": [{"0_Comment Submission": "brightline train on its track in downtown miami", "1_Text": "Noooooooo", "2_Subreddit": "Miami"}], "dwk0jja": [{"0_Comment Submission": "friendships are not easy with an ED", "1_Text": "Dear god, this. I'm only disgusted by myself but usually never others.", "2_Subreddit": "proED"}], "dwmut3b": [{"0_Comment Submission": "[Serious] Survivors of attempted murder, what is your story? How have you been since, physically, emotionally and mentally?", "1_Text": "TL;DR - I got drowned by a crazy bitch while her mother watched(8/9yo) and I was in a drug/gang shoot out in Ecuador with family and we never talk about it(10/11yo).\n\nI was sleeping over a distant family's house since I was close to their daughter and their son had just died. I was there to play and comfort her. She was always a little weird but then again so was I so I never thought much of it. The mom was a dead woman walking so we were able to do whatever as long as we didn't enter her brother's room; which I did and it was untouched except for Jesus candles, everywhere. \n\nAnyways, the next day, I was supposed to stay the whole weekend, we decided to go for a swim. I'm a weak swimmer but I just like to do laps and chill. As I'm doing my own thing, she comes up behind me and shoves my head down underwater. I thought she wanted to play until a good 15-30 seconds pass and I start flailing and trying to push her. I started seeing black spots and I opened my mouth and the rush of water hurt sooooo bad. It felt like an eternity and I was terrified.  \n\nWhat scared me the most was her mom watched this happened as I saw her looking at us before she pushed my head in. I guess it took her a bit to click back on and she rushed outside to pull me out and then started to blame me for it. I was coughing and vomiting water while this crazy lady is screaming about what I did and why. I told her what her daughter did and she went full robot again and denied it and was like \"ur crazy\" aka gas lighting me. \n\nI showered and then told her I wanted to check in with my mom. I went to the bathroom and told her to come pick me up, now.  I was around 8/9 yrs old. She was 11. My mom believed me and was there in less than 30 minutes. \n\nI guess because she didn't want to get caught or something, the mom gave me new clothes and did my hair for when my mom picked me up. I never went back. \n\nAlso: Was in Ecuador in the back of a pick up truck with some cousins and we were just chilling with their friends. As soon as they get into their car/taxi this moped/shitty motorcycle pulls up and starts making it rain bullets. I just remember hearing one pass between all of us in the back like a zyooooom and then my head hit the bed as my sister pushed up down. \n\nFuck are guns loud as shit. We waited until we heard the guys go and the motorcycle leave. Between the screams and people gathering, my cousin(who was driving and high as shit as they'd been hotboxing) pulled the fuck out, I got to see the taxi that was next to us with their friends. There was just glass and blood everywhere and people just taking pictures. Saw a picture and the story the next day on the newspaper. None of us there spoke about it since we knew we'd never be able to go out again. We still don't.", "2_Subreddit": "AskReddit"}], "dwmvxlu": [{"0_Comment Submission": "What was easier in 2008 than 2018?", "1_Text": "Lol do you really think humans will survive until then?", "2_Subreddit": "AskReddit"}], "dwndp4v": [{"0_Comment Submission": "College students use financial aid money to invest in bitcoin", "1_Text": "Ah thanks [deleted] for [removed]! I totally understand and feel that lol.", "2_Subreddit": "nottheonion"}], "dwnejpf": [{"0_Comment Submission": "i finally reached my goal weight!! and I'm satisfied, I don't need to lose more!", "1_Text": "I got so excited and happy! God dammit....back to the treadmill.", "2_Subreddit": "proED"}], "dwnk40p": [{"0_Comment Submission": "What is the Creepiest thing that has ever happened to you?", "1_Text": "Yooooo I had something similar to my sister and I (we were young) when we were chilling one day downstairs on our couch. We were watching tv and felt cold air, both got goosebumps, and we heard something knock on our sliding door/window. Lmao we kept trying to trip/throw each other down the stairs as we ran to our parents room.", "2_Subreddit": "AskReddit"}], "dwra0jk": [{"0_Comment Submission": "The Wonderful World of Extreme Knife Cutting", "1_Text": "This is like the extended version of that vine with the fat guy wielding the katana while migos plays in the background lmao.", "2_Subreddit": "Damnthatsinteresting"}], "dwrgycp": [{"0_Comment Submission": "I know what my problem is-- I want to use heroin forever.", "1_Text": "Damn :(. I feel this.", "2_Subreddit": "opiates"}], "dwrh7sm": [{"0_Comment Submission": "{NSFW} Boof Queen!", "1_Text": "Tig ol' bitties and dope! Great combo.", "2_Subreddit": "opiates"}], "dws6302": [{"0_Comment Submission": "What is your \"happy place\" food?", "1_Text": "Chicken Caesar salad and Coke Zero mmmmm :)", "2_Subreddit": "proED"}], "dwtf62a": [{"0_Comment Submission": "I have a legitimate issue with emotions...", "1_Text": "Sameee!!", "2_Subreddit": "HeroinHeroines"}], "dwv8gms": [{"0_Comment Submission": "I’m honestly feeling attacked right now", "1_Text": "Omg", "2_Subreddit": "ProEDmemes"}]}], "1_submissions": [{"6z4cbf": [{"0_Title": "The motto.", "1_Text": "I had just copped and my dad and I never spoke a lot but he followed me to my room looked at me and broke down. He told me he loved me so much and seeing me kill my self felt like he was holding a noose around his neck and his heart was going to break. I had already taken dope and felt nothing.\n\nIt wasn't until I got to school to take a math test that all the feelings started to hit and it crushed me. I had to postpone the test and the professor let me take it in their office since I was crying so much. \n\nI felt for the first time that I had died a while ago in my addiction and I was just killing everyone around me too. I entered rehab 2 weeks after.", "2_Subreddit": "childfree"}], "78s2jv": [{"0_Title": "Cried picking up my subs for the week. I feel human again :)! Off to start my program and *maybe* kick dish nashty habiiit!!!", "1_Text": "I had just copped and my dad and I never spoke a lot but he followed me to my room looked at me and broke down. He told me he loved me so much and seeing me kill my self felt like he was holding a noose around his neck and his heart was going to break. I had already taken dope and felt nothing.\n\nIt wasn't until I got to school to take a math test that all the feelings started to hit and it crushed me. I had to postpone the test and the professor let me take it in their office since I was crying so much. \n\nI felt for the first time that I had died a while ago in my addiction and I was just killing everyone around me too. I entered rehab 2 weeks after.", "2_Subreddit": "opiates"}], "7lz3gm": [{"0_Title": "I lost one of the only people I ever loved to dope and I can't stop.", "1_Text": "I had just copped and my dad and I never spoke a lot but he followed me to my room looked at me and broke down. He told me he loved me so much and seeing me kill my self felt like he was holding a noose around his neck and his heart was going to break. I had already taken dope and felt nothing.\n\nIt wasn't until I got to school to take a math test that all the feelings started to hit and it crushed me. I had to postpone the test and the professor let me take it in their office since I was crying so much. \n\nI felt for the first time that I had died a while ago in my addiction and I was just killing everyone around me too. I entered rehab 2 weeks after.", "2_Subreddit": "opiates"}]}]}]}