{"Kil0totin": [{"0_comments": [{"dvgqqah": [{"0_Comment Submission": "Snorting suboxone help !!!", "1_Text": "It's best to use the smallest amount of water and pinch ur nose after doing it. It can be tricky the first few times..it takes practice but it's very worth while doing it this way", "2_Subreddit": "opiates"}], "dvh0qba": [{"0_Comment Submission": "Snorting suboxone help !!!", "1_Text": "Ya. Just try not to spill any and pinch your nose after. I absorbs alot better this way", "2_Subreddit": "opiates"}], "dvhlqkp": [{"0_Comment Submission": "Broke the first rule and got taken for $200, now I gotta recoup the loss. I have these laying around for WD...", "1_Text": "U shud be able to get 40. Instant release is a dollar a mg and ops are .50c a milligram usualy. I would try to pay 30-50. More on the 30-40 side. But for just a few i can see u getting 40 no problem at all", "2_Subreddit": "opiates"}], "dvhm3tq": [{"0_Comment Submission": "this fent shit is getting crazy....no one is safe anymore.", "1_Text": "Man.. I fucked around with a certain set that had fent bags for a month and now when I cop elsewhere it's ridiculous how many bags I gota do to feel high. 3 fent bags =5-8 of the other average dope bags. So I don't have much of a choice but to keep getting fent. It sucks.", "2_Subreddit": "opiates"}], "dvr0hxl": [{"0_Comment Submission": "My wd arsenal: 2 Molly presses and 2 m bombs , my last lonely k pin (hopefully getting more today) flexiril, big bag of weed and a shitload of kratom 💪🏾 I have Lyrica somewhere but my wife stashes it from me on sick days. she knows I can’t control myself but she’s at work ):", "1_Text": "Why include the Molly n bombs that's sooooo shity in withdrawl who wud want that.", "2_Subreddit": "opiates"}], "dvr0rov": [{"0_Comment Submission": "Instagram dealer (so far my lowest point trying to get drugs)", "1_Text": "Dear autocorrect never once in my life have I texted ducking on purpose.....", "2_Subreddit": "opiates"}], "dvr11q3": [{"0_Comment Submission": "Full extractions", "1_Text": "Dude it's okay man Its just someone he knows it's not like he's talking about himself", "2_Subreddit": "opiates"}], "dvt9bvr": [{"0_Comment Submission": "Tolerance and dependency breaks", "1_Text": "Weeks man ur to early in right now it would almost reset ur withdrawl wait at least around 3 weeks man preferably longer", "2_Subreddit": "opiates"}], "dvtd6v2": [{"0_Comment Submission": "Pretty positive I got sold a few fake m 30s last night.", "1_Text": "Your absolutely right on the dosage but when u factor in bioavaility it equal to as low as 30-50mg but with different roas it's equal to 90mg give or take", "2_Subreddit": "opiates"}], "dvv15va": [{"0_Comment Submission": "I bought a Logitech gaming mouse from Staples for $6.", "1_Text": "I'm willing to give u 12.84$ for it!", "2_Subreddit": "gaming"}], "dvze7vc": [{"0_Comment Submission": "60 bucks wish me luck 😂", "1_Text": "God damn boy for 60? Get it in!!", "2_Subreddit": "cocaine"}], "dvzfs31": [{"0_Comment Submission": "Nice rock", "1_Text": "I think that when it has that certain shine and chunkyness to it that this pic has. That it has benzocaine in it. I had it before like that that looked better then it was. I'm not certain on the benzocaine it's jus my opinion. So it might look better then it is", "2_Subreddit": "cocaine"}], "dw69k8f": [{"0_Comment Submission": "Woman teaches baby about flat earth", "1_Text": "Is that really harming your kids mind? I'm against it to but that's taking it to far", "2_Subreddit": "insanepeoplefacebook"}], "dw6b85u": [{"0_Comment Submission": "Woman teaches baby about flat earth", "1_Text": "Eh just a opinion. Depends how j see it. This flat earth shits crazy", "2_Subreddit": "insanepeoplefacebook"}], "dw6f9fw": [{"0_Comment Submission": "Governor signs bill making CBD oil legal in Indiana", "1_Text": "Money... that's all the reason they need to make and keep it illegal. What they do is not in our intrest. It's in the interest of the 1% who don't care about us at all", "2_Subreddit": "news"}], "dw6mh04": [{"0_Comment Submission": "I just startet on 6mg (in Denmark) after a heroin habit", "1_Text": "Takes 7-10 days for ur body to adjust n get suboxone withdrawls so that makes no sense. If u do it for a month ur guna deal with suboxone withdrawls not dope", "2_Subreddit": "suboxone"}], "dwadez2": [{"0_Comment Submission": "Nice rock", "1_Text": "From it burning n clogging ur shit up I would highly suspect benzocaine as a major cut", "2_Subreddit": "cocaine"}], "dwdspn8": [{"0_Comment Submission": "How many of yall get irritated by people who lack drug knowledge/logic?", "1_Text": "Just the other day I gave this girl I hangout with alot a xanax... she's asked me if I had anything to crush it up with to snort it..... fucking dum ass", "2_Subreddit": "Drugs"}], "dwdu5tj": [{"0_Comment Submission": "(Ben Swann) Reality Check: How Prevalent is the Global Child Sex Trade in the U.S.?", "1_Text": "I usually pay 5-10k for the fresh off the boat pretty ones but price varies....... jk. Idk. I don't think anyone knows the whole scope of it", "2_Subreddit": "conspiracy"}], "dwjlud8": [{"0_Comment Submission": "SOS... Dealer offering free bag of his new \"crazy fire\"", "1_Text": "What...where do u go that people literally stick it in your pocket lol", "2_Subreddit": "OpiatesRecovery"}], "dwr8yyf": [{"0_Comment Submission": "Receiving a BJ in an ebay photo of your car", "1_Text": "Pretty expensive to.", "2_Subreddit": "trashy"}], "dwx1ayd": [{"0_Comment Submission": "Why do you go on one last binge before rehab?", "1_Text": "Pretty much everyone in recovery or before they got in recovery had reservations of sum last bit of fun before they part ways. It's like super common n isn't that hard to figure out if u have used opiates n cud probly somewhat relate even if u don't feel that way", "2_Subreddit": "opiates"}], "dwx263l": [{"0_Comment Submission": "Stash of the day", "1_Text": "\"Stash\"", "2_Subreddit": "opiates"}], "dwx2l63": [{"0_Comment Submission": "Appearing in court tomorrow for sentencing on first and only possession charge...", "1_Text": "Lmao. Okay most everyone knows the drug laws n all that is messed up okay. Ya alot of things need to be changed but please. Don't run ur mouth n get drilled. My first time going in the system I actually told the court I had a drug problem because I really wanted to better myself instead of just dumb jail time. Guess what I got? More jail time. And the choice to extend my sentence 6-12 more months if i pushed for help. While getting hit with my high end on my guidelines with very little record.... so ya I did the wrong thing thinking it was right... first time they get ya. U duno better", "2_Subreddit": "opiates"}], "dwxkvm8": [{"0_Comment Submission": "Stash of the day", "1_Text": "I'm sorry that's your stash man... I would be really embarrassed to call that mine", "2_Subreddit": "opiates"}]}], "1_submissions": [{}]}]}