{"Itsthematterhorn": [{"0_comments": [{"dtyzfvf": [{"0_Comment Submission": "Aside from children,what other parts of the cliched lifescript do you dislike", "1_Text": "Where is this wild place?!?", "2_Subreddit": "childfree"}], "due8z91": [{"0_Comment Submission": "Opiate couple drama", "1_Text": "GREAT username !!", "2_Subreddit": "opiates"}], "due9ie4": [{"0_Comment Submission": "Yummy DingleBEARies", "1_Text": "Bc breakfast is the most important fun meal of the day?", "2_Subreddit": "crappyoffbrands"}], "dvbxasd": [{"0_Comment Submission": "Must be willing to work all night and perform daily feats of strength", "1_Text": "I think they updated bc I haven't seen any of what has been posted here.", "2_Subreddit": "recruitinghell"}], "dvf7ppi": [{"0_Comment Submission": "Found this", "1_Text": "I've done the book trick! It was great but it did come back and eventually became problematic so I had a rather invasive surgery to get rid of it. Like put under anesthesia kind of surgery, not local to slice it out.", "2_Subreddit": "popping"}], "dvgv56r": [{"0_Comment Submission": "This is the bullet that ended my fathers battle with depression. Don’t keep it a secret. Please talk to someone, anyone.", "1_Text": "Nothing stopping me besides my own stubbornness :( thanks for your reply it's been a difficult day.", "2_Subreddit": "pics"}], "dvjbd82": [{"0_Comment Submission": "Meth addiction from 15 till 22 vs 4 years clean", "1_Text": "I hit my rock bottom surrounded by dope. I wasn't homeless, broke or stealing, but goddamn was I miserable and hating every waking moment. Everyone's rock bottom is different. Maybe he was selling it while using? It's how a lot of people support their habit. Regardless, how ever he did it, he did it without meth and that's amazing. \n\n\nCONGRATS OP that's the tits!! So happy to see you looking so healthy!", "2_Subreddit": "pics"}], "dvp3d2d": [{"0_Comment Submission": "Part of the cellar used by Josef Fritzl to imprison his daughter, and her three children borne of incestuous rape. She remained locked in this basement for 24 years.", "1_Text": "If it was opiates and he had a lot of them, I believe it.", "2_Subreddit": "MorbidReality"}], "dvp9hbq": [{"0_Comment Submission": "Teen Confesses to Molesting Sister, Dad Executes Him", "1_Text": "The father wasn't the girls father though. She was his sons half sister, so while the boy & girl had the same mother, they had different fathers. I think his dad didn't want a chi-mo as a son :(", "2_Subreddit": "MorbidReality"}], "dvyrio7": [{"0_Comment Submission": "Custom office drawer unit.", "1_Text": "He mentioned in his imgur post about ventilations on the computer and he's pretty confident in it. I think he said top, front and rear vents? And liquid cooling or something?", "2_Subreddit": "DIY"}], "dw2mgqv": [{"0_Comment Submission": "Never accept a job without knowing what your work will be used for. I don’t think I’ll ever forgive myself for being part of something like this.", "1_Text": "I had an \"oh no!\" Moment in the car when I read that line. Knew right there what was happening.", "2_Subreddit": "nosleep"}], "dw34y54": [{"0_Comment Submission": "He had the most amazing voice she'd ever heard.", "1_Text": "I made an audible \"heh\".", "2_Subreddit": "nosleep"}], "dwl5ae5": [{"0_Comment Submission": "Local Utah TV news report: Woman raped by high-ranking Mormon leader. Audio recording of his confession leaked. Church creates a dossier to smear and discredit her, which they give to the accused's son, who in turn distributes it to news outlets. This is how Mormons handle victims of rape.", "1_Text": "Irrelevant, go home you're drunk.", "2_Subreddit": "TwoXChromosomes"}], "dwn76vx": [{"0_Comment Submission": "Progress: I was stuck at the same office job for 9 years, I went back to school and started exercising. Now I have my dream job working as an exotic animal trainer, dreams do come true!", "1_Text": "How much were you drinking?!", "2_Subreddit": "pics"}], "dwnv2p0": [{"0_Comment Submission": "Pretty sure no one switched my baby at birth. Progress from 3 weeks left inside to 3 weeks on the outside.", "1_Text": "Look into baby Chiro or yoga, so many things to help gas and colick!!", "2_Subreddit": "pics"}], "dwt8f5b": [{"0_Comment Submission": "on being the ugly, invisible girl", "1_Text": "I don't mean to be offensive or anything, this is an honest suggestion since you said your body was also suffering. Hit up a gym!! Or yoga? I lost about 30lbs due to yoga and changing my diet and that alone boosted my confidence. Not the losing weight part, but being active and getting stronger was awesome!! Not winded going up stairs anymore, ONE trip from car to house w groceries, little things like that and there is not one excuse as to why you cannot be active. Please work on that, if you don't do anything else just be s little active and get a good sweat going. Endorphins make you happy and happy people don't kill their husbands! (Thanks Elle Woods)", "2_Subreddit": "TwoXChromosomes"}], "dwt8ldz": [{"0_Comment Submission": "on being the ugly, invisible girl", "1_Text": "Fixing my teeth was one of the best decisions in my life!! 13 years of braces from 10-25 but hottdamn my teeth are beautiful!", "2_Subreddit": "TwoXChromosomes"}], "dwt94lo": [{"0_Comment Submission": "on being the ugly, invisible girl", "1_Text": "Not too late!!! I did Invisalign in my early 20's and loved it!", "2_Subreddit": "TwoXChromosomes"}], "dwtbnwt": [{"0_Comment Submission": "Fentanyl-Laced Cocaine Becoming A Deadly Problem Among Drug Users : Shots", "1_Text": "No, but you certainly are an ignorant bastard, that's for sure.", "2_Subreddit": "MorbidReality"}], "dwtce6j": [{"0_Comment Submission": "Tycoon and his wife ‘admit having threesome with teen shortly before she fell 14 floors naked to her death’", "1_Text": "A lot of hotels have balconies", "2_Subreddit": "MorbidReality"}], "dwvcgza": [{"0_Comment Submission": "Please speak some sense to me. I am obsessed with withdrawal...", "1_Text": "Psych yourself in. Woo doggy that phrased helped me get off subs a few years ago with zero withdrawals. I also used that phrase to pump myself up for a septo/rhinoplasty that I did without painkillers and hottdamn does it help! Yes things hurt during the time of going thru it but it wasn't that bad, or as bad as if I talked myself into how terrible it would be! Good advice, get psyched IN", "2_Subreddit": "OpiatesRecovery"}], "dwvcvjf": [{"0_Comment Submission": "Methadone Final Withdrawal: reduced from 85-10ml, preparing for cold-turkey. Plan and experience report.", "1_Text": "Hey man I jumped at .25 and it was a breeze (all things considered!!) pop and Advil in the am before a nice hot shower and that evened me out all day. I did .25 for a day, skipped a day, dosed one day, skip two until I just jumped off. But I was on .25 for 2 weeks before spacing the days. You can do it!", "2_Subreddit": "OpiatesRecovery"}], "dwvm428": [{"0_Comment Submission": "Grounded for Life is an incredibly underrated sitcom", "1_Text": "Femi-Mart owner and tour guide on Portlandia! He's great in it.", "2_Subreddit": "television"}], "dwvp0oz": [{"0_Comment Submission": "Was going through my grandma’s old stuff when I found my great-great-grandfather’s discharge papers from the Civil War.", "1_Text": "Museum glass and all that fancy stuff helps quite a bit. I suggest taking it to a framer, they are super knowledgable about preserving stuff with certain glass used.", "2_Subreddit": "pics"}], "dwxc63e": [{"0_Comment Submission": "Anyone ever think about going on a drug holiday in SE Asia?", "1_Text": "Don't use alone. u/sahhm came back from Cambodia cremated. So, okay go for it, but please not alone", "2_Subreddit": "opiates"}]}], "1_submissions": [{"6ndie4": [{"0_Title": "TIL: you can get invited to an app to change the colors on two New York buildings.", "1_Text": "Where is this wild place?!?", "2_Subreddit": "todayilearned"}]}]}]}