{"FrescoBeatz": [{"0_comments": [{"ds28psv": [{"0_Comment Submission": "That Rapper’s name?", "1_Text": "Wow trump’s presidency is worse than 9/11? That’s pretty unpatriotic. You probably think he’s worse than Hitler too you anti-Semite. \n\nBoth political parties have been taking advantage of the the poor and disparaged for the past 60 years, the liberals just claim to be the bastion of acceptance and goodwill, while the conservative values are based around that of the the nuclear family. Yeah republicans don’t care about poor people as much as their own family, because when you give to the poor, (higher taxes on the rich going to welfare kings and queens) that’s taking away from their own families, money which THEY actually EARNED. You ever heard about what LBJ said about the poor people during his presidency (mainly African-Americans)? When writing in the civil rights act, he did so solely to, and I quote, “Having those n*ggers voting democrat for the next 200 years”. So don’t come at me with that bullshit that it’s just republicans that fuck people over.", "2_Subreddit": "bassnectar"}], "ds28x8c": [{"0_Comment Submission": "That Rapper’s name?", "1_Text": "You’re reaching really far here. Obviously war should be avoided at all costs, but if there is a war, would you rather our country not gain financial incentives? You hate America obviously, go move to Sweden or Canada or some socialist nation you limp wristed pussy", "2_Subreddit": "bassnectar"}], "ds29gno": [{"0_Comment Submission": "That Rapper’s name?", "1_Text": "Do you even vote? Have a college degree or even a job? Do you actually contribute anything to this country or just suck at the tit? People like you are ruining this country. Criticize everything about America but I’m sure you’ve got your hand out waiting on that welfare check every month huh?", "2_Subreddit": "bassnectar"}], "ds29z86": [{"0_Comment Submission": "That Rapper’s name?", "1_Text": "u/XtraPersonality I’m sorry for kinda hijacking this post. I’m glad you were moved by the guys speech, I just thought it didn’t flow well with the show and could’ve done without it. That’s all I was trying to say", "2_Subreddit": "bassnectar"}], "ds2aiuw": [{"0_Comment Submission": "That Rapper’s name?", "1_Text": "Don’t worry brother, we’ll get through this..and we WILL MAKE AMERICA GREAT AGAIN", "2_Subreddit": "bassnectar"}], "dti0btt": [{"0_Comment Submission": "Oral Oxycodone to IV BTH Conversion", "1_Text": "Figured this would be the response I would get. I’ll give it a go", "2_Subreddit": "opiates"}], "dti2kqv": [{"0_Comment Submission": "Oral Oxycodone to IV BTH Conversion", "1_Text": "I’ve IV’d coke crystal and morphine before but never heroin. I have based tar off foil though several times. And I know everyone says this but I’m pretty positive the product I’m getting is grade A, or so the reviews I’ve heard say it is", "2_Subreddit": "opiates"}], "ducxi4d": [{"0_Comment Submission": "Can I still use opiates recreationally while on SSRI’s?", "1_Text": "Mainly the suicidal thoughts. I’d never act on them but if I can keep them at bay it’d be ideal lol. \n\nAlso heroin, hydros and oxy", "2_Subreddit": "opiates"}], "ducxl16": [{"0_Comment Submission": "Can I still use opiates recreationally while on SSRI’s?", "1_Text": "Okay good to hear", "2_Subreddit": "opiates"}], "ducxoe6": [{"0_Comment Submission": "Can I still use opiates recreationally while on SSRI’s?", "1_Text": "This is kind of what scares me. I honestly think Xanax would have controlled the symptoms of my disease better than Zoloft but I didn’t want my doc thinking I was drug seeking. Almost told her I’d been self medicating with Xanax and it was working but i decided not to", "2_Subreddit": "opiates"}], "ducxzjq": [{"0_Comment Submission": "Can I still use opiates recreationally while on SSRI’s?", "1_Text": "Well I took my first dose of the Zoloft yesterday and then proceeded to down 100mg of hydro, and I was pretty fucked up but I could still function, it was almost like the Zoloft potentiated the hydros or vice versa. I also just took 4 mg of Xanax but I haven’t taken my Zoloft dose yet today because it made me tired, gonna wait to take it before bed", "2_Subreddit": "opiates"}], "ducy4ey": [{"0_Comment Submission": "Can I still use opiates recreationally while on SSRI’s?", "1_Text": "Trust me if I feel the slightest urge I’m going straight to the ER.", "2_Subreddit": "opiates"}], "ducyl7u": [{"0_Comment Submission": "Can I still use opiates recreationally while on SSRI’s?", "1_Text": "No, you’re right, that’s what the doctor said about the depression and anxiety; that it’ll take a few weeks to notice that going away. However the side effects (diarrhea, dry mouth, dizziness, drowsiness and clouded thoughts) start when you start taking the medicine.", "2_Subreddit": "opiates"}], "ducz297": [{"0_Comment Submission": "Can I still use opiates recreationally while on SSRI’s?", "1_Text": "Lol don’t worry, you couldn’t pay me to take tramadol. I don’t even consider it a recreational drug", "2_Subreddit": "opiates"}], "dwa8h6p": [{"0_Comment Submission": "Getting off probation in 2 weeks. Very excited but also very worried.", "1_Text": "I’m in almost the same place. I’m one month and one and a half weeks clean from all drugs, but I still think of using often; it crosses my mind at least once an hour. I’m on probation too, I start drug court tomorrow and I’ll be in it for at least the next 14 months, probably longer. \n\nWhat’s been kind of helping me with those fleeting thoughts of using is thinking about all the consequences my drug use has brought me: nasty detoxes, incarceration, and broken relationships. You have to realize those fleeting thoughts are exactly that: fleeting. Play the tape through in your mind. The human mind is an amazing thing in that it only remembers the good parts of using but makes it difficult to remember the bad, you have to consciously think about it. \n\nThe opposite of addiction isn’t sobriety, it’s relationships. Build up personal relationships, go to a meeting, make new friends that are beneficial to your sobriety.", "2_Subreddit": "opiates"}], "dwbvfil": [{"0_Comment Submission": "Preferred Opiate/Opioid", "1_Text": "A year at least", "2_Subreddit": "opiates"}], "dwc4n4j": [{"0_Comment Submission": "Suboxone or methadone", "1_Text": "I’ve got a question for people on maintenance therapy: why not just go through the WD for a few days and stay clean? I understand it’s easier said than done but in the long run it’s cheaper and better for you. I’ve kicked multiple times and I know it’s hell but the suboxone and methadone WD is worse from what I hear.", "2_Subreddit": "opiates"}], "dwc6r9a": [{"0_Comment Submission": "Need help with Step 8.. Making a list of all the sooty marks left on fabric everywhere I have smoked and cleaning it off.", "1_Text": "I’ve been noticing a lot of stuff on here from AA/NA recently. Idk if it’s that I’m hearing it too (recently got into treatment and have been hitting meetings) and now know what people are talking about or if more people are getting into treatment and going to meetings too. Either way good to know I’m not alone and people are getting help", "2_Subreddit": "opiates"}], "dwdq5e9": [{"0_Comment Submission": "Suboxone or methadone", "1_Text": "In my experience opiate withdrawal lasts from 3-5 days, starting about 12-24 hours from last use. And I’m assuming fielding meant fiending, which isn’t a symptom of withdrawal in my opinion, it’s a symptom of mental addiction. I’m sorry to say but at a certain point that mental addiction will never go away (and at 14 years of use you’ve definitely hit that point). Find a new hobby, go to a meeting, make new friends. All of these would help quell that mental addiction.", "2_Subreddit": "opiates"}], "dwi9ibj": [{"0_Comment Submission": "The pharmacology behind benzo-opiate interaction and potentiation (and potential dangers!)", "1_Text": "Yeah kids don’t mix benzos and opiates unless you want a severe case of the fucking wonderfuls", "2_Subreddit": "opiates"}], "dwnedqi": [{"0_Comment Submission": "Hydro5s", "1_Text": "Just eat the wee bastards ya cock", "2_Subreddit": "opiates"}], "dwpl9zz": [{"0_Comment Submission": "I know they’re not opis but this sub is so much friendlier. Personal stash plug collected over the years. All presses I’m pretty sure.", "1_Text": "Looks like adderall to me", "2_Subreddit": "opiates"}], "dwpnuvt": [{"0_Comment Submission": "I know they’re not opis but this sub is so much friendlier. Personal stash plug collected over the years. All presses I’m pretty sure.", "1_Text": "Goddamn ur boy still got it lol", "2_Subreddit": "opiates"}], "dwruhbv": [{"0_Comment Submission": "Last bag today, deleting all numbers", "1_Text": "This X1000. \n\nWas trying to get clean a while back and literally told the niggas I was being watched by the feds and they hit me up later that day", "2_Subreddit": "opiates"}], "dwxymxi": [{"0_Comment Submission": "Texting and driving... WCGW?", "1_Text": "They’re both idiots. The one who threw the phone now has destruction of property and assault. They could throw the book at the guy who was texting and driving and he wouldn’t go to jail. Other guy would definitely go downtown and probably serve some time", "2_Subreddit": "Whatcouldgowrong"}]}], "1_submissions": [{"7u60ua": [{"0_Title": "Oral Oxycodone to IV BTH Conversion", "1_Text": "Wow trump’s presidency is worse than 9/11? That’s pretty unpatriotic. You probably think he’s worse than Hitler too you anti-Semite. \n\nBoth political parties have been taking advantage of the the poor and disparaged for the past 60 years, the liberals just claim to be the bastion of acceptance and goodwill, while the conservative values are based around that of the the nuclear family. Yeah republicans don’t care about poor people as much as their own family, because when you give to the poor, (higher taxes on the rich going to welfare kings and queens) that’s taking away from their own families, money which THEY actually EARNED. You ever heard about what LBJ said about the poor people during his presidency (mainly African-Americans)? When writing in the civil rights act, he did so solely to, and I quote, “Having those n*ggers voting democrat for the next 200 years”. So don’t come at me with that bullshit that it’s just republicans that fuck people over.", "2_Subreddit": "opiates"}], "7y1roh": [{"0_Title": "Can I still use opiates recreationally while on SSRI’s?", "1_Text": "Wow trump’s presidency is worse than 9/11? That’s pretty unpatriotic. You probably think he’s worse than Hitler too you anti-Semite. \n\nBoth political parties have been taking advantage of the the poor and disparaged for the past 60 years, the liberals just claim to be the bastion of acceptance and goodwill, while the conservative values are based around that of the the nuclear family. Yeah republicans don’t care about poor people as much as their own family, because when you give to the poor, (higher taxes on the rich going to welfare kings and queens) that’s taking away from their own families, money which THEY actually EARNED. You ever heard about what LBJ said about the poor people during his presidency (mainly African-Americans)? When writing in the civil rights act, he did so solely to, and I quote, “Having those n*ggers voting democrat for the next 200 years”. So don’t come at me with that bullshit that it’s just republicans that fuck people over.", "2_Subreddit": "opiates"}]}]}]}