{"jeffjeff2017": [{"0_comments": [{"dwthslk": [{"0_Comment Submission": "Left my dad a note on his bike lock", "1_Text": "What's a SHOS?", "2_Subreddit": "CasualUK"}], "dwtihpl": [{"0_Comment Submission": "PSA: Always look before opening your car door. I forgot and it almost cost me my life.", "1_Text": "The old adage is that you don't start learning to drive until after you pass your test. I reckon that's true, most people drive like a cunt from 17-20ish and then grow up.", "2_Subreddit": "CasualUK"}], "dwtishe": [{"0_Comment Submission": "PSA: Always look before opening your car door. I forgot and it almost cost me my life.", "1_Text": "It's crazy how it exponentially increases with each extra MPH. I don't have the stats to hand but you're almost certain to survive a 20mph impact, once you get to 30 it decreases substantially and anything 40mph and above you have to be really fucking lucky. \n\nWhilst 20mph limits by schools may be irritating, I'm all for them. When you actually calculate the difference it makes to your journey time it's really insignificant.", "2_Subreddit": "CasualUK"}], "dwtj76k": [{"0_Comment Submission": "The book that taught my mum to cook in the 70's -a simpler time", "1_Text": "I love reading my Mum's Madhur Jaffrey's book of Indian cooking from the '70s. The ingredient lists of super exotic spices like curry powder and garam masala must've been so revolutionary to your average meat & 2 veg '70s housewife.", "2_Subreddit": "CasualUK"}], "dwtjdkn": [{"0_Comment Submission": "Finally just finished the last of my Christmas body/shower stuff. Now I have to go and spend actual money on more!", "1_Text": "Did you get a £4 Lynx set aimed at pre-pubescent boys on the pull?", "2_Subreddit": "CasualUK"}], "dwtjmhf": [{"0_Comment Submission": "Really fancied a coke so I nipped into tesco. Got home to realise I'd been mugged off. 375ml and still £1.30!", "1_Text": "That's the sort of money you expect to pay for a glass bottle of coke. If you've never tried it, I can highly recommend. After quitting a terrible 2-3 litre a day habit I had whilst I was on smack I rarely indulge nowadays but can't resist a proper glass coke if the opportunity arises.", "2_Subreddit": "CasualUK"}], "dwtjrh9": [{"0_Comment Submission": "How does your tap water taste?", "1_Text": "Great. I live in Brum and AFAIK we get decent Welsh water from Severn Trent. I've never lived anywhere with 'bad' council pop and can't understand why some people have to buy litres from Tesco because they're too precious to drink from the tap.", "2_Subreddit": "CasualUK"}], "dwtox77": [{"0_Comment Submission": "Really fancied a coke so I nipped into tesco. Got home to realise I'd been mugged off. 375ml and still £1.30!", "1_Text": "I prefer a traditional pint glass. I think it adds a touch of gentlemanly class when you're glassing some ne'er-do-well.", "2_Subreddit": "CasualUK"}], "dwuh2ob": [{"0_Comment Submission": "I'm Eric Hafner, I'm running for U.S. Congress in Portland, Oregon (OR-3). I want to legalize all drugs, including opiates, but offer ibogaine therapy too, and free drugs for addicts via prescription.", "1_Text": "I'm impressed you're willing to go on record with that. In the UK it would be political suicide for a candidate to admit to being a current drug user. Even our more left wing politicians who do campaign for cannabis legalisation would never admit to being a current user.\n\nOccasionally we get one admitting to having a few tokes in university whilst they were 'young and stupid' and of course they never inhaled :)", "2_Subreddit": "opiates"}], "dwuhdot": [{"0_Comment Submission": "I'm Eric Hafner, I'm running for U.S. Congress in Portland, Oregon (OR-3). I want to legalize all drugs, including opiates, but offer ibogaine therapy too, and free drugs for addicts via prescription.", "1_Text": "It's Switzerland and it has been very successful. It's only offered to long term users who have not been able to quit after multiple rehab attempts/methadone prescription. Those users are finally able to get their lives back on track, back into employment and avoid the hectic lifestyle associated with a daily habit. \n\nOnce they do stabilise their lifestyles they find it much easier to address the addiction and any underlying mental health issues that led them to self-medicate in the first place. The overall benefits to society both in terms of quality of life, reduced property crime and reduced law enforcement costs easily outweigh the cost of the programme. \n\nAs it has been so successful it is endorsed even by citizens who would consider themselves to be staunchly anti drug.", "2_Subreddit": "opiates"}], "dwuljtf": [{"0_Comment Submission": "I'm Eric Hafner, I'm running for U.S. Congress in Portland, Oregon (OR-3). I want to legalize all drugs, including opiates, but offer ibogaine therapy too, and free drugs for addicts via prescription.", "1_Text": "Do you actually understand what he's proposing? Organised crime is allowed to flourish because drugs cannot be provided legally. If pharmaceutical quality drugs could be provided at a reasonable price by licensed providers it would remove the incentive for organised crime to fill the gap in the market and consequently reduce the social problems resulting from the war on drugs.\n\nThey tried prohibition of alcohol in the '30s and it didn't reduce demand or supply. It simply drove the market underground, causing more problems than it solved. Now, most countries have sensible alcohol policies and dangerous bathtub gin is rare. It is clear that even with the most draconian legal penalties people will still find a way to consume drugs. It is part of human nature. Surely fighting an unwinnable war is not sustainable social policy and an alternative must be found.", "2_Subreddit": "opiates"}], "dwupyr9": [{"0_Comment Submission": "Best McCoys Flavour", "1_Text": "Flame Grilled obviously. Their salt and vinegar are so salty they're inedible.", "2_Subreddit": "CasualUK"}], "dwuqyrk": [{"0_Comment Submission": "Did Anyone Get Their Tax Refund Money yet? I did at 4 Am. At 4:05 i called the dboy. Didnt spend a lot, trying to cut down and save $", "1_Text": "Nice stash. How much is a nickel bag? I just googled it and it says a nickel is 5c so I guess it isn't that.", "2_Subreddit": "opiates"}], "dwvesqd": [{"0_Comment Submission": "How I left my \"pro life\" ex for choosing a theoretical pregnancy over my life.", "1_Text": ">  Like, it's not a beautiful fucking sacrifice to leave a widowed \n\nThat is a perfect explanation. It's just another example of how generally religious nut-job males think they should be able to control women. If the mother has to sacrifice her life it better be a boy...", "2_Subreddit": "childfree"}], "dwvq9rk": [{"0_Comment Submission": "Serious discussion (I guess); in light of the recent surge in baked bean posts, does anyone else think the CasualUK sub is being gamed?", "1_Text": "Much respect but you need to up your toast game. An extra 40 seconds in the toaster and that would actually be crispy.\n\nAs an aside, have you ever considered tinned ravioli? It's 9000% posher.", "2_Subreddit": "CasualUK"}], "dwvqd0a": [{"0_Comment Submission": "Serious discussion (I guess); in light of the recent surge in baked bean posts, does anyone else think the CasualUK sub is being gamed?", "1_Text": "Salad? As in leaves and shite or a proper Glasgow salad (sticks of potato deep fried in grease)?", "2_Subreddit": "CasualUK"}], "dwvqzht": [{"0_Comment Submission": "What would happen if you took a six-pack of non-alcoholic beer into work and sat there drinking them at your desk?", "1_Text": "They used to sell Bass Shandy in the chippy when I was a kid. I remember trying to get pissed as a 10 year old on 3 quids worth. Most unsuccessful. If any children are reading I recommend burgling your parents spirit cupboard instead. Do it before school so you sober up by the time they see you again.", "2_Subreddit": "CasualUK"}], "dwvrigh": [{"0_Comment Submission": "Gis' us a fag mum.", "1_Text": "Poor kid. If even the mother won't appreciate it's gingerness it's bound to grow up with a massive complex. Whilst I don't always agree with the alleged millenial snowflake syndrome, it seems bang out of order that it's still seen as socially acceptable to slag off gingers. They need to start playing the 'ginger' card aggressively.", "2_Subreddit": "CasualUK"}], "dwvrl46": [{"0_Comment Submission": "Gis' us a fag mum.", "1_Text": "Only if you're a yank, use plenty of lube.", "2_Subreddit": "CasualUK"}], "dwvrri2": [{"0_Comment Submission": "Want a luggage carousel for your house? A \"Nothing to Declare\" sign for the garden? Maybe a large urinal for the bathroom?! Heathrow is auctioning off the contents of Terminal 1.", "1_Text": "I didn't see any comments about the urinal auction. Am about to move in with 8 other penises and want to avoid any industrial size piss bottle related awkwardness.", "2_Subreddit": "CasualUK"}], "dwvrywm": [{"0_Comment Submission": "Been craving IV cocaine something fierce.", "1_Text": "Not necessarily a good idea, I've been groin injecting into my femoral for years which is an easy site but I also have two permanent craters either side of my cock which you can't explain to anyone you want to have 'relations' with.", "2_Subreddit": "opiates"}], "dwvs81b": [{"0_Comment Submission": "Wondering how you guys met your now-dealers? (Don't worry, I'm not trying to source)", "1_Text": "I try to avoid other junkies (no disrespect but in the UK they tend to be skanky fuckers that will rob you blind). Whenever I move house and need a new shotter I will approach a homeless begger and buy them a bag for all the numbers in their phone. Works every time.", "2_Subreddit": "opiates"}], "dwvsu25": [{"0_Comment Submission": "Been craving IV cocaine something fierce.", "1_Text": "[Here](https://imgur.com/a/R4Bcw)\n\nThe one on the right I've not used for 3 years or so after a DVT, the left I've been using since then. I know it's not common in the US but in the UK most people go for their groin after killing their surface veins. After that you only have your neck. We also get special pins for it as you can't access with a short insulin pin unless you have no bodyfat at all.", "2_Subreddit": "opiates"}], "dwvtj7e": [{"0_Comment Submission": "Did half of each already , but .4 of hard and .3 of Canadian brown Fent. I smoke both on tin foil, weird hey?", "1_Text": "The crack looks pretty sexy. It's got that gloss look that suggests quality. Did it melt away to nothing?", "2_Subreddit": "opiates"}], "dwvydot": [{"0_Comment Submission": "Been craving IV cocaine something fierce.", "1_Text": "Haha, imagine all you want but a gentleman never gets his nose out in public :)", "2_Subreddit": "opiates"}]}], "1_submissions": [{"6cz6v5": [{"0_Title": "[Vendor Review] landedgypsie - #4 Afghan Heroin Sample", "1_Text": "What's a SHOS?", "2_Subreddit": "AlphaBay"}], "7bycju": [{"0_Title": "Feature Request", "1_Text": "What's a SHOS?", "2_Subreddit": "AeroBlackmarket"}], "7ht43x": [{"0_Title": "Car Licence Holder - UK Motorcycling", "1_Text": "What's a SHOS?", "2_Subreddit": "MotoUK"}], "7iihol": [{"0_Title": "Lenovo Thinkpad T420", "1_Text": "What's a SHOS?", "2_Subreddit": "SuggestALaptop"}], "7p2bep": [{"0_Title": "Query - Abortions", "1_Text": "What's a SHOS?", "2_Subreddit": "childfree"}], "7q0c73": [{"0_Title": "[ Newspaper Article ] The in-laws won't babysit. Astounding entitlement", "1_Text": "What's a SHOS?", "2_Subreddit": "childfree"}], "80w19g": [{"0_Title": "It's all Kicking off in Uxbridge", "1_Text": "What's a SHOS?", "2_Subreddit": "CasualUK"}], "818u4a": [{"0_Title": "I wish I'd Broken Down on the A1 Today", "1_Text": "What's a SHOS?", "2_Subreddit": "CasualUK"}]}]}]}