{"NewDOConTheBLOCK": [{"0_comments": [{"dt9d17r": [{"0_Comment Submission": "Script day... tons of 80s 20s Xanax valium muscle relaxers and roids... holla", "1_Text": "None of the above, sorry kiddo.  Haven't made up anything. I can tell you're extremely jealous though.", "2_Subreddit": "opiates"}], "dt9d35r": [{"0_Comment Submission": "Script day... tons of 80s 20s Xanax valium muscle relaxers and roids... holla", "1_Text": "Because unlike your pathetic ass, I have a life.  I haven't been around in a few days... but you seem to be here 24/7.  As predicted, perfectly analyzed, correct as always.", "2_Subreddit": "opiates"}], "dt9dixj": [{"0_Comment Submission": "So it's finally happening, it turns out a bottle of pills is worth more to my mom than her son.", "1_Text": "Errr.. this sounds like one hell of a fucked up situation.  Are you both on drugs?  If you know she's an addict, then you should know to hide your meds. Or keep them on you if that's feasible.  I don't know if you're an addict as well, but either way I'm sure you know that this isn't your mother talking/acting, it's her addiction.\n\nOn another note, and I'm speaking from experience here... even if you're in the right (which I believe you probably are), you can't call out your mother for shit living under her roof.  My mother is a neurotic paranoid borderline schizophrenic and alcoholic, and would accuse me of the dumbest bullshit ever when I lived at home.  Any time I would say anything to her or call her out on her own hypocritical bullshit... her excuse was always \"blah blah blah my house blah blah blah\" so I said fuck it and packed some shit and left.  Crashed on couches/spare beds of various friends until I could find a place to live \"permanently\".  \n\nI wish you the best of luck with your situation and hope your mom gets the help she needs.\n\nEdit: what the fuck is up with Reddit  (Or just this sub?) not showing paragraphs and sticking everything together..?", "2_Subreddit": "opiates"}], "dt9dtlv": [{"0_Comment Submission": "Day 2 heavy dope habit cold turkey. Been taking lots of gabapentin and Valium along the day, but this is how I will actually sleep(hopefully). 50mg seroquel, 2 spliffs, 4mg alprazolam and 1g APAP. Will prob wake up in 4 hours in cold sweats though, but any rest is fine at this point.", "1_Text": "4mg is a pretty massive dose of alprazolam... I'm gonna assume you're familiar with your tolerance, but be careful of frequently taking dosages like that.  Benzo withdrawals can be just as nasty as opiate withdrawal.. with the added bonus of potential death from a tonic clonic seizure.\nThat being said, good luck with your sobriety and withdrawal and stay safe.", "2_Subreddit": "opiates"}], "dt9dvir": [{"0_Comment Submission": "I've finally got it! (damn I'm smart)", "1_Text": "Fail.. this is retarded.", "2_Subreddit": "opiates"}], "dt9dx8u": [{"0_Comment Submission": "I've finally got it! (damn I'm smart)", "1_Text": "This is a level of retarded and pathetic that I've not previously encountered.", "2_Subreddit": "opiates"}], "dt9dzih": [{"0_Comment Submission": "Anyone else play video games while high on opiates?", "1_Text": "No, nobody.  Just you.", "2_Subreddit": "opiates"}], "dt9ebcw": [{"0_Comment Submission": "I fucking hate myself.", "1_Text": "Well I can tell you where this ends, if you keep going the way you're going.  If you don't die in the process of getting your tolerance to the inhuman level that my tolerance is, you will essentially become immune to opiates and will no longer get high.  Not only will you no longer get high, whenever you don't have opiates all over your receptors, you will be miserable.  And even when your receptors are saturated with opiates, you'll find you only feel somewhat normal, and no longer experience genuine happiness.  All this is providing you are independently wealthy and have a ton of money, or have a script comparable to mine.  You won't love opiates anymore, you will hate them.  You'll hate what they've done to you and hate that your life is an opiate induced prison... where you need a ridiculous amount of opiates just to function.  You will fully understand anhedonia in the way that only someone who is experiencing or has experienced depression has.  You can read about it, you can think you understand it, but you can't truly appreciate it until you experience it.  That's when you will hate not yourself, or not only yourself, but opiates and what they've done to you.", "2_Subreddit": "opiates"}], "dt9edsc": [{"0_Comment Submission": "11 Months Have Passed Since His Death", "1_Text": "Damn.. dead to cancer at 18.  Poor guy was just a baby.  My condolences, and congratulations at being a successful chipper.", "2_Subreddit": "opiates"}], "dt9f999": [{"0_Comment Submission": "My motivation", "1_Text": "Addiction and relationships don't work.  And while poetic, I can promise you that you wouldn't deal with a life of withdrawal as opposed to a day without her.  Either you haven't experienced withdrawal, or don't realise how bad withdrawal can actually get.  There's no such thing as a \"perc 30\", so I assume you're talking about a 30mg oxy IR.  If that's all the both of you need to stay out of withdrawal.. You definitely don't know how bad withdrawal can get.  Also, while you may be willing to choose her over opiates... you're making a huge mistake assuming she would choose you over opiates.  That just shows you don't truly understand the power of addiction.  Addictions have ruined 30+ year marriages, torn families apart, caused the closest of friends to steal from and betray each other, etc...  to think that your relationship that's still in its honeymoon phase is above the reach of addiction is as naive as it gets.\nYou're gonna do what you're gonna do.. but ultimately there will be a winner in the fight that you just realized is going on - addiction vs. your relationship.  I truly hope you're right (for your sake) about her choosing you over the drugs... but the longer this love affair with opiates goes on... the closer addiction is to winning.  I've seen this play out 10-12 times...and all I'll say is that the odds are not in your favor. That's the cold ugly truth.  If you two are going to overcome the odds, you need to sit down with her and have a serious conversation.  If she's not ready she needs to get ready, because by the time she says she's ready on her own... it will be too late.  Good luck, I really hope you make it through together.  I've seen addiction win too many times, and it's overdue for a loss.", "2_Subreddit": "opiates"}], "dt9fc2f": [{"0_Comment Submission": "1111", "1_Text": "I'm not sure what Im supposed to be looking at here lol", "2_Subreddit": "opiates"}], "dtbrurc": [{"0_Comment Submission": "Day 2 heavy dope habit cold turkey. Been taking lots of gabapentin and Valium along the day, but this is how I will actually sleep(hopefully). 50mg seroquel, 2 spliffs, 4mg alprazolam and 1g APAP. Will prob wake up in 4 hours in cold sweats though, but any rest is fine at this point.", "1_Text": "Yeah, my benzo tolerance is quite high as well.  70 2mg alprazolam a month.  I don't and never have abuse/d my benzos, and they have no real side effect for me other than some anterograde amnesia, they're quite cheap, and I don't care about staying on them for life", "2_Subreddit": "opiates"}], "dtbrxp8": [{"0_Comment Submission": "1111", "1_Text": "Bahaha, I'd probably have pubes older than you if I didn't shave.", "2_Subreddit": "opiates"}], "dwpt9qc": [{"0_Comment Submission": "2 years", "1_Text": "Heh.. I turned 34 today ( well yesterday technically ) and I remember saying I was going to stop when I turned 30.  I don't know where the time has gone.  It's so fucked up.", "2_Subreddit": "opiates"}], "dwptvds": [{"0_Comment Submission": "I have consumed over $1 million worth of opiates", "1_Text": "Hahaha. What about tolerance increases over 7 years?  My line graph of dosage needed over time would look almost like a 90 degree angle just curved out when my tolerance really took off heh.", "2_Subreddit": "opiates"}], "dwpu01o": [{"0_Comment Submission": "I know I relapsed the other day, but I can do this, guys!", "1_Text": "You didnt have enough to give then... there comes a time where opiates stop giving you everything you need.  The stop giving you anything at all.  They start taking.  And then they take more, and then it's not a 2 way street at all anymore because they take everything and give nothing back.  Unless you want to call debt, addiction, anhedonia, hypogonadism etc \"gifts\" they gave back lol", "2_Subreddit": "opiates"}], "dwpu4fe": [{"0_Comment Submission": "I know I relapsed the other day, but I can do this, guys!", "1_Text": "It really depends how much clean time you have that determines the severity of a one time relapse. If you've completely healed mind and body and you're not physically dependent at all, then one relapse can be nothing (it can also be everything, but in a different context).  If you're only 5-7 days clean and you relapse, well you get to start the fun over again heh.", "2_Subreddit": "opiates"}], "dwpuav6": [{"0_Comment Submission": "So apparently all emergency departments don't treat addicts like garbage.", "1_Text": "Errr... story reeks of horseshit.  They don't give fentanyl to opiate naive patients first of all, and secondly if you're on bupe then only sufentanil is going to be able to displace it on your ų receptors and provide pain relief.", "2_Subreddit": "opiates"}], "dwpwkit": [{"0_Comment Submission": "So apparently all emergency departments don't treat addicts like garbage.", "1_Text": "Errr I have my textbooks... You can easily Google binding affinity of opiates and a ton of shit pops up.  The lower the number the tighter the bon, in layman terms.\n\nAlso, hydromorphone is standard in hospitals these days (most of them in Canada anyway).  And you're not told what dose of what you're being given and they certainly aren't wasting time in the ER telling patients we're giving you this but were gonna give you this and now you're getting this instead at this dosage.  #1 as mentioned they simply don't have time and #2 most patients don't know fuck all anyway", "2_Subreddit": "opiates"}], "dwpwoud": [{"0_Comment Submission": "I have consumed over $1 million worth of opiates", "1_Text": "Oh mine are prescribed... I thought people would have taken that for granted. Definitely can't get rich unable to work due to chronic pain and disability =(", "2_Subreddit": "opiates"}], "dwpwprf": [{"0_Comment Submission": "I have consumed over $1 million worth of opiates", "1_Text": "And you're not.  Tool.", "2_Subreddit": "opiates"}], "dwpwrjs": [{"0_Comment Submission": "I know I relapsed the other day, but I can do this, guys!", "1_Text": "That's def on the higher end on this sub these days.  Bunch of Vicodin and perc kiddies posting \"pill porn\" of their wisdom teeth scripts rofl.  Some moron even posted fucking gabapentin awhile back... lol", "2_Subreddit": "opiates"}], "dwpwt85": [{"0_Comment Submission": "/r/Opiates can be a depressing place, but after a lot of research and thought I have determined that this user is the best user of /r/Opiates and possibly the best person on Reddit too!", "1_Text": "Dori!  Are you still clean??  Been awhile", "2_Subreddit": "opiates"}], "dwpwx4z": [{"0_Comment Submission": "I have consumed over $1 million worth of opiates", "1_Text": "You should probably leave your bedroom more often, or at least read some books while you're there.  If your takeaway from my post is that you think I'm trying to brag... You clearly have piss poor reading comprehension, probably are socially inept, and also a depressed loser, based off of your short sarcastic and totally pointless posts.  Don't even try responding, I'm always bang on when I psychoanalyze a schmuck like you.", "2_Subreddit": "opiates"}], "dwpwzjx": [{"0_Comment Submission": "I have consumed over $1 million worth of opiates", "1_Text": "Yeah sure does.  Trying to taper off them now and am currently experimenting with medical weed for my pain.  Some strains seem to help, some just fuck me right up to where i can't even function and it's extremely unpleasant.  It's definitely a trial and error process lol", "2_Subreddit": "opiates"}]}], "1_submissions": [{"7gln6q": [{"0_Title": "Those of you with ongoing opiate prescriptions", "1_Text": "None of the above, sorry kiddo.  Haven't made up anything. I can tell you're extremely jealous though.", "2_Subreddit": "opiates"}], "7m3yqw": [{"0_Title": "Om nom nom", "1_Text": "None of the above, sorry kiddo.  Haven't made up anything. I can tell you're extremely jealous though.", "2_Subreddit": "opiates"}], "7rnhf4": [{"0_Title": "Script day... tons of 80s 20s Xanax valium muscle relaxers and roids... holla", "1_Text": "None of the above, sorry kiddo.  Haven't made up anything. I can tell you're extremely jealous though.", "2_Subreddit": "opiates"}], "89alj7": [{"0_Title": "I have consumed over $1 million worth of opiates", "1_Text": "None of the above, sorry kiddo.  Haven't made up anything. I can tell you're extremely jealous though.", "2_Subreddit": "opiates"}]}]}]}