{"Dustbunniez4eva": [{"0_comments": [{"dwve4ba": [{"0_Comment Submission": "EGCG users", "1_Text": "Quercetin actually looks useful so i may experiment with that soon.", "2_Subreddit": "Nootropics"}], "dwve7ol": [{"0_Comment Submission": "EGCG users", "1_Text": "I understand that, fasting, mtor, ampk, autophagy, all is very interesting. I have noticed very good overall effects of 20hr fasts.", "2_Subreddit": "Nootropics"}], "dwvec0g": [{"0_Comment Submission": "Fasting and Exercise", "1_Text": "I can attest to endorphin release. I feel very similar to being high on opiates when i am in a fasted state. Creativity and motivation is super high too.", "2_Subreddit": "Nootropics"}], "dwveo7i": [{"0_Comment Submission": "Has anyone tried the \"two sleeps\" idea with stimulants?", "1_Text": "This is a misinterpretation of two sleeps. A", "2_Subreddit": "Nootropics"}], "dwvespn": [{"0_Comment Submission": "Mimic the effects of a drug and use it to overcome anxiety and stress without harmful physical effects the substance may bring.", "1_Text": "brb going to try mimic shooting heroin", "2_Subreddit": "Nootropics"}], "dwvfaim": [{"0_Comment Submission": "Flu Symptoms When Starting A Cycle", "1_Text": "This is too simplistic, immuno suppressive and immuno stimulatory, to what? There are differing immune systems part of overall system, your body creates th0 cells which then differentiate to th1 or th2 or th17 and probably more. When one portion is stimulated, other portions are suppressed. Unless the study clearly states there is global supression or stimulation, you really need to be more specific. \n\nBacterial, fungal, viral infections are all managed differently by the body, to my knowledge. Dont fall into trap pf thinking stimulating or suppressing immunity in otherwise normal health states is desireable. This is how you create autoimmunity or weakened resistance to infections, immune system should be balanced. Many steroids have differing pathways of cytokine stimulation or suppression, and this effect reaches into other parts of immunity. \n\n\nThat 1900 study was done before medical science even knew about th and cytokine systems, i am assuming. It is way way way too simplistic to call things immune stimulants or suppressives these days, you have to be more specific about what systems are suppressed or stimulated. Intracellular and extracellular pathogens require different responses. It works for ads and marketing but it is not held up scientifically to call it one or the other in most cases. \n\n\nIf you really want to know, get a th1 th2 th17 system blood test before cycle and then in the middle. It will cost you a thousand dollars to do this but if you really care...\n\nAnyways. Immune modulatory supplements and drugs might be worth investigating for those concerned. Epicor's research is mostly biased but it seems to work. Then there are bacterial probiotics and other ones like Florastor which can balance immunity in some ways iirc. If you can support and regulate your gut immunity, you will probably fare better on cycle. I use all of the above plus resistant starch and butyrate producing bacteria. Eventually i will get the th1th2th17 bloodwork when i can afford it. LDN is not really immuno modulatory unless you have some specific immunity issues, i see many people experimenting with it kind of wildly which is not good.\n\n\nFwiw i have had seeming immune reactions to sterile gear. Your systems can do some pretty amazing stuff when they detect foreign substances in tissues. \n\nGetting the research done to really verify these effects doesnt seem that hard, i guess research money is spent on other avenues though. Instead of these questions we could have clear relevant data.", "2_Subreddit": "PEDsR"}], "dww5u8t": [{"0_Comment Submission": "Flu Symptoms When Starting A Cycle", "1_Text": "Ok, 1990, but even th17 was discovered after that, which is what takes over when th1 gets overworked. The writers of medical research papers often make assumptions the reader can read between the lines when they present information, what i mean is they arent going to detail step by step explain what they mean about suppression or stimulation, they assume you are well learned enough to differentiate what the data means. \n\nTestosterone is called immuno supressive because men apparently  are more likely to succumb to infections than women, but it is too complex to say it is because of testosterone molecule directly. I read the article on the research not long ago, there is more to it than that, i just did not retain the info. There is a seperate pathway you could block with special drugs or maybe a supplement which could reduce or eliminate the supposed immune supression.  Now that i think of it, it is probably all over immune dampening, as women are said to be more resilient to infection (bacterial, th1) but also at higher risk of autoimmunity (th2) than men. They probably have more inflammation but this protects from outside invaders better than men, as a whole. \n\nTest flu from steroids is likely a reaction to a high amount of solvent or hormone molecule. I have never gotten it on frequent low doses of testosterone. It can happen if you inject UGL gear made with high amounts of solvent, as some labs use unecessary amounts of the benzyl solvents and preservatives, or take higher than prescribed doses of pharma test where the manufacturer only rates a certain amount per week as the max dose by taking into account their solvent concentration. I hear about it often in T500 and other high concentration steroids, which are really meant to be diluted with other gear before injecting, It can also happen when the oil solution absorbs unequally, and the hormone precipitates as crystals in your tissue, which your body tries to reject, and this is from too much solvent absorbing quickly and making crystal fall out of solution. It can also happen with exotic hormones your body is surprised by, i guess. Like i said, ive got strange reactions to certain steroids the first time ive taken them. \n\n\nWBC is only a guidance marker, you can have elevated wbc to a sterile abscess, i think, with abscence of pathogen your body simply assumes the steroid shot is a foreign pathogen and tries to fight it off. But generally, you would only get really ill , like really bad fever when there is actual bacteria. Not saying you couldnt have a pseudo fever to a sterile abcess, but it is probably a little rarer. The doctor can probably interpret the levels in your bloodwork along with symptoms to decide if it is infected or not. \n\nIf you want to avoid test flu, use gear in normal concentrations and dont front load big amounts at a time. With total newbies taking 500mg a week of test as first cycle, which is a shitty cycle imo, and using UGL gear made by people using those standard brew formulas off the internet, it seems common. Just use regular concentration gear made by someone competent and take reasonable amounts at a time. More frequent injections with lower solvent gear and tapering up sensibly will probably avoid much of it. If you are starting a new hormone, do small subq shot for first couple days to see how you react to it. I never feel comfortable IM injecting a ml of some new exotic compound, i always shoot a tiny amount into stomach fat first. If you try to get away with 2 shots a week and your dose is 500mg test a week, you are taking a ton of steroid at a time. People misinterpret halflives and release rates and take the minimum amount of shots as possible. More frequent injections is almost always better for so many reasons, even with longer esters. \n\nSince a high dose test cycle of 500mg a week, 2 big shots a week is called a beginner cycle in so many places, that is why people get test flu. That is fine with me, let people do this stuff and talk shit when i try to tell them to try something else, they will either learn like i did or continue beating head against a wall. It is amazing how opinionated online forum users are and how sure they are right their way is the best way because majority do it and are vocal about their consensus. I never get any of these horrible sides, never had test flu, never had gyno (except my first cycle, where i followed advice from popular online sources lol), prolactin, nothing. Alot of shit with steroids is avoidable. \n\nI think your supposition what causes test flu is incorrect. Test flu is not from immuno supression. Someone who is immuno supressed from a testosterone injection doesnt just magically catch a flu virus, at the rate of online steroid users reporting this side.  And if you are getting flu symptoms as a result of no actual viral infection  an immune response is more likely characteristic of stimulated immunity, if anything. \n\nIf someone is constsatly getting viral infections on cycles, then yeah, they have immune issues and gear isnt helping. But a one off reaction at start of cycle is different, usually. Im talking about when users report a general malaise, not an easily identifiable viral infection. As to the SARMs study, that is interesting. I am willing to believe some compounds can be very effective at increasing risk for catching a cols, i just dont think that is the same as people complaining of common test flu when they begin their cycle, its not a flu, its a heightened immune reaction to a sterile foreign substance, not a virus or bacteria. \n\nI dont know much about SARMs but am fucking amazed people willingly take some of them, especially the one associated with tumor growth in rats. We barely know much about many of these substances yet, and even when we do know alarming details, people are still taking them. \n\nTest flu is literally just your body going \"what the fuck is this\" when you dump in a big dose of a hormone or solvent chemicals, or the hormone crystallizes in muscle and your body tries to eliminate it. I really sincerely doubt it is because of immune modulation. \n\n\nYes, i like to explain everything i think about the subject, lol.", "2_Subreddit": "PEDsR"}], "dww84bx": [{"0_Comment Submission": "[Compound Experience Saturday] 1-Test (DHB, Dihydroboldenone)", "1_Text": "Thank you for all the info, i think i will now keep some propecia on hand, and will probably do injectable sdrol to be honest. I cant really see myself willingly take orals orally anymore, i spent too much time and money restoring gut health to risk messing it up again with swallowing drugs.  Do you make your own, do you have a formula for it? \n\n\nNPP + sdrol + insulin . It gonna be piss", "2_Subreddit": "steroids"}], "dwxa3za": [{"0_Comment Submission": "[Compound Experience Saturday] 1-Test (DHB, Dihydroboldenone)", "1_Text": "I was not really talking or concerned about liver toxicity. I get really bad gut problems from even raw anavar powder. It is the steroid hormone itself irritating my gut, it contributes to dysbiosis in a way as well. A lot of pharmaceutical drugs do this (kill gut bacteria), even benign stuff you wouldnt think has an effect. There is some recognition of this recently, as people are becoming more aware of gut flora. Basically alot of non abx drugs act like weak antibiotics and in the end contribute to seemingly widespread gut issues many people face.\n\nI spend alot of money and time learning about gut microbiome, i have special probitoics from japan and take prebiotics, etc. If there is an injectable option which bypasses gut absorption, i prefer it for the reason of not distressing the good bugs on my tummy. I also believe in benefit of spread out slow release of steroid hormone throughout day, so oil injection is nice, i am not a fan of takig a rapidly absorbing dose all at once. \n\nBasically if you want to optimize gut health or have sensitivities, dosing ugl oral gear especially is not too great of an idea imo. Maybe sdrol is not as bad as anavar, but if i have the powder i wil just make an oil injection anyways, and take a small shot subq every day. It will release quite slowly that way.", "2_Subreddit": "steroids"}], "dwxb18n": [{"0_Comment Submission": "Daily Ask Anything: 2018-04-06", "1_Text": "Nolvadex is a nasty drug, i will never touch it again. Ruins my night vision, does other weird vision artifacts, causes depression, studied carcinogen to liver... Raloxifene, i dont even know im taking. Feels way more benign", "2_Subreddit": "steroids"}], "dwxbjdp": [{"0_Comment Submission": "Daily Ask Anything: 2018-04-06", "1_Text": "My 1 year goal is to be mark zuckerberg\n\nAnd to own a bajillion lamborghinis\n\nThis is what you sound like to me \n\n\nYou want the rewards without the sacrifice or struggle, you probably train like a wet rag, and your goal is vanity focussed \n\nAnd the genetics thing is a copout. Your apparent shit genetics are result of your lifestyle factors up until a recent point. You are basically whining about biology and reality. You have gained like 25 lb in 1.5 years and are complaining it is slowing down? Do you realize what a bitch you sound like rn?", "2_Subreddit": "steroids"}], "dwxcf7s": [{"0_Comment Submission": "Daily Ask Anything: 2018-04-06", "1_Text": "Training is a process, i just cant read you understand the reality of it long term from your post. Comparing yourself to others is a surefire exercise in misery.  1.5 years is so laughably nothing compared to what you expect. Your expectations are so skewed imo. Nobody here can sum up in one post if you should take drugs to gain muscle, that is on you. You approach things so much like a formula, your expectation wih specific diet and training programs, you need to take a step back and see the whole picture. It is a very consumerist attitude to expect to just get this program, this drug, this diet, and poof out pops a greek statue in a pre determined time frame. \n\nIt took me more than 1.5 years to even get competent at most lifts, lol.", "2_Subreddit": "steroids"}], "dwxcxb2": [{"0_Comment Submission": "Daily Ask Anything: 2018-04-06", "1_Text": "Lol at how simplistic and cut and dry you want abusing your body to be. I have been there, it is a stupid way of thinking. Be real about what you do to yourself instead of trying to justify it based on what dose dbol is equivalent to ethanol ingestion. For real tho, champions dont think like you do.", "2_Subreddit": "steroids"}], "dwxd3wa": [{"0_Comment Submission": "Daily Ask Anything: 2018-04-06", "1_Text": "You sound retarded, she sounds typical girl dumb, it is unfortunate you two met but alas, it is the world we live in", "2_Subreddit": "steroids"}], "dwxgntf": [{"0_Comment Submission": "Working Out", "1_Text": "Try using a sauna. Go easy at first, follow it with a cold shower.", "2_Subreddit": "HealthAnxiety"}], "dwxgodn": [{"0_Comment Submission": "Daily Ask Anything: 2018-04-06", "1_Text": "Lol just joking brah", "2_Subreddit": "steroids"}], "dwxgoq7": [{"0_Comment Submission": "Daily Ask Anything: 2018-04-06", "1_Text": "Never used clomid", "2_Subreddit": "steroids"}], "dwxgt55": [{"0_Comment Submission": "Working out worsening my anxiety", "1_Text": "It takes a long time of taking gear to effect your heart muscle. Dont take steroids if you have healh anxiety, lol", "2_Subreddit": "HealthAnxiety"}], "dwxgyxa": [{"0_Comment Submission": "i haven't struggle in almost a year but here i am", "1_Text": "Had one on my back, freaked out about it too.", "2_Subreddit": "HealthAnxiety"}], "dwxh1b9": [{"0_Comment Submission": "Balance of kombucha as a probiotic but yeast accelerator", "1_Text": "Kombucha is s. Boulardii, not candida. S. Boulardii antagonises candida.", "2_Subreddit": "Candida"}], "dwxhj8r": [{"0_Comment Submission": "111 days of juice fasting didnt kill candida (but cleared out a lot of debrees out of my colon/s regardless)", "1_Text": "A juice fast isnt really a fast. It is a diet. You arent getting the ramped up autophagy as in a water fast, you should have tried a real fast imo", "2_Subreddit": "Candida"}], "dwxho61": [{"0_Comment Submission": "111 days of juice fasting didnt kill candida (but cleared out a lot of debrees out of my colon/s regardless)", "1_Text": "I am getting sinusitis in later stages of candida treatment, it occured when i started a new probiotic which has been shown to antagonize candida.", "2_Subreddit": "Candida"}], "dwxijzl": [{"0_Comment Submission": "Feeling way better but always getting new symptoms", "1_Text": "Which test?  My doctor is an asshat. So i have to do it myself. Arent stool tests for yeast notoriously unreliable? I am told by a medical professional, only PCR blood which checks dna is accurate for candida, even the less accurate blood tests are nearly worthless. \n\nMy gut is way better, my ibs d  is gone, my painful frequent stools is gone, i just have more itching and now sinus issues as i ramped up treatment. \n\nI feel way better now than i did before, at any case. It is just annoying dealing with supposed die off and knowing it is probably wishful thinking to call every symptom resurgence or new one die off.", "2_Subreddit": "Candida"}], "dwxiy4h": [{"0_Comment Submission": "Feeling way better but always getting new symptoms", "1_Text": "That is cool, but i think you jumped the gun saying years of misery, I know how dysbiosis affects candida, but i am saying no candida stool test will be that accurate. In any case, the antifungals work for me. I assumed alrewdy i had sibo and began treating myself that way too and i improved.", "2_Subreddit": "Candida"}], "dwxj2b5": [{"0_Comment Submission": "Daily Ask Anything: 2018-04-06", "1_Text": "Then you havent read around enough. Fair supposition tho.", "2_Subreddit": "steroids"}]}], "1_submissions": [{"87pacz": [{"0_Title": "No urge to use heroin anymore since becoming fatalistic and understanding i will die one day, any day, perhaps soon, perhaps not soon", "1_Text": "Quercetin actually looks useful so i may experiment with that soon.", "2_Subreddit": "opiates"}], "87pjlx": [{"0_Title": "Thymalin", "1_Text": "Quercetin actually looks useful so i may experiment with that soon.", "2_Subreddit": "Ceretropic"}], "87tf8x": [{"0_Title": "Try sauna", "1_Text": "Quercetin actually looks useful so i may experiment with that soon.", "2_Subreddit": "Candida"}], "89hige": [{"0_Title": "EGCG users", "1_Text": "Quercetin actually looks useful so i may experiment with that soon.", "2_Subreddit": "Nootropics"}], "8acdgg": [{"0_Title": "Feeling way better but always getting new symptoms", "1_Text": "Quercetin actually looks useful so i may experiment with that soon.", "2_Subreddit": "Candida"}]}]}]}