{"Cortman97": [{"0_comments": [{"dv22hb1": [{"0_Comment Submission": "People deserve access to sterile, accurately dosed, pharmaceutical heroin", "1_Text": "I guess they are already trying this in the U.K, but it's more like suboxone in the way that you have to get a special doctor and all that, but obviously you don't get a months supply, except you can work your way to take-homes. So far it's proven to be more effective than methadone and subs", "2_Subreddit": "opiates"}], "dv231xg": [{"0_Comment Submission": "What's your story?", "1_Text": "My brother is about 7-8 years older than me, he's been a heroin addict since 16. I wa sin high school and he just got out of jail and moved in with my mom and the rest of my family. I've taken norcos a few times, I like it a lot but I wasn't trying to find them, I just got them from my friend who got them from his mom every once in a while. I start doing them for a couple weeks maybe every 3-4 days or so with my brother, it's the 4th of July, 2013, I come home from a high school party and he tells me he's got oxy but you have to smoke it. I hit it and of course get incredibly sick, hit it a few times and pass out, find out the next morning it was heroin, and do it that day but end up so sick I hate it. Don't touch it for about 2 years maybe a little less, find my own dealer and start smoking it every now and then, starts to turn into almost every night, just a 20 or less. Brother moves back in again, start doing it with him as he slams and I smoke, eventually he shoots me up and I loved it incredibly much. I do it for a month until he ends up back in jail for years this time. I go back to smoking it every now and then, nothing too bad, able to afford it with my part time job, maybe a 20 every 4 days or so. Eventually do it more and more, summer of 2016 I got stabbed by a friend, long story, end up in hospital for 16 days, collapsed lung, ruptured diaphragm and liver, multiple surgeries and ICU. I go on suboxone for 8 months, March 3, 2017 my girlfriends birthday, go to the coast and buy a gram just to celebrate the weekend, just smoking, I don't know what was so different this time but I haven't been able to go a day since, except for a 30 day stint in rehab with I relapsed just a couple weeks out. Ended up shooting it just a month or 2 after her birthday. Life keeps going lower while I keep getting higher, sure is a bitch, and i'm only 20 years old", "2_Subreddit": "opiates"}], "dv83bkj": [{"0_Comment Submission": "A great day today!", "1_Text": "I'm in EP yes, (sorry moderators if this is against rules, not trying to solicite!) is that where you were thinking of?", "2_Subreddit": "opiates"}], "dv84oze": [{"0_Comment Submission": "How to go about cold coping in a smaller city?", "1_Text": "I downloaded Whisper and got very lucky, but I think that was a rare thing. Try finding the bad areas and just look for homeless, poverty stricken people. Not trying to stereotype but they probably have some idea of where to find it. Be careful with your money as well as possibly driving a stranger to get drugs", "2_Subreddit": "opiates"}], "dv84zo5": [{"0_Comment Submission": "What do you guys do for work?", "1_Text": "That's awesome! I'm in early recovery now and just transferred from CC into a University here in California for next semester, majoring in History with education as a focus. Hoping to teach High School as well, but can't be a heroin addict and a teacher, at least not for long I assume.", "2_Subreddit": "opiates"}], "dv85062": [{"0_Comment Submission": "What do you guys do for work?", "1_Text": "Crack smokin Ryan Gosling. Lmao", "2_Subreddit": "opiates"}], "dvebftv": [{"0_Comment Submission": "BURNED COLD COPPING.....", "1_Text": "Yeah I would never spend $200 on a cold cop. I just moved and my new connect started off as a cold cop, only did $20-$40 for the first week or so. Even if I had to go out multiple times a day, it's better than seeing hundreds just walk away", "2_Subreddit": "opiates"}], "dvec0hu": [{"0_Comment Submission": "The ol Craigslist dilemma", "1_Text": "From what I've HEARD, LE usually doesn't go after users, he should be more worried than you since he's selling, but that doesn't mean LE still won't do it, so be very careful, feel it out and don't let him walk all that. If he's close, just start with $20 or so? You can always buy more, but you can't go back in time to buy less", "2_Subreddit": "opiates"}], "dvppkt0": [{"0_Comment Submission": "Rivalry over a woman leads to a fatal stabbing in the mall", "1_Text": "I wasn't stabbed in the abdomen, 5 inch knife. Got my liver, diaphragm, and right lung, spent 16 days in the hospital with multiple surgeries. Blood transfusion in the ambulance. Yeah it fucking hurts! I was in a fight and I thought he punched me super hard in the side, it was right below my ribs on the right, he was short so it went upward sort of. Then a huge burning pain you cannot describe started in that area, blood was pouring then I went ice cold and the pain focused right on the area, shock kicked in at that point, still could not believe it, I kept saying \"you stabbed me, you fucking stabbed me\" then I just walked outside and sat in the driveway until I passed out and woke up in the ambulance. Crazy stuff", "2_Subreddit": "watchpeopledie"}], "dvpplbw": [{"0_Comment Submission": "Rivalry over a woman leads to a fatal stabbing in the mall", "1_Text": "*was", "2_Subreddit": "watchpeopledie"}], "dvv73e8": [{"0_Comment Submission": "Another lucky day!", "1_Text": "Yeah I'm from NorCal as well, not illegal but yeah every pharmacy I've gone to there has denied me except late at night one young pharmacy aid gave me some but she said it was a one time thing", "2_Subreddit": "opiates"}], "dwbn67n": [{"0_Comment Submission": "E795 10MG PANDA", "1_Text": "Yeah a girl-friend of mine would take these from her dad. Back when I was just smoking H, anyways I feel snorfing then definitely better than H, at least smoking H", "2_Subreddit": "opiates"}], "dwgdcum": [{"0_Comment Submission": "What if you could shorten your w/ds to 5 minutes but during that 5 minutes you feel the cumulative pain you would've during the regular 5-7 days so it would be extremely painful but much shorter?", "1_Text": "Fuck yeah! Fuck the man ANARCHY", "2_Subreddit": "opiates"}]}], "1_submissions": [{"80robm": [{"0_Title": "Help in El Paso?", "1_Text": "I guess they are already trying this in the U.K, but it's more like suboxone in the way that you have to get a special doctor and all that, but obviously you don't get a months supply, except you can work your way to take-homes. So far it's proven to be more effective than methadone and subs", "2_Subreddit": "opiates"}], "81bs64": [{"0_Title": "A great day today!", "1_Text": "I guess they are already trying this in the U.K, but it's more like suboxone in the way that you have to get a special doctor and all that, but obviously you don't get a months supply, except you can work your way to take-homes. So far it's proven to be more effective than methadone and subs", "2_Subreddit": "opiates"}], "828jyv": [{"0_Title": "Scenario for y'all", "1_Text": "I guess they are already trying this in the U.K, but it's more like suboxone in the way that you have to get a special doctor and all that, but obviously you don't get a months supply, except you can work your way to take-homes. So far it's proven to be more effective than methadone and subs", "2_Subreddit": "opiates"}], "84sfqq": [{"0_Title": "Snorting BTH?", "1_Text": "I guess they are already trying this in the U.K, but it's more like suboxone in the way that you have to get a special doctor and all that, but obviously you don't get a months supply, except you can work your way to take-homes. So far it's proven to be more effective than methadone and subs", "2_Subreddit": "opiates"}], "850z3y": [{"0_Title": "Another lucky day!", "1_Text": "I guess they are already trying this in the U.K, but it's more like suboxone in the way that you have to get a special doctor and all that, but obviously you don't get a months supply, except you can work your way to take-homes. So far it's proven to be more effective than methadone and subs", "2_Subreddit": "opiates"}], "87xr4d": [{"0_Title": "New Cold Cop story", "1_Text": "I guess they are already trying this in the U.K, but it's more like suboxone in the way that you have to get a special doctor and all that, but obviously you don't get a months supply, except you can work your way to take-homes. So far it's proven to be more effective than methadone and subs", "2_Subreddit": "opiates"}], "87xttk": [{"0_Title": "Opana", "1_Text": "I guess they are already trying this in the U.K, but it's more like suboxone in the way that you have to get a special doctor and all that, but obviously you don't get a months supply, except you can work your way to take-homes. So far it's proven to be more effective than methadone and subs", "2_Subreddit": "opiates"}]}]}]}