{"itsOPits": [{"0_comments": [{"dmnzu9y": [{"0_Comment Submission": "Calling all crack chefs", "1_Text": "That's 4 to 1 coke to baking soda,  correct?", "2_Subreddit": "opiates"}], "dmsq96g": [{"0_Comment Submission": "24+ hours without Suboxone, I took 50mg Vicodin, 60mg Oxycodone, 30mg Valium, Absolutely No nodding or euphoria", "1_Text": "Can I ask why you chose to get on subs? 8 mg subs are SO much stronger than 50 mg oxy, really surprised a doctor would go for that honestly.", "2_Subreddit": "opiates"}], "dnpq3nl": [{"0_Comment Submission": "Shipping at wall question", "1_Text": "Update- I called again,  again they said it showed as still in transit. I asked politely if she could check into it further and she ended up calling shipping for me. Sure enough, it was already at the wall.\n\nBy the way, my 7 pound clear bag wasn't great but wasn't bunk. Had to use a larger dose but it worked for sure. 5/10", "2_Subreddit": "PoppyTea"}], "dntacda": [{"0_Comment Submission": "Shipping at wall question", "1_Text": "I'm probably doing 1.5x my normal size doses. This bag for me will last 3.5 days", "2_Subreddit": "PoppyTea"}], "dofea6a": [{"0_Comment Submission": "What is with the sudden influx of trolls/shit-talkers today?", "1_Text": "Exactly. Oxycodone 30mgs. Exactly. The government is stupid for trying to stop over prescribing, don't you agree? Exactly. Oxycodone 30mgs.", "2_Subreddit": "opiates"}], "dofeanq": [{"0_Comment Submission": "What is with the sudden influx of trolls/shit-talkers today?", "1_Text": "Exactly. Oxycodone 30mgs. Exactly. The government is stupid for trying to stop over prescribing, don't you agree? Exactly. Oxycodone 30mgs.", "2_Subreddit": "opiates"}], "dofec79": [{"0_Comment Submission": "ol' boy blue", "1_Text": "Exactly. Oxycodone 30mgs. Exactly. The government is stupid for trying to stop over prescribing, don't you agree? Exactly. Oxycodone 30mgs.", "2_Subreddit": "opiates"}], "doknz0g": [{"0_Comment Submission": "Fresh out da county brothers!!", "1_Text": "Good to see ya brother. That level 12 cock jaw probably tried to rat you out is my guess.", "2_Subreddit": "opiates"}], "dom4wcu": [{"0_Comment Submission": "Has anyone tried Vivitrol or Naltrexone? I think this guy is full of it.", "1_Text": "You're repeating yourself again and based on prior comments, this is a topic that you don't actually have any personal experience in. \n\n\nOn another note, to the OP, I don't believe this person about vivitrol reversing paws. However, I do think vivitrol gets an unfair shot around here. I do have experience with it, and all it does is make opiates completely useless. The mechanism involved has nothing to do with natural endorphins, I don't get why people say that. I think people get depressed because many go on it prematurely and are not ready to end their use. IME, it did exactly what it was supposed to do. However, it's not gonna do shit for cravings if you are still purposefully dwelling on using.", "2_Subreddit": "opiates"}], "don4fns": [{"0_Comment Submission": "I'm here again", "1_Text": "Dude, please be safe with this shot. A few months from now you will have some clean time and your life will be back to getting in order, and you'll be super thankful you didn't OD. Not to mention the people around you. And if you don't have many of those people, than I will be glad you didn't. Just be safe, and good luck in the coming weeks.", "2_Subreddit": "opiates"}], "dor6niz": [{"0_Comment Submission": "Yesterday I promised if my post reached 50 upvotes I’d post a video of me railing Oxy off my wife’s chest. I am here to deliver.", "1_Text": "Send one over!", "2_Subreddit": "opiates"}], "dqj4ugg": [{"0_Comment Submission": "I'm back in recovery..again.", "1_Text": "This was good to see. Keep up the good work man", "2_Subreddit": "opiates"}], "dqnxfcp": [{"0_Comment Submission": "My doctor and family keeps pressuring me into receiving a VIVITROL shot. SHARE your experience!", "1_Text": "Whenever this topic comes up, it bothers me the reputation that vivitrol gets based on heresay stories. From my EXPERIENCE, here is the thing about vivitrol. If you want to get clean, it is great. If you're just doing it to please people, it's just gonna add misery. When I was on it and wanting to stay clean, it was great. You know when you're trying to stay clean but you get a text or you walk into a situation where you can use and temptation is too much? Vivitrol is great for that because it eliminates that moment of weakness. You can't use it as your only source of recovery, but it can be a very helpful tool to help recovery along.\n\nAs far as natural highs go, this is just a badly repeated falsity. Your natural endorphins work just fine. The reason that people get depressed on it is they no longer want to stay clean. If your still entertaining using thoughts and looking at dope porn etc it's gonna be miserable. It's like staring at chocolate cake all day while on a fast, of course it's gonna be miserable. \n\nYou do need to be committed to it, as others warned. Trying to break through it and use can lead to easy OD, and when you get off of it, your tolerance will definitely be lower, so there is always danger there. Also, I still drank while on it. They say it helps to prevent drinking but I never really noticed a difference while drinking.\n\nSorry for the long post, but just wanted to share my experience. In all honesty, I'm using now, so obviously nothing is 100 percent successful. But when I was committed to staying clean, I really felt like it was beneficial.", "2_Subreddit": "opiates"}], "dqnxm5j": [{"0_Comment Submission": "My doctor and family keeps pressuring me into receiving a VIVITROL shot. SHARE your experience!", "1_Text": "I think it gets a bad reputation because of EXACTLY what you said. People blame PAWS and their emotional/psychological issues on the shot, when it's not actually the shot causing it. \n\nBtw,  I did have one side effect. Crazy ass dreams. Supposedly that's normal too. They were vivid like real life. That and a sore ass cheek where they give the shot, but other than those, no physical or sexual side effects.", "2_Subreddit": "opiates"}], "dqz8jpc": [{"0_Comment Submission": "r/coldcop", "1_Text": "Delete this dude, you're an idiot", "2_Subreddit": "opiates"}], "drftjcu": [{"0_Comment Submission": "WGN Spanish has changed in the last 2 months", "1_Text": "They are absolutely terrible. Horrible. No good. Insert other synonyms. The taste alone is the worst", "2_Subreddit": "PoppyTea"}], "drt3hix": [{"0_Comment Submission": "Last shot until I get paid Friday. Been a solid holiday Bender. 2 points each boy and girl. Hopefully this will satisfy me the rest of the night.", "1_Text": "Always wondered, do you get bellringers when you shoot  bath salts, apvp etc? Separately, I don't shoot, but I guess the only thing you can smoke for a good ringer is crack, right?", "2_Subreddit": "opiates"}], "dtjz7ri": [{"0_Comment Submission": "Emergency: \"I need soda [because] I'll die if I have to drink water one more time!", "1_Text": "I'll probably keep reading these, but to be honest and rude at the same time, these are getting old. The dude is obviously a leech. Why continue associating with him?", "2_Subreddit": "opiates"}], "dtk1kyu": [{"0_Comment Submission": "Emergency: \"I need soda [because] I'll die if I have to drink water one more time!", "1_Text": "You, sir, are a polite redditor. Hope it works out for you the best somehow", "2_Subreddit": "opiates"}], "dtk1rnn": [{"0_Comment Submission": "ROXI YOU ROCK MY WORLD", "1_Text": "Hell yeah bro. You really think they are legit brother?", "2_Subreddit": "opiates"}], "dvss5p9": [{"0_Comment Submission": "PST to Subs Question", "1_Text": "I was planning on 3 mg the first day, 3 the second ( I'm going out of town so need to be good to go), then bumping down a mg a day until I get to halves and feel like (hopefully) I can jump off.", "2_Subreddit": "PoppyTea"}], "dvssi5k": [{"0_Comment Submission": "PST to Subs Question", "1_Text": "I normally dose once in the afternoon and have been taking kratom in the morning. I always thought I felt mild wds starting at 16 or so hours, but I also haven't been pushing it. I'm at 34 hours right now, and although I did sleep plentu (with a benzo), my legs are achy, I've got a mild runny nose, and sorry for tmi but I've got diarrhea. I was REALLY hoping to take these at 48 hours. Definitely should have planned this better with my last dose, but my rescue dose for this upcoming trip arrived to the wall with the box damaged. They said when they opened it to check on it, seeds went all over the floor. Figured I might as well make the jump.", "2_Subreddit": "PoppyTea"}], "dvsso2e": [{"0_Comment Submission": "PST to Subs Question", "1_Text": "Thanks for the input folks. I'll keep y'all updated, gonna resist the temptation and hold out.", "2_Subreddit": "PoppyTea"}], "dvunese": [{"0_Comment Submission": "PST to Subs Question", "1_Text": "So...to update...i got lucky.  At 40 hours, I took .5 mg, felt ok, so an hour later took another .5, and then two hours later took another 2 mg. So, basically, 44 hours and it made me feel better. Thanks for y'alls help.", "2_Subreddit": "PoppyTea"}], "dwvkadr": [{"0_Comment Submission": "Did half of each already , but .4 of hard and .3 of Canadian brown Fent. I smoke both on tin foil, weird hey?", "1_Text": "I'm super jealous, looks nice. There have been quite a few hard pics lately on the sub, got me craving for sure. It's super expensive here so especially the nick bags some of these folks are getting look too good", "2_Subreddit": "opiates"}]}], "1_submissions": [{"5yl33h": [{"0_Title": "A Hard Question To Ask", "1_Text": "That's 4 to 1 coke to baking soda,  correct?", "2_Subreddit": "opiates"}], "604ml8": [{"0_Title": "Hallucinogens after Opiate Use", "1_Text": "That's 4 to 1 coke to baking soda,  correct?", "2_Subreddit": "opiates"}], "60cqwd": [{"0_Title": "East TN", "1_Text": "That's 4 to 1 coke to baking soda,  correct?", "2_Subreddit": "opiates"}], "61e3wh": [{"0_Title": "Worse than Pinned Eyes...", "1_Text": "That's 4 to 1 coke to baking soda,  correct?", "2_Subreddit": "opiates"}], "661xqv": [{"0_Title": "Jangles", "1_Text": "That's 4 to 1 coke to baking soda,  correct?", "2_Subreddit": "opiates"}], "6cqhpo": [{"0_Title": "H cut with coke? And other bullshit", "1_Text": "That's 4 to 1 coke to baking soda,  correct?", "2_Subreddit": "opiates"}], "6qybjn": [{"0_Title": "Shouts Outs", "1_Text": "That's 4 to 1 coke to baking soda,  correct?", "2_Subreddit": "opiates"}], "6umgoq": [{"0_Title": "Johnson City New Restaurant", "1_Text": "That's 4 to 1 coke to baking soda,  correct?", "2_Subreddit": "tricities"}], "6umhhs": [{"0_Title": "Copping Question (something different)", "1_Text": "That's 4 to 1 coke to baking soda,  correct?", "2_Subreddit": "opiates"}], "6ygacr": [{"0_Title": "Calling all crack chefs", "1_Text": "That's 4 to 1 coke to baking soda,  correct?", "2_Subreddit": "opiates"}], "6yhrps": [{"0_Title": "NE Tennessee or W Carolina", "1_Text": "That's 4 to 1 coke to baking soda,  correct?", "2_Subreddit": "Tianeptine"}], "706xs5": [{"0_Title": "2# SN from Wall- Exp 5/31", "1_Text": "That's 4 to 1 coke to baking soda,  correct?", "2_Subreddit": "PoppyTea"}], "70bjfa": [{"0_Title": "Out of Place Dope", "1_Text": "That's 4 to 1 coke to baking soda,  correct?", "2_Subreddit": "opiates"}], "739jhe": [{"0_Title": "Shipping at wall question", "1_Text": "That's 4 to 1 coke to baking soda,  correct?", "2_Subreddit": "PoppyTea"}], "77uurs": [{"0_Title": "Red / Flushed Face fixes or remedies...anybody have one?", "1_Text": "That's 4 to 1 coke to baking soda,  correct?", "2_Subreddit": "Tianeptine"}], "786sz3": [{"0_Title": "Issues", "1_Text": "That's 4 to 1 coke to baking soda,  correct?", "2_Subreddit": "Tianeptine"}], "7rmhir": [{"0_Title": "First Time BTH Advice", "1_Text": "That's 4 to 1 coke to baking soda,  correct?", "2_Subreddit": "opiates"}], "84qy8j": [{"0_Title": "PST to Subs Question", "1_Text": "That's 4 to 1 coke to baking soda,  correct?", "2_Subreddit": "PoppyTea"}]}]}]}