{"angryhangryhippo": [{"0_comments": [{"dvjnm2u": [{"0_Comment Submission": "Facts", "1_Text": "Pretty sure I read last month that a man died from doing that", "2_Subreddit": "BikiniBottomTwitter"}], "dvjtxvk": [{"0_Comment Submission": "Facts", "1_Text": "That doesn’t sound pleasant, I respect you for putting yourself through that.. why?", "2_Subreddit": "BikiniBottomTwitter"}], "dvmq5x1": [{"0_Comment Submission": "The Average Faces of 42 Different Subreddits [OC]", "1_Text": "At first I thought it was because she has such striking features but maybe she just sticks to the same expression more than other celebs", "2_Subreddit": "dataisbeautiful"}], "dvq1ule": [{"0_Comment Submission": "Obsessed with IQ starter pack", "1_Text": "I loved that copy pasta but I feel like it’s gone stale", "2_Subreddit": "starterpacks"}], "dvq6h6z": [{"0_Comment Submission": "Obsessed with IQ starter pack", "1_Text": "I had the same thought and then in nov/dec my friend from college that is otherwise pretty cool tweeted something about how she believes it takes a certain type of intelligence to appreciate adult cartoons like rick and morty. What’s interesting about it to me is that it really didn’t change my opinion of her, since I know she’s much more than that one dumb tweet. I’m glad I had that real life crossover to remember that people aren’t defined by their *occasional* annoying social media posts", "2_Subreddit": "starterpacks"}], "dvq7udl": [{"0_Comment Submission": "Obsessed with IQ starter pack", "1_Text": "My theory: I subbed after season 2 and there was so much time between 2 and 3 that the sub was starved for content, so people were posting fan theory after fan theory. They became so complex to the point that Justin and Dan would both have to be Shakespeare to have planned it out that way.\n\nEdit: that happens with pretty much every popular show or movie, but it felt like this was happening in such a concentrated span of time that it became really annoying.\n\nI unsubbed before season 3 ever even came out. In the meantime, rick and morty went massively mainstream. The combo of the person who wrote it most likely hating mainstream culture while the subreddit was getting sucked up its own ass I believe is what spawned the copy pasta", "2_Subreddit": "starterpacks"}], "dvq8vo8": [{"0_Comment Submission": "TIL Frankie Muniz suffers from long term memory loss and doesn't even remember being on Malcolm in the Middle.", "1_Text": "Why am I now even more jealous of Frankie muniz than when I was 8", "2_Subreddit": "todayilearned"}], "dvrcywk": [{"0_Comment Submission": "Pets are family. Kids? Meh. 🇺🇸", "1_Text": "I want gun control but when I saw this tweet I kind of eye rolled. Gun reform is much more complicated to legislate in this country compared to that. There’s no amendment in the constitution that grants airlines the right to store dogs in overhead compartments. It’s just not a fair comparison", "2_Subreddit": "PoliticalHumor"}], "dvsuj92": [{"0_Comment Submission": "Talking shit behind Hooman's back.", "1_Text": "Itchy butt?", "2_Subreddit": "AnimalTextGifs"}], "dvtxq71": [{"0_Comment Submission": "Chinese Invisibility Cloak Hoax DESTROYED!!!", "1_Text": "What youtubers was he trying to emulate? I watched while folding laundry but I have to admit a lot of that went over my head", "2_Subreddit": "videos"}], "dvu3tei": [{"0_Comment Submission": "Chinese Invisibility Cloak Hoax DESTROYED!!!", "1_Text": "Okay, as I mentioned I was folding laundry while watching and didn’t notice that detail. Thanks for letting me know", "2_Subreddit": "videos"}], "dvuivr9": [{"0_Comment Submission": "This hockey game has an \"alone cam\" that shows people who are by themselves", "1_Text": "I’ve seen so many movies alone and it’s one of my favorite experiences. That’s so lame, I’m sorry that happened.", "2_Subreddit": "assholedesign"}], "dw22akz": [{"0_Comment Submission": "Grandma doesn’t get the joke", "1_Text": "Lmao probably avoiding the charge your phone bot", "2_Subreddit": "oldpeoplefacebook"}], "dww74ay": [{"0_Comment Submission": "Learned this the hard way", "1_Text": "Hey I met my best friend in detox. Damn you guys sub to r/opiates and are trash talking people who are addicts???? No I don’t want to find my future husband at rehab but “shopping at a garbage dump” 10 upvotes look in the mirror bro", "2_Subreddit": "opiates"}], "dwwafxx": [{"0_Comment Submission": "Learned this the hard way", "1_Text": "I feel that. I’ll never forget the woman I met in rehab that was so sweet but looked like a re-animated corpse. I’m just saying pot calling the kettle black. “Shopping at the garbage dump.” You suck too boo. You’re in the garbage too", "2_Subreddit": "opiates"}]}], "1_submissions": [{"859er4": [{"0_Title": "Haha was it worth it", "1_Text": "Pretty sure I read last month that a man died from doing that", "2_Subreddit": "coaxedintoasnafu"}], "8a1tpr": [{"0_Title": "Join if you hate yourself", "1_Text": "Pretty sure I read last month that a man died from doing that", "2_Subreddit": "CircleofTrust"}]}]}]}