{"ak47revolver9": [{"0_comments": [{"ds325hx": [{"0_Comment Submission": "Signs of Withdrawal Already?", "1_Text": "For hydros? 45 is definitely a lot but 15 may be too low too.", "2_Subreddit": "opiates"}], "ds75lm3": [{"0_Comment Submission": "Addict thinking.", "1_Text": "Me too bud me too.", "2_Subreddit": "opiates"}], "ds7e180": [{"0_Comment Submission": "Planning on ordering needles for the first time. Will it say on the package where it’s from or that there are needles inside?", "1_Text": "Damn. Living with some straight edge people so anything that looks drug related will get me dropped as a friend.", "2_Subreddit": "opiates"}], "ds7e8h0": [{"0_Comment Submission": "Planning on ordering needles for the first time. Will it say on the package where it’s from or that there are needles inside?", "1_Text": "Would it say it largely on it or would it just be like a tiny lil sticker? May just have to do it the ol fashioned way and go to a cvs or Walmart. Do they ask for a prescriptions or ID? Idek if they sell in 10 packages. I don’t need a hundred lmao.", "2_Subreddit": "opiates"}], "dsarg7s": [{"0_Comment Submission": "Life feels like shit, want to try opiates.", "1_Text": "BPD generally means borderline personality disorder. Sort of similar, but also not quite. It hardcore fucks with relationships. That’s one of it’s main symptoms. I think that’s what OP is referencing in their post.", "2_Subreddit": "opiates"}], "dsisiog": [{"0_Comment Submission": "So who would be interested in an r/opiates writers workshop?", "1_Text": "Would LOVE to see more of your stories dude. Regardless if this takes off, you should definitely share!", "2_Subreddit": "opiates"}], "dsisosn": [{"0_Comment Submission": "So who would be interested in an r/opiates writers workshop?", "1_Text": "Really like this idea. Sometimes I come here specifically looking for some good stories, but I have to search pretty thoroughly to find stuff. It would be nice to have it all in one place.", "2_Subreddit": "opiates"}], "dsiwjht": [{"0_Comment Submission": "So who would be interested in an r/opiates writers workshop?", "1_Text": "I think the one where you recognized a turning point and were on the verge of real addiction may give people some insight on where they are now. I know a lot of people at different stages frequent this sub and it may help someone. \n\nThough you should post both cause they both sound really interesting.", "2_Subreddit": "opiates"}], "dvia7hz": [{"0_Comment Submission": "Who’s your /r/opiates secret crush?", "1_Text": "GoodGuyNeoNazi and HK were mine back when they were active. GGNN said some of the funniest shit", "2_Subreddit": "opiates"}], "dvpzws9": [{"0_Comment Submission": "Found this on r/wtf", "1_Text": "It most likely is. The space between the lines is grainy compared to the rest of the page if you zoom in.", "2_Subreddit": "opiates"}], "dvqsmnf": [{"0_Comment Submission": "I want to get high on ANYTHING.", "1_Text": "I always find it hard to share in meetings because I’m shy and feel like I’m wasting peoples time. I feel like my addiction is inferior I guess. Any advice on how to get past that?", "2_Subreddit": "OpiatesRecovery"}], "dvr2cre": [{"0_Comment Submission": "I want to get high on ANYTHING.", "1_Text": "Thanks for the response man. This helped me a lot. :) and stay strong! You sound smart. I believe in you.", "2_Subreddit": "OpiatesRecovery"}], "dvr2k1l": [{"0_Comment Submission": "I want to get high on ANYTHING.", "1_Text": "This is some really good advice. Thank you! I never really thought that the “pink cloud” would affect me much, but that makes sense.", "2_Subreddit": "OpiatesRecovery"}], "dvx1bwz": [{"0_Comment Submission": "The Hunted Fox", "1_Text": "Hey. I think you did a pretty good job. I like your use of metaphors, though sometimes I got a little confused on what you were actually trying to say. Like when you said “horseback blood coat” I don’t understand what you’re describing. I actually took it literally at first and got an image of a mangled and bloody horse, and I don’t think that’s quite what you meant haha. Perhaps it just went over my head though. \n\nI really like your use of alliteration though. I’m not sure if it was intentional but you did a really good job. I liked the “thundering, through” “hear, howl” “camouflage, creature” “hilltop, hounds” “vibrant, vermillion” etc. I always think that’s pretty clever and fun to read. It gives a poem an extra umph lol and allow things to flow together nicely.", "2_Subreddit": "OCPoetry"}], "dvx25ge": [{"0_Comment Submission": "One that got away", "1_Text": "I love how some of your one liners pack such a huge punch. Like the “Can I play boyfriend?” ,”strangers staring; we look cute”, and “zipping away in your Camry” are short lines but really evoked a lot of emotion within me. I think this poem is pretty powerful, though I wish it was longer. Maybe if you wrote more stanzas detailing your day, the reader can become even more immersed and really feel how it felt to watch her go.", "2_Subreddit": "OCPoetry"}], "dw08ca5": [{"0_Comment Submission": "I've been thinking...", "1_Text": "Damn reading this made me so sad. I really hope things get better for you.", "2_Subreddit": "opiates"}], "dwav51a": [{"0_Comment Submission": "Love Isn’t For Everyone", "1_Text": "Woah. This is some great stuff. I’m surprised someone responded at this point. But I’m super glad you did. All your suggestions, I’ll think hard on. Thank you. I’m also a chick describing a dude. Sorry for the confusion, but you’re right, I didn’t really go into descriptive detail on the person itself. I guess I was more describing how I felt. This is a thing I’m dealing with in real life and this dude has a girlfriend and is a lot older than me so if he decided to cheat on her or go after me, I feel like I’d lose some respect for him and myself, so that’s why he’s unobtainable. But as you know, I’m crushin’ the fuck out of him. \n\nYou’re right, I actually added a lot of adverbs and the excess because I was trying to make the lines longer. I did have a little better meter in the first draft of this, but for some reason when I write, sometimes my poems lines get longer as I go on. And I had wanted it to all match in relative length but I can see that you saw right through the bullshit lol. \n\nAnd you’re right, some of the cliches were most likely laziness on my part. I was probably looking for something to rhyme and picked the first thing I thought of. \n\nDamn I really actually appreciate your critique. You sound like you know what you’re doing. This sub is awesome.", "2_Subreddit": "OCPoetry"}], "dwni877": [{"0_Comment Submission": "Policy Change regarding human consumption", "1_Text": "Fuck.", "2_Subreddit": "opiates"}], "dwrt7ci": [{"0_Comment Submission": "Which actors have totally stole the spotlight from the main character?", "1_Text": "Dylan O’Brien (Stiles) from Teen Wolf", "2_Subreddit": "AskReddit"}], "dwtci29": [{"0_Comment Submission": "How did your opiate use start?", "1_Text": "I jumped straight in with oxy and xanax at age 11. I was too curious and too “smart” for my age. And I was sneaky. On and off various pills for various reasons, I knew my way around a prescription bottle.  I was horrifically depressed and I figured it was something to live for. So I dove in without hesitation and tried to wreck as much havoc on my brain as possible. I tried every pill I could get my hands on and I even tried things I knew weren’t abusable. Now that I’m not longer suicidal (most of the time), I seem to be stuck with the consequences.", "2_Subreddit": "OpiatesRecovery"}], "dwuzzb0": [{"0_Comment Submission": "88 days clean. I’ve pretty much decided that I’m going to use today, but I also don’t want to give up my clean time.", "1_Text": "It does actually. I’ve been trying to remind myself of that. That and how they may judge me for relapsing cause they’re in recovery too. I don’t know. I just feel so lost right now.", "2_Subreddit": "OpiatesRecovery"}], "dwv052a": [{"0_Comment Submission": "88 days clean. I’ve pretty much decided that I’m going to use today, but I also don’t want to give up my clean time.", "1_Text": ">All chance of every regaining the trust and love of that person will be gone.\n\nThat’s a really good point and something that’s been on my mind as well. They’re in recovery as well so they may understand how I’m feeling but they may still judge me for being weak and using because of a person. And their disgust will feel even worse.", "2_Subreddit": "OpiatesRecovery"}], "dwvvpl9": [{"0_Comment Submission": "88 days clean. I’ve pretty much decided that I’m going to use today, but I also don’t want to give up my clean time.", "1_Text": "I’m pretty involved with na meetings and I do a lot of service work. Trying to find some hobbies but not really feeling the motivation. Getting back into video games though a little.", "2_Subreddit": "OpiatesRecovery"}], "dww76qc": [{"0_Comment Submission": "I have 5mg hydrocodone + 325mg Acetaminophen each pill. Whats the max safe amount of pills I could take at once?", "1_Text": "I’d take about 3 more. 25-30 is a good starter dose for hydros with opiate naive.", "2_Subreddit": "opiates"}], "dww9i2u": [{"0_Comment Submission": "I have 5mg hydrocodone + 325mg Acetaminophen each pill. Whats the max safe amount of pills I could take at once?", "1_Text": "I bet man. I’m 89 days clean today. Be careful. You’ll fall in love faster than you think.", "2_Subreddit": "opiates"}]}], "1_submissions": [{"3ewvw5": [{"0_Title": "Really fast onset orally? Is it normal?", "1_Text": "For hydros? 45 is definitely a lot but 15 may be too low too.", "2_Subreddit": "opiates"}], "3gdwga": [{"0_Title": "Question on what to expect from trance/hypnosis Two different opinions?", "1_Text": "For hydros? 45 is definitely a lot but 15 may be too low too.", "2_Subreddit": "hypnosis"}], "6fdlj3": [{"0_Title": "Joker school shooting", "1_Text": "For hydros? 45 is definitely a lot but 15 may be too low too.", "2_Subreddit": "Dreams"}], "6lxbd3": [{"0_Title": "Is it easier for you to spot if someone is high on opiates? If so, has it ever happened?", "1_Text": "For hydros? 45 is definitely a lot but 15 may be too low too.", "2_Subreddit": "opiates"}], "6o9zsk": [{"0_Title": "/r/OurOverUsedVeins banned??", "1_Text": "For hydros? 45 is definitely a lot but 15 may be too low too.", "2_Subreddit": "opiates"}], "6pkij7": [{"0_Title": "Does anyone else get pimples or breakout when using?", "1_Text": "For hydros? 45 is definitely a lot but 15 may be too low too.", "2_Subreddit": "opiates"}], "6qf42r": [{"0_Title": "Poem from cyanide and happiness. Thought of you guys", "1_Text": "For hydros? 45 is definitely a lot but 15 may be too low too.", "2_Subreddit": "opiates"}], "6tmou5": [{"0_Title": "Two weeks, no drugs. I know it's good but it feels so so bad. Cravings advice?", "1_Text": "For hydros? 45 is definitely a lot but 15 may be too low too.", "2_Subreddit": "opiates"}], "6v1gu6": [{"0_Title": "Had a using dream. Got high!", "1_Text": "For hydros? 45 is definitely a lot but 15 may be too low too.", "2_Subreddit": "opiates"}], "6w8er3": [{"0_Title": "Found expired hydros in family med cabinet! Wooo! Wait a minute...", "1_Text": "For hydros? 45 is definitely a lot but 15 may be too low too.", "2_Subreddit": "opiates"}], "6w8lel": [{"0_Title": "What is the head tingling?", "1_Text": "For hydros? 45 is definitely a lot but 15 may be too low too.", "2_Subreddit": "Stims"}], "6z2in7": [{"0_Title": "Stupid noobish question but I just want wanna be safe. Just took 400mg tramadol but had 15mg ambien last night. Will I be okay?", "1_Text": "For hydros? 45 is definitely a lot but 15 may be too low too.", "2_Subreddit": "opiates"}], "78t6jt": [{"0_Title": "Masturbating is a trigger? Anyone else get this or am I just fuckin weird...", "1_Text": "For hydros? 45 is definitely a lot but 15 may be too low too.", "2_Subreddit": "OpiatesRecovery"}], "78vtl0": [{"0_Title": "Self destruction. Why do we feel it? It doesn’t make any sense.", "1_Text": "For hydros? 45 is definitely a lot but 15 may be too low too.", "2_Subreddit": "OpiatesRecovery"}], "79p5nk": [{"0_Title": "/r/opiates, what’s the best/most unbelievable lie that you’ve pulled off?", "1_Text": "For hydros? 45 is definitely a lot but 15 may be too low too.", "2_Subreddit": "opiates"}], "7gfzxm": [{"0_Title": "Want to kill myself but made a poem cause that’s all I can really do rn. Maybe someone can relate? I feel so alone.", "1_Text": "For hydros? 45 is definitely a lot but 15 may be too low too.", "2_Subreddit": "SuicideWatch"}], "7n4yty": [{"0_Title": "Oh bliss, I’ve missed you. Whoever said relapses were disappointing is wrong.", "1_Text": "For hydros? 45 is definitely a lot but 15 may be too low too.", "2_Subreddit": "opiates"}], "7ngcfi": [{"0_Title": "First time dilly. What do I do?", "1_Text": "For hydros? 45 is definitely a lot but 15 may be too low too.", "2_Subreddit": "opiates"}], "7o7iqy": [{"0_Title": "Planning on ordering needles for the first time. Will it say on the package where it’s from or that there are needles inside?", "1_Text": "For hydros? 45 is definitely a lot but 15 may be too low too.", "2_Subreddit": "opiates"}], "84j1e7": [{"0_Title": "I want to get high on ANYTHING.", "1_Text": "For hydros? 45 is definitely a lot but 15 may be too low too.", "2_Subreddit": "OpiatesRecovery"}], "85foj3": [{"0_Title": "Love Isn’t For Everyone", "1_Text": "For hydros? 45 is definitely a lot but 15 may be too low too.", "2_Subreddit": "OCPoetry"}], "87oijq": [{"0_Title": "Alone in this world.", "1_Text": "For hydros? 45 is definitely a lot but 15 may be too low too.", "2_Subreddit": "OCPoetry"}], "88unvl": [{"0_Title": "My name is Obi Wan Kenobi and here is a progress pic of me after cleaning up from heroin and learning the ways of the Force.", "1_Text": "For hydros? 45 is definitely a lot but 15 may be too low too.", "2_Subreddit": "pics"}], "8a0q7m": [{"0_Title": "88 days clean. I’ve pretty much decided that I’m going to use today, but I also don’t want to give up my clean time.", "1_Text": "For hydros? 45 is definitely a lot but 15 may be too low too.", "2_Subreddit": "OpiatesRecovery"}], "8adhua": [{"0_Title": "ITAP of the sky at 6:30 in the morning", "1_Text": "For hydros? 45 is definitely a lot but 15 may be too low too.", "2_Subreddit": "itookapicture"}]}]}]}