{"higuy420740": [{"0_comments": [{"dwn91oc": [{"0_Comment Submission": "Easter colors !!! 😂 60mg Oxy in the blue, 90mg Morphine in the pink.... Happy Easter Nods my friends 🤙🏻", "1_Text": "I would put a hold on both cards so then she has to contact you and tell her to give up the location of the ops or no cc money. man bitches be crazy. leaves u and takes 80% of your drugs and in her mind she took all your money", "2_Subreddit": "opiates"}], "dwn97py": [{"0_Comment Submission": "prescription monitoring across state lines", "1_Text": "the pmps are state data bases. there is no federal database so the answer is no. but your definilty playing with fire because technically your passing into doctor shoping which is illegal and the fact that your crossing back with drugs over state lines could become a federal issue. script or no script. plenty of people with scrpits from florida would catch charges up in kentucky just based on suspiscion of selling them", "2_Subreddit": "opiates"}], "dwnvlod": [{"0_Comment Submission": "Anyone know what this is? I’m used to getting BTH, but this showed up today....", "1_Text": "ecp= east coast powder like the first reply stated", "2_Subreddit": "opiates"}], "dwnvovk": [{"0_Comment Submission": "Drug taking loophole", "1_Text": "sounds like you need to stay off drugs for a while if thats your loophole. its foolproof. I think the opposite. only a fool would use every drug under the sun every other day and expect that to lessen there chances of tolerence or money watsed. this seems like the post of a 16 yr old", "2_Subreddit": "opiates"}], "dwnvvy9": [{"0_Comment Submission": "Life’s good , eating good , living good", "1_Text": "im sure they dont hate you for having money but in life you dont go running around telling people how much money you got. it always seems rude to people without any", "2_Subreddit": "opiates"}], "dwnvwuc": [{"0_Comment Submission": "My Buddy Claims This Was Half a Point - He's Retarded as FUCK", "1_Text": "yea hes an idiot thats at least a full point", "2_Subreddit": "opiates"}], "dwodwyd": [{"0_Comment Submission": "After 7 months I got my vyvanse prescription back! Forgot how much I liked them :) picking up some h today or tomorrow also 😍", "1_Text": "i could care less I was showing how pitty some people are. ive seen multiple people freak out about candy posts, selfies ect", "2_Subreddit": "opiates"}], "dwoil2a": [{"0_Comment Submission": "I’m sick and tired of this, and nobody wants to help me. I’m a grown ass man and I’m crying right now.", "1_Text": "take that appointment for the end of april. Its seems forever away when every minute seems like an hr but from past experience I would feel the same way when id make those calls and get the same answers and the date would always roll around sooner than later and id be in the same shit hole wishing i had taken the appoinment 30 days out. I hate to say it but turning down the subs for the mean time is your own choice. theres plenty of people feeling the same way as you that would die for the opportunity to get on subs. even if it just holds u for the mean time untill u get into the methadone clinic. you can take subs and jump onto a methadone program without a big detox. you just cant do it the other way around be on methadone and then jump on bupe right away. and the reason all the clinics intakes are booked is because there is more people trying to get on state paid programs then there is intake appointments avaiable. and for you to think u need to get in worse than somone who made there appt. and waiting there month your wrong. all of us are hurting and u arnt any more special than any other addict. unless u can pay for a a private clinic then u r special in there eyes", "2_Subreddit": "opiates"}], "dwpt8x7": [{"0_Comment Submission": "Point for 25, gram for 180", "1_Text": "u think thats insane. theres a movie where steve busemi's character gets put thru a wood chipper. the name of the movie is the city im talking about. out there its 60 a point no way around it. 300 a g. and the way they justify 3bills a gram is they say thats only 30 for each point.", "2_Subreddit": "opiates"}], "dwptio9": [{"0_Comment Submission": "How addictive is OPIUM?", "1_Text": "actually there was a coke epicidemic. what do u think they make crack from", "2_Subreddit": "opiates"}], "dwpubzu": [{"0_Comment Submission": "How addictive is OPIUM?", "1_Text": "why do u think they get addicted. the truth is the first great experience you get a feeling that u swear uve been waiting your whole life to feel that good and once u experience that feeling and compare it to normal life and being sober its near impossible to turn down feeling that amazing again. the best way to describe the feeling to somone who never felt it is... u know where your watching a movie and u get so tired that you keep closing your eyes and trying to stay awake and finally u give in and close them for good and u just feel at peace for about 20-30 secs before u pass out. imagine feeling that warm sedated feeling times 100. and when u get a nice buzz u can feel the blood rushing thru ur body. lots of people describe it as having a warm blanket over u after being really cold the amazing relief without actually being cold. also u get  to a point where u start to daze off or in opiate terms nodd off and basically your in a half awake dream state where your not sleeping but your not fully conscious either. this is the most blissful state in my opinion and its kind of like day dreaming but multiply it by 1000 based on the numbness and sense of no problems at all in the world. there could be a fire going on near by and in a nod state u wouldnt be much bothered. in other words when you are in this state u are content with the whole world and anything it has to throw at u. but this is just the nice great times of the first 10-15 times doing it. eventually u get to a point where if u do some and after doing it everyday for weeks few times a day where u will go thru withdrawl. basically because it does rush thru your body and make u feel extremly numb and blissful, when the chemical feeling wears off your body is basically a wreck and the only thing that is gonna get u well is more opiates. that is putting it very softly. basically its almost as bad as the  flu and on top of it u mind is just a basket case and very depressed and full of anxious thoughts and eventually u just obsess over getting more opiates until u do. imagine having the flu and knowing u could just take a pill or drink some cough syrup and bam your right back to normal and even better than normal feeling like u just asked out the girl uve had a crush on and she said yes. those types of emotions. so theres really no ? why when people use for weeks in a row after starting that once they hit there first experience with with drawl that they use again to get outta the flu type sickness. i mean its like if u had the flu knowing how shitty it feels and u could just take a pill to feel bettter u would turn that down. hell no aint no body trying to feel that way if it can be fixed that quick with a pill. thats why they call it a fix. any how thats why u dont try opiates because u will experience one of the best feeling of your life and unless u already are happy and fo filled maybe its possible to have an experience and move on back to your nice life. but for people who are in a rut or depresssed or full of anxiety its almost impossible to not use again after trying it and finally feeling at peace and having a chance to feel like u actaully like the world and if u could just feel like this u wouldnt be such a sap. but it will never fix your problems and will just make things worse if your using to run away from your problems.", "2_Subreddit": "opiates"}], "dws0sin": [{"0_Comment Submission": "In love with a user", "1_Text": "wow. this is like the exact situation I was in except for I just met her at a strip club and not thru friends. same shit bf in jail, addict, the whole nine yards. and pal let me say u do not wanna end up like me. when her bf got out of jail there were the same excuses feeling bad blah blah. next thing u kno some ramdon guy in a mask holds me up in my house for over 4k. im almost certain it was them. I did everything to try to help this girl and same as u I thought I was in love. that faded really quick when I realized it was  her bf that held me up in my own house. she knew I kept cash in the house from the first few times I had her give me private dances at my house. It was time to pay and im sure she kinda knew that I had plenty of cash on deck. anyhow im just happy I didnt get hurt. and think about this if her bf beats the shit outta the woman he loves, wats he gonna do to the dude who tryed cleaning her up and basically giving her the power to leave him for ever. READ THESE WORDS AND REMEMBER THEM. IF YOU DO NOT CUT IT OFF ASAP, U WILL HAVE EXTREME REGRET FOR  THE CIRCUMSTANCES IT HAS LEAD U TOO. iF U PROVIDE RESOURCES IN ANY WAY TO HER WHILE SHES WITH HER BF, THE SECOND U DENY THOSE RESOURCES WILL BE START SECOND THEY PLAN ON ROBBING U SOMHOWE. ITS OK TO LOVE SOMONE AND LET THEM GO PAL.", "2_Subreddit": "opiates"}], "dws120i": [{"0_Comment Submission": "Today's pickup!", "1_Text": "YOUR A CRACK HEAD PAL", "2_Subreddit": "opiates"}], "dwszmty": [{"0_Comment Submission": "Anyone ever heard of these or taking them ? Just wondering how they make you feel.", "1_Text": "Ketorolac, sold under the brand name Toradol among others, is a nonsteroidal anti-inflammatory drug (NSAID) in the family of heterocyclic acetic acid derivatives, used as an analgesic.[1][2] It is considered a first-generation NSAID.", "2_Subreddit": "opiates"}], "dwszv9b": [{"0_Comment Submission": "I have to meet police chief and mayor", "1_Text": "do u live in charolette", "2_Subreddit": "opiates"}], "dwszzj1": [{"0_Comment Submission": "I have to meet police chief and mayor", "1_Text": "you must be brad", "2_Subreddit": "opiates"}], "dwt031u": [{"0_Comment Submission": "I have to meet police chief and mayor", "1_Text": "http://www.wccbcharlotte.com/2018/03/19/man-saves-stranger-jumping-off-bridge/  here is the full story. your a good man brad", "2_Subreddit": "opiates"}], "dwtj6x7": [{"0_Comment Submission": "In love with a user", "1_Text": "shooting herion", "2_Subreddit": "opiates"}], "dwtjxyw": [{"0_Comment Submission": "more A E S T H E T I C drug pics for ya pervs", "1_Text": "it is very strong stuff. it should help with w/d but will make u extremly tired and take your blood pressure way down.", "2_Subreddit": "opiates"}], "dwtjzjz": [{"0_Comment Submission": "Nothing beats having enough that I can probably out running withdrawal for a while", "1_Text": "what is that h on the left and crack on the right", "2_Subreddit": "opiates"}], "dwu2n5z": [{"0_Comment Submission": "Pickup story : made my d boy sus", "1_Text": "might wanna wait to take pics on your own time and not in front of the dealer. I can def see a dboy getting noid as hell. thanks for the dope instantly pull out your camera and take pictures. it just kind of shows you got no street smarts or your taking evidence pictures.", "2_Subreddit": "opiates"}], "dwu2viv": [{"0_Comment Submission": "Standard", "1_Text": "so 8 hrs there and back.", "2_Subreddit": "opiates"}], "dww0i62": [{"0_Comment Submission": "I had to save my friend's life tonight.", "1_Text": "u did your job and gave him the best chance of living. he made his choices and would have gotten boy with or without u. its funny how nieve the parents are. they prolly have no clue that the chemical that made things escalate was the benzos legally prescribed.", "2_Subreddit": "opiates"}], "dww0n7j": [{"0_Comment Submission": "I had to save my friend's life tonight.", "1_Text": "also I dont have the self control u do because had I had been bringing the id back I would have flipped out on the mom for blaming me and had screamed that I saved his life u dumb bitch and maybe if you were a good parent your kid wouldnt have ended up snorting dope and taking bars at the same time. I think the mom was yelling at u while sub consciously yelling at herslef", "2_Subreddit": "opiates"}], "dwwe7si": [{"0_Comment Submission": "Standard", "1_Text": "in a job like that theres no contract. they can fire you for any reason. they dont even need a reason. just as the same as u can quit for no reason or quit for a reason.", "2_Subreddit": "opiates"}]}], "1_submissions": [{}]}]}