{"mashnote": [{"0_comments": [{"dw9p7om": [{"0_Comment Submission": "Anyone else agree?!", "1_Text": "While it's true that statistically speaking intelligence correlates with drug addiction, I think most of the explanations for that given in this thread are off mark. The simplest and most realistic explanation is that since **addiction is a mental process that revolves around rationalization**, the more intelligent you are the stronger your addiction because the better your rationalizations. Now re-read the other explanations for the correlation in this thread through the lens of these explanations, themselves, being rationalizations.\n\nThe mind is a crazy powerful and crazy limited thing!", "2_Subreddit": "opiates"}], "dwa18ft": [{"0_Comment Submission": "I’ll take WD over a heartbreak anyday", "1_Text": "Very well put. Suicide fodder for sure. \n\n<\\3", "2_Subreddit": "opiates"}], "dwa2cys": [{"0_Comment Submission": "Couple articles on America's WAR on pain pills.", "1_Text": "As much as I love to blame Big Pharmacist for shit I think is wicked and/or that I suffer from, i think in this case (current opioid epidemic) they are a scapegoat. Yet I am part of this grand hoax too, it can be very convenient; if I was to have secret double life as a doper exposed, I too would blame it on some pain prescription I had at some point, bc of the difference in social stigma. The truth is that I've had various painkiller prescriptions and never had a problem getting off, never became a grade A dope addict, until years afterward. But I have abused substances my whole life.\n\nSimpler explanation, USA sort-of legalized cannabis so now to regain profits the black market has shifted to another arbitrary plant that's illegal. Check the supply changes.", "2_Subreddit": "OpiatesRecovery"}], "dwa698t": [{"0_Comment Submission": "Question/Poll", "1_Text": "Not enough info to say one way or the other, but I will tell you this: you thought the dog was safe, you're probably next. Stay alert OP!", "2_Subreddit": "opiates"}], "dwai7iz": [{"0_Comment Submission": "Couple articles on America's WAR on pain pills.", "1_Text": "I'm not saying all of that didn't happen; I'm saying if you look at the effect that had proportionate to the entire effect of the current epidemic, it plays the minority role. The majority role being played by increased heroin supply and that supply being tainted with fentanyl. There was one article in particular that someone posted a while back that did a great job breaking down the statistics, I'll see if I can find it. I mean when you think back, historically the state hasn't typically done a stellar job with laying blame proportionately.\n\nEdit: I believe I found it, here it is: https://www.acsh.org/news/2017/10/12/opioid-epidemic-6-charts-designed-deceive-you-11935", "2_Subreddit": "OpiatesRecovery"}], "dwal2ew": [{"0_Comment Submission": "Couple articles on America's WAR on pain pills.", "1_Text": "Also, my statement was intended to *support* the points in the articles that you originally posted here. So let me clarify what it is exactly that I'm trying to express, and that the author I linked you argues for, because I fear I may have come off the wrong way.\n\nDid Big Pharma do wrong? Absolutely. That's what they do. But the mainstream view has put up Big Pharma's sins as this like huge animal sacrifice on the altar so to speak, to make it look like we are doing the right thing with the \"crackdown\". But these are the claims that are unsubstantiated: 1, that Big Pharma's evil doing created a whole new sizable population of addicts. That is difficult to prove. Maybe they only added a little bit, or not at all - maybe the pool of drug addicts is virtually the same, but now they are simply dying more often, because of the fentanyl problem. And 2, that current and past attempts to reverse what Big Pharma did wrong are helping or have helped. Like for example, the article points out that overdose deaths were stable in the first decade of this century up until 2010 when there was a new abuse-proof form of OxyContin which correlates perfectly with a spike in OD deaths - and while that is still an action of pharma, it is first of all not the action that the main narrative points to as the root of the problem, and second of all this phenomena does not suggest an increase in addiction, only an increase in deaths as a result of addiction. That is to say, the existing addicts switched products.\n\nI just think this whole crackdown thing is such bullshit, so inhumane, and salt in the wound is that it also represents yet another smokescreen thrown on the population preventing people from actually learning about real addiction.\n\nIs that more clear...? (btw, here is another good one by the same guy: https://www.acsh.org/news/2017/08/16/heads-sand-%E2%80%94-real-cause-todays-opioid-deaths-11681)\n\nEDIT: but see, the thing is that without a good massive-ass scapegoat, the state or the \"system\" or however you conceive of our country's dominant power would be forced to acknowledge the only remaining possible cause of the creation and maintenance of all these super mentally-ill people: a toxic ass culture. And that would be so very bad for business.", "2_Subreddit": "OpiatesRecovery"}], "dwhog1t": [{"0_Comment Submission": "Well, we have all been in this predicament.....", "1_Text": "Portable pocket-sized single use hand warmers. Squeeze to activate.", "2_Subreddit": "opiates"}], "dwholgm": [{"0_Comment Submission": "NA isn't the only way to get clean", "1_Text": "Preach. Btw I have heard that statistics show that SMART recovery is four times more effective than NA/12 step. As in four times as many people are still clean a year later. Food for thought.", "2_Subreddit": "opiates"}], "dwhpie4": [{"0_Comment Submission": "Lost My Job!", "1_Text": "I really think you are mistaken. I think that only possession is a crime, not use. If you are not mistaken then I am mistaken and if so I really want to know.\n\nWhere is USE (not possession) a crime? Can you name even one place? (I'm only talking about USA)", "2_Subreddit": "opiates"}], "dwhq3xu": [{"0_Comment Submission": "Rebate; Re up; Relief", "1_Text": "I wish more people would acknowledge that getting sober isn't the most important thing; developing life skills is. Maybe it would take longer for more people to reach \"sobriety\", but I think there would be less damage leading up to that point and fewer relapses afterward.\n\nCongrats, proud af of you, stranger. As a functioning addict who wishes to become *high*-functioning, I'll be shooting a PM your way.", "2_Subreddit": "opiates"}], "dwhqp6i": [{"0_Comment Submission": "Well, we have all been in this predicament.....", "1_Text": "Just like how if you cook meat the same way with the same amounts of everything a bunch of times, you eventually don't need the meat thermometer because it's very easy to predict when your meat will hit x degrees... well, same concept. A lot of people have fucked with this method often enough to develop the \"recipe\" you need, which looks like this: have exactly v mL of piss in w type of container, have x type of hand warmer and squeeze it within y minutes of having to drop, after which you will have a window of z minutes to get your temperature.\n\nNot saying it's ideal; I agree the best method is to be clean for tests, cuz that's serious shit. Just wanted to throw that out there in case somebody is unfortunately needing to face this last resort. 😔 (yes, I have seen it done successfully. Hand warmers work *quick*.)", "2_Subreddit": "opiates"}], "dwhqyxr": [{"0_Comment Submission": "Well, we have all been in this predicament.....", "1_Text": "Again, I agree.... but a lot of people are so fucked with addiction that they can't bring themselves to, even when jail is on the line.... 😔 I've seen folks use right up until \"the hour mark\" they believe to be the limit... officially in academia and medicine addiction is defined by disordered thinking/behavior.", "2_Subreddit": "opiates"}], "dwhwasu": [{"0_Comment Submission": "Lost My Job!", "1_Text": "Holy shit you're right. Just looked it up and it's under Michigan legislature MCL 333.7341(4). I treasure my few civil rights so remind me not to move to Michigan. Good on you for bargaining down though!", "2_Subreddit": "opiates"}], "dwhwsaa": [{"0_Comment Submission": "Fucking Magnesium. Don't roll the dice with this RLS remedy", "1_Text": "Next time maybe try a hot epsom salt bath instead. The magnesium absorbs through the skin directly and only to the saturation point so your muscles only get what they need and no more. It's helped me tremendously during WD. Magnesium  supplementation on the other hand (oral) doesn't even work fast enough to really \"work\", it needs to build up in the system over multiple days of dosing. I know this because my SO takes it daily for bipolar and I take it daily for horrendous migraines. (Thank you, sane non-pharma-lapdog neurologists!) but I have another friend with anxiety disorder who says magnesium aggravates her symptoms, so I think with this particular substance everyone is different.\n\nIf you don't mind I'd love to hear about what your toxicity experience was like, when you're feeling up to it.", "2_Subreddit": "opiates"}], "dwipue5": [{"0_Comment Submission": "NA isn't the only way to get clean", "1_Text": "Yup yup. I agree with you actually. It does seem like most of them eventually fail. What's really fucked up to think about is the fact that relapse makes the rehab more profit than sobriety (if they come back to the same place for more treatment, which, interestingly to me, is not uncommon). \n\nhtI like your doctor's point of view as well. That's true harm reduction, literally. I don't know if the \"all or nothing\" mentality actually helps here... that's not how I've cut back on other harmful habits. But my bf says that heroin is a whole different beast, that you can't give her even a hair. And I'll be damned if I didn't already make that mistake, getting addicted in the first place. (\"I don't have an addictive personality, it will be fine to keep it to the weekends\")\n\nKind of in support of what you said, I just started reading the book Unbroken Brain, and it read I quote: \"studies find that the majority of cocaine, alcohol, prescription drug, and cannabis addictions end before people are in their mid-30s and most do so without treatment.\"", "2_Subreddit": "opiates"}], "dwipy28": [{"0_Comment Submission": "NA isn't the only way to get clean", "1_Text": "Yeah? Do you mind sharing more about your experience with SMART? What do you like about it so much? I think I might start going to SMART meetings here soon so I'm quite interested.", "2_Subreddit": "opiates"}], "dwp84wk": [{"0_Comment Submission": "NA isn't the only way to get clean", "1_Text": "Yup yup and yup. I totally agree with everything you said here... am I missing something?, what was it that I said that you disagree with?\n\nEdit: also, what in that quote leads you to think they are using a broad definition of addiction? Is it because you can't believe that the majority of \"serious, real\" addictions resolve? Because the quote did not indicate how they are measuring and/or defining addiction.", "2_Subreddit": "opiates"}], "dwprijt": [{"0_Comment Submission": "NA isn't the only way to get clean", "1_Text": "Ahh yes, very good points. Very true, it seems to me. Doesn't seem like anybody really knows what the **** is going on with addiction. Which is why I'm interested in this book, because I understand the premise to be that she is re-framing it in a new paradigm (learning disorder). Have you read it? Do you think it's worth the read? What did you take away from it?", "2_Subreddit": "opiates"}], "dwpsyxl": [{"0_Comment Submission": "Depression after stopping", "1_Text": "I think that that whole being-fundamentally-driven-by-\"a thing\" is a lot less common than we are led to believe. I think my culture at least (American) invests in training us to think of that as the key to a good and meaningful life, probably because it meshes so well with other American values like individuality, independence, and having a full time job that creates social mobility. But to be honest, I have seen WAY more people that \"wish\" they had something that \"lights up their eyes\", as you put it, or that intend to find that thing, or that think they found it once and they've been meaning to get back to it for a while... you catch my drift.\n\nAnd I can't help but wonder if that's really a realistic or even desirable goal for most people... like is that really human nature? What is the evidence that that is human nature? Or is it more of a picturesque ideal?\n\nBut I think this is one that's really hard to let go of for most people because it's just such a darn romantic idea. That you will feel fulfilled or stimulated if you just find \"your thing\". A \"thing\" is so dependable and it won't ever abandon you and you can make it yours in your own unique way, forever.\n\nWhat's funny to me too is that it's so common to hear people disparage how unhealthy it is to rely on a person for happiness and then in practically the same breath recommend finding a hobby or job or \"your thing\" as a Good road to happiness... Hmm...", "2_Subreddit": "opiates"}], "dwptwjf": [{"0_Comment Submission": "Stupid shit people say about recovery - have to sit for you", "1_Text": "I think what OP is trying to say is that there actually is not a disagreement because both of you say you need to quit for yourself in order to *ultimately succeed*. You didn't really address his point which was all about how it begins, not where it goes.\n\nFor the record I don't have an opinion on this; I just feel the urge to help when I see two people not understanding each other's points and thus arguing \"past\" each other. (Aka child of divorce neuroses)", "2_Subreddit": "opiates"}], "dwrir0r": [{"0_Comment Submission": "Depression after stopping", "1_Text": "Thanks so much for saying this. I haven't spent much time outside of the West but this was my suspicion so thx for confirming it. I saw a huge increase in mental well being once I realized the whole \"a thing\" narrative is kind of silly.", "2_Subreddit": "opiates"}], "dwuck39": [{"0_Comment Submission": "today would’ve been your 23rd birthday. i miss you everyday darlin’ 💔", "1_Text": "Lmao, straightened arrow... that's pretty much the best misheard phrase I've ever seen. How long have you thought that's what it was? Adorable, you should keep going and make that a thing. One day no one will remember the other way", "2_Subreddit": "opiates"}], "dwud6uy": [{"0_Comment Submission": "today would’ve been your 23rd birthday. i miss you everyday darlin’ 💔", "1_Text": "Wow, what an amazing, powerful, beautiful dream. I'm fascinated by such dreams. Thanks so much for sharing.\n\nMy dog that I grew up with fought a long hard battle with cancer before we had to put her down. She went through so much... the night I saw her crying as she dragged herself across the floor because she had lost the use of her hind legs but felt scared in the middle of the night and wanted to be with someone, or maybe try to get outside because she was tired of the humiliation of pissing herself, idk... watching her drag herself, my heart broke into like a million little pieces. I remember the moment and the feeling so clearly, and I knew I would never recover and I never have. But my point is, re: dreams like that.. after she died, I was so upset constantly thinking about how she had suffered *so* much before she went, and then...\n\nShe came to me in a dream. It didn't feel like a normal dream with her in it, I mean I'd dreamt of my dog a bunch of times, but this time it felt distinctly different, like I had no control over or input into it... like there was really \"someone *else*\" present. Yes, a presence. A sense of surprise and mystery and giving. \n\nWe were sitting at the bottom of the ocean, and we couldn't move, but somehow could still breathe. In fact we weren't distressed at all, quite the opposite. There was a lot of light and pretty fish and bubbles would float by and we were just straight chillin, watching the world pass, enveloped in this feeling of contentedness and well being and relaxation. She communicated to me with her mind directly to my mind the following: this is like the place I am at now. It's very peaceful and I am happy. Before, during the time that you worry I suffered too much, I had a lot of days like this - where even though I couldn't walk or move much, I felt content to watch the world pass, because I felt loved. So thank you. I am at peace now and I want you to be at peace too. I like when we are together. I love you.\n\nIt felt so lucid, so real. I woke up and cried happy tears. I still believe it. I don't know if you believe in shit like that, but I do. I know how silly it sounds, but when you experience it, it makes too much sense. So I believe that maybe your friend reached out. I believe that love is an artifact that transcends time and space, and that she was showing you that realm. That's where y'all are still together, always have been, always will be. 💖👽💫", "2_Subreddit": "opiates"}], "dwv767t": [{"0_Comment Submission": "today would’ve been your 23rd birthday. i miss you everyday darlin’ 💔", "1_Text": "Aw thank you! That's cool of you. I myself am an atheist; I think love being an artifact that transcends time and space doesn't necessitate anything supernatural, just the awareness that we are still as far away from understanding everything as the primitives that worshipped the sun and moon, in the grand scheme of things.", "2_Subreddit": "opiates"}], "dwv996p": [{"0_Comment Submission": "I'm Eric Hafner, I'm running for U.S. Congress in Portland, Oregon (OR-3). I want to legalize all drugs, including opiates, but offer ibogaine therapy too, and free drugs for addicts via prescription.", "1_Text": "Subs (buprenorphine) are not a quasi opiate. They are an opiate. You are still taking an opiate every day.", "2_Subreddit": "opiates"}]}], "1_submissions": [{"4web9b": [{"0_Title": "Those of you who have been married for over ten years and are still in love, I want to hear from you. What's it like?", "1_Text": "While it's true that statistically speaking intelligence correlates with drug addiction, I think most of the explanations for that given in this thread are off mark. The simplest and most realistic explanation is that since **addiction is a mental process that revolves around rationalization**, the more intelligent you are the stronger your addiction because the better your rationalizations. Now re-read the other explanations for the correlation in this thread through the lens of these explanations, themselves, being rationalizations.\n\nThe mind is a crazy powerful and crazy limited thing!", "2_Subreddit": "love"}], "6ibsod": [{"0_Title": "As a small weak female, I am scared to take a taxi alone in Buenos Aires, but I must - ayuda por favor", "1_Text": "While it's true that statistically speaking intelligence correlates with drug addiction, I think most of the explanations for that given in this thread are off mark. The simplest and most realistic explanation is that since **addiction is a mental process that revolves around rationalization**, the more intelligent you are the stronger your addiction because the better your rationalizations. Now re-read the other explanations for the correlation in this thread through the lens of these explanations, themselves, being rationalizations.\n\nThe mind is a crazy powerful and crazy limited thing!", "2_Subreddit": "BuenosAires"}], "6xgg4a": [{"0_Title": "Fentanyl Warning - Central Texas", "1_Text": "While it's true that statistically speaking intelligence correlates with drug addiction, I think most of the explanations for that given in this thread are off mark. The simplest and most realistic explanation is that since **addiction is a mental process that revolves around rationalization**, the more intelligent you are the stronger your addiction because the better your rationalizations. Now re-read the other explanations for the correlation in this thread through the lens of these explanations, themselves, being rationalizations.\n\nThe mind is a crazy powerful and crazy limited thing!", "2_Subreddit": "opiates"}], "78dybt": [{"0_Title": "Just discovered a free, foolproof, simple way to intensify the rush from my shots !!! And now I want to hear yours.", "1_Text": "While it's true that statistically speaking intelligence correlates with drug addiction, I think most of the explanations for that given in this thread are off mark. The simplest and most realistic explanation is that since **addiction is a mental process that revolves around rationalization**, the more intelligent you are the stronger your addiction because the better your rationalizations. Now re-read the other explanations for the correlation in this thread through the lens of these explanations, themselves, being rationalizations.\n\nThe mind is a crazy powerful and crazy limited thing!", "2_Subreddit": "opiates"}], "78r852": [{"0_Title": "SO and I are gonna try mixing H and ecstasy tonight.... any tips?", "1_Text": "While it's true that statistically speaking intelligence correlates with drug addiction, I think most of the explanations for that given in this thread are off mark. The simplest and most realistic explanation is that since **addiction is a mental process that revolves around rationalization**, the more intelligent you are the stronger your addiction because the better your rationalizations. Now re-read the other explanations for the correlation in this thread through the lens of these explanations, themselves, being rationalizations.\n\nThe mind is a crazy powerful and crazy limited thing!", "2_Subreddit": "opiates"}], "798o52": [{"0_Title": "What could explain this: after having a daily speedball habit for quite a while, my first time banging coke by itself, I felt practically nothing", "1_Text": "While it's true that statistically speaking intelligence correlates with drug addiction, I think most of the explanations for that given in this thread are off mark. The simplest and most realistic explanation is that since **addiction is a mental process that revolves around rationalization**, the more intelligent you are the stronger your addiction because the better your rationalizations. Now re-read the other explanations for the correlation in this thread through the lens of these explanations, themselves, being rationalizations.\n\nThe mind is a crazy powerful and crazy limited thing!", "2_Subreddit": "Stims"}], "7apb3k": [{"0_Title": "I just got slammed by my period 25 hours into WD. Girl junkies plz pray for me", "1_Text": "While it's true that statistically speaking intelligence correlates with drug addiction, I think most of the explanations for that given in this thread are off mark. The simplest and most realistic explanation is that since **addiction is a mental process that revolves around rationalization**, the more intelligent you are the stronger your addiction because the better your rationalizations. Now re-read the other explanations for the correlation in this thread through the lens of these explanations, themselves, being rationalizations.\n\nThe mind is a crazy powerful and crazy limited thing!", "2_Subreddit": "opiates"}], "7bi92l": [{"0_Title": "Taking buprenorphine every day makes it \"build up\" in your system. Here's what that looks like broken down day by day... and here are some questions I have.", "1_Text": "While it's true that statistically speaking intelligence correlates with drug addiction, I think most of the explanations for that given in this thread are off mark. The simplest and most realistic explanation is that since **addiction is a mental process that revolves around rationalization**, the more intelligent you are the stronger your addiction because the better your rationalizations. Now re-read the other explanations for the correlation in this thread through the lens of these explanations, themselves, being rationalizations.\n\nThe mind is a crazy powerful and crazy limited thing!", "2_Subreddit": "opiates"}], "7kfvwo": [{"0_Title": "Despite watching videos, I still can't figure out how to use these micron wheel filters. Please, my dumb ass is desperate for assistance.", "1_Text": "While it's true that statistically speaking intelligence correlates with drug addiction, I think most of the explanations for that given in this thread are off mark. The simplest and most realistic explanation is that since **addiction is a mental process that revolves around rationalization**, the more intelligent you are the stronger your addiction because the better your rationalizations. Now re-read the other explanations for the correlation in this thread through the lens of these explanations, themselves, being rationalizations.\n\nThe mind is a crazy powerful and crazy limited thing!", "2_Subreddit": "opiates"}], "7pezji": [{"0_Title": "What's something positive that has come from your opiate addiction?", "1_Text": "While it's true that statistically speaking intelligence correlates with drug addiction, I think most of the explanations for that given in this thread are off mark. The simplest and most realistic explanation is that since **addiction is a mental process that revolves around rationalization**, the more intelligent you are the stronger your addiction because the better your rationalizations. Now re-read the other explanations for the correlation in this thread through the lens of these explanations, themselves, being rationalizations.\n\nThe mind is a crazy powerful and crazy limited thing!", "2_Subreddit": "opiates"}], "7y4mg6": [{"0_Title": "Anyone else going through a sharp \"tolerance break\" type WD, rather than complete zero-dose kicking?", "1_Text": "While it's true that statistically speaking intelligence correlates with drug addiction, I think most of the explanations for that given in this thread are off mark. The simplest and most realistic explanation is that since **addiction is a mental process that revolves around rationalization**, the more intelligent you are the stronger your addiction because the better your rationalizations. Now re-read the other explanations for the correlation in this thread through the lens of these explanations, themselves, being rationalizations.\n\nThe mind is a crazy powerful and crazy limited thing!", "2_Subreddit": "opiates"}], "82otfi": [{"0_Title": "Efff speedballs feel so damn good, how the hell to quit these!! Has anyone out there quit a daily speedball habit?! Plz tell me how. I mean jeez it's like an orgasm from young Jesus.", "1_Text": "While it's true that statistically speaking intelligence correlates with drug addiction, I think most of the explanations for that given in this thread are off mark. The simplest and most realistic explanation is that since **addiction is a mental process that revolves around rationalization**, the more intelligent you are the stronger your addiction because the better your rationalizations. Now re-read the other explanations for the correlation in this thread through the lens of these explanations, themselves, being rationalizations.\n\nThe mind is a crazy powerful and crazy limited thing!", "2_Subreddit": "opiates"}]}]}]}