{"b-dexteh": [{"0_comments": [{"dvhqo8m": [{"0_Comment Submission": "Research Chem U-4", "1_Text": "After some reading up I’m fairly certain it is in fact -49. Typically my reactions are slight paranoia with hallucinations; weird, “painted in” visuals, hearing people say my name, hearing loud crashes. Crazy shit. \nI’d been institutionalized in the past for psychotic episodes that were drug related and they taught me a lot of grounding techniques to keep in mind. When it comes to wild ass substances like this though it’s damn near impossible for anyone to not lose their shit and snap from a simple breeze that blew the wrong way", "2_Subreddit": "opiates"}], "dvhqw2p": [{"0_Comment Submission": "Research Chem U-4", "1_Text": "Farthest into WD’s I’d gotten was 4 days and by then it was quite literally impossible for me to bring myself to move, even though I know I was getting up to go pick up a fix. After looking around I got back onto ‘tried and true’ boy with the hope that I could manage the detox and taper out with subs. So far I’ve kicked a gram a day habit down to 1/4 gram a day and haven’t broken my process yet", "2_Subreddit": "opiates"}], "dvsckuz": [{"0_Comment Submission": "Research Chem U-4", "1_Text": "Yep, and the crazy shit was I was never even intentionally searching for it; that dealer simply kept a massive stock and eventually admitted that it was a “H substitute.”\nAs of now I’m no longer on it (thank Christ;) I went back to my old H source and stuck with that for several days. I’m not sure if it was real detox symptoms from the u-4 getting flushed out or if it was a mental thing my brain pulled on itself (considering I was still inputting an opiate) but I could have sworn that I would still feel slight WD symptoms as it hit 12-18 hours after I last touched the 4, while I most certainly was feeling buzzed off the H; goosebumps, runny nose, light auditory hallucinations, extreme irritability, other manageable things that weren’t anywhere NEAR the full blown symptoms.", "2_Subreddit": "opiates"}], "dvscrdv": [{"0_Comment Submission": "Research Chem U-4", "1_Text": "I can’t afford it monetarily, nor can I afford switching dependencies.  I haven’t dosed u-4 in a while now but I still have a moderately high H habit that I’m attempting to cold turkey for the first real time. The odds look ridiculously out of my favor, I know, but I HAVE to follow through and not allow myself to relapse. Tomorrow will be day 2 and if I can make it to day 5 I know I’ll be set.", "2_Subreddit": "opiates"}], "dvscvql": [{"0_Comment Submission": "Research Chem U-4", "1_Text": "That’s actually what I’m in the process of doing. It’s the 2nd day and it’s been cold turkey thus far but I have 1/2 gram that I’ll taper with for around a week and a half; mainly just to allow myself to sleep or to get through work without looking as if I’m about to die in front of managers. Not been easy but it’s a gargantuan step down from the WD’s from the RC", "2_Subreddit": "opiates"}], "dvscxdy": [{"0_Comment Submission": "Research Chem U-4", "1_Text": "Last time I touched any was 2 weeks ago and a gram had done nothing but keep me from being sick. That was the final straw and I never went back", "2_Subreddit": "opiates"}], "dvu6tc8": [{"0_Comment Submission": "Best advice for at home detox", "1_Text": "That’s what I’ve heard; opiates are just wasting time until you either run out of what you’re substituting with or until you realize cutting hem out completely is the right way. \nI’ll be looking for klonopine or valiums to ease the anxiety and restlessness at the start and end of the days.", "2_Subreddit": "opiates"}], "dvu6uqn": [{"0_Comment Submission": "Best advice for at home detox", "1_Text": "I’ve tried kratom before but it wasn’t for me. I really didn’t see and change whatsoever in WD’s except for getting rid of a runny nose and crawling skin; everything else was just as intense. \nMay have simply been using the wrong strain of the stuff though now that I thing about it", "2_Subreddit": "opiates"}], "dvu70k1": [{"0_Comment Submission": "Best advice for at home detox", "1_Text": "Good shit man, stick to it! I’m on probation so smoking was iffy before for me but I’ve pretty much gotten to the point of not really giving a fuck anymore (if I get violated I’m guaranteed at least 3 days of forced withdrawal and from there I’ll be able to control my impulses, even though that’s a really fucked up way to view it) \nKlonopines or Valiums, some potent bud and a shit ton of vitamins & exercise is what I’m planning to aid me through this hellish few weeks to come. \nHope you stay on the right path and leave this shit behind ya, dude!!", "2_Subreddit": "opiates"}], "dvu73yd": [{"0_Comment Submission": "Best advice for at home detox", "1_Text": "Yep, ive come to realize that. There’s no easy way out or ultimate WD cocktail that’ll leave you completely clean and chemically stable on the other side; if it was that simple there wouldn’t be addicts of many, many years other than those that actually wanted to be. \nI guess the best thing there is to help ease the symptoms is really just your willpower and mindset. That won’t make it any less painful or shitty but it’s really all you need to successfully get yourself back to how you truly were (vitamins and improvements in diet and exercise as well to get your body accustomed to healthy living and proper working order)", "2_Subreddit": "opiates"}], "dvu76f2": [{"0_Comment Submission": "Best advice for at home detox", "1_Text": "I found that using blow would help for around 10-15 minutes, then the anxiety from WD added with the comedown from coke was pure agony. Needless to say, I learned my lesson with that haha. Weed and orgasms help a lot actually from past experience, only for a short while though. If it goes as planned I’ll manage without sub, but Idk yet since I can’t take time off of work and have only 1 day a week off typically", "2_Subreddit": "opiates"}], "dwhev2f": [{"0_Comment Submission": "Happy Birthday to me...", "1_Text": "Happy birthday dude! My 21st is the day after tomorrow, and I too and stuck between grabbing a bag to stave off withdrawals or continue my taper plan I’ve been working. Do what ya need to as far as payments and rent goes, THEN face the dilemma of what choice you should make!", "2_Subreddit": "opiates"}]}], "1_submissions": [{"80h2cs": [{"0_Title": "Research Chem U-4", "1_Text": "After some reading up I’m fairly certain it is in fact -49. Typically my reactions are slight paranoia with hallucinations; weird, “painted in” visuals, hearing people say my name, hearing loud crashes. Crazy shit. \nI’d been institutionalized in the past for psychotic episodes that were drug related and they taught me a lot of grounding techniques to keep in mind. When it comes to wild ass substances like this though it’s damn near impossible for anyone to not lose their shit and snap from a simple breeze that blew the wrong way", "2_Subreddit": "opiates"}], "84u1r1": [{"0_Title": "Best advice for at home detox", "1_Text": "After some reading up I’m fairly certain it is in fact -49. Typically my reactions are slight paranoia with hallucinations; weird, “painted in” visuals, hearing people say my name, hearing loud crashes. Crazy shit. \nI’d been institutionalized in the past for psychotic episodes that were drug related and they taught me a lot of grounding techniques to keep in mind. When it comes to wild ass substances like this though it’s damn near impossible for anyone to not lose their shit and snap from a simple breeze that blew the wrong way", "2_Subreddit": "opiates"}]}]}]}