{"dopfeen": [{"0_comments": [{"dt50mul": [{"0_Comment Submission": "15 year old addicted to mdma pills (need help)", "1_Text": "Cut off all contact with dealers / other users, if you make it more difficult for yourself to get drugs it'll be easier to get through that initial period.", "2_Subreddit": "Drugs"}], "dt50rik": [{"0_Comment Submission": "drug to get high other than weed?", "1_Text": "If a drug doesn't get you high then what would be the point", "2_Subreddit": "Drugs"}], "dt51dii": [{"0_Comment Submission": "I think I'm addicted to opiates at 16 years old", "1_Text": "Ok firstly you're not taking the codeine with paracetamol to get that much codeine right? Because that'll destroy your liver.\n\nTaking that much codeine is unnecessary for migraines, plus there's other non-opiate drugs for migraines, just switch to something else. \n\nYou don't sound physically addicted at the moment but you're heading towards an addiction for sure, so I'd stop now or you'll end up trying stronger opiates and it'll just spiral from there. Completely stopping and never using again may seem like the hardest thing in the world right now but the longer you use the harder it gets. \n\nSeriously, you've realized that you have a problem earlier than most so quit before it gets out of control. I started with codeine at 16 too, next came heroin, spiraled into an insane fentanyl addiction, before I knew I'd destroyed my mental health, had multiple overdoses, got in trouble with the police, lost friends that got into it with me to this shit, and finally had a massive seizure detoxing from carfentanyl and in hosptial got told that most of my organs were functioning minimally before I finally quit. 19 now clean for a few months still crave it all the time, it escalates really fucking fast, so I advise you stop.", "2_Subreddit": "Drugs"}], "dt51x9k": [{"0_Comment Submission": "Help me make the perfect fap", "1_Text": "Adderall adderall adderall adderall", "2_Subreddit": "Drugs"}], "dt66v94": [{"0_Comment Submission": "Men, where's the worst place that you've had an erection?", "1_Text": "Inside your mom", "2_Subreddit": "AskReddit"}], "dulpqzz": [{"0_Comment Submission": "Drug Review: Diethyl Ether", "1_Text": "Ether makes you nauseous if you do enough", "2_Subreddit": "Drugs"}], "dulptqk": [{"0_Comment Submission": "Drug Review: Diethyl Ether", "1_Text": "Try soaking a rag in 10-15ml and immediately inhaling straight through the rag, totally different experience", "2_Subreddit": "Drugs"}], "dvaaxiu": [{"0_Comment Submission": "What's the most worthless, yet irritating thing that a thief could steal in a home robbery?", "1_Text": "I spent longer looking through this sub just now than I'd like to admit", "2_Subreddit": "AskReddit"}], "dvjucbv": [{"0_Comment Submission": "What is the most \"adult\" thing you have ever done?", "1_Text": "I'm 20 and I've done this", "2_Subreddit": "AskReddit"}], "dvjv076": [{"0_Comment Submission": "Teenagers of Reddit, what is something you want to ask adults of Reddit?", "1_Text": "You don't. You will never know. Just wing it.", "2_Subreddit": "AskReddit"}], "dvjv9fj": [{"0_Comment Submission": "Teenagers of Reddit, what is something you want to ask adults of Reddit?", "1_Text": "Honestly I felt like this until I went to parties then realized that parties are mostly shit and if you feel this way then you probably won't enjoy partying anyway. Join a club or something that you actually enjoy, parties aren't everything.", "2_Subreddit": "AskReddit"}], "dvjvczn": [{"0_Comment Submission": "Teenagers of Reddit, what is something you want to ask adults of Reddit?", "1_Text": "Absolutely", "2_Subreddit": "AskReddit"}], "dvjvfb6": [{"0_Comment Submission": "Teenagers of Reddit, what is something you want to ask adults of Reddit?", "1_Text": "Depends on if you put in the effort to make a change", "2_Subreddit": "AskReddit"}], "dvjvh6e": [{"0_Comment Submission": "Teenagers of Reddit, what is something you want to ask adults of Reddit?", "1_Text": "Holy fuck no why would anyone want to do that that's basically self harm", "2_Subreddit": "AskReddit"}], "dvjvmm3": [{"0_Comment Submission": "Teenagers of Reddit, what is something you want to ask adults of Reddit?", "1_Text": "Sorry not happening kid.", "2_Subreddit": "AskReddit"}], "dvjvqe8": [{"0_Comment Submission": "Teenagers of Reddit, what is something you want to ask adults of Reddit?", "1_Text": "Just wing it", "2_Subreddit": "AskReddit"}], "dvjvtuz": [{"0_Comment Submission": "Teenagers of Reddit, what is something you want to ask adults of Reddit?", "1_Text": "Where do you even get these kind of teaching hours god damn", "2_Subreddit": "AskReddit"}], "dvjw1d9": [{"0_Comment Submission": "Teenagers of Reddit, what is something you want to ask adults of Reddit?", "1_Text": "If you put yourself first you ARE being selfish, that's what the word means. Just realize that there's nothing wrong with that. Everyone is doing the same thing without realizing it, the world is selfish. So long as you understand, and accept, why you're doing what you do, then you'll be okay with yourself.", "2_Subreddit": "AskReddit"}], "dvvgmm2": [{"0_Comment Submission": "People only care that you're high when they notice it.", "1_Text": "It feels weird that this even needs to be pointed out", "2_Subreddit": "Drugs"}], "dw2j34u": [{"0_Comment Submission": "Lol. Bout that life?", "1_Text": "If you get narcaned everyday you should probably use less", "2_Subreddit": "opiates"}], "dw4vty8": [{"0_Comment Submission": "It's Not In Your Head - Psychedelics Are Making A Scientific Comeback", "1_Text": "Nah I think originally they were made illegal because hippies are annoying", "2_Subreddit": "Drugs"}], "dw4w0ey": [{"0_Comment Submission": "I don’t know but I know I will try", "1_Text": "Isn't ibogaine meant to actually 'reset' your brain chemistry to a normal pre-addiction state though? Don't think ayahuasca does this, but could still be useful.", "2_Subreddit": "opiates"}], "dwc3dhj": [{"0_Comment Submission": "What's the most insane thing you've done on acid?", "1_Text": "At some point during a 500ug lsd trip I wanted to sleep so I took 700mg diphenhydramine (I added it up and decided that 14 50mg pills is 50mg, acid makes me shit at math) would not recommend", "2_Subreddit": "Drugs"}], "dwn5o0n": [{"0_Comment Submission": "What's the most insane thing you've done on acid?", "1_Text": "Yeah I was seeing insects everywhere for a couple of days and had no idea why", "2_Subreddit": "Drugs"}], "dwn60z0": [{"0_Comment Submission": "“When you feel the urge just smoke some weed..”", "1_Text": "Yes", "2_Subreddit": "opiates"}]}], "1_submissions": [{}]}]}