{"pissdrunx801": [{"0_comments": [{"dwwg1tq": [{"0_Comment Submission": "West Coast Lovin’", "1_Text": "Long time lurker, first time poster... For all the ECP folks and junkys in general, a little lovin’ from the other coast. 1st photo is a rock of powder black tar. This is what your dope looks like before moisture is introduced (I actually don’t know the specifics of the production process, but would love to hear it if someone has that info!). 2nd photo: I broke up the rock and huffed on it for a minute or so. You can see it start to resemble tar as it catches the moisture on my breath. Happy Hustlin’!", "2_Subreddit": "opiates"}], "dwwhfqa": [{"0_Comment Submission": "Just relapsed after almost 10 months clean", "1_Text": "Goddamn, your story sounds a lot like mine (even the specifics outside of the drug/relapse shit). As someone who has been down that road many times (relapse, trying to chip), I can tell you the most obvious, glaring thing about your situation: it’s not fucking worth it! But you know this. And it sounds like you’ve already made up your mind to try to chip. We all know how that ends up. Maybe you can do it man?? I know I can’t, and haven’t seen it done successfully. Only you can answer that and decide. As someone who was in a similar boat recently (clean for several months, relapse) and is actively using heroin again, I have no place to discourage you from continuing to use. I can say that it’s dark and fucking miserable though. Sure, there are brief reprieves and moments of bliss, but the trade off is a shitty deal. If I were you, I’d reconsider your plan, and think of all the good shit you could possibly lose. Cause it sounds like things are going good for you. As a fellow addict, I’m notorious for taking a good thing and burning it the fuck down. Good luck, man! Keep us posted.", "2_Subreddit": "opiates"}], "dwwirwg": [{"0_Comment Submission": "Here is why many British drug users take so much.", "1_Text": "Wow, this sounds very interesting. How would you rate the severity of your “condition” (for lack of a better term)? Meaning, are you simply bad at empathizing, or typically have little to no empathetic responses at all? How does this condition manifest in your life and everyday interactions with other people? Do you find yourself having “un-empathetic” responses to people (thoughts of violence, maybe, or like imagining someone getting hit by a car without feeling any shock or sympathy)? \n\nI’m reading over this, and I apologize if these questions are crude or too personal. I’m also happy to hear that your experience with LSD was so beneficial and insightful. I’ve learned so much from acid: about myself, my thoughts and feelings, also the world and our place in it. Wouldn’t recommend LSD for everyone (the bros mentioned in this post, for example). But goddamn did it change the way I look at the world...", "2_Subreddit": "Drugs"}], "dwwleyn": [{"0_Comment Submission": "Wow, going hard with Molly is just not what I thought it would be.", "1_Text": "I’m not sure if “clean eating” (just eating better in general, more fruits and veg, whole grains, responsible proteins, less fats, empty carbs, sugars, red meat... ya know, basic nutrition) would directly affect serotonin levels specifically. But it would undoubtedly help with brain function, sleep, and general health/well-being. I imagine this, in turn, would benefit your serotonin system. I don’t have the science to back me up, but eating well never hurts.", "2_Subreddit": "Drugs"}], "dwwmizs": [{"0_Comment Submission": "Went to my first pregnancy OB appointment today and failed drug screen for a slew of drugs I’m not on. False positives because of anti depressants? They made me leave.", "1_Text": "Used to administer drug tests to veterans who were on a slew of medications (SSRIs, anti-psych, etc). There were often false positives associated with medications like that, especially the anti-depressants and the anti-psychs. Although it does seem strange that you would have that many false positives. Regardless, if you haven’t taken those substances, the lab should clear up any discrepancies. I wouldn’t worry about it. As far as your OB, you’d be surprised how much ignorance/misinformation there is concerning drug testing (and drugs in general), even in the medical field. That, and the stigma of addiction. Medical professionals should know better, especially when it comes to how they interact with addicts or potential drug users. But sadly, this is usually not the case. That’s crazy that they refused to see you. I’d definitely look into seeing a more empathetic OB.", "2_Subreddit": "Drugs"}], "dwwn08n": [{"0_Comment Submission": "Went to my first pregnancy OB appointment today and failed drug screen for a slew of drugs I’m not on. False positives because of anti depressants? They made me leave.", "1_Text": "It is not uncommon for an SSRI to trigger a “false positive” for certain substances (benzos, barbiturates are common ones). Contrary to popular belief, the common urine analysis drug test can be inaccurate and seriously unreliable. I wouldn’t trust anything that wasn’t tested by a lab.", "2_Subreddit": "Drugs"}]}], "1_submissions": [{"8a7g7w": [{"0_Title": "West Coast Lovin’", "1_Text": "Long time lurker, first time poster... For all the ECP folks and junkys in general, a little lovin’ from the other coast. 1st photo is a rock of powder black tar. This is what your dope looks like before moisture is introduced (I actually don’t know the specifics of the production process, but would love to hear it if someone has that info!). 2nd photo: I broke up the rock and huffed on it for a minute or so. You can see it start to resemble tar as it catches the moisture on my breath. Happy Hustlin’!", "2_Subreddit": "opiates"}]}]}]}