{"Diluted_Jack": [{"0_comments": [{"dwmtjic": [{"0_Comment Submission": "Last minute Easter trip to Delaware", "1_Text": "Yeah, I got a take-home for today and slept until 930... wore that baby's butt out when he woke up at midnight do to his usualy cry until someone touches him and puts a nipple in his mouth.    Ran him around the yard for 20 minutes.  Felt.  So.  Good.  Sleeping.", "2_Subreddit": "Methadone"}], "dwmtw22": [{"0_Comment Submission": "Remember that time Hillary Clinton leaked the 4 minute nuclear response time during the Presidential debates in front of 70 million viewers? Our President remembers.", "1_Text": "Four minutes seems as if it's over budget and running late.  Trump will have airborne 24/7 F-111A  and have that time lowered to 74 seconds.", "2_Subreddit": "The_Donald"}], "dwor7zv": [{"0_Comment Submission": "Drug test", "1_Text": "Yes.  Please tell me you're enrolled in clinic.  In Florida you can be on maintenance meds so long you're not on drug Court or drug offender probation (write letter to judge and ask for Methadone if it's drug offender probation)\n\nGood luck.", "2_Subreddit": "Methadone"}], "dwork03": [{"0_Comment Submission": "Drug test", "1_Text": "Yeah.  I wouldn't say shit, and I'd take your butt to the clinic right now and enroll.  The reason I hardly did jail time and no probation ever was I stuck to that rule of shut up and ask for lawyer.  When I got out of county and looked up the peeps I meshed with... These big bad drug movers (they were)  all sang like canaries in their probable cause report.   \n\nMy PCs are all about a paragraph of cop misspelling everything in his lazy write up and then it says:\n\n\"After defendant was read Rights he asked for the severity of charge.  Then he said I did no such thing and requested his attorney.  Taken to MCSOJAIL without incident.\"\n\nALWAYS shut up and just ask for lawyer once those cuffs go on.\n\nAnyhow, if you wobble under pressure or if your wife does.... Bad shit.  Protect your wife.", "2_Subreddit": "Methadone"}], "dworzyc": [{"0_Comment Submission": "My tum tum and methadone", "1_Text": "Maybe someone else knows if any  those interact?  Ant acids can help or hurt bioavailability... Tagament makes it feel stronger... I can't think of the other that lowers it?  Tums helps absorb easily.  But no joke Tagament makes your dose feel higher.  Science stuff.\n\nCan you think of any other meds or Life style choices you'd like to share?", "2_Subreddit": "Methadone"}], "dwp0p3g": [{"0_Comment Submission": "Drug test", "1_Text": "Yeah, it's State by State - I'm in Florida, where are you?  * All Probation Urine's go through the Big Urine Machine for Drug Court in my County.  Thing is freaking State of the Art... It's almost joke looking, like you're pissing on R2D2.  Even the easy peasy generic DMV 6-panel tests for Methadone...  So.... a 6 panel iCup had Methadone on it.  Methadone tests different than opiates, just how Ritalin isn't an amphetamine, Klonopin sometimes doesn't show, methadone doesn't show as opiate, Subs don't show as opiates... But yeah.. Even the 6 panel ones that DON'T test for benzos have Methadone.  \n\n*Per Google:  A 5-panel drug test will test for cocaine, amphetamines, opiates, PCP, and marijuana\n6 panel is that plus Methadone.", "2_Subreddit": "Methadone"}], "dwp0rve": [{"0_Comment Submission": "Drug test", "1_Text": "I'm just worried if you're PO is half smart and case load is under 1000 that he will put together wife on clinic and you, or snoop around - So, if you fail, and it's a tech violation - is this felony misd?", "2_Subreddit": "Methadone"}], "dwpbqdc": [{"0_Comment Submission": "Drug test", "1_Text": "My life on reddit is an artistic flare, Detective.  I'm just a reformed junkie losing weight and taking care of my son.  Insurance is back so I'm getting rides again.  I plead guilty last week for Dwls .. They dropped it to misdemeanor... time served.  Namaste.", "2_Subreddit": "Methadone"}], "dwqergy": [{"0_Comment Submission": "I still roll blunts for my wife...", "1_Text": "You can get one of those rollers at any Indian convenience store.  Or Ebay.  They sell 1.5 inch fit and for blunts they sell a larger one.  You could just buy her the roller and blunt wraps and tahdah.", "2_Subreddit": "OpiatesRecovery"}], "dwqkhq6": [{"0_Comment Submission": "What is your Reddit \"golden rule\"?", "1_Text": "NO **\"ALPHA CHAD KEYBOARD WARRIOR\"**\n\nMy vacation house forum half the page is filled with LOL FAKE.   You're a fag! Memes. Just... So much hate and negativity.\n\nReddit still has respectfully endings to name calling.\n\n\"Thank you for taking the time to understand my view point, as I yours... But you're still wrong.\"\n\nIt's.. Divinity mixed with civility dash of anarchism.", "2_Subreddit": "AskReddit"}], "dwqlw5r": [{"0_Comment Submission": "I still roll blunts for my wife...", "1_Text": "So was this a question or did you just wanna chat?\n\nHow long you be been married?  Year 3 for me.  Year 2 was rough.  Now we've got a routine now around each others strengths and weaknesses", "2_Subreddit": "OpiatesRecovery"}], "dwqqjib": [{"0_Comment Submission": "Please help! Methadone levels cut, counselor not taking responsibility or helping resolve my problem.", "1_Text": "Come on over to /r/Methadone next time - every single person is on MMT over there.\n\nEdit:  Did you lose takehomes?  Do you have takehomes?  I test positive for THC at my clinic and it's considered \"dirty\" but that just means I can't go up to the next phase.  I still get my weekend and Holidays.  What are you so angry about - that he did you wrong?  Sure.  Get the clinics fax number - you can use Faxzero.com to send faxes for free - write up a letter in word, or the online free version https://office.live.com/start/Word.aspx\n\nWrite letter explaining what happened, be anonymous, send letter to clinic and your states oversite board - and google around for like a State Director, etc.  Mass - Fax - edous.   Send four to four different \"people\" in one night, and since faxes are paper trails... shit will happen.\n\nYou're welcome.\n\n\nMy theory is be nice to your counselor but love from a distance:  I show up every 2 weeks at Wednesday 730am... he doesn't \"lock me out\" first, trusts me to show up.  \"All is good, I like you, where do I sign?\"  Got him a Christmas card, a Thank You card and when he was out a \"Get Well\" card.  \n\nHe's just the gate keeper to raising or lowering dose.  I'm sure his degree is in social work or therapy yet, over-loaded.  \n\nI think, you might - Talk to much.  Less is more - and some people, in social work, and therapy - have control complexes, and many exhibit Narcissism.  (check out the trending post about that right now)  \n\nFly under the radar.  If you're losing the battle with your counselor; go to the head nurse.  Go to the program director.  Etc.  \n\nBe a stealth bomber not a squadron of B2s.", "2_Subreddit": "opiates"}], "dwqrai1": [{"0_Comment Submission": "Please help! Methadone levels cut, counselor not taking responsibility or helping resolve my problem.", "1_Text": "701-540-6498  is the fax number for Community Medical Services.  I don't know if you're in Fargo or the other one, yet this number leads to same place.  Fax them.  Read my other post.  (remain anonymous) now google around and find your clinics fax number.  So fax that number, whom is the half govt/business for your clinics, and then fax clinic it's self; using Faxzero.com - remain anonymous.  Be precise and keep it to one page.  Good luck.    If you don't want to be anonymous more will get done yet might not be best option, unless you really feel 100% it's in the wrong.", "2_Subreddit": "opiates"}], "dwr0u9z": [{"0_Comment Submission": "Please help! Methadone levels cut, counselor not taking responsibility or helping resolve my problem.", "1_Text": "You didn't like the fax idea? No No No, you don't have Narcissism!  Therapists and Counselors have a significant amount of narcissistic traits - I just read that on /r/all in the adult children of narcissists sub.", "2_Subreddit": "opiates"}], "dwr1lbl": [{"0_Comment Submission": "\"You atheists like to shove your atheism down our throats.\"", "1_Text": "Those who know me know I am married to a devout tongue speaking pentecostal wife... \n\nYes, south - FL.\n\nThere is this structure for making money - House of Prayer, they have branches in many cities - they have a FL HQ in Orlando, and from there they have a USA HQ in Nebreska.  You can attend a \"college\" that ends with HOP \"ordaining\" you and giving you a plastic card that says Minister and a Piece of paper saying you can start your own flock under HOP's name.. etc.  \n\nSo my wife went, did the 4 years of college that involves.. living at and working at the Church... so basically they got 4 years of free labor and her rich family paid $6,000 a year.  It was filled with lots of rich girls who found God to escape a bad situation and then just children of avid believers.... and yeah... So, for years before we got married she would drive around town to all these churches all day preaching the word and speaking tongues over the homeless.  \n\nNow, at home, with me - She puts on sermons on Youtube and cries and tells me to watch.\n\nand then I explain to her how Easter rotates because of the First sunday after the first full moon after the spring equinox.  \n\n\"You're not LIVING with God, loving God - you are \"filled with facts of folly\" and not \"thinking with a God Conscious\" you think you're smart its just \"useless knowledge for God\" --  and she's seen him.  She spent days filled with the Holy Spirit walking in heaven.\n\nand it's very interesting.   I like to stir up her church friends with simple questions or Youtube videos of Messianic Jews in Israel... heh.\n\nBut yeah I always get accused of \"pushing anthiesm\" and in reality it's just when I'm in Public and suddenly 3 people start speaking tongues and praying near a Palm Reading Stand at the mall telling Satan to leave in Jesus name...  I make a beeline with my son to the food court.  \n\nWhere they all re-group and explain that \"Jesus already won\" and \"we know that\" so we really shouldn't fight these battles.\n\nThen someone will quote something else and they'll say \"You're right.\"  and then they all pray again that the palm reader ( 20 something cute girl that looks mysterious) finds Jesus.", "2_Subreddit": "atheism"}], "dwrdc2n": [{"0_Comment Submission": "Drug test", "1_Text": "Hey, thanks for educating me.  I appreciate it and you posting here.  Much love.", "2_Subreddit": "Methadone"}], "dwre5w0": [{"0_Comment Submission": "Kaitlin Olson gives 'It's Always Sunny' Season 13 update", "1_Text": "The Mick KILLS over AP Bio.\n\nAP Bio was Glenn getting stoned and thinking he could remake Community - with no character depth.", "2_Subreddit": "IASIP"}], "dwreux9": [{"0_Comment Submission": "Kaitlin Olson gives 'It's Always Sunny' Season 13 update", "1_Text": "OK.  So he's a Harvard Teacher of Philosophy :Discovering himself\" in Toledo, Ohio but really it's his dead Mom's house... (sorta like Joel in that he's rich, really smart, and sooo lazy he wears PJs to work... for the entire season)  All he wants to do is bring down his arch nemesis.. who went to Yale instead of Harvard or something and published a book called \"The Question is the Answer\"  So his name is Jack, like mine, and Jack is an alpha slacker who tells Pattan Oswald (doofus Principal) to get lost and \"You can't fire me.\"  There's a sassy black woman who wants doofus fired - and Jack always hangs the \"Harvard\" thing over peoples heads.\n\nHis students in Ap Bio have no textbook, he trhew them all away.  The class always wants to take notes, he throws deep quotes and philosophy quotes and then tries to bang a students mom... except the student is the fat one with red-hair and a hot skinny blonde  mom... of course.\n\nIt's just.... so middle America.  \n\nAlso, you know the \"Breakfast Club\" formula?  Nerd, Foreign, Jock, Nerd, Fat, hot girl, homely girl.. yada yada\n\nThey are so overly the top that you can look and see who the nerd is, who the stuck up girl is... who is the baby hewey fat one... the one black kid who is the \"slowly becoming cool\" and Jack is taking under his wing... Just freaking shoot me.\n\nWhile, Mick, well, she nails it.  The kids are a delight in being kids and have a dark side.  The once maid now semi maid side kick fits Mick perfectly... You know the depth of Jimmy etc etc etc..  AP Bio I can't even remember the names but can explain to you the character looks...  See how they messed up?\n\nAlso, I think it's NBC and not that late at night and it's just lacking... any sort of comedy punch.  It's a sunday binge watch, at best.", "2_Subreddit": "IASIP"}], "dwrf3u7": [{"0_Comment Submission": "What did I just hear?", "1_Text": "I never heard it before.  I just heard this also.  I'm re discovering music now that I'm not living at the bar or nodding out in the corner.\n\n[In hell I'll be in good company..](https://www.youtube.com/watch?v=B9FzVhw8_bY)", "2_Subreddit": "OpiatesRecovery"}], "dwsquxy": [{"0_Comment Submission": "I have watched The Office in its entirety at least three times. Today is the first time I've seen the episode \"The Sting\"", "1_Text": "I have a memory that is legit real of Jim Carrey being a boss in the office.  /shrugs   It's..... I see a commerical and it's like \"Even thought MICHAEL left the office.. The search for a new boss....\"  and it's like Jim Carrey wearing a hat going \"huckle huckle huckle\" and then Ray Ramona and then.... that's all I remember.", "2_Subreddit": "MandelaEffect"}], "dwsrwi9": [{"0_Comment Submission": "Drug Court", "1_Text": "I did a VICE interview about drug courts.  OK, Drug Court started in Florida due to the Cocaine Problem with Janet Reno who was Florida's AG ---    because they couldn't be throwing business men in jail/prison for cocaine or making them felons.  So they started a program around Cocaine abuse -   Drug Test 3-5 times a week first 6 months.  12 steps mandatory.  Court once a week.  A relapse = jail time.  (3, 7, 14, 30 days) it doesn't mean you get kicked out.  So I know people in NA meetings whom have been in drug court for 3 or 4 years... and it's aye yi yi, it obviously doesn't work.\n\nThey mostly all take white people... It's mostly all opiate/pill heads... mostly young.... and guess what?  You must get downtown, every weekday, for the first 6 months - to pee in cup, get acupuncture, do group - and guess what?  Counselors are underfunded and overworked so it's not real 1x1 therapy ... OOOO think of it this way - all the DMV like nonsense at the clinic, except it's the Judge -  so they tried to combine social work with the law.... and it sucks.\n\nSo at 730am with acupunture, and group, and they don't provide any drink or food or transportation, at 10 you can go - but on Tues and Thurs nights you must get back downtown to do another group and pee --- and you must attend at least 3 12 step meetings a week...\n\nand it is a giant failure.  So much so it eats at the souls of the Judges and people who work in it because they see first hand the damage they are doing forcing people to just \"stop\" drugs, keep them off all narcotics (even if you need Valium, even if you need codeine, even if you need Methadone, etc etc) yet they load you up on big pharma anyhow, just legal mess with your brain NAZI crap.\n\nNot a big fan.  I was in it for a few months, kept getting \"sanctioned\" with 90% of everyone else and spending a weekend or a week in jail, and then tah-dah\n\nof course you must pay for it.... So how the hell can you keep a job with those crazy hours to be downtown and how can you keep a job when they throw you in jail for drinking booze for 3 days?  \n\nIt's sad.", "2_Subreddit": "Methadone"}], "dwsscqz": [{"0_Comment Submission": "Jake, if you’re on this sub, just know you’re the absolute worst", "1_Text": "I know it says \"No Hookups\" and I'm not saying ANYTHING about Reddit or this Sub -- Yet, even my Uber drives all have a \"Colorado guy\" - my neighbor has a \"colorado\" guy --  He gets 3oz's sent to him via Fedex and the guy gets the cheap $100 oz's but it's good to us Southern FOlk so good we call that \"fire\" blah -- and yeah, I get what you're saying --\n\nThis guy warmed up to you for a period of months.. chatting every day - and then just burned your money?  \n\nI'm sorry, dear, I know the wheelchair thing sucks... \n\nand I am one of those people who don't lock my door because I believe in the ultimate good of people.\n\nYet, on the internet, there was no real soul bond with you.  No looking the eyes, or touching - he's never seen your spirit man.  \n\nIt's easy to get burned.  You're just text.  \"Block\" and done.  \n\nYou will be rewarded by 7 for everything evil took from you - You know this.  Keep focusing on love and focusing on the future you want to create - and it will come back.  \n\nNamaste.", "2_Subreddit": "trees"}], "dwssspz": [{"0_Comment Submission": "Drug Court", "1_Text": "It went from a 40% success rate to 12% success rate when they stopped allowing maintenance medicine when the opiate explosion first started back in 2004ish....   No MAT or Suboxone.\n\nEvery 100 people in Drug Court, 12 get to leave after 12-24 months (Like I said earlier, if you beg the Judge, you can stay in drug court and be sanctioned for relapsing all the time...)   The other 88 people went to Felony Drug Probation with once a month drug testing and no nonsense and that still keeps a felony off your record, except, if you mess up - it's really bad.\n\nSo, it's a double muligan with Drug Court.  \n\nYet, once again, I\"ve seen people do 2 years drug court, fail, get transfered to felony probation, do 11 months, fail, do 6 months jail... and then they remember this arrest was 4 years ago.  \n\nBut yes -\nIf you are the lucky 12% and follow all anti-evidence based treatment the charge is dropped.    Since 94% of all arrests turn into a guilty or no contest plea.", "2_Subreddit": "Methadone"}], "dwtaywh": [{"0_Comment Submission": "Drug Court", "1_Text": "Yes.  People must remember my experience is Florida.  That's where all big social change happens, from marijuana to gay marriage... Usually via ballot petition for constitutional amendment at the State.  Then a county can add to it.  Then a city.  Then zoning.\n\nSo the methadone clinic or drug court in one state is totally different... Yet when more and more good changes (social, good or bad has no place)  such as allowing maintenance meds, marriage, marijuana, etc.   Things change for the good usually with a snowball effect.\n\nThis is for felony drug charges and it's a PTI program, right?  Does your State make new people do ALL that nonsense like FL?", "2_Subreddit": "Methadone"}], "dwtbixb": [{"0_Comment Submission": "Kaitlin Olson gives 'It's Always Sunny' Season 13 update", "1_Text": "I sincerely laughed.  That SNL over the top magic is felt on AP Bio.  You can tell when it's Glenn, also, He's not EP, the other three famous off screen are the EPs... Glenn is just a producer... This show was built before pitched... Where as they went on Station after Station pitching The Mick to get a show.. NBC (whom oddly everyone is being brand loyal with SNL on NBC and Seth) made a show and needed a star.  Because Oswald will take anything.    They can't figure out how \"dark\" they want it to go... Tickle fingers and writing book was a great subplot that died.  Oh well.", "2_Subreddit": "IASIP"}]}], "1_submissions": [{"6t1uyk": [{"0_Title": "Does anyone else use NEMT (Insurance pays for Transportation) for getting to the Clinic? This (would have) saved me from getting arrested.", "1_Text": "Yeah, I got a take-home for today and slept until 930... wore that baby's butt out when he woke up at midnight do to his usualy cry until someone touches him and puts a nipple in his mouth.    Ran him around the yard for 20 minutes.  Felt.  So.  Good.  Sleeping.", "2_Subreddit": "Methadone"}], "7215bn": [{"0_Title": "Went to jail for that DWLS in-front of clinic -- Now at 40mg/daily and it feels much too powerful.", "1_Text": "Yeah, I got a take-home for today and slept until 930... wore that baby's butt out when he woke up at midnight do to his usualy cry until someone touches him and puts a nipple in his mouth.    Ran him around the yard for 20 minutes.  Felt.  So.  Good.  Sleeping.", "2_Subreddit": "Methadone"}], "76vowe": [{"0_Title": "My clinic is 98% white folks. Of those, 67% are female. Of those, the majority are age 18-39. (Non Profit Clinic releases data) -- Is this true for your clinic?", "1_Text": "Yeah, I got a take-home for today and slept until 930... wore that baby's butt out when he woke up at midnight do to his usualy cry until someone touches him and puts a nipple in his mouth.    Ran him around the yard for 20 minutes.  Felt.  So.  Good.  Sleeping.", "2_Subreddit": "Methadone"}], "76vrzz": [{"0_Title": "Operation \"Target MMT Patients\" Police and surveillance of Methadone Clinics.", "1_Text": "Yeah, I got a take-home for today and slept until 930... wore that baby's butt out when he woke up at midnight do to his usualy cry until someone touches him and puts a nipple in his mouth.    Ran him around the yard for 20 minutes.  Felt.  So.  Good.  Sleeping.", "2_Subreddit": "Methadone"}], "7b3nsn": [{"0_Title": "Write a Thank You letter to your clinic.", "1_Text": "Yeah, I got a take-home for today and slept until 930... wore that baby's butt out when he woke up at midnight do to his usualy cry until someone touches him and puts a nipple in his mouth.    Ran him around the yard for 20 minutes.  Felt.  So.  Good.  Sleeping.", "2_Subreddit": "Methadone"}], "7eam13": [{"0_Title": "ABC iTEAM called me regarding Methadone Hit Piece segment with legal team on phone...(links)... Good Job Reddit!", "1_Text": "Yeah, I got a take-home for today and slept until 930... wore that baby's butt out when he woke up at midnight do to his usualy cry until someone touches him and puts a nipple in his mouth.    Ran him around the yard for 20 minutes.  Felt.  So.  Good.  Sleeping.", "2_Subreddit": "Methadone"}], "7eap65": [{"0_Title": "ABC iTEAM called me regarding Methadone Hit Piece segment with legal team on phone...(links)... Good Job Reddit!", "1_Text": "Yeah, I got a take-home for today and slept until 930... wore that baby's butt out when he woke up at midnight do to his usualy cry until someone touches him and puts a nipple in his mouth.    Ran him around the yard for 20 minutes.  Felt.  So.  Good.  Sleeping.", "2_Subreddit": "OpiatesRecovery"}], "7n1cnp": [{"0_Title": "3 extra Take Homes for Christmas - 3 for NYE!", "1_Text": "Yeah, I got a take-home for today and slept until 930... wore that baby's butt out when he woke up at midnight do to his usualy cry until someone touches him and puts a nipple in his mouth.    Ran him around the yard for 20 minutes.  Felt.  So.  Good.  Sleeping.", "2_Subreddit": "Methadone"}], "7ryax4": [{"0_Title": "Applying Red Pill to finding a career - need money advice not sex advice.", "1_Text": "Yeah, I got a take-home for today and slept until 930... wore that baby's butt out when he woke up at midnight do to his usualy cry until someone touches him and puts a nipple in his mouth.    Ran him around the yard for 20 minutes.  Felt.  So.  Good.  Sleeping.", "2_Subreddit": "TheRedPill"}], "7tdmc2": [{"0_Title": "Umm - Why can't I get Travel Doses?", "1_Text": "Yeah, I got a take-home for today and slept until 930... wore that baby's butt out when he woke up at midnight do to his usualy cry until someone touches him and puts a nipple in his mouth.    Ran him around the yard for 20 minutes.  Felt.  So.  Good.  Sleeping.", "2_Subreddit": "Methadone"}], "7wnuwr": [{"0_Title": "Applying LOA with Christian beliefs", "1_Text": "Yeah, I got a take-home for today and slept until 930... wore that baby's butt out when he woke up at midnight do to his usualy cry until someone touches him and puts a nipple in his mouth.    Ran him around the yard for 20 minutes.  Felt.  So.  Good.  Sleeping.", "2_Subreddit": "lawofattraction"}], "80idpu": [{"0_Title": "For everyone using Methadone for opiate replacement therapy:", "1_Text": "Yeah, I got a take-home for today and slept until 930... wore that baby's butt out when he woke up at midnight do to his usualy cry until someone touches him and puts a nipple in his mouth.    Ran him around the yard for 20 minutes.  Felt.  So.  Good.  Sleeping.", "2_Subreddit": "OpiatesRecovery"}], "81b8fm": [{"0_Title": "Just saying THANK YOU to the boys from Canada.", "1_Text": "Yeah, I got a take-home for today and slept until 930... wore that baby's butt out when he woke up at midnight do to his usualy cry until someone touches him and puts a nipple in his mouth.    Ran him around the yard for 20 minutes.  Felt.  So.  Good.  Sleeping.", "2_Subreddit": "Videostream"}], "824hx9": [{"0_Title": "Thank you /r/Methadone for allowing me to become moderator. Let's get to work.", "1_Text": "Yeah, I got a take-home for today and slept until 930... wore that baby's butt out when he woke up at midnight do to his usualy cry until someone touches him and puts a nipple in his mouth.    Ran him around the yard for 20 minutes.  Felt.  So.  Good.  Sleeping.", "2_Subreddit": "Methadone"}], "82i581": [{"0_Title": "Please welcome /u/beefbiber and /u/YeastySnatch as another wave in the circle of reddit -- New! blood comes to Moderate and Update /r/Methadone and make Methadone first again.", "1_Text": "Yeah, I got a take-home for today and slept until 930... wore that baby's butt out when he woke up at midnight do to his usualy cry until someone touches him and puts a nipple in his mouth.    Ran him around the yard for 20 minutes.  Felt.  So.  Good.  Sleeping.", "2_Subreddit": "Methadone"}], "82jj59": [{"0_Title": "Law of Attraction. Thoughts Become Things. What you think about you bring about...", "1_Text": "Yeah, I got a take-home for today and slept until 930... wore that baby's butt out when he woke up at midnight do to his usualy cry until someone touches him and puts a nipple in his mouth.    Ran him around the yard for 20 minutes.  Felt.  So.  Good.  Sleeping.", "2_Subreddit": "lawofattraction"}], "82zzmi": [{"0_Title": "A review of the cardiotoxicity of Methadone", "1_Text": "Yeah, I got a take-home for today and slept until 930... wore that baby's butt out when he woke up at midnight do to his usualy cry until someone touches him and puts a nipple in his mouth.    Ran him around the yard for 20 minutes.  Felt.  So.  Good.  Sleeping.", "2_Subreddit": "OpiatesRecovery"}], "83c3pb": [{"0_Title": "Let me know when in manic episode.", "1_Text": "Yeah, I got a take-home for today and slept until 930... wore that baby's butt out when he woke up at midnight do to his usualy cry until someone touches him and puts a nipple in his mouth.    Ran him around the yard for 20 minutes.  Felt.  So.  Good.  Sleeping.", "2_Subreddit": "u_Diluted_Jack"}], "84fk7z": [{"0_Title": "New Moderator learning how to edit flair, banner, icon.", "1_Text": "Yeah, I got a take-home for today and slept until 930... wore that baby's butt out when he woke up at midnight do to his usualy cry until someone touches him and puts a nipple in his mouth.    Ran him around the yard for 20 minutes.  Felt.  So.  Good.  Sleeping.", "2_Subreddit": "u_Diluted_Jack"}], "85nu5k": [{"0_Title": "THREAD DISCUSSION: Trump's New War On Opiates. Death penalty for opiate \"Kingpins\"", "1_Text": "Yeah, I got a take-home for today and slept until 930... wore that baby's butt out when he woke up at midnight do to his usualy cry until someone touches him and puts a nipple in his mouth.    Ran him around the yard for 20 minutes.  Felt.  So.  Good.  Sleeping.", "2_Subreddit": "u_Diluted_Jack"}], "85nvqd": [{"0_Title": "SUB DISCUSSION: How do you feel about Trump's New opiate Kingpins Death Penalty Bill: War on Opiates", "1_Text": "Yeah, I got a take-home for today and slept until 930... wore that baby's butt out when he woke up at midnight do to his usualy cry until someone touches him and puts a nipple in his mouth.    Ran him around the yard for 20 minutes.  Felt.  So.  Good.  Sleeping.", "2_Subreddit": "Methadone"}], "862kvm": [{"0_Title": "It's official: Lost my insurance because I'm making money again. Yet, bright side:", "1_Text": "Yeah, I got a take-home for today and slept until 930... wore that baby's butt out when he woke up at midnight do to his usualy cry until someone touches him and puts a nipple in his mouth.    Ran him around the yard for 20 minutes.  Felt.  So.  Good.  Sleeping.", "2_Subreddit": "Methadone"}], "86b0fq": [{"0_Title": "Come on over to /r/Methadone if Mdone is/was apart of your story!", "1_Text": "Yeah, I got a take-home for today and slept until 930... wore that baby's butt out when he woke up at midnight do to his usualy cry until someone touches him and puts a nipple in his mouth.    Ran him around the yard for 20 minutes.  Felt.  So.  Good.  Sleeping.", "2_Subreddit": "opiates"}], "89jmbp": [{"0_Title": "What did I just hear?", "1_Text": "Yeah, I got a take-home for today and slept until 930... wore that baby's butt out when he woke up at midnight do to his usualy cry until someone touches him and puts a nipple in his mouth.    Ran him around the yard for 20 minutes.  Felt.  So.  Good.  Sleeping.", "2_Subreddit": "OpiatesRecovery"}], "89jr5z": [{"0_Title": "The LOA works. Just think it, believe it - AND - WALK IT OUT. my life is amazing. thank you.", "1_Text": "Yeah, I got a take-home for today and slept until 930... wore that baby's butt out when he woke up at midnight do to his usualy cry until someone touches him and puts a nipple in his mouth.    Ran him around the yard for 20 minutes.  Felt.  So.  Good.  Sleeping.", "2_Subreddit": "lawofattraction"}]}]}]}