{"JourneyOfFools": [{"0_comments": [{"dud3rbk": [{"0_Comment Submission": "Delaware Teachers 1973", "1_Text": "No he just made a bunch of threats over the course of a year leading up to this shooting.", "2_Subreddit": "OldSchoolCool"}], "dufad0f": [{"0_Comment Submission": "Delaware Teachers 1973", "1_Text": "I agree with most of what you've said and will add we're really screwed right now with regards to turning this mess around. All people care about is the propaganda pushing media and we end up with what seems like 75% or more of the population brainwashed and only concerned with what they're told to be concerned about. This leads to a population of completely uninformed drones just repeating nonsense and the real issues never even get talked about. There's all sorts of logical solutions to all the issues we face but when only a few people know or even care about them we're basically screwed. I've tried numerous times to type out long comments full of facts trying to explain to other misinformed Redditors problems and solutions to some of our bigger issues. The responses are always the same, they either can't go start researching things on thier own and expect me to link articles for everything I've said. Or they straight up call me a idiot for thinking anything different than them. I've never once swayed someone, I've only found new people to argue with.  As long as we continue down this path nothing will Improve.", "2_Subreddit": "OldSchoolCool"}], "dufapro": [{"0_Comment Submission": "Delaware Teachers 1973", "1_Text": "It doesn't fit the population's brainwashed mindset that somehow removing more rights from legal gun owners will fix everything. You honestly cannot have a intelligent debate with anyone that still believes the mainstream media isn't doing anything but pushing propaganda. If they don't fugue that out on thier own they're never going to be swayed by one of us.", "2_Subreddit": "OldSchoolCool"}], "duffge5": [{"0_Comment Submission": "Guns or Life? Man silently protesting in front of the Lincoln Memorial today.", "1_Text": "Police officers cannot be compared to citizens carrying a concealed pistol for many reasons. There already are thousands if not millions of people legally carrying pistols in the USA every day. Everyday you are most likely in public with more than one of these individuals and never know it.  They had to go through training and a extensive FBI background check in order to receive thier certificate. They're only allowed to draw thier weapon under life and death situations. How often have you been in that type of situation, do you even know one person that had been in that type of situation?  I don't know one person who could have legally drawn a weapon because as civilians we avoid conflict and it would be incredibly rare to be in that kind of situation. Police deal with dangerous people cor a living, trying to  compared them to civilians is ludicrous. Not to mention police are trained to use force and threat of bodily harm as a way of having the upperhand when dealing with potential violent individuals. The law allows them to do this were it's illegal for a civilian to do three same thing.", "2_Subreddit": "pics"}], "duffp4d": [{"0_Comment Submission": "Guns or Life? Man silently protesting in front of the Lincoln Memorial today.", "1_Text": "I'm sorry but it's not wise to engage in these types of conversations without the proper education. You're just muddying the waters at best and reinforcing false facts at worse. All that I know about certain subjects comes from interest in the knowledge of the subject followed by research. People throwing around false facts is a huge problem, please don't make it worse by getting drunk and tossing around misinformation.", "2_Subreddit": "pics"}], "duffzw3": [{"0_Comment Submission": "Guns or Life? Man silently protesting in front of the Lincoln Memorial today.", "1_Text": "You're incapable of doing anything but repeating the sensationalized propaganda you've sucked up from the media. No amount of facts or misunderstandings on your part will change your mind, you won't accept being wrong.", "2_Subreddit": "pics"}], "dugy23y": [{"0_Comment Submission": "Guns or Life? Man silently protesting in front of the Lincoln Memorial today.", "1_Text": "Most states require training, I don't think that the average person should be trusted with concealed carry with out training.", "2_Subreddit": "pics"}], "dugyvzp": [{"0_Comment Submission": "South Park - Mr.Garrison's Evolution Theory", "1_Text": "Makes about as much sense as the official theory of evolution.", "2_Subreddit": "videos"}], "duh0955": [{"0_Comment Submission": "Bojack Horseman on gun control", "1_Text": "You'd have to be mentally handicapped to think owning a firearm doesn't decreases your risk of sexual assault. Thats what makes firearms so great, they make everyone equal, just because you're not as strong as your attacker you can still come out unharmed.", "2_Subreddit": "television"}], "duh0lz6": [{"0_Comment Submission": "Bojack Horseman on gun control", "1_Text": "Not at all, tazers don't work nearly as effective as people think they do. Go watch a bunch of videos of police trying to use them and they don't hook through clothing. Pepper spray is hard to get in the right spot and only works if you're very close to your attacker most likely affecting the person spraying it. It really annoys me how much people want guns to not be the best option for self defense, get over it they have been around for hundreds of years and equalize us.", "2_Subreddit": "television"}], "duh0szk": [{"0_Comment Submission": "Bojack Horseman on gun control", "1_Text": "You're brainwashed by anti gun media, they use three suicide statistics to make guns look like they will just shoot you while sitting on a table. A educated non suicidal person has nothing to fear from firearms.", "2_Subreddit": "television"}], "dun7pn8": [{"0_Comment Submission": "School shooting suspect could lose public defender after reports of $800K inheritance", "1_Text": "That's a really negative assumption, how could you possibly have met enough (white American guy's) of all ages to know they're all messed up. It sounds like you're watching way to much sensationalized news and only seeing the awfully negative things they shove down your throat all day. The most simple and healthy advice I can give anyone would be to stop watching the news. I gave up cable television years ago and it made me a lot more positive and open minded. I've lived in the USA my whole life and I've met all sorts of races and there are good and bad people of every color and every religion. Human's are all capable of being messed up regardless where they live our how they look.   Also judging someone based on how they're at the one point in their life and thinking they're always like that isn't fair either. People change, they mature and can end up turning out completly different than you'd assume looking at just one phase of thier life or even one negative action.", "2_Subreddit": "news"}], "dun9188": [{"0_Comment Submission": "School shooting suspect could lose public defender after reports of $800K inheritance", "1_Text": "The massive problem is that even the most advanced doctors have no clue why these illnesses happen and certain medications help some people yet make others 1000x worse even though they've been diagnosed with the same mental illness. Every year we find out more reasons to not just treat everyone dealing with certain mental difficulties the same way. Physical illnesses that are incredibly difficult to detect on labs have been found to have severe psychological side effects. When those individuals are just labled mentally ill and thrown into that system horrible things happen. Often they commit suicide if they're not treated for thier physical illness.  Treating mental illness is beyond complicated, we don't understand enough about the brain or why certain things happen to help some people. Furthermore lots of people end up seriously declining when they're forced into mental institutions. Life is hard, there is no magic solution you can force a seemingly mentally ill person to do that's going to just fix them.  The most important thing we can do is be loving and understanding even though we cannot relate to what they're feeling. Be patient and listen to how they feel, don't just give them a cold shoulder because we believe they need to do things differently.    \n\nLook what happend back in the early to mid 1900's when massive institutions were common. People were forced away for thier whole lives because of illnesses we'd never think of sending them away for now. The barbaric lobotomy was invented and used frequently on people who could have lived a decent life at home if thier family was capable of accepting that they were different. We've come a long way in regards to humanely dealing with the mentally ill and mentally disabled. The biggest progress had been in accepting people for who they're and letting them live a decent life as long as they're not threatening physical harm to anyone. \n\n\nTrying to constantly tell someone who's struggling with mental health issues that they just need to take medications or go and be committed for the rest of thier life isn't helping them at all. All that's accomplishing is making that person feel completely alone and misunderstood. If someone is making threats to harm others and or harming themselves than they need to be committed for as long as the doctors feel appropriated. But those actions often don't mean that they will be there for that long. The goal is not to just lock somone up if they're found not to be a danger to themselves or others, it could only be a few weeks from what I've seen others go through. I dated a really great girl for a free years who was diagnosed with bi polar disorder. The experience really opened my eyes to all the issues I've  expressed and since than it's given me a interest to educate myself on the subject. I've observed these issues time and time again when looking at others dealing with their family's and a limited medical system.", "2_Subreddit": "news"}], "dun9bft": [{"0_Comment Submission": "School shooting suspect could lose public defender after reports of $800K inheritance", "1_Text": "If he had been to a mental health facility and diagnosed with self harm characteristics along with urges to harm others he should have never been allowed to buy a firearm under the current laws. Suicidal attempts that are reported will also get your right to own a firearm taken away. Any owned firearms are to be taken awsy and you're supposed to be flagged when you send in your background check if you're trying to purchase a new one. These laws exist and I've read news story's of people hang the sheriff's show up at thier home not even weeks after they get out of the psychological ward for breakdowns. If he really did make these threats and the authority's didn't follow through with the law than they are reponsible to some degree. This also shows that we have the proper laws on the books but we have a completely flawed system that is unreliable.", "2_Subreddit": "news"}], "dur2jaf": [{"0_Comment Submission": "Florida school shooting: Sheriff got 18 calls about Nikolas Cruz's violence, threats, guns", "1_Text": "Just that incident if reported correctly would have automatically revoked his right to own firearms or even have them in the house he's living in regardless if they're owned by a legal relative. He also would have been denied a pass on the mandatory background check no more than a week after his suicide attempt added self harm were reported probably three sheriff would have been sent too his residence to retrieve all firearms in the home.  But the sheriff completely shit the bed and has blood on his hands now. He should be legally punished too make a example to the nation's law enforcement that they can't pick and choose what they will follow through with in regards to these clearly unhinged violent individuals.", "2_Subreddit": "news"}], "dur2ris": [{"0_Comment Submission": "Florida school shooting: Sheriff got 18 calls about Nikolas Cruz's violence, threats, guns", "1_Text": "Just one of these incidents if reported correctly would have automatically revoked his right to own firearms or even have them in the house he's living in regardless if they're owned by a legal relative. He also would have been denied a pass on the mandatory background check no more than a week after his suicide attempt added self harm were reported probably three sheriff would have been sent too his residence to retrieve all firearms in the home.  But the sheriff completely shit the bed and has blood on his hands now. He should be legally punished too make a example to the nation's law enforcement that they can't pick and choose what they will follow through with in regards to these clearly unhinged violent individuals.", "2_Subreddit": "news"}], "dusjcnx": [{"0_Comment Submission": "Teen accused of shoplifting. Security finds rotting dead baby in bag.", "1_Text": "If it was a guy who had done this he'd have been locked up for life and I doubt you would have this same sympathy. Seeing far too much pussy pass related comments trying to give this monster every excuse they cam think up and it makes my sick.", "2_Subreddit": "WTF"}], "dusjmyi": [{"0_Comment Submission": "Ashley Smith - Out of Control (2010): a mentally ill 15-year-old throws crabapples at a mailman, and what starts as a one-month sentence stretches to nearly four years in solitary confinement. She kills herself while guards are repeatedly told to not enter her cell if she's still breathing. [41:21]", "1_Text": "This is why people will try andhide mental illness instead of seeking help.  This story is just one of the millions of unbelievable injustices that occur in USA psychological institutions every year. They're really not helping many people, you just have to dig around a but as can be informed enough too understand how huge the issue is", "2_Subreddit": "Documentaries"}], "dv0fi74": [{"0_Comment Submission": "I'm an ex white supremacist and klansman. AMA", "1_Text": "Just the fact that you were able to leave and stay away shows huge change. I found one thing to be able to completely change my negative traits when no amountof will power could do it. I didn't have racist issues but I held anger towards anyone I felt had made my life inconvenient. I could spend hours throwing absolute rage fest towards family members friends for very minor issues and it ate me alive. The only thing that changed me and it changed me 100% was praying to Jesus and asking for my heart and mind to be changed. Everytime I got angry I asked for forgiveness and for peace from being angry and negative and it didn't take that long before I completly stopped dealing with anger. It's incredible how he made me into a peaceful postive person when I used to be furious at least once a week for the better part of a day.", "2_Subreddit": "IAmA"}], "dv0gkrz": [{"0_Comment Submission": "I'm an ex white supremacist and klansman. AMA", "1_Text": "You couldn't be more right and you did a great job of explaining Christians views towards forgiveness. I don't feel like you were negative towards his friend who he prays with, it's very unfortunate that others have been so negative towards what you've said. I myself have also changed a great deal once I started forgiving others along with praying for my own negative front to be changed. It's so sad that the general Reddit population is so against Christianity and the simple ways Christ would like us to deal with our negative emotions. I cannot imagine living like that again, it was so easy to be eaten up with anger and hatred towards things I disagreed with, Satan will make our lives terribly unpleasant if we're not praying for Christ to stop him and for Christ to make everything right and to keep things on track to be the best person we can.  It didn't  matter how much I tried to change myself on my own I only failed, and in the endid's actually easy top see how much beret things are when wet follow Jesus's teaching and just give him all our troubles.", "2_Subreddit": "IAmA"}], "dv0m5wc": [{"0_Comment Submission": "I'm an ex white supremacist and klansman. AMA", "1_Text": "Christianity has it's foundation on forgiveness to anyone who wants forgiveness and a change of heart regardless how terrible the sin they committed. Jesus pleaded that God his  father  forgive the Roman soldiers who taunted and tourtured him the day of his crucifixion. My favorite act of forgiveness and love of God to change every mans heart happend with Saul. Saul was one of Christianity's worst enemy's in it's early days. He went from town to town gathering as many Christians as he could to put them to death or prison if they were lucky. He was Jewish and did not believe that Jesus had been the true son of God who had been professed in the old testament. One day as Saul and his group of helpers were traveling Jesus spoke to him from Heavan. The whole group heard Jesus say  “Saul, Saul, why do you persecute me?” Saul asked \"who are you, Lord?\" Jesus responded “I am Jesus, whomyou are persecuting,” he replied. 6 “Now get up and go into the city, and you will be told what you must do.”  Saul was blind for three days after this incident and his men led him into the city where a priest whom Jesus had chosen and instructed of Sauls transformation and his importance as a servant of God was waiting and praying. When the priest put his hands on Sauls head scales fell from his eyes and he was able to see again. Saul ened up becoming one of the most influential followers and teachers  of Jesus in all the days of Christianity. His transformation was seen by many of Jews as proof Jesus was the true son of God and they became followers and ultimately saved. \n\nBasically the whole premise of the new testament is that we're fallen and sinful because of the original sin. We were given all sorts of rules to live by in the old testament that if followed were supposed to please God and make us worthy of his presence and worthy of the gift of eternal Heaven. Not one man couldd be worthy of these holy gifts no matter how hard they tried, the sinfulness that was within all of us made us incapable of getting even close to deseveving of the the presence of God based on our works. God than decided he would send Jesus his only son to teach of the new way and ultimately die on the cross only to be resurrected for all the sins mankind would commit so that by our belief in Jesus we would be able to go to Heaven. Ultimately it's the best gift we have ever been given, belive in Jesus and want to be the best people we can be through prayer, forgivness and faith and we are given the ultimate gift of eternal life in the presamce of God.   \n\nReading through this section of comments was really sad, I pray that as many of you as possible are touched by Jesus's love and have your hearts changed in the way he wants all of us to be. Life is so much better once you can forgive those who we feel have wronged us, regardless how bad they harmed us we should want them to recive forgiveness and the belief and faith in Jesus to also go to heaven.", "2_Subreddit": "IAmA"}], "dv2736m": [{"0_Comment Submission": "I gave up alcohol when my daughter turned 1 (left). I'm 5 years sober today.", "1_Text": "You look so much better its amazing what heavy drinking can do, but even more amazing how much healing the body can do in one year.", "2_Subreddit": "pics"}], "dvqaowf": [{"0_Comment Submission": "Police officers of Reddit, was there a time you wanted to let someone off the hook but couldn't, and if so, what happened?", "1_Text": "I mean if you look at the majority of the comments of people that got let off of a decent ticket they're young women. I'd almost garentee they're also white but I could only verify they were young women based on thier Reddit profile.  Some stereotypes are true regardless if you want them to be or not, but white people especially young white women get a serious leniency when dealing with the police. Just as black men get there worst of the treatment, that's not to say that there aren't exceptions but most of the time that's reality.", "2_Subreddit": "AskReddit"}], "dvykl3r": [{"0_Comment Submission": "Uber Suspends Driverless-Car Program After Pedestrian Is Killed", "1_Text": "Retb14- exactly, how many times a day do human divers avoid collisions in similar circumstances. I'd venture to say many, I know that just this year at least three deer and one giant bull elk ran right out in front of me while driving and I had no problem avoiding a collision. I honestly don't think the technology is anywhere near as advanced as a human driver whose paying attention. But people want so desperately to endorse this technology and go right ahead and started to blame this very unfortunate women whose now dead. Do they understand how many children who don't yet understand what it's liked to drive put themselves in dangerous situations to grab a ball while playing with freinds?  If this technology was adopted as it sits there would be many more accidents and who would even be at fault? Are we going to charge a car with manslaughter? Humans when fully paying attention are way more advanced than any technology that's been invented", "2_Subreddit": "worldnews"}], "dwhba22": [{"0_Comment Submission": "I got pulled over today..", "1_Text": "Because the legal limit is a joke for a lot of people me being one of them. It used to be much higher and people who couldn't handle their liqure ruined it for people who could.", "2_Subreddit": "opiates"}]}], "1_submissions": [{"578wmc": [{"0_Title": "Decade of sub usage now taking a vacation", "1_Text": "No he just made a bunch of threats over the course of a year leading up to this shooting.", "2_Subreddit": "opiates"}], "6j7gum": [{"0_Title": "Bup to morphine", "1_Text": "No he just made a bunch of threats over the course of a year leading up to this shooting.", "2_Subreddit": "opiates"}], "6keer1": [{"0_Title": "Suboxone nearly killed me", "1_Text": "No he just made a bunch of threats over the course of a year leading up to this shooting.", "2_Subreddit": "suboxone"}], "6keg7z": [{"0_Title": "Suboxone nearly killed me", "1_Text": "No he just made a bunch of threats over the course of a year leading up to this shooting.", "2_Subreddit": "OpiatesRecovery"}], "6wwnia": [{"0_Title": "Burned hard by a so called friend", "1_Text": "No he just made a bunch of threats over the course of a year leading up to this shooting.", "2_Subreddit": "opiates"}]}]}]}