{"bouncybear11563": [{"0_comments": [{"dv67d3u": [{"0_Comment Submission": "Carfentenil help?", "1_Text": "I've done carfentanil numerous times and I haven't experienced that though it did shock me the first time with how strong it was. The high was like 1 hour max tbh. I think they're probably fucking with your shit or like the dude said, low blood pressure.", "2_Subreddit": "opiates"}], "dv9wbxl": [{"0_Comment Submission": "Carfentenil help?", "1_Text": "Nah I am pretty positive. It's been about a decade of this shit. And I've done ketamine many, many times lol doesn't effect me for more than 30-45 mins. Bit of course different things effect people differently right? Why don't u just go in the next town over? ;)", "2_Subreddit": "opiates"}], "dw54r6z": [{"0_Comment Submission": "My first papaver somniferum sprout!", "1_Text": "I had a 20ftx40ft gardening spot full of them and the geese/groundhogs/bears DESTROYED it all. My dog along with them. 😭😭😭", "2_Subreddit": "opiates"}], "dw55awf": [{"0_Comment Submission": "Question on price of heroin", "1_Text": "$80-100 in the cities of PA. Next state over is anywhere from $25-$50.", "2_Subreddit": "opiates"}], "dw575ly": [{"0_Comment Submission": "OD", "1_Text": "When you stop breathing and your lips turn blue and lose consciousness.. 2 months ago my boyfriend has to use 4 narcan shots and the paramedics used two after him. They did cpr for 12 minutes before I awoke. I have damaged eyesight and hearing from losing oxygen for too long... Be careful and please make have narcan on hand if u can get it!", "2_Subreddit": "opiates"}], "dwikdir": [{"0_Comment Submission": "The worst withdrawal symptom", "1_Text": "Heart palpitations/anxiety and dry retching.", "2_Subreddit": "opiates"}], "dwjfilq": [{"0_Comment Submission": "OD", "1_Text": "Thanks very much :) strangely enough I don't know if because my body was put under so much stress from the narcan or coincidence but it induced my period when I had it just a week and a half prior. Along with a bloody nose and vomiting lol.", "2_Subreddit": "opiates"}]}], "1_submissions": [{}]}]}