{"captain3641": [{"0_comments": [{"dwrxcad": [{"0_Comment Submission": "On what part of my wife would you like to put your cum? Just tell me", "1_Text": "I would love to cum all over her face after pounding that gorgeous pussy!", "2_Subreddit": "amateurcumsluts"}], "dwrzgbj": [{"0_Comment Submission": "Shitpost? Happy Monday! I want to know everyone's opinions on the ER oxy 20s. Thumbs up on the duration, thumbs down on the ROA available. What if one were to just boof a while one? Dumb question?", "1_Text": "Nice stash!!!", "2_Subreddit": "opiates"}], "dwrzj1h": [{"0_Comment Submission": "Morgan Rodriguez - ka-BLAM!", "1_Text": "Damn dude! You got a permit for that thing?", "2_Subreddit": "FacialFun"}], "dws0a7v": [{"0_Comment Submission": "[18F] Do you think I have what it take to work in the adult industry?", "1_Text": "If you want to practice before you start please let me know. I would be happy to help!!", "2_Subreddit": "gonewild"}], "dws0q89": [{"0_Comment Submission": "Another angle [f]or your pleasure", "1_Text": "Well damn! Amazing ass!!!", "2_Subreddit": "gonewild"}], "dws0u73": [{"0_Comment Submission": "Feeling extra naughty, any requests? (F)", "1_Text": "Yes, please come over to my place right now.", "2_Subreddit": "gonewild"}], "dws1i76": [{"0_Comment Submission": "What would you do with these little pink panties? [F28]", "1_Text": "Keep them as a trophy. Gorgeous body, sexy AF!!", "2_Subreddit": "bodyperfection"}], "dws1xhl": [{"0_Comment Submission": "[F]ill my mouth then cover my tits (dick pics welcome 😉)", "1_Text": "Damn, my kind of girl!", "2_Subreddit": "gonewild"}], "dws264l": [{"0_Comment Submission": "What celebrity death will hit you the hardest?", "1_Text": "I'm a huge music fan, so for me it would be Dave Matthews. That man is like the brother I never had.", "2_Subreddit": "AskReddit"}], "dwtuhg2": [{"0_Comment Submission": "I know what my problem is-- I want to use heroin forever.", "1_Text": "Thank you for the kind words, I do appreciate it. Believe me, I have tried. I tried to get back into the activities that I used to be very passionate about, but the spark is just gone. The drugs completely numbed me to anything I ever loved, and anything that ever made me happy. I'm trying. I do go to therapy once a week, which is ok. Honestly I don't know what to do. My brain just isn't happy anymore. All the chemicals the brain releases to make you feel happy and ok with life seem to be completely depleted. Sad, depressed, and numb is pretty much all I ever feel. \n\nThanks again for the positive vibes. You didn't have to do that, but you did. That is so much more than what I get from the people that are important to me. The people I used to consider my friends and family. They all just disowned me.", "2_Subreddit": "opiates"}], "dwtv76o": [{"0_Comment Submission": "You can’t escape me today. 2 posts in one day. (F)", "1_Text": "Are you kidding? You can keep me captive if you want. Trust me, I will never try to escape!", "2_Subreddit": "gonewild"}], "dwtwro4": [{"0_Comment Submission": "And they say they are hard to get .. 🧐", "1_Text": "Aww come on, this is just not fair!", "2_Subreddit": "opiates"}], "dwtxh51": [{"0_Comment Submission": "And they say they are hard to get .. 🧐", "1_Text": "Not if you're disciplined. I made 50 last 30 days once. It's hard as shit, but it's possible. I'm just sayin.", "2_Subreddit": "opiates"}], "dwtxmg7": [{"0_Comment Submission": "And they say they are hard to get .. 🧐", "1_Text": "Idk, but I'd love to take that challenge. PM me bro", "2_Subreddit": "opiates"}], "dwtxorf": [{"0_Comment Submission": "And they say they are hard to get .. 🧐", "1_Text": "My god, you are killing me with this!! Lol So fucking jelly!!", "2_Subreddit": "opiates"}], "dwtyj4s": [{"0_Comment Submission": "And they say they are hard to get .. 🧐", "1_Text": "No, I know. Lol Of course not, they never are. Usually it's the exact opposite. Hell of a haul though!", "2_Subreddit": "opiates"}], "dwtyncj": [{"0_Comment Submission": "And they say they are hard to get .. 🧐", "1_Text": "Chill, I hear you. We're just joking around. We do that from time to time.", "2_Subreddit": "opiates"}], "dwuam7x": [{"0_Comment Submission": "And they say they are hard to get .. 🧐", "1_Text": "Yeah, that totally sucks! You do what you have to do, right? I don't know how I did it, but I was always able to keep it within reason. Of course you binge sometimes, it's unavoidable. But somehow for the most part I was always able to stay very disciplined. I tried to look at it like this: I'd rather have a little stretched out for a longer period of time, because I would at least have something just about every day, than do a lot over a short period of time. I don't know, I was just always good at stretching it out. I didn't have a choice really. It wasn't my prescription and it was my only source. He was a good friend though, and he took care of me as much as he could every month. I know it's not common, but some people can do it.", "2_Subreddit": "opiates"}], "dww0fps": [{"0_Comment Submission": "I know what my problem is-- I want to use heroin forever.", "1_Text": "Thank you so much for this!! Awesome stuff!!", "2_Subreddit": "opiates"}], "dww0xln": [{"0_Comment Submission": "Can we just take a second to appreciate how much of a human trash bag Chris Brown is, and what he actually did to Rihanna?", "1_Text": "He should be fucking castrated, at the very least. What a colossal prick!! I always hated him, this just exacerbates it to rage. What a cowardly piece of shit!", "2_Subreddit": "pics"}], "dww15yw": [{"0_Comment Submission": "What a cumback! ;)", "1_Text": "That's what she got it for, right?", "2_Subreddit": "amateurcumsluts"}], "dww1gyr": [{"0_Comment Submission": "Nothing like sealed bottles to start my day.", "1_Text": "Holy shit man! You never cease to amaze!", "2_Subreddit": "opiates"}], "dww21ro": [{"0_Comment Submission": "YouTube star Logan Paul kicked out of Yosemite", "1_Text": "Not even mildly, just plain terrifying.", "2_Subreddit": "news"}], "dwxuprh": [{"0_Comment Submission": "I didn't have time to make a pretty pic or message but beauty is in the eye of the beholder", "1_Text": "Abstract pill art. I love it!!", "2_Subreddit": "opiates"}], "dwxv0hb": [{"0_Comment Submission": "Underneath the baggy jumper (f)", "1_Text": "...is one smoking hot body!!!", "2_Subreddit": "gonewild"}]}], "1_submissions": [{}]}]}