{"Hardcorish": [{"0_comments": [{"dvqe95x": [{"0_Comment Submission": "BBC 3 documentary following our Dota 2 team travelling... Not kidding", "1_Text": "Dota 2 Documentary (Gone Sexual)", "2_Subreddit": "DotA2"}], "dvqh98c": [{"0_Comment Submission": "The 307th Weekly Stupid Questions Thread", "1_Text": "What is the white symbol that is seen on Witch Doctor's immortal coconut tree item?  The item is called Bonkers The Mad but I can't tell what the symbol on the tree is.", "2_Subreddit": "DotA2"}], "dvw2y56": [{"0_Comment Submission": "Girls of reddit who have rejected people, what’s the worst way someone has taken it?", "1_Text": "There are lots of us out there that are self-taught.  I actually tried typing the \"proper\" way like they teach in school and I never got the hang of it and figured I never really needed to since I already knew how to type fast.", "2_Subreddit": "AskReddit"}], "dvxq06b": [{"0_Comment Submission": "TIL In the USA if you are delayed by an airline by more than 4 hours for actions within their control (overbooking) you are entitled to 4x the face vale of the ticket capped at $1300.", "1_Text": "We need updates on this in another day or three!  I hope it all works out for you even if this particular offer doesn't.", "2_Subreddit": "todayilearned"}], "dvxre33": [{"0_Comment Submission": "TIL In the USA if you are delayed by an airline by more than 4 hours for actions within their control (overbooking) you are entitled to 4x the face vale of the ticket capped at $1300.", "1_Text": "What would be an example situation where they can't?", "2_Subreddit": "todayilearned"}], "dvxrttp": [{"0_Comment Submission": "TIL In the USA if you are delayed by an airline by more than 4 hours for actions within their control (overbooking) you are entitled to 4x the face vale of the ticket capped at $1300.", "1_Text": "Haha, I was genuinely curious but if you can't honestly answer I'm ok with that too.", "2_Subreddit": "todayilearned"}], "dw5dhc6": [{"0_Comment Submission": "The International 2018 Collector's Cache Call to Arms", "1_Text": "My guess is it'll look like an underground cave we'll see stalagmites replace trees, like if you use quelling blade or tango it'll cut down a stalagmite, and when approaching a new area you'll see partially visible stalagtites visible on the \"ceiling\".", "2_Subreddit": "DotA2"}], "dw702gw": [{"0_Comment Submission": "TIL Lina’s “better to burn out than fade away” line was the last line in Kurt Cobain’s suicide note.", "1_Text": "If you ever want to know how someone formatted a word in their comment, hit the \"source\" button underneath their comment and it'll show how it was done.", "2_Subreddit": "DotA2"}], "dw8ake8": [{"0_Comment Submission": "TIL Lina’s “better to burn out than fade away” line was the last line in Kurt Cobain’s suicide note.", "1_Text": "https://imgur.com/a/sjgbF", "2_Subreddit": "DotA2"}], "dw9bxls": [{"0_Comment Submission": "Blizzard came up with a method how to avoid your most hated teammates.", "1_Text": "That's why Blizzard put a time limit on how long anybody can remain on the list (without being manually re-added to it).  After 7 days, the list clears itself and if you want to avoid the same two people again, you have to add them back on the list.", "2_Subreddit": "DotA2"}], "dweycfd": [{"0_Comment Submission": "Me and my dad in his greenhouse 20 years ago", "1_Text": "I see some big and beautiful Lophophora Williamsii (peyote) in the background.  Your dad just earned +100 cool points in my book.", "2_Subreddit": "cactus"}], "dwg0b71": [{"0_Comment Submission": "Me and my dad in his greenhouse 20 years ago", "1_Text": "I don't understand?  I am a cactus grower myself and can name at least 4 species I see in the pic, including the peyote.  It would help if the photo were higher resolution but given the time period it was taken in, it's understandably not crystal clear.", "2_Subreddit": "cactus"}], "dwgsovw": [{"0_Comment Submission": "Me and my dad in his greenhouse 20 years ago", "1_Text": "No need to be sorry, I appreciate you sharing that awesome pic with us!  The fact that any species are identifiable in the pic is just a bonus.", "2_Subreddit": "cactus"}], "dwiu4kt": [{"0_Comment Submission": "GABEN PLEASE. I've spent nearly 40,000 shards trying to get the last common relic on Lina and SF. Let me buy for 5,000 shards or something.", "1_Text": "I only had one (1) relic on Shadow Shaman and I wanted to get 3 new ones.  I gathered up the required shards and spent them.  Ended up landing on that very same relic I already had TWICE in a row.  On the third try I finally got something different.  Escalating odds?  LOL.", "2_Subreddit": "DotA2"}], "dwiuirm": [{"0_Comment Submission": "GABEN PLEASE. I've spent nearly 40,000 shards trying to get the last common relic on Lina and SF. Let me buy for 5,000 shards or something.", "1_Text": "Typically you're right, but I can compare it within the context of escalating odds and tell you if the odds escalate, it isn't by more than a fraction of a percent at best.", "2_Subreddit": "DotA2"}], "dwixp14": [{"0_Comment Submission": "GABEN PLEASE. I've spent nearly 40,000 shards trying to get the last common relic on Lina and SF. Let me buy for 5,000 shards or something.", "1_Text": "What we've seen so far in this thread seems to indicate I was the victim of bad RNG while you were lucky with it.  There are others in this very same thread that needed one last relic to finish and couldn't get it until spending well over 20-30k more shards.\n\nAt this point I tend to believe there are no escalating odds and it just boils down to luck (or bad luck).  Usually when Valve implements escalating odds into their reward mechanisms, they announce it as such but this time around there wasn't any indication or announcement that odds escalated the more relics you buy.  I guess we'll not know for sure until more data comes in or Valve themselves make an announcement about it.", "2_Subreddit": "DotA2"}], "dwlq5o5": [{"0_Comment Submission": "ARGGGHHHH BITCOIN!!!", "1_Text": "The crackdown isn't really affecting mail stateside, it's mostly customs looking for fent coming in from China that is taking all the heat at the moment.  Ordering domestic is about as safe as it's always been, at least with regard to powders and pills.", "2_Subreddit": "opiates"}], "dwm496e": [{"0_Comment Submission": "ARGGGHHHH BITCOIN!!!", "1_Text": "Psychs definitely can aid you in quitting, but I find they don't really do it all on their own.  You also have to put in some work to stay away from getting high.\n\nWhat works for a lot of people is finding a hobby you can devote most or all of your free time to instead of chasing down your dboy.  The biggest issue a lot of others face is once they're sober, they get bored and go back to wanting to get high.  Just do your best to fill that empty time with something else you can enjoy.  For me it was getting into cacti growing.  I have spent all my extra money and time on raising babies from seed and it's kept me out of trouble.  I hope you're able to pull yourself out no matter how you end up doing it.", "2_Subreddit": "opiates"}], "dwmln3y": [{"0_Comment Submission": "Putting the evidence in the guy's way that you're arresting for possession wcgw.", "1_Text": "I saw this gif over a year ago and all this time, I also assumed it was a sheet of acid.  It never occurred to me that it was a note from robbing a bank.  Although, it also didn't make complete sense to me why he'd just have a sheet of acid out in the open without it being protected somehow either.  I'm glad I can put this mystery to rest finally.", "2_Subreddit": "Whatcouldgowrong"}], "dwmqduw": [{"0_Comment Submission": "Can I cross one ferocactus with another type? Example: pollinate f. glaucescens with f. pottsii pollen?", "1_Text": "Thanks, yeah they aren't blooming on the same days so I'll have to save the pollen and wait.  I've got a unique mutant pottsii, that has spines and fur in between each of its ribs and I want to try and get those traits on a glaucescens.  Ty for the advice.", "2_Subreddit": "cactus"}], "dwmr0dz": [{"0_Comment Submission": "Clonidine for sweats", "1_Text": "We are identical, at least in terms of dose and length of time on it.  I'm actually at 85mg but 1mg, who's counting.  I want an answer for this problem too but everyone at work notices I'm the only one who looks like they walked out of a swimming pool every year when it starts warming up.", "2_Subreddit": "Methadone"}], "dwmsbij": [{"0_Comment Submission": "Did someone say Peyote?", "1_Text": "About as difficult as going on eBay and typing in the word \"caespitosa\" in the search bar.", "2_Subreddit": "cactus"}], "dwwmq43": [{"0_Comment Submission": "!!! Approaching 72 hours !!! (If you want to quit, you can. That’s the ONLY way)", "1_Text": "Some people are jealous when others are capable of recovery.  GL to you Cap.  We don't want to ever see you here again (I mean that in the best way possible lol)", "2_Subreddit": "opiates"}], "dwwnjol": [{"0_Comment Submission": "No matter how much oxy I do. I can't get euphoria- only sleepy nods.", "1_Text": "Yeah this happens to everyone whose tolerance to other opiates gets out of control.  I stopped getting any euphoria from oxy after using H for so long.  Now I experience exactly what you do: I can take enough to go to sleep but there's no euphoria or any other benefit.  Oxy would take away withdrawals for me but that's all it is capable of.", "2_Subreddit": "opiates"}], "dwwnn13": [{"0_Comment Submission": "What you know about those sour sloths? And these are the weirdest percs I've ever seen.", "1_Text": "The trolli octopus used to be my fav, but these are so much better.  They only sell them at one or two stores in my area so I snatch them all up when I see them lol.", "2_Subreddit": "opiates"}]}], "1_submissions": [{"4sgjn5": [{"0_Title": "What exactly will the new challenge be asking us to do?", "1_Text": "Dota 2 Documentary (Gone Sexual)", "2_Subreddit": "DotA2"}], "51x20t": [{"0_Title": "Wew Lad & The U Wot M8s", "1_Text": "Dota 2 Documentary (Gone Sexual)", "2_Subreddit": "Bandnames"}], "536wkn": [{"0_Title": "Lip Snot (Slipknot cover band)", "1_Text": "Dota 2 Documentary (Gone Sexual)", "2_Subreddit": "Bandnames"}], "538ckq": [{"0_Title": "Mad Lads Singing Ballads", "1_Text": "Dota 2 Documentary (Gone Sexual)", "2_Subreddit": "Bandnames"}], "590r2r": [{"0_Title": "I want to build a PC that can run DOTA 2 with all settings fully maxed. Is this doable at around $700-800?", "1_Text": "Dota 2 Documentary (Gone Sexual)", "2_Subreddit": "DotA2"}], "5etck9": [{"0_Title": "I want to play Dota 2 on max settings at 100+ fps in with a 144hz display. Where can I find a list of PC parts that can handle this task?", "1_Text": "Dota 2 Documentary (Gone Sexual)", "2_Subreddit": "DotA2"}], "5g2zi1": [{"0_Title": "The Donald Trumpets", "1_Text": "Dota 2 Documentary (Gone Sexual)", "2_Subreddit": "Bandnames"}], "5icrcb": [{"0_Title": "What do you call a celebrity that likes to inject heroin?", "1_Text": "Dota 2 Documentary (Gone Sexual)", "2_Subreddit": "opiates"}], "5jdbrj": [{"0_Title": "Freudian Nip Slip", "1_Text": "Dota 2 Documentary (Gone Sexual)", "2_Subreddit": "Bandnames"}], "5vqeh2": [{"0_Title": "What are the custom effects from Scythe of the Hunter's Glory bounty hunter weapon?", "1_Text": "Dota 2 Documentary (Gone Sexual)", "2_Subreddit": "DotA2"}], "5vx5g9": [{"0_Title": "Life would have a lot more embarrassing and awkward moments if humans could detect smells as good as some dogs can.", "1_Text": "Dota 2 Documentary (Gone Sexual)", "2_Subreddit": "Showerthoughts"}], "60njty": [{"0_Title": "Just tested positive for coke after last use was 33 days ago.", "1_Text": "Dota 2 Documentary (Gone Sexual)", "2_Subreddit": "opiates"}], "6b2169": [{"0_Title": "Sven's \"Rhinoceros Order\" set shows boots included, but when purchased there are no boots.", "1_Text": "Dota 2 Documentary (Gone Sexual)", "2_Subreddit": "DotA2"}], "6cfpdd": [{"0_Title": "I bet I'll feel like an idiot when someone tells me the obvious.. but what is this thing on the minimap panel?", "1_Text": "Dota 2 Documentary (Gone Sexual)", "2_Subreddit": "DotA2"}], "6fsrw1": [{"0_Title": "Trump's Travel Band", "1_Text": "Dota 2 Documentary (Gone Sexual)", "2_Subreddit": "band_names"}], "6fstil": [{"0_Title": "Mad Lads Singing Ballads", "1_Text": "Dota 2 Documentary (Gone Sexual)", "2_Subreddit": "band_names"}], "6jpeu7": [{"0_Title": "I have one free Battle Pass to gift to someone who can't afford it.", "1_Text": "Dota 2 Documentary (Gone Sexual)", "2_Subreddit": "DotA2"}], "6pcipn": [{"0_Title": "I am in DISBELIEF. Blessed by Junkie Jesus today.", "1_Text": "Dota 2 Documentary (Gone Sexual)", "2_Subreddit": "opiates"}], "6stesd": [{"0_Title": "Does abandoning a game count toward Slark's Riptide Rumble or do you have to complete the game?", "1_Text": "Dota 2 Documentary (Gone Sexual)", "2_Subreddit": "DotA2"}], "74xp11": [{"0_Title": "We can instruct computers to think, but we won't be truly advanced until we can instruct them to think all on their own.", "1_Text": "Dota 2 Documentary (Gone Sexual)", "2_Subreddit": "Showerthoughts"}], "770r9f": [{"0_Title": "If you want to test the durability of a product, give it to a kid for a few minutes", "1_Text": "Dota 2 Documentary (Gone Sexual)", "2_Subreddit": "Showerthoughts"}], "78uev1": [{"0_Title": "There could be an advanced underwater civilization plotting to exterminate humanity in one of the 95% unexplored parts of our ocean, and we would never know.", "1_Text": "Dota 2 Documentary (Gone Sexual)", "2_Subreddit": "Showerthoughts"}], "7f7132": [{"0_Title": "The Proud Accomplishments", "1_Text": "Dota 2 Documentary (Gone Sexual)", "2_Subreddit": "Bandnames"}], "88leye": [{"0_Title": "Can I cross one ferocactus with another type? Example: pollinate f. glaucescens with f. pottsii pollen?", "1_Text": "Dota 2 Documentary (Gone Sexual)", "2_Subreddit": "cactus"}], "8a6zwp": [{"0_Title": "Anyone else missing the shard reward given by the recent level up increase?", "1_Text": "Dota 2 Documentary (Gone Sexual)", "2_Subreddit": "DotA2"}]}]}]}