{"lemme_get_a_half": [{"0_comments": [{"durzun6": [{"0_Comment Submission": "New candy flavors - any good??", "1_Text": "I'm surprised it took this long for someone to realize that. \nThe yellow lovers are the true sinners. \nWithout a doubt.", "2_Subreddit": "opiates"}], "duxk79q": [{"0_Comment Submission": "Came into a brick of what must be heroin", "1_Text": "I'm pretty sure you are full of shit. If you wanted to dispose of it, you would just flush it. Who gives a fuck about putting drugs into the water supply? \nThere's nothing to be confused about here.", "2_Subreddit": "opiates"}], "dv2zvsa": [{"0_Comment Submission": "Just did a shot that scared the shit out of me. What happened?", "1_Text": "How long have you been slamming? Histamine reactions aren't that uncommon. I guess it was probably a bit scary the first time, before I knew what it was. \nNo biggie though.", "2_Subreddit": "opiates"}], "dv3y2gv": [{"0_Comment Submission": "Sniper gang mask in the cut , 500 xannies in my hand", "1_Text": "Can you say what vendor?", "2_Subreddit": "benzodiazepines"}], "dv563xn": [{"0_Comment Submission": "A new drug-based Discord has been made!", "1_Text": "PharmaCUM. \nCool name.", "2_Subreddit": "benzodiazepines"}], "dv685vl": [{"0_Comment Submission": "how do addicts keep blacking out?", "1_Text": "If you are dripping it onto candies, you would want to use an ethanol solution. Pg doesn't evaporate. I'm not the dude you were asking, but he's most likely using ethanol/everclear solution.", "2_Subreddit": "benzodiazepines"}], "dvjuzgk": [{"0_Comment Submission": "Copped 120 of these bad boys!", "1_Text": "They have a really nice gloss to them. Good score man.", "2_Subreddit": "benzodiazepines"}], "dvk2ng5": [{"0_Comment Submission": "if I relapsed I would be able to get high for so cheap", "1_Text": "I also knew a dude that died from a relapse shot. Be careful broseph. \nJust be sure to do a tiny tiny tester. Maybe even snort a tiny bump first to make sure it's not insanely strong. I'm sure you know all these things already.", "2_Subreddit": "opiates"}], "dvk37v0": [{"0_Comment Submission": "Just picked up some pressed school busses how do they look?", "1_Text": "They look good. The yellow color is very close. Sometimes they make the yellow way too dark. Schoolbusses have a nice light yellow color. Similar to the ones you have there.", "2_Subreddit": "benzodiazepines"}], "dvk4000": [{"0_Comment Submission": "Alone on this lonely Saturday night, feel like just binging a few of my kpins and getting stoned instead of rationing them for the month", "1_Text": "Fuck that bitch for not inviting you. I know that feels shitty if a lot of your friends are there, but you'll have a better time this way. Enjoy the benzos and chill. Kpins are great. \nAlso, fuck that bitch.", "2_Subreddit": "benzodiazepines"}], "dvk47wg": [{"0_Comment Submission": "Sorry", "1_Text": "I think you're just telling people you tried to kill yourself because you're feeling a certain way. You didn't really want to die did ya? \nIf so, what's so serious that you actually wanted to die?  Stupid  issues with boyfriends/girlfriends always pass. No matter how much they suck in the moment. Don't trip.", "2_Subreddit": "opiates"}], "dvkc1s8": [{"0_Comment Submission": "Sorry", "1_Text": "That stuff is all legit actually... as long as it's not about your boyfriend, because that will pass rather quick. You shouldn't kill yourself though. I know it doesn't help, but I'm also in the same situation with h. I have been for about a decade. So I'm with ya there.", "2_Subreddit": "opiates"}], "dvkufku": [{"0_Comment Submission": "Metaphysical Tar Porn", "1_Text": "Looks good.", "2_Subreddit": "opiates"}], "dvkv4r1": [{"0_Comment Submission": "WTF did he say?", "1_Text": "Dude just sounds like an idiot. He probably has no idea what he's talking about. Some people are the worst man...", "2_Subreddit": "opiates"}], "dvl2q76": [{"0_Comment Submission": "Have you ever..", "1_Text": "Jesus Christ man. \nPlease tell us how much that cost. \nI'm very curious.", "2_Subreddit": "opiates"}], "dvl48sz": [{"0_Comment Submission": "Have you ever..", "1_Text": "Sure, whatever you gotta do.", "2_Subreddit": "opiates"}], "dvo427j": [{"0_Comment Submission": "fucked up way to start a friendship", "1_Text": "That was a great story. I really enjoyed it. Definitely write more if ya feel like it.", "2_Subreddit": "opiates"}], "dvo459n": [{"0_Comment Submission": "fucked up way to start a friendship", "1_Text": "Same here. I thought he was gonna take his money, grab both sacks, and dip. I'm glad he didn't though. That would have been a bummer.", "2_Subreddit": "opiates"}], "dvo8az8": [{"0_Comment Submission": "If i take xanax, atleast 10mg a month, why dont i ever withdrawal.", "1_Text": "20 mg's a month isn't that much. That's why you don't have withdrawals.", "2_Subreddit": "benzodiazepines"}], "dvoakzs": [{"0_Comment Submission": "Anyone else prefer Mylans or footballs ?", "1_Text": "I always thought the mylans were great. I actually just popped one an hour ago. I also popped half a real pharma bar right after. Fucking great. My black connect has been m.i.a for 2 days, so I'm assuming he finally got caught up. I'm popping the xans so I can hopefully get some sleep tonight. I'm about to take the plunge buying on the dnm. If anybody wants to pm me the best h vendors on dream, that would be great. I would like to get ecp, but I think I'm gonna go for tar because the prices are better and I know I like tar. I've been liking it for a damn decade...... smh.....sorry to change topics. If y'all feel like pm'ing me though, that would be appreciated.", "2_Subreddit": "benzodiazepines"}], "dvoammt": [{"0_Comment Submission": "Xanax first time tomorrow", "1_Text": "Yea, that's a great way to start. You should be fine doing that. Just wait a decent bit before you take another quarter, until you see how it's affecting you. Don't drive bro. \nCrazy shit can happen. \nBe safe and enjoy.", "2_Subreddit": "benzodiazepines"}], "dvoaodr": [{"0_Comment Submission": "Dope in balloons?", "1_Text": "I've always received shit quality in balloons also. \nFucking sucks.", "2_Subreddit": "opiates"}], "dvon7kv": [{"0_Comment Submission": "fucked up way to start a friendship", "1_Text": "The part where he fell out was a different kind of bummer.  Haha. \nYour response to my comment was perfect though. Lol.", "2_Subreddit": "opiates"}], "dvonkwn": [{"0_Comment Submission": "fucked up way to start a friendship", "1_Text": "That's a hilarious observation... But to be totally honest.... It was the title that made me think he was gonna rob him, not the fact he was black. Plus..... He was only half black..... so ya know.......     jk... jk....  it was actually 100% the title \"a fucked up way to start a friendship\".  I knew something bad was gonna happen at some point.", "2_Subreddit": "opiates"}], "dwmqlb9": [{"0_Comment Submission": "Mmmmm 😈💦", "1_Text": "Fucking awesome. I just lost my  connect that I've had for like the last year......  BUT THE AMAZING news is...... I put it some work and found new connect within about a day. Prices are the same. 40 for a half. she'll actually do 70 or 75 for a g.  The other dude would just so straight 80. I have to drive just a bit farther, but not bad at all. Like 25-30. I don't mind the drive at all. I kind of enjoy it. It's only been about 2 weeks, so I really hope It's not somehow only working out amazingly at beginning and then goes to shit. She seems like a really  fucking cool chick though.  I forgot to mention the best part though. THE FUCKINF QUALITY IS FUCKING FIRE. BESY IBE HAD IN YEARS! VERY FUCKING AWESOME. I just hope it continues.", "2_Subreddit": "opiates"}]}], "1_submissions": [{}]}]}