{"BeatenDeez": [{"0_comments": [{"dw4gnkf": [{"0_Comment Submission": "Ex-drug addict for Trump.", "1_Text": "Winner winner chicken dinner. Sad to see so many in our predicament, but hopeful that they find what makes them want to stop. Anything is better than being strung out, congrats to you as well.", "2_Subreddit": "The_Donald"}], "dw4gp5j": [{"0_Comment Submission": "Ex-drug addict for Trump.", "1_Text": "Amen. Thanks brother you too.", "2_Subreddit": "The_Donald"}], "dw4gvjt": [{"0_Comment Submission": "Ex-drug addict for Trump.", "1_Text": "Something the left and RINOs will never understand. Thank you for that pede good to hear.", "2_Subreddit": "The_Donald"}], "dw4ibnj": [{"0_Comment Submission": "Ex-drug addict for Trump.", "1_Text": "Thanks for the advice. Thank god those were the other part of my decision to get clean.", "2_Subreddit": "The_Donald"}], "dw4jdvq": [{"0_Comment Submission": "Ex-drug addict for Trump.", "1_Text": "Agreed, it's the only thing that's going to help from their point of view. Better treatment options too but the tough stance is a good first step. Congrats to you as well so many of us out there.", "2_Subreddit": "The_Donald"}], "dw4jifk": [{"0_Comment Submission": "Ex-drug addict for Trump.", "1_Text": "Thanks. It's really not as bad as people make it out to be, people just hate having to pay the piper when their time comes, I was guilty of it as well.", "2_Subreddit": "The_Donald"}], "dw4k343": [{"0_Comment Submission": "Ex-drug addict for Trump.", "1_Text": "Yeah the detox is understandable and definitely good to get more people into. It's the time after detox that is the most important. For me, I made the decision to go through withdrawal, and know that I definitely didn't want to go back. I could see maintenance working for somebody who still has urges moreso suboxone cause it blocks most of any high you could get.", "2_Subreddit": "The_Donald"}], "dw4kpyp": [{"0_Comment Submission": "Ex-drug addict for Trump.", "1_Text": "Thanks, makes me feel proud to be part of this movement and to not let anyone down!", "2_Subreddit": "The_Donald"}], "dw4l500": [{"0_Comment Submission": "Ex-drug addict for Trump.", "1_Text": "I can't agree with you more, It's contagious. Thank you!!", "2_Subreddit": "The_Donald"}], "dw4luiq": [{"0_Comment Submission": "Ex-drug addict for Trump.", "1_Text": "Thanks, same to you as well.", "2_Subreddit": "The_Donald"}], "dw4nbcj": [{"0_Comment Submission": "Ex-drug addict for Trump.", "1_Text": "Thanks, glad to be here! MAGA", "2_Subreddit": "The_Donald"}], "dw6y1zf": [{"0_Comment Submission": "A continuation: After Cliff waited at my snowy doorstep for nearly two hours", "1_Text": "Reading this post makes me glad I've been clean. That sucks so much dick dude I'm sorry. Hopefully Tuesday works out for you.", "2_Subreddit": "opiates"}], "dw6z39t": [{"0_Comment Submission": "A continuation: After Cliff waited at my snowy doorstep for nearly two hours", "1_Text": "Yeah dude the game is dirty. Why even trust him anymore? Just make sure you're with him anytime he goes from now on.", "2_Subreddit": "opiates"}], "dw76v36": [{"0_Comment Submission": "Looking for or suggestions on dealing with addicted ex.", "1_Text": "This is such a mean and disgusting drug. I'm sorry this happened to you and your family. I know it's hard to believe but that isn't him. Until he realizes it's time to get clean then he's not going to do it for anybody but himself. Good luck with everything and cut him out of everything, even the kids. Who wants their kids talking to a dope head anyway. He can earn everything back that you allow him to.", "2_Subreddit": "opiates"}], "dw78kmh": [{"0_Comment Submission": "Looking for or suggestions on dealing with addicted ex.", "1_Text": "I guess I worded that a little harshly, but yeah that.", "2_Subreddit": "opiates"}], "dw7aah6": [{"0_Comment Submission": "I heard my husband masturbating...", "1_Text": "It seems you already know but definitely something to be proud of. With the internet you can have ANYTHING you want with a click of the screen, and he picked you. How sweet.", "2_Subreddit": "confessions"}], "dw9p21k": [{"0_Comment Submission": "Disgusting Joe Biden at it again!", "1_Text": "This made me a little nervous and I'm a 29 year old man. Yikes.", "2_Subreddit": "The_Donald"}], "dwaziy0": [{"0_Comment Submission": "How to get your plug to come for a small amount (yes i know its kinda fucked up)", "1_Text": "Did you ever get him to come through?? Totally invested on how this went.", "2_Subreddit": "opiates"}], "dwb0i1f": [{"0_Comment Submission": "Meth is a hell of a drug", "1_Text": "His eye also happens to know where on her face the treasure is buried that she keeps digging for. Only teamwork can win this prize.", "2_Subreddit": "trashy"}], "dwb22l9": [{"0_Comment Submission": "Chemist disposal?", "1_Text": "Send it to me as I am a licensed disposer of medication. VERY PROFESSIONAL MIND YOU. Business as usual nothing to raise any red flags over you know? So just personal message me and We can take care of this problem.", "2_Subreddit": "opiates"}], "dwb2kpz": [{"0_Comment Submission": "Mouth swap", "1_Text": "I haven't heard of any ways to beat the oral swab. Listerine or any other kind of alcohol based oral rinse Is going to be your best bet though.", "2_Subreddit": "opiates"}], "dwe53ct": [{"0_Comment Submission": "Something scary is happening", "1_Text": "Very thought out and well spoken youngin you are. This is what we are against, sounds like you're aboard.", "2_Subreddit": "The_Donald"}], "dwgz9l1": [{"0_Comment Submission": "Snorting H Query (Nod but no eurphoria)", "1_Text": "With me I always noticed fent hit really hard and really fast. Once it was over it was over no residual high. Make sure to be careful and if you can get something else in the meantime fent jacks your tolerance.", "2_Subreddit": "opiates"}], "dwp48q6": [{"0_Comment Submission": "so i actually died", "1_Text": "I wouldn't call him boy anymore. Guy atleast deserves the title of a man. I.E. that man saved your life. Keep fighting the good fight tho you'll be ok.", "2_Subreddit": "opiates"}], "dwp5aol": [{"0_Comment Submission": "Might be diahrrea of the mouth but I value yalls opinion and being an ex-junkie I wanna know if I am about to make a dumb decision.", "1_Text": "Hell yeah do it. If you relapse hopefully you don't but if you do then you'll just be a strapped junkie with big balls to beat dealers with.", "2_Subreddit": "opiates"}]}], "1_submissions": [{"819vmb": [{"0_Title": "My father and 2 friends 1971, Long Island, NY.", "1_Text": "Winner winner chicken dinner. Sad to see so many in our predicament, but hopeful that they find what makes them want to stop. Anything is better than being strung out, congrats to you as well.", "2_Subreddit": "OldSchoolCool"}], "86egon": [{"0_Title": "Ex-drug addict for Trump.", "1_Text": "Winner winner chicken dinner. Sad to see so many in our predicament, but hopeful that they find what makes them want to stop. Anything is better than being strung out, congrats to you as well.", "2_Subreddit": "The_Donald"}]}]}]}