{"druuuggedagain": [{"0_comments": [{"du9gkqc": [{"0_Comment Submission": "The FDA Is Still Trying to Ban Kratom, a Potential Solution to the Opioid Epidemic - Hit & Run : Reason.com", "1_Text": "Hey im that someone, a former heroin user and I currently use both weed and kratom daily. \n\nI'm one of these people!", "2_Subreddit": "Drugs"}], "dut61j6": [{"0_Comment Submission": "The miss turned into an abscess the size of a golf ball, so we took matters into our own hands in a hotel room on Colfax.", "1_Text": "Holy shit I missed your stories while I was busy with life and I'm so excited to start reading this one with my daily dose of kratom and a good cup of coffee.\n\nBeen clean 36 days now.", "2_Subreddit": "Drugs"}], "dut7nlu": [{"0_Comment Submission": "Some questions about kratom", "1_Text": "Hi there, I just took my morning dose of kratom and I'm feeling great!\n\nAs someone that is self diagnosed with general anxiety disorder, i think Kratom is absolutely great for social situations that would otherwise make me uncomfortable  and is a good way to deal with it. Even long term.\n\nI have been using kratom on and off for 3 years with little to no negative impact on physical or mental health. It continues to surprise me with how effective it is without all the negative effects that traditional medications carry.\n\nLimiting usage depends more on your personality and willpower, the reason I say this, is I do not experience any WD when I stop taking kratom. For me it's purely a mental issue.\n\nThe tolerance you build will quickly disappoint if you try to \"chase the dragon\". Keeping your doses consistant and not upping it when tolerance comes into the picture is the difference between a healthy relationship with kratom and an addictive one.\n\nJust like anything that feels so nice it is easy to make exceptions and break your own rules. I dose twice a day at 6g and that seems to work for me. Again, I don't experience any WD on days off but that's just me and EVERYONE IS DIFFERENT. Experiment and see how you react on days off, you don't want to take kratom for months then be surprised that you do get WD symptoms when you run out or take a day off. \n\nExperiment, everyone is different.\n\nTake into consideration I am an ex-heroin addict (36 days clean!) so my view on what is and isn't considered WD symptoms may be different than someone that has never been through really bad WD. Like I said though, constipation was my only issue with kratom and at its worst, it was just extremely uncomfortable and thankfully didn't require any doctor visits. \n\nEdit: I also take phenibut 2x a week for the same reason. If you can handle not getting addicted to that stuff then kratom should be a walk in the park. I see you are 17 and it looks like you care about harm reduction. 👍 I like to see younger people doing research and asking questions. Really does make me happy", "2_Subreddit": "Drugs"}], "duu3dc1": [{"0_Comment Submission": "Can I taper off of heroin?", "1_Text": "Yes but you may need a longer taper. I read a guide here on Reddit where a dude went from a gram a day down to nothing in 2 weeks. That's pretty rapid and he didn't feel good at all but he did it and it worked.\n\nReading his story made my own habit seem small and easy. When i quit i had been shooting for about a month and using for 2 years. I tapered in a week ruducing each dose.\n\nI waited till I was in WD (24 hrs) and did about 75% of my last dose. \n\nI do still use kratom and tons of weed though. Both are lifesavers.", "2_Subreddit": "Drugs"}], "duu4e7o": [{"0_Comment Submission": "Can I taper off of heroin?", "1_Text": "Yeah I would wait till I couldn't fall asleep and was super restless to do the next little bit. Then i would smoke a bowl to fall asleep.\n\nMagnesium helps a lot with restless legs.\n\nEven a month later my body temp is all messed up. I'm always super cold.", "2_Subreddit": "Drugs"}], "duu5rxi": [{"0_Comment Submission": "Can I taper off of heroin?", "1_Text": "I feel like kratom is that way for me. It's always a low dose type feeling and never gets out of hand, like maintenance.", "2_Subreddit": "Drugs"}], "dvc4ekn": [{"0_Comment Submission": "Speedy coke side effects (advice pls)", "1_Text": "Magnesium citrate works for me.", "2_Subreddit": "cocaine"}], "dvh7trr": [{"0_Comment Submission": "Edibles suprised me", "1_Text": "Soooo I just made 6 cookies with one gram of RSO.\n\nIf the RSO is 60% THC then that is 100mg per dose. \n\nI'm a regular smoker and 25mg had me passing out. The full 100 is  super heavy and im kinda entering a mild psychedelic state.  I believe this is stronger than most edibles because RSO is a full extract concentrate.", "2_Subreddit": "Drugs"}], "dvq716w": [{"0_Comment Submission": "Getting followed on acid", "1_Text": "I bet that situation was a real eye opener, realizing the decisions you made that night potentially saved your life, all while tripping balls.", "2_Subreddit": "Drugs"}], "dvu007c": [{"0_Comment Submission": "Wtf Shrooms", "1_Text": "Going into any trip with to specific of expectations is a bad idea. It never seems to work out the way you want it to.\n\nI also found that I don't like to trip with others for the entire trip, maybe the beginning but the peak and comedown can be really fucking weird. Espesially with shrooms.", "2_Subreddit": "Drugs"}], "dw5cadu": [{"0_Comment Submission": "Why do people cut cocaine with fentanyl and worse carfentenil", "1_Text": "You are correct, doing both in excess can fuck up your heart rhythm/make it hurt, or worse, stop it all together.\n\nIt's not a very fun time and really hurts.", "2_Subreddit": "Drugs"}], "dw72lx9": [{"0_Comment Submission": "It happened to my son", "1_Text": "Same thing happened to a good friend of mine after a seemingly pleasant 1 gram cubensis trip while smoking bud.\n\nIts been 2 years, things have gotten a little better. I really do think it happened for a reason though, leading up to that trip I noticed that he was in a lot of mental pain from childhood trauma. It's sad he changed but I think he was released from suffering in a way, he is kinda like a little kid again and pretty carefree.\n\nEvery day I have a dreadful feeling of \"why him though? It could have been me... I would rather it be me than him.\"\n\nA few people might try and claim my story as bullshit but I assure you, that I absolutely love psychedelics and will continue to use them as of now.\n\nAfter this experience though, I won't encourage just anyone to go out and try them but if you do, then  do a little research and look into possible mental illness in the family. Especially schizophrenia, that's what forever changed my friend.", "2_Subreddit": "Drugs"}], "dw72tjf": [{"0_Comment Submission": "It happened to my son", "1_Text": "Example: If I overdose on caffeine I will have a really bad time but that doesn't guarantee death.\n\nI feel like media has changed how people react to certain words because the definition of overdose has never changed but people today immediately think of death when it's mentioned.", "2_Subreddit": "Drugs"}], "dw7bg0r": [{"0_Comment Submission": "Cambridge Analytica moving \"boxes\" out of their office before the search warrant", "1_Text": "With hammocks, hand-jobs and cheeto fingers for lunch. Ignore me I'm drunk.", "2_Subreddit": "pics"}], "dw7bpx8": [{"0_Comment Submission": "It's Not In Your Head - Psychedelics Are Making A Scientific Comeback", "1_Text": "Reminds me of back in the day when we would just sit around and smell gas alll day then make slightly muffled sounds of pleasure.\n\nFinding a tank full of gas downtown on this fine Sat morning is such a delightfully powerful, truly a enlightening experience. 10 out of/9ths . \n\nSlight possibility of me smelling gas one more time before i quit for good this time. ahhhh the rush....", "2_Subreddit": "Drugs"}], "dw7bv27": [{"0_Comment Submission": "TIL that immediately after he gave up absolute power by signing a constitution, King Frederick VII of Denmark remarked, \"that was nice, now I can sleep in in the mornings\"", "1_Text": "I feel like this is pretty rare really. \n\nI mean.. I do it on occasion but that's unrelated.", "2_Subreddit": "todayilearned"}], "dw8wny7": [{"0_Comment Submission": "Why do people cut cocaine with fentanyl and worse carfentenil", "1_Text": "How exactly do we measure if someone has calmed down? Im no medical expert but i would think heart rate and blood pressure.\n\nSaying it doesn't effect the heart is pretty ignorant.\n\nI personally have experienced overdosing and it was after using both stims and CNS depressants in excess. I was having heart palpitations and major chest pain.", "2_Subreddit": "Drugs"}], "dwgltp2": [{"0_Comment Submission": "When your boss needs proof that you’re sick.", "1_Text": "Sperm bank.", "2_Subreddit": "funny"}], "dwtqfzu": [{"0_Comment Submission": "Bad Vibes", "1_Text": "I could almost feel the vibes with words that thick.\n\nIf you want, just keep posting regularly and you might gain a following!", "2_Subreddit": "Drugs"}], "dww1jne": [{"0_Comment Submission": "Wow, going hard with Molly is just not what I thought it would be.", "1_Text": "I struggle pretty bad with appetite loss without being on the comedown, so its been pretty rough. I did make it to work though which is nice and kind of counts as physical activity.\n\nThat reminds me though, I should go eat something, it's been awhile.", "2_Subreddit": "Drugs"}], "dww2v61": [{"0_Comment Submission": "Wow, going hard with Molly is just not what I thought it would be.", "1_Text": "Thanks for the heads up but I knew this going into the whole ordeal, I had never experienced it first hand till now though.\n\nIt might seem like it but I don't feel surprised as much as I am shocked that people do this every time they roll. \n\nTalk about a learning experience, my eyes are pryed wide open now to what not to do.", "2_Subreddit": "Drugs"}], "dww4eyv": [{"0_Comment Submission": "Wow, going hard with Molly is just not what I thought it would be.", "1_Text": "Thanks. It's nice to write out some of the things that have been bouncing around in my head lately.\n\nEven if it's not super important for the sub I feel we could all benefit from having some sort of journal, even if temporary.", "2_Subreddit": "Drugs"}], "dww68w6": [{"0_Comment Submission": "Wow, going hard with Molly is just not what I thought it would be.", "1_Text": "Heh, that happens most days regardless. 💨 I like to make rso edibles that kick my ass.", "2_Subreddit": "Drugs"}], "dww6o6a": [{"0_Comment Submission": "Im so grateful to be so disappointed.", "1_Text": "Damn I think you are right, i know what an oxy high feels like and it was nothing like that.\n\nPlus, they came from some fellow that resides south of the border.\n\nIt all makes more sense now.", "2_Subreddit": "opiates"}], "dwwci7c": [{"0_Comment Submission": "Wow, going hard with Molly is just not what I thought it would be.", "1_Text": "I probably won't go over 200 again either.\n\nMy face is still numb. O.o", "2_Subreddit": "Drugs"}]}], "1_submissions": [{"8a5fxt": [{"0_Title": "Wow, going hard with Molly is just not what I thought it would be.", "1_Text": "Hey im that someone, a former heroin user and I currently use both weed and kratom daily. \n\nI'm one of these people!", "2_Subreddit": "Drugs"}], "8a659o": [{"0_Title": "Im so grateful to be so disappointed.", "1_Text": "Hey im that someone, a former heroin user and I currently use both weed and kratom daily. \n\nI'm one of these people!", "2_Subreddit": "opiates"}]}]}]}