{"genericthrowawaynh": [{"0_comments": [{"dwlytty": [{"0_Comment Submission": "TLOU should have hipfire", "1_Text": "Oh man when you get rushed and just start throwing punches around, but still miss the punches then get stabbed. Oof", "2_Subreddit": "thelastofusfactions"}], "dwmpbbi": [{"0_Comment Submission": "How stupid can someone be to admit to receiving medical cannabis via the mail?", "1_Text": "Shit now they’ll know people are sending weed through the mail. Parties over folks", "2_Subreddit": "bostontrees"}], "dwmql7v": [{"0_Comment Submission": "PSA: Stay away from ATG's BAKKED CO2 cartridges", "1_Text": "$70 for 500mg extracted from whatever’s left on the cutting room floor. Rough", "2_Subreddit": "bostontrees"}], "dwmqw19": [{"0_Comment Submission": "Minimalist sea rocks. Any critique would be great!", "1_Text": "What’s your subject? I’d actually vote not enough contrast because your whites are very dull, try using a curves adjustment to bring those up a bit. It’s not a bad photo, but there’s also nothing really going on here", "2_Subreddit": "Nikon"}], "dwnnaj0": [{"0_Comment Submission": "What is the best image, without post-processing, that you have ever taken?", "1_Text": "It’s called Straight Out of Camera (SOOC). My best image without processing looks pretty flat, without much saturation, or sharpening, a little underexposed to preserve highlight detail. Just like every raw file.", "2_Subreddit": "photography"}], "dwotive": [{"0_Comment Submission": "Inexperienced hiker, want to do Observation Point at Zion this June. Any tips for someone with not a lot of hiking experience?", "1_Text": "You can always hike to observation point from outside of the east side of the park, which is much, much easier. Think it’s the east Mesa trail? We chose to do that so I could photograph sunset and not deal with the shuttle schedule. The road getting out there, while fairly short, is dirt and can be in rough shape though. I made it out no problem in our rental SUV, but some cars might not have enough clearance", "2_Subreddit": "hiking"}], "dwoxr33": [{"0_Comment Submission": "Wondering about the legality of, and tips for, bringing marijuana over the border from Canada.", "1_Text": "It’s federally illegal and border patrol has nothing to do with state laws. Do you think trafficking illegal drugs across country borders is a good idea? Cmon dude obviously weed will be easy to find in Maine", "2_Subreddit": "Maine"}], "dwp0yh3": [{"0_Comment Submission": "Wondering about the legality of, and tips for, bringing marijuana over the border from Canada.", "1_Text": "If you can’t find weed in Maine you probably don’t deserve to have any. I didn’t smoke for 5 years and found 10 connects within an hour of looking online up there.", "2_Subreddit": "Maine"}], "dwpc2lw": [{"0_Comment Submission": "Even if you had the 90 grand for that equipment,Rossin press would be more cost effective than rotovap and molecular (wiped film)distillation system?", "1_Text": "Maybe like a 4” bong", "2_Subreddit": "CannabisExtracts"}], "dwpccpz": [{"0_Comment Submission": "Wondering About any Cool Urbex in Meredith", "1_Text": "Winter Street in Laconia", "2_Subreddit": "newhampshire"}], "dwq9270": [{"0_Comment Submission": "Lightroom 7.3: New camera profiles, larger tone curve, new camera support (including A7 III)", "1_Text": "Interesting, definitely looking forward to checking out the new profiles and tone curve. Adobe standard tends to introduce too much contrast out the gate (imo).", "2_Subreddit": "photography"}], "dwqhhxm": [{"0_Comment Submission": "I love when a headline reads like a Cum Town bingo card", "1_Text": "There have been a few times lately on here that I read a thread title and just assumed it was in the cumtown subreddit, only to look and see it’s in /news or something haha. Life imitating art", "2_Subreddit": "Cumtown"}], "dwqoyh6": [{"0_Comment Submission": "Lightroom 7.3: New camera profiles, larger tone curve, new camera support (including A7 III)", "1_Text": "Ya I’ve heard this. Looking forward to getting home and taking a look at the new features", "2_Subreddit": "photography"}], "dwqp6e7": [{"0_Comment Submission": "People who say Florida isn’t good for hiking have never seen the real Florida - Big Shoals State Park", "1_Text": "Looks cool but any hike with 0 elevation gain is a walk IMO. I really enjoyed exploring the swamps of Florida though", "2_Subreddit": "hiking"}], "dwqsnob": [{"0_Comment Submission": "Lightroom 7.3: New camera profiles, larger tone curve, new camera support (including A7 III)", "1_Text": "Any other comments on the rendering? I’ll be home in like two hours but ya know, I’m impatient lol", "2_Subreddit": "photography"}], "dwrbcpo": [{"0_Comment Submission": "People who say Florida isn’t good for hiking have never seen the real Florida - Big Shoals State Park", "1_Text": "I suppose you could say that. But walking up 5000’ is a little different, no?", "2_Subreddit": "hiking"}], "dwrdaez": [{"0_Comment Submission": "People who say Florida isn’t good for hiking have never seen the real Florida - Big Shoals State Park", "1_Text": "That’s more like it", "2_Subreddit": "hiking"}], "dwtk6mt": [{"0_Comment Submission": "Have the boys ever mentioned sylvester stallone sleeping at the port authority bus station, selling his dog, or doing softcore porn??", "1_Text": "I think really early on", "2_Subreddit": "Cumtown"}], "dww3lip": [{"0_Comment Submission": "Best place to see a Maine sunrise?", "1_Text": "Or just drive up like the 300 other people will.", "2_Subreddit": "Maine"}], "dww4i4t": [{"0_Comment Submission": "Advice on beginning again.", "1_Text": "I stopped for 5 years, other reasons, but similar concerns when starting again. I would try and find some nice indica dominant flower or even one of the vape pens if you can find them. They’re certainly all over New England so if you can find flower, you could probably find some cartridges. \n\nThose cartridges are filled with distillate+terpenes (flavor) typically. Imo the distillate high, being only THC, tends to be pretty mellow and one dimensional, which I think lends itself very well to occasional smokers, especially to dip your toe back in the water.", "2_Subreddit": "eldertrees"}], "dww4m06": [{"0_Comment Submission": "Reviving tomfoolery", "1_Text": "So just do that over and over to stack parts? Shit is just weird to me and seems like a giant waste of time", "2_Subreddit": "thelastofusfactions"}], "dww87fq": [{"0_Comment Submission": "Reviving tomfoolery", "1_Text": "We would’ve done fine if they weren’t staying in the corners doing that. I had to quit after 5 minutes cause it got boring but the other player and I kept up at like 14-11", "2_Subreddit": "thelastofusfactions"}], "dwwz8ms": [{"0_Comment Submission": "Reviving tomfoolery", "1_Text": "Nah supply raid. On ps3 and that’s the only game mode I can find DLC matches in.", "2_Subreddit": "thelastofusfactions"}], "dwxwxrm": [{"0_Comment Submission": "Noted music aficionado Big Jay spoke with an air of disgust when describing \"fucking bubble gum pop punk shit\", as though the childish garbage he likes isn't more or less the same.", "1_Text": "Social retards writing god damn dissertations on reddit about a guy’s music taste. Who fucking cares doggie", "2_Subreddit": "LegionOfSkanks"}], "dwyr42o": [{"0_Comment Submission": "My Room mate is annoying. Gotta Bang Her.", "1_Text": "Who’s that", "2_Subreddit": "NSFW_GIF"}]}], "1_submissions": [{"8a5xqo": [{"0_Title": "Reviving tomfoolery", "1_Text": "Oh man when you get rushed and just start throwing punches around, but still miss the punches then get stabbed. Oof", "2_Subreddit": "thelastofusfactions"}]}]}]}