{"Empereur": [{"0_comments": [{"cho5wdf": [{"0_Comment Submission": "Reddit, can you blow my mind in one sentence?", "1_Text": "Hydrogen atoms are turned into more complex atoms through nuclear fusion. These atoms assembled to form molecules. These molecules assembled, self-replicated and became alive. Evolution made life more and more complex until one species (humans) was intelligent enough to reflect on its own existence.", "2_Subreddit": "AskReddit"}], "dwn3npf": [{"0_Comment Submission": "Two things: 1) Withdrawing while ill. 2) Vaping H from a bag.", "1_Text": "Weed made me paranoid. I would hyperfocus on my increased heart rate and it made me fear that my mental faculties might decline if I kept at it. It just wasn't good for my mental health. I loved the introspection though, the clarity it gave to music, the way it allowed me to immerse myself in a movie, the heavy body and the slight euphoria, but there were too many negative aspects. I might have been vaping weed that was too strong or might have missed the useful cannabinoids since vaping releases THC disproportionally. I tried different strains and vaped tiny amounts, but it just wasn't working.\n\nThanks for your advice regarding heroin. My Volcano doesn't display the temperature, but I can turn the heat up and down. I'm going to try to find more information, but I didn't have much luck earlier today, which is why I posted this thread. I'll be super careful, that was a given, I just didn't want to bother getting heroin (which I've never even seen with my own eyes) if vaping it wasn't an option.", "2_Subreddit": "opiates"}], "dwn4bo3": [{"0_Comment Submission": "Two things: 1) Withdrawing while ill. 2) Vaping H from a bag.", "1_Text": "Thank you! What you say makes sense, although the instant vaporization doesn't sound bad if it all goes in the bag, does it? I can definitely see how the powder could fly through even the finest mesh. Opium might be a better candidate for the Volcano, but I really don't know enough about opioids that aren't in pharmaceutical pill form.\n\nI'm not super comfortable with snorting, mostly because I'm scared to death of fentanyl. I thought that having the heroin vapor floating inside of a bag would mix it so thoroughly that it would give me very fine control over how much I inhale. The truth is that I'm probably too chicken shit for heroin, but its strenght is so appealing at the same time.\n\nThanks again!", "2_Subreddit": "opiates"}], "dwn4wcy": [{"0_Comment Submission": "Two things: 1) Withdrawing while ill. 2) Vaping H from a bag.", "1_Text": "Oh shit. The surgeon gave me the many perfectly round gallstones that were extracted from it and they certainly look more like rabbit shit than gold nuggets.", "2_Subreddit": "opiates"}]}], "1_submissions": [{"88s5tq": [{"0_Title": "Two things: 1) Withdrawing while ill. 2) Vaping H from a bag.", "1_Text": "Hydrogen atoms are turned into more complex atoms through nuclear fusion. These atoms assembled to form molecules. These molecules assembled, self-replicated and became alive. Evolution made life more and more complex until one species (humans) was intelligent enough to reflect on its own existence.", "2_Subreddit": "opiates"}]}]}]}