{"lordspidey": [{"0_comments": [{"dv7krkm": [{"0_Comment Submission": "Methadone dosage inpatient", "1_Text": "What... why also 24000 karma?!?\n\nIs there a report feature for this sort of shit, I'm guessing its rampant - karma farming to sell accounts / promote stuff... 2sp00ky4me.", "2_Subreddit": "pharmacy"}], "dv92214": [{"0_Comment Submission": "Has anyone ever been able to use these outfits? From what I can they, these ship conversions have the graphics in the game but aren’t buyable. Any idea why?", "1_Text": "man seeing all the graphical assets really makes me wonder how much work one would have to put in to make a rip-off open/free clone...\n\nOr if whoever's sitting on the IP would liscence the damn thing to get ported and adapted to ios/android it would make a mean tablet/phone game... a pile of gold i tell ya!\n\nAlso i'm pretty sure a mod unlocks these outfits maybe a feature that they thought of putting in the game ie; doing the rebel storyline if you had a modstarbridge/valk you could upgrade to the respective rebel boat in the outfitter instead of buying a new ship... iunno.", "2_Subreddit": "evnova"}], "dv9htak": [{"0_Comment Submission": "Do you feel the size of Halifax is an issue?", "1_Text": "uhhh apart from google fiber, on time buses and overcrowding Halifax has everything you could possibly ask for!\n\nDepends on where/why you want to live personally I really like Montreal even though I've never lived there halifax is otherwise pretty allright 300k is enough population for this city to have everything a really large city would have but with less downsides (there's still annoying amounts of traffic but nothing like toronto/MTL/vancouver).\n\nI've been here since 2000 and the amount of money getting poured into downtown developments is starting to make it feel more and more \"big fancy city\" but its still pretty small.\n\nIf anything Halifax kinda lacks in the nightscene department compared to a city like Paris/montreal/berlin but its kind-of an unfair comparison... also the public transit in  isn't great because halifax is still too small to justify light rail but very spread out and runs on few buses which zigzag so much walking is almost faster.\n\nI give halifax a solid 5.8/7", "2_Subreddit": "halifax"}], "dv9xenu": [{"0_Comment Submission": "Do you feel the size of Halifax is an issue?", "1_Text": "aye but saint john's is half the size not to mention OP was comparing halifax to a million+ inhabitant city which probably has metro/light rail/trams which are way more reliable modes of public transportation.\n\nI live not too far from the penhorn terminal in dartmouth and there's a few spots in halifax which are really impractical to get to on bus where hopping off the bus at the halifax side of the bridge i get there faster walking versus staying on the bus!", "2_Subreddit": "halifax"}], "dvh7q9t": [{"0_Comment Submission": "Corvid Stud in my backyard this morning!", "1_Text": "bonus birbs https://imgur.com/a/OiMT3 the female cardinal wasn't too far either but didn't get good pictures of her :/", "2_Subreddit": "Ornithology"}], "dvjbci8": [{"0_Comment Submission": "*Poncirus trifoliata* 'Flying Dragon' a hardy orange species.", "1_Text": "I'll take \"things I'd really rather avoid falling into for 800\" Alex.", "2_Subreddit": "marijuanaenthusiasts"}], "dvlf0am": [{"0_Comment Submission": "Amazing shot.!!!", "1_Text": "holy shit dude!", "2_Subreddit": "Beekeeping"}], "dvln0hk": [{"0_Comment Submission": "Prairie Sunset", "1_Text": "I gotchu fam!\n\nhttps://imgur.com/a/MELDr *", "2_Subreddit": "saskatchewan"}], "dwlxf3v": [{"0_Comment Submission": "Lunar mare basalt thin section under cross polarized light", "1_Text": "Oy someone x-post this to r/thinsectionporn!", "2_Subreddit": "geology"}], "dwr7a37": [{"0_Comment Submission": "I was wondering why my \"demo\" nest cameras weren't working... opened them and found blank PCBs", "1_Text": "Nekkid PCB's always get me going.", "2_Subreddit": "electronics"}], "dwrhll3": [{"0_Comment Submission": "Pornhub gives people in Climax, Sask free premium memberships", "1_Text": "Hmmm I know where I'm setting up my next proxy server!", "2_Subreddit": "saskatchewan"}], "dwv8g7w": [{"0_Comment Submission": "Are there any good Viruses.", "1_Text": "Oy you forgot phage therapy!", "2_Subreddit": "biology"}], "dwv9ahs": [{"0_Comment Submission": "Are there any good Viruses.", "1_Text": "Fair enough; hell of a good read btw hell I might've learned me some stuff today thanks to you! :P", "2_Subreddit": "biology"}], "dwvp13r": [{"0_Comment Submission": "Saskatchewan Random & Off Topic", "1_Text": "yeh, fackn' cold too bud.", "2_Subreddit": "saskatchewan"}], "dwvwkcq": [{"0_Comment Submission": "magnesium threonate - rapid increase in physical performance", "1_Text": "Magnesium covered my last car payment... and fixed my marriage!\n\n*Accidentally the whole.", "2_Subreddit": "Nootropics"}], "dwvz4ei": [{"0_Comment Submission": "u/lordspidey's circle", "1_Text": "Myeah sure; I don't even know what's going on in here wcgw!", "2_Subreddit": "CircleofTrust"}], "dww9o93": [{"0_Comment Submission": "Red Winged Black Bird", "1_Text": "nice, getting good pictures mid flight is harder than it looks.", "2_Subreddit": "birdpics"}], "dww9ulg": [{"0_Comment Submission": "One of the better looking sunsets on the farm last week.", "1_Text": "Bonus pictures of a bird that got real nice and close to my camera; https://imgur.com/a/1PEHV\n\nThese little bastards are everywhere right now.", "2_Subreddit": "saskatchewan"}], "dwwa87r": [{"0_Comment Submission": "Where does Cody get the ideas for his videos/projects from?", "1_Text": "I'd say from living out in the stick and having nothing else to do than feed his youtube channel with cool shit.", "2_Subreddit": "codyslab"}], "dwx3gd4": [{"0_Comment Submission": "Where does Cody get the ideas for his videos/projects from?", "1_Text": "Well to give you an example I built a pretty powerful potato blaster enough that even firing a blank gives enough recoil that Its possible with basic gear to calculate the thrust a single shot generates (to be fair I haven't built the rig yet but I figure I'll make some sort of swing and see how far it travels), if i factor in the amount of propellant I use (in my case diethyl ether) I could derive the specific impulse of my potato blaster with a stoichiometric amount of air for the volume of the combustion chamber. how's that for fun middle of buttfuck nowhere science-ey shit :P\n\nCalculating the average projectile speed over a given distance is pretty easy with my phones camera it worked out to about 3~4 frames between the projectile leaving the barrel to impact at 10 meters so at 30 fps that's a really rough ballpark of ~100m/s for the first 10 meters. the challenge here would be using round projectiles that weight the same and using an exact pre-mixed propelland/air mixture to get a better idea of the muzzle velocity for a given projectile mass/propellant. coming up with ways to figure this shit out and trying it in practice is a lot of fun I shit you not.\n\nI dropped out of Highschool so being in college doesn't have much to do with it (if you ask me anyway) in my case its mostly a result of trying to find interesting things to do with my time and what I already have on hand, just doing that yeilds interesting results.\n\nThere's so many other cool projects I've got on the backburner but I simply don't have the drive to put great amounts of time in them.\n\nmost of the stuff I do isn't nearly as involved as cody (I would kill for some glasswear) but yeah a couple of years back i found some of those polarized 3d cinema goggles and what resulted was a bunch of polarized dark field photography. lately I've been thinking of trying to rig something together to make thin section macros but yeah its a little more involved than just sticking shit between polarized filters and taking a bunch of pictures.\n\nJust try to come up with shit you can do with the stuff you have on hand and i guarantee you'll come up with surprisingly creative solutions to the problems you encounter solutions.\n\nshit you can build an incubator with a lightbulb sterilize some dishes and try to isolate microbial life in homemade petri dishes.\n\nSo many things you can do just on a whim it might not work but you'll have learned form the experience and next time you try to reproduce your experiment you'll have that previous insight.\n\nI've got tons of examples of projects and half-assed shit I've put on the backburner (i'll revisit them eventually...probably...maybe...) and yeah at this rate I totally see myself digging up rocks trying to isolate stuff out of em for shit'n'giggles. :P\n\nTL;DR: just do stuff with what you already have and see where it takes you! :P", "2_Subreddit": "codyslab"}], "dwx8cqb": [{"0_Comment Submission": "Do any of your patients actively use drugs? Make sure you rx them narcan too!", "1_Text": "\"How do you combat the potential for people to use narcan inappropriately as a bail out to try and get a \"higher high\"?\" <\n\nAs someone who frequents many online drug communities and some which revolve around opiate use I've never heard of this and from my first hand experience with opiates (not IV mind you) It sounds absolutely asinine since getting too high is \"too\" much and overall no fun.\n\nIf you ask me the potential for naloxone autoinjectors being used to save people who intentionally overdose is small enough to be neglected since you're wasting good drugs at that point (something no fiend would do) and its really not fun... I doubt there's anything to be done to try to combat such a foolish and wasteful practice.\n\n\"Also, if narcan is used IIRC it causes the user to have issues feeling as much of a high for some extended time afterwards which makes them more prone to overdose.\" < Again I figure this only happens in isolated incidents and apart from education towards the very temporary tolerance naloxone induces there's not much to be done.\n\nI don't speak from personal experience since i've never had the opportunity to experience mu-antagonist for any reason (If I had some on hand I'd probably do it out of sheer curiosity and probably not with a 50 dollar autoinjector that has much better uses) but from what i've read the potential for naloxone to save lives and give addicts that \"Oh shit I almost died better dial my shit down\" far outweighs the potential harm people abusing it would bring.", "2_Subreddit": "medicine"}], "dwx9f29": [{"0_Comment Submission": "Do any of your patients actively use drugs? Make sure you rx them narcan too!", "1_Text": "Honestly If someone does drugs on a remotely frequent basis or is around people who do street drugs there's no harm in having a narcan autoinjector somewhere in the stash. For instance in my locale people have died from tainted coke, and unless they were forthcoming to their physician in a lot of cases its hard/impossible to notice/suspect they're already way way wayyy down the rabbit hole in which case they should definitely have one.\n\nHad these casual cocaine users had narcan on hand the fentanyl that was cut into the coke probably wouldn't have killed a couple of em and they could've been saved by a casual \"non-problematic/detectable\" drug user who would've had naloxone in their stash.\n\n\"Wouldn't prescribe things your patient doesn't need\" Aye that makes sense but in the case of naloxone no one knows they need it until they (or someone nearby) is in dire need of it and the risk of it being used improperly or in a dangerous manner is far outweighed by the overdoses that would be reversed and the lives which would be preserved.\n\nI don't think I remotely fit the category of someone who would be prescribed a naloxone injector given my recreational drug use stays far away from street drugs and opiates in general (bar the occasional opportunity at collecting deliciously bitter latex from a particular ornamental plant that's sold at my local grocery store) but there's been times working on large construction projects where some of the crews were definitely into putting back a couple of lines for lunch/after work given the problem of dealers not knowing what the fuck they're doing I don't think anyone in those crews would've had a problem with someone somewhere having a naloxone kit.\n\nPlus the motherfuckers who would seem to fit the description of having naloxone prescribed to them probably aren't consulting with a physician on anything short of a dire necessity and even then...", "2_Subreddit": "medicine"}], "dwxhva6": [{"0_Comment Submission": "I have never done any opiates. I've been browsing this sub for ~2 hours now.", "1_Text": "I'm relatively naive to opiates (only have about a dozen individual experiences spread out over the last 10 years or so) and the only times I've gotten pronounced euphoria from opiates were at lower doses or with low potency opiates like codeine and actually doing stuff while high.\n\nThe only time I did a dose that really brought on the opiate warmth I was about 15mg of oxycodone and 4mg of hydromorphone in and though euphoria was present the whole experience wasn't really fun because it was \"too much\" and the nausea/sedated feeling far outweighed the more positive part of the experience.\n\nOn the other hand if I pop 80~300mg of codeine throughout the day its an absolutely amazing happy-go-lucky somewhat subtle euphoria. Oddly enough the only other substances which are euphoriating in a similar regard are gabapentinoids and benzos where the euphoria is really subtle but if you're in a good mood it'll make itself present unlike the euphoria from stims or the more cerebral euphoria from MDMA or psychs which is much more in your face can't help but feel absolutely amazing type of deal.", "2_Subreddit": "opiates"}], "dwxq0kc": [{"0_Comment Submission": "How long does Klonopin stay in your system?", "1_Text": "You might but... If its just one of those 12 panel piss-test its unlikely - even through clonazepam & its metabolite clear relatively slowly the dose will have been well so well distributed and metabolized that at .25mg its probably well below the detectable threshold in your urine by granted you didn't take more than that single .25mg dose three days ago.\n\nhttps://en.wikipedia.org/wiki/Clonazepam#Pharmacokinetics\n\nThere's no way to know for sure until you take the piss test and pass/fail but given the low dose and the length of time I'd say you're likely in the clear. (just guessing over here best of luck to ya!)", "2_Subreddit": "AskDrugNerds"}], "dwy5gh9": [{"0_Comment Submission": "One of the better looking sunsets on the farm last week.", "1_Text": "I figure its a Hoary Redpoll.\n\nhttps://www.allaboutbirds.org/guide/Hoary_Redpoll", "2_Subreddit": "saskatchewan"}]}], "1_submissions": [{"49ne9o": [{"0_Title": "Snowy owl carrying partially decapitated duck.", "1_Text": "What... why also 24000 karma?!?\n\nIs there a report feature for this sort of shit, I'm guessing its rampant - karma farming to sell accounts / promote stuff... 2sp00ky4me.", "2_Subreddit": "natureismetal"}], "4ydpps": [{"0_Title": "Pretty sure I shorted out my nano; can I bring it back?", "1_Text": "What... why also 24000 karma?!?\n\nIs there a report feature for this sort of shit, I'm guessing its rampant - karma farming to sell accounts / promote stuff... 2sp00ky4me.", "2_Subreddit": "arduino"}], "5h0cdt": [{"0_Title": "[Article] - Prevalence of New Psychoactive Substances in Northeast Asia from 2007 to 2015", "1_Text": "What... why also 24000 karma?!?\n\nIs there a report feature for this sort of shit, I'm guessing its rampant - karma farming to sell accounts / promote stuff... 2sp00ky4me.", "2_Subreddit": "Scholar"}], "5j896n": [{"0_Title": "[Article] - Purity, adulteration and price of drugs bought online versus offline in the Netherlands.", "1_Text": "What... why also 24000 karma?!?\n\nIs there a report feature for this sort of shit, I'm guessing its rampant - karma farming to sell accounts / promote stuff... 2sp00ky4me.", "2_Subreddit": "Scholar"}], "5kw1rz": [{"0_Title": "Broke backpacker with time to kill till the 31st", "1_Text": "What... why also 24000 karma?!?\n\nIs there a report feature for this sort of shit, I'm guessing its rampant - karma farming to sell accounts / promote stuff... 2sp00ky4me.", "2_Subreddit": "HongKong"}], "6550jj": [{"0_Title": "Why such huge pharmacokinetics differences between triazolam/flubromazolam", "1_Text": "What... why also 24000 karma?!?\n\nIs there a report feature for this sort of shit, I'm guessing its rampant - karma farming to sell accounts / promote stuff... 2sp00ky4me.", "2_Subreddit": "AskDrugNerds"}], "6gq4wj": [{"0_Title": "As it once was, and as it will remain.", "1_Text": "What... why also 24000 karma?!?\n\nIs there a report feature for this sort of shit, I'm guessing its rampant - karma farming to sell accounts / promote stuff... 2sp00ky4me.", "2_Subreddit": "videos"}], "71lmhh": [{"0_Title": "Amarilla sp?", "1_Text": "What... why also 24000 karma?!?\n\nIs there a report feature for this sort of shit, I'm guessing its rampant - karma farming to sell accounts / promote stuff... 2sp00ky4me.", "2_Subreddit": "mycology"}], "72oe27": [{"0_Title": "Microsoft Security Essentials trips on older curecoin client version.", "1_Text": "What... why also 24000 karma?!?\n\nIs there a report feature for this sort of shit, I'm guessing its rampant - karma farming to sell accounts / promote stuff... 2sp00ky4me.", "2_Subreddit": "curecoin"}], "7aa3z0": [{"0_Title": "re-re-repost", "1_Text": "What... why also 24000 karma?!?\n\nIs there a report feature for this sort of shit, I'm guessing its rampant - karma farming to sell accounts / promote stuff... 2sp00ky4me.", "2_Subreddit": "france"}], "7aiozg": [{"0_Title": "The Bender", "1_Text": "What... why also 24000 karma?!?\n\nIs there a report feature for this sort of shit, I'm guessing its rampant - karma farming to sell accounts / promote stuff... 2sp00ky4me.", "2_Subreddit": "Drugs"}], "7bd4ps": [{"0_Title": "Domestic homicide courtesy of /u/win-a-bagel", "1_Text": "What... why also 24000 karma?!?\n\nIs there a report feature for this sort of shit, I'm guessing its rampant - karma farming to sell accounts / promote stuff... 2sp00ky4me.", "2_Subreddit": "MurderedByWords"}], "7e5lvq": [{"0_Title": "Cryptocurrency", "1_Text": "What... why also 24000 karma?!?\n\nIs there a report feature for this sort of shit, I'm guessing its rampant - karma farming to sell accounts / promote stuff... 2sp00ky4me.", "2_Subreddit": "SaluteCorporate"}], "7e63dy": [{"0_Title": "I have 1000mg etizolam can i make a volumetric solution with 1kg of beer?", "1_Text": "What... why also 24000 karma?!?\n\nIs there a report feature for this sort of shit, I'm guessing its rampant - karma farming to sell accounts / promote stuff... 2sp00ky4me.", "2_Subreddit": "drugscirclejerk"}], "7e72ms": [{"0_Title": "The Composite Contact-Evaporator!", "1_Text": "What... why also 24000 karma?!?\n\nIs there a report feature for this sort of shit, I'm guessing its rampant - karma farming to sell accounts / promote stuff... 2sp00ky4me.", "2_Subreddit": "StonerEngineering"}], "7wd5m5": [{"0_Title": "Been scratching my noodle over this one; What the hell is it?", "1_Text": "What... why also 24000 karma?!?\n\nIs there a report feature for this sort of shit, I'm guessing its rampant - karma farming to sell accounts / promote stuff... 2sp00ky4me.", "2_Subreddit": "Minerals"}], "7yona2": [{"0_Title": "Revisiting my favorite stupid simple home chemistry project", "1_Text": "What... why also 24000 karma?!?\n\nIs there a report feature for this sort of shit, I'm guessing its rampant - karma farming to sell accounts / promote stuff... 2sp00ky4me.", "2_Subreddit": "homechemistry"}], "7zy8jy": [{"0_Title": "After many months of troubleshooting and no dice wat do?", "1_Text": "What... why also 24000 karma?!?\n\nIs there a report feature for this sort of shit, I'm guessing its rampant - karma farming to sell accounts / promote stuff... 2sp00ky4me.", "2_Subreddit": "techsupport"}], "81wpdx": [{"0_Title": "Intel bringing RGB feature to its CPU!", "1_Text": "What... why also 24000 karma?!?\n\nIs there a report feature for this sort of shit, I'm guessing its rampant - karma farming to sell accounts / promote stuff... 2sp00ky4me.", "2_Subreddit": "pcmasterrace"}], "83eosk": [{"0_Title": "Corvid Stud in my backyard this morning!", "1_Text": "What... why also 24000 karma?!?\n\nIs there a report feature for this sort of shit, I'm guessing its rampant - karma farming to sell accounts / promote stuff... 2sp00ky4me.", "2_Subreddit": "Ornithology"}], "83zy33": [{"0_Title": "Saskatchewan in early January (Wish I woulda had better gloves)", "1_Text": "What... why also 24000 karma?!?\n\nIs there a report feature for this sort of shit, I'm guessing its rampant - karma farming to sell accounts / promote stuff... 2sp00ky4me.", "2_Subreddit": "saskatchewan"}], "8a5e9u": [{"0_Title": "u/lordspidey's circle", "1_Text": "What... why also 24000 karma?!?\n\nIs there a report feature for this sort of shit, I'm guessing its rampant - karma farming to sell accounts / promote stuff... 2sp00ky4me.", "2_Subreddit": "CircleofTrust"}], "8a6ap5": [{"0_Title": "Hoary Redpoll!", "1_Text": "What... why also 24000 karma?!?\n\nIs there a report feature for this sort of shit, I'm guessing its rampant - karma farming to sell accounts / promote stuff... 2sp00ky4me.", "2_Subreddit": "Ornithology"}], "8a6kvc": [{"0_Title": "Hoary Redpoll!", "1_Text": "What... why also 24000 karma?!?\n\nIs there a report feature for this sort of shit, I'm guessing its rampant - karma farming to sell accounts / promote stuff... 2sp00ky4me.", "2_Subreddit": "birdpics"}], "8a6mm8": [{"0_Title": "One of the better looking sunsets on the farm last week.", "1_Text": "What... why also 24000 karma?!?\n\nIs there a report feature for this sort of shit, I'm guessing its rampant - karma farming to sell accounts / promote stuff... 2sp00ky4me.", "2_Subreddit": "saskatchewan"}]}]}]}