{"cosmixxkitten": [{"0_comments": [{"dum2pdd": [{"0_Comment Submission": "They got back to me!! Thanks Denver public library.", "1_Text": "I live in Denver, and I love the DPL! Good on them.", "2_Subreddit": "actuallesbians"}], "dum2yc8": [{"0_Comment Submission": "BREAKING: Accident on I-225 North at DTC Blvd involving multiple vehicles.", "1_Text": "That part of the highway might as well always be blocked off anyway. Can't get to 25 for shit. Bunch of dumbasses.", "2_Subreddit": "Denver"}], "dum54tv": [{"0_Comment Submission": "Are Carpatho-Rusyns and Lemkos a separate ethnic group?", "1_Text": "Lemko, here. My 2x great grandfather's village is a well known Lemko village that exists in modern day Poland. His last name isn't a typical polish last name, in fact it's a Rusyn word. \nThe answer to your question lies in Operation Vistula, which took place in the 40s. Soviet/Polish authorities came and rounded up the Lemkos and put them on trains with their livestock. They were relocated to former German territories that belonged to Poland. When they got there, they weren't allowed their Lemko clothing. They had to speak Polish instead of Rusyn. Some of them returned to where they came from over time. Few people identify as Lemko in Poland, although after Operation Vistula it is estimated that there are 100,000 people of Lemko descent.\nWould I say they were an ethnic group that simply assimilated? No, although that would be the easier answer. I would argue that was all ethnic cleansing. I do not believe Rusyns and Lemkos are simply Ukranian. That makes no sense to me. Their DNA does differ from that of Ukranians. The genetic testing I, and other Lemkos I have known have done, shows Polish, Slovak, and Hungarian DNA, no Ukranian. Even if it did, it's not that simple, as the countries I listed did used to be a part of Ruthenia, after all.", "2_Subreddit": "Masastan"}], "duoatbg": [{"0_Comment Submission": "Any Denver ladies interested in a lesbian book club? 📚👭📚", "1_Text": "sounds great to me :)", "2_Subreddit": "actuallesbians"}], "duos71a": [{"0_Comment Submission": "Are Carpatho-Rusyns and Lemkos a separate ethnic group?", "1_Text": "Not all Rusyns are Carpatho Rusyns. I myself am Lemko and have absolutely no relation to Ukraine, genetically, or anywhere on my tree.", "2_Subreddit": "Masastan"}], "duosy54": [{"0_Comment Submission": "Are Carpatho-Rusyns and Lemkos a separate ethnic group?", "1_Text": "I'd argue they're separate branches. You also have to understand they lived under Austria Hungary for a long time, when the pan Slavic movement was ongoing because so many Slavic countries were owned by non Slavic empires. Rusyns have maintained their unique identity throughout all of this.\n\nIt's really just relative to what part of former Ruthenia they were living. That could be in modern day Slovakia, Poland, Ukraine, or the tip top of Romania. Some Rusyns lived in Hungary.\n\nI can link you to some resources to make this more clear. Lemkos are Lemko Rusyn, and existed in modern day Poland. \n\nBut at the same time, just because their country doesn't exist anymore, doesn't equate them with Ukranians, Poles, Slovaks, etc. Their language is different. Genetically, they are different. Rusyns have a history of staunchly rejecting bring recognized as a Ukranian subgroup, if that's not enough reason to not see them as one.\n\nhttp://www.carpatho-rusyn.org/lemkos/lemkos.htm\n\nhttp://rusyncenter.blogspot.com/2013/04/the-carpatho-rusyns-of-poland-lemkos.html?m=1\n\nhttp://www.khazaria.com/genetics/rusyns.html\n\nhttp://www.slovakia.org/society-rusyn.htm", "2_Subreddit": "Masastan"}], "duprjly": [{"0_Comment Submission": "Are Carpatho-Rusyns and Lemkos a separate ethnic group?", "1_Text": "I mean, Presov University has a full time academic program in Rusyn language \n\nA lot of ethnic Lemkos speak Rusyn. A lot of Rusyns in America speak Rusyn.\n\nIf that statement is true, it surprises me, because as far as I know, linguists acknowledge Rusyn as a language. It is Ukranians who see it as a dialect.", "2_Subreddit": "Masastan"}], "duqaiut": [{"0_Comment Submission": "The Anjunadeep Edition 189 with Eli & Fur", "1_Text": "my fave Anjunadeep artists. so underrated.", "2_Subreddit": "AboveandBeyond"}], "dur3cmp": [{"0_Comment Submission": "What were some super gay things you did when you were \"straight\"?", "1_Text": "I was basically in a romantic relationship with another girl (unknowingly, she didn't know either) for about a year, which is about as bad as it gets.\n\nIf you are wondering how that works, I don't want to have to explain in too much detail. But I innocently just felt it was a very strong, deep, and turbulent friendship. But in every aspect, it was essentially a relationship. I was 12. We are both out gays now.", "2_Subreddit": "actuallesbians"}], "durj0xy": [{"0_Comment Submission": "What were some super gay things you did when you were \"straight\"?", "1_Text": "Nooo :(", "2_Subreddit": "actuallesbians"}], "dusjaa5": [{"0_Comment Submission": "How long is the Common Ground A&B concert?", "1_Text": "At Providence, RI's show, Lutrell played until 11 and A&B played until 1, plus encore", "2_Subreddit": "AboveandBeyond"}], "dusq0pd": [{"0_Comment Submission": "THIS IS", "1_Text": "I was expecting THIS IS *group therapy with above and beyond whisper*", "2_Subreddit": "AboveandBeyond"}], "dv06m8s": [{"0_Comment Submission": "Suggested Dosage For Big Guy Who Was On 10 mg of Hydrocodone Almost Daily", "1_Text": "My roommate is a big guy (6'3, 300 lbs) and he takes less than I do (5'3, 115 lbs) at about 3g. I take about 5 and sometimes even 7. Don't wait for him to fall into physical withdrawals before seeing if he would like to try it like some have suggested here. Psychological withdrawals are hell and withdrawing wouldn't even be so bad if they weren't present.\nOnce he's started using Kratom encourage him to maintain a dose and if possible taper down over time. Some people need Kratom as often as they need opiates and that's okay, too, as long as he's not getting to where it's not even going to help him anymore.", "2_Subreddit": "kratom"}], "dvzifmv": [{"0_Comment Submission": "Gay men of Reddit, what are your Grindr horror stories?", "1_Text": "I'm not a gay man. However, I found myself in Southern California for a music festival in November with my bisexual male friend.\n\nWe brought some party favors for said show, but wound up going through them before it was time to even head to the festival. With a couple hours to spare, and without a car or knowing anyone in the area, we head to Grindr to perhaps find the hookup we are looking for.\n\nWe scroll for a few minutes and my buddy hits up a guy with a username something  to the effect of Hungry Hole. He decided to hit him up because he hinted to having what we were looking for in his bio. Almost like a miracle, within minutes we have this guy agreeing to meet my friend at the Burger King that is within walking distance of our hotel.\n\nMy friend heads to the Burger King and I stay put. The guy shows up and hands my friend a bag that feels like it's full of rocks. My friend looks inside and sees that he was just handed a fist full of meth, which wasn't the requested substance. Hungry Hole acknowledges he brought the wrong thing, but in the end he says \"dope is dope man,\" and is getting heated with my friend, and is insisting on still making the deal.\n\nMy friend threw the fist full of meth at Hungry Hole, and literally told him his hole could *starve*", "2_Subreddit": "AskReddit"}], "dw0y4av": [{"0_Comment Submission": "Gay men of Reddit, what are your Grindr horror stories?", "1_Text": "he had no intention of having sex with anybody, but I should have cleared that up", "2_Subreddit": "AskReddit"}], "dw0y4qm": [{"0_Comment Submission": "Gay men of Reddit, what are your Grindr horror stories?", "1_Text": "because he mixed up \"snow\" and \"ice\"", "2_Subreddit": "AskReddit"}], "dw2syn9": [{"0_Comment Submission": "Lane 8 - \"This Never Happened\" Shows", "1_Text": "I saw him at the Mishawaka Ampitheatre in the mountains in Colorado. It was amazing. I never even wanted to reach for my phone anyway. The only thing I wish I could've taken a picture of was when his wife came out with his baby. I was making  faces at her and making her laugh. Cute kid. Going to see him again Friday night in Denver.\n\nIt also makes me feel like my recordings of him at Phoenix Lights are rare footage, haha.", "2_Subreddit": "AboveandBeyond"}], "dwfhryk": [{"0_Comment Submission": "ROONEY MARA ♡ I have the biggest fucking crush on this absolutely adorable human being and I had to share this pic I found. *gay scream*", "1_Text": "So many queer characters from her too", "2_Subreddit": "actuallesbians"}], "dwfvose": [{"0_Comment Submission": "Listen to us, your fans...", "1_Text": "To be fair, they're touring an album.\n\nWhen I saw them in Providence, RI, they dropped Salva Mean 2.0, Black Room Boy, etc and it was amazing.", "2_Subreddit": "AboveandBeyond"}], "dwis3hf": [{"0_Comment Submission": "People who have 'infamous' medical conditions (Cancer, Schizophrenia, OCD, MS etc), what do people assume about you and your condition, but not truly understand?", "1_Text": "I have a schizophrenic spectrum disorder. A lot of people assume any illusion, strange thought, or hallucination would be accepted as reality for someone with a schizophrenic spectrum disorder, but about 99.9% of what I experience is shrugged off and completely disregarded. It's like being neurotypical with funny little obstacles in the way.", "2_Subreddit": "AskReddit"}], "dwj8jvh": [{"0_Comment Submission": "People who have 'infamous' medical conditions (Cancer, Schizophrenia, OCD, MS etc), what do people assume about you and your condition, but not truly understand?", "1_Text": "only if something is extremely surreal.", "2_Subreddit": "AskReddit"}], "dwkig7m": [{"0_Comment Submission": "Alyson Stoner on embracing (her) sexuality.", "1_Text": "I knew it", "2_Subreddit": "actuallesbians"}], "dwwg60a": [{"0_Comment Submission": "Just relapsed after almost 10 months clean", "1_Text": "Recovery culture teaches a lot of toxic concepts. They teach you you're an addict because of spiritual self centeredness, not an underlying issue. Relapse is a mortal sin and like someone else said, they act like all your time sober is a thing of the past and out the window.\n\nAnd the concept that addicts don't deserve respect and trust from those around them because of a relapse is also disgusting.\n\nRelapses happen. They really just do. They happen all the time. You're working towards bettering yourself, and that's all that matters. Stay away from benzos before you have a bad seizure and fatally hit your head on something or some shit. Pills are a waste of money. Get back the best you can and keep growing.", "2_Subreddit": "opiates"}], "dwy1ccg": [{"0_Comment Submission": "If you could have an opiate-sesh with anybody, dead or alive, who would it be and why?", "1_Text": "Deborah Harry.", "2_Subreddit": "opiates"}], "dwyfhdy": [{"0_Comment Submission": "Day Off Vibes.", "1_Text": "5280?", "2_Subreddit": "DrugStashes"}]}], "1_submissions": [{"509dl0": [{"0_Title": "the number one issue with plugging", "1_Text": "I live in Denver, and I love the DPL! Good on them.", "2_Subreddit": "opiates"}], "59zm84": [{"0_Title": "liquid pill porn", "1_Text": "I live in Denver, and I love the DPL! Good on them.", "2_Subreddit": "opiates"}], "5c3ibs": [{"0_Title": "I think this was supposed to be a joke but I relate", "1_Text": "I live in Denver, and I love the DPL! Good on them.", "2_Subreddit": "opiates"}], "5epuqb": [{"0_Title": "beat this tonsil stone. this thing is collasal and came out of the tonsil that usually doesn't have stones.", "1_Text": "I live in Denver, and I love the DPL! Good on them.", "2_Subreddit": "tonsilstones"}], "5zna9w": [{"0_Title": "shitpost: when the oxys/hydros/morphs hit you", "1_Text": "I live in Denver, and I love the DPL! Good on them.", "2_Subreddit": "opiates"}], "602llq": [{"0_Title": "My 2x Great Grandfather Serving Poland Under Austria-Hungary, Late 1800s", "1_Text": "I live in Denver, and I love the DPL! Good on them.", "2_Subreddit": "OldSchoolCool"}], "602n17": [{"0_Title": "My 2x Great Grandmother & Her Sisters In Austria-Hungary Circa 1890s", "1_Text": "I live in Denver, and I love the DPL! Good on them.", "2_Subreddit": "OldSchoolCool"}], "65bf46": [{"0_Title": "Month of Regular Xanax Use Withdrawal Fears", "1_Text": "I live in Denver, and I love the DPL! Good on them.", "2_Subreddit": "benzodiazepines"}], "65ub7g": [{"0_Title": "Fake Percocets - M523 10/325", "1_Text": "I live in Denver, and I love the DPL! Good on them.", "2_Subreddit": "opiates"}], "6l1a0m": [{"0_Title": "Dont Taste So Good", "1_Text": "I live in Denver, and I love the DPL! Good on them.", "2_Subreddit": "trashy"}], "722gyx": [{"0_Title": "Hurtin For Some Cash Y'all", "1_Text": "I live in Denver, and I love the DPL! Good on them.", "2_Subreddit": "trashy"}], "722nzv": [{"0_Title": "Hurtin For Some Cash", "1_Text": "I live in Denver, and I love the DPL! Good on them.", "2_Subreddit": "trashy"}], "7hcswq": [{"0_Title": "I Need Help Figuring Out Why I'm Finnish", "1_Text": "I live in Denver, and I love the DPL! Good on them.", "2_Subreddit": "Geneology"}], "7ilrzm": [{"0_Title": "Driving for Postmates is Worth it in Denver. Only Haven't Been Tipped Once or Twice.", "1_Text": "I live in Denver, and I love the DPL! Good on them.", "2_Subreddit": "postmates"}], "7x2zut": [{"0_Title": "Dealing With Dboys as a Female", "1_Text": "I live in Denver, and I love the DPL! Good on them.", "2_Subreddit": "opiates"}], "7x3dc6": [{"0_Title": "Was Just Made Aware of an Account Inherited & Hidden by My Uncle", "1_Text": "I live in Denver, and I love the DPL! Good on them.", "2_Subreddit": "personalfinance"}], "7x3g58": [{"0_Title": "Was Just Made Aware of Accounts Inherited & Hidden By My Uncle", "1_Text": "I live in Denver, and I love the DPL! Good on them.", "2_Subreddit": "legaladvice"}], "85z9t4": [{"0_Title": "Cody Loves His Bubbles", "1_Text": "I live in Denver, and I love the DPL! Good on them.", "2_Subreddit": "bichonfrise"}], "8agayi": [{"0_Title": "A REALLY Good Day Several Years Ago..", "1_Text": "I live in Denver, and I love the DPL! Good on them.", "2_Subreddit": "DrugStashes"}]}]}]}