{"brand21new": [{"0_comments": [{"dwdlfdp": [{"0_Comment Submission": "Shampoo dispenser in shower.", "1_Text": "I don't get it.. All my past rehabs have had this in their shower. I kinda thought it was a requirement to supply it in a facility?", "2_Subreddit": "lifehacks"}], "dwdlzpj": [{"0_Comment Submission": "3 generations of soap bars. My mum raised 5 boys as a single parent after my dad left, I often wonder how she managed it. We have all left the roost now, but old habits die hard...", "1_Text": "I've had my bottle of Dove soap for 4 months. Running low now but I can't believe I had the same bottle for this long. It kind of makes me wonder if I'm showering wrong..", "2_Subreddit": "Frugal"}], "dwfruk4": [{"0_Comment Submission": "I'm on probation for drugs and alcool question", "1_Text": "Just don't use. Period.", "2_Subreddit": "Drugs"}], "dwgzx46": [{"0_Comment Submission": "People of reddit, have you ever killed anyone? If so, under what circumstances?", "1_Text": "Whew, if you only knew my story...", "2_Subreddit": "AskReddit"}], "dwgzyay": [{"0_Comment Submission": "Why would someone talk about their B cups saying they are double Ds when it is obvious they are not?", "1_Text": "I like you.", "2_Subreddit": "AskReddit"}], "dwh0050": [{"0_Comment Submission": "How do you make friends as an adult?", "1_Text": "Go to rehab a few times, meet people in jail. That's pretty much what I do.", "2_Subreddit": "AskReddit"}], "dwh0dga": [{"0_Comment Submission": "Super obese people, how do you pay for it all?", "1_Text": "You can buy a giant package of those cream sandwich cookies, the ones like Oreos, for $1, maybe $1.50 at Walmart. It's like twice as many cookies as a package of Oreos.", "2_Subreddit": "AskReddit"}], "dwh0fui": [{"0_Comment Submission": "Super obese people, how do you pay for it all?", "1_Text": "Food stamps as well.", "2_Subreddit": "AskReddit"}], "dwhg4q7": [{"0_Comment Submission": "Instead of a wedding ring, what would you get instead?", "1_Text": "Rent/mortgage. If we want to get for real for real though, heroin. But that's not an option..", "2_Subreddit": "AskReddit"}], "dwhjbpn": [{"0_Comment Submission": "What local music from your country do you love that hasn’t gotten much exposure anywhere else in the world?", "1_Text": "They from buffalo or Canada?", "2_Subreddit": "AskReddit"}], "dwhkfz7": [{"0_Comment Submission": "What sucked most about puberty for you?", "1_Text": "Sweating. My armpits were horrible, and nothing helped. It wasn't because I was warm, it was any time, all time. I wore layers to try and lessen the pit stains, didn't work. I sweat through it all. I remember in 5th grade going to the bathroom a lot to change paper towels under my arms or trying to blow dry them. Horrible! I remember not smelling amazing, deodorant helped as far as the smell, I reapplied a plethora of different scented deodorants during the day, but wasn't competently prefect. I believe I went to a doctor, and found Certain Dri. I think that's when things got better.\n\nI had early puberty and was taking shots to hold off on it, so I was kinda messed up from 3rd grade to like, 7th?", "2_Subreddit": "AskReddit"}], "dwhkjmq": [{"0_Comment Submission": "What sucked most about puberty for you?", "1_Text": "I'm 24 and could pass as 16. In jail when I got my hair in a braid and looking scummy and no makeup, I could literally pass as 12.", "2_Subreddit": "AskReddit"}], "dwifcny": [{"0_Comment Submission": "Another one of these - Drug testing", "1_Text": "Halfway house. Which is then sent to my federal probation", "2_Subreddit": "opiates"}], "dwittku": [{"0_Comment Submission": "Epidem-myass", "1_Text": "haaaaaaa", "2_Subreddit": "opiates"}], "dwjmuei": [{"0_Comment Submission": "Who is the black sheep of your family and why?", "1_Text": "Me because I'm the heroin addict in and out of jails and rehab. My family is straight suburban, white upper middle class. My parents thought heroin and meth were the same thing before they found out i was using.", "2_Subreddit": "AskReddit"}], "dwjq647": [{"0_Comment Submission": "Drug test for work on Monday morning and I CANNOT lose this job!! Help?", "1_Text": "What the test? 5 panel, unsupervised? Dips tick? \n\nMy experience within the same time frame is yes, passed. But, your results may vary, I cannot know for you for sure. Absolutely do not use anymore. They may not test for subs, if that's a help for you.", "2_Subreddit": "opiates"}], "dwklut6": [{"0_Comment Submission": "Gabapentin and Suboxone", "1_Text": "First three days, I took a handful of gabapentin and a 1. 5mg ativan /day and was fine. Day 4 came and I was so anxious because I had to stop my benzos, took a few MG of sub and a few gabapentin (not much) and was a lot better. I'd say I was good enough to go out and do things for my little week of WD. I swear by gabapentin for a lot of things. Love it. I've never been one for subs, just took probably 5 mg/day this withdrawal, worked for me. So,  a moderate amount of a benzo, maybe some clonidine or stomach med, sub, and you'll be good. I like to wrap myself up so I can sweat as much as possible through the night. For me, after a night, I no longer get the chill/hot flip. Not perfect but I don't expect withdrawal to ever be. I stayed in bed because I could but I think I'd be fine if I had gone about my normal day.", "2_Subreddit": "opiates"}], "dwo4szo": [{"0_Comment Submission": "Woke up w/ bump on forehead, been growing slowly. Have no idea what it is. Is it Staph??", "1_Text": "What's the verdict?", "2_Subreddit": "popping"}], "dwper1b": [{"0_Comment Submission": "Mental crush with no physical urges. Happened to anyone else and how because its fucking with my brain??", "1_Text": "This is kinda what's going on with me and I don't know what to think of it.", "2_Subreddit": "AskReddit"}], "dwquxrq": [{"0_Comment Submission": "What's your favorite element of the periodic table?", "1_Text": "Is this a pickup line?", "2_Subreddit": "AskReddit"}], "dwsdv7b": [{"0_Comment Submission": "If you could guarantee one other person a place in Heaven, who would it be, and why?", "1_Text": "My mom. Because she's my mom.\n\nEnd of thread.", "2_Subreddit": "AskReddit"}], "dwse2le": [{"0_Comment Submission": "If you could magically transform ONE aspect of yourself, changing it in any way you wish, what would you change about yourself and why?", "1_Text": "My social anxiety, which stems from fear of judgement and low self esteem. I don't talk to people, I don't have much interest in people. My mom taught me to sit down, feel no emotion. Raised me to be quiet and distant from people.", "2_Subreddit": "AskReddit"}], "dwu8xw0": [{"0_Comment Submission": "Recently found a photo of my grandfather (in the suit) from the late 40s with some friends. Cooler than I will ever be.", "1_Text": "Men used to all be so good looking back then.", "2_Subreddit": "OldSchoolCool"}], "dww301a": [{"0_Comment Submission": ":(", "1_Text": "Find a doctor. Set up short term goals and work to meet them.\n\nStay positive and utilize the ones that love you and support you.", "2_Subreddit": "depression"}], "dwxbr3p": [{"0_Comment Submission": "What guilty thoughts do you have but don't express?", "1_Text": "I want to have multiple one night stands.\n\nSometimes I feel I want to hurt other people. Emotionally. I want to yell at them and get them sad.", "2_Subreddit": "AskReddit"}]}], "1_submissions": [{"7zsybi": [{"0_Title": "For those that have been in an institution for a decent period of time. How did you deal with entering in the real world again?", "1_Text": "I don't get it.. All my past rehabs have had this in their shower. I kinda thought it was a requirement to supply it in a facility?", "2_Subreddit": "AskReddit"}], "802ykn": [{"0_Title": "Convincing myself that anyone that leaves my life is now dead", "1_Text": "I don't get it.. All my past rehabs have had this in their shower. I kinda thought it was a requirement to supply it in a facility?", "2_Subreddit": "BPD"}], "82c527": [{"0_Title": "You have 10 seconds to think of a tattoo you HAVE to get. What do you choose?", "1_Text": "I don't get it.. All my past rehabs have had this in their shower. I kinda thought it was a requirement to supply it in a facility?", "2_Subreddit": "AskReddit"}], "85t6u6": [{"0_Title": "I live in a drug and alcohol halfway house and have to spend the next 4 hours sitting at the laundry mat, while our house gets sprayed for bed bugs! Please AMA.", "1_Text": "I don't get it.. All my past rehabs have had this in their shower. I kinda thought it was a requirement to supply it in a facility?", "2_Subreddit": "AMA"}], "886gca": [{"0_Title": "Another one of these - Drug testing", "1_Text": "I don't get it.. All my past rehabs have had this in their shower. I kinda thought it was a requirement to supply it in a facility?", "2_Subreddit": "opiates"}], "8ablpw": [{"0_Title": "In today's world, do you think it's worse to be a girly-man, or a manly-girl?", "1_Text": "I don't get it.. All my past rehabs have had this in their shower. I kinda thought it was a requirement to supply it in a facility?", "2_Subreddit": "AskReddit"}]}]}]}