{"jdl348": [{"0_comments": [{"dwjnp9o": [{"0_Comment Submission": "Do mail delivery vehicles have to meet the same crash safety requirements as civilian vehicles?", "1_Text": "Those [USPS trucks are up to 30 years old.](https://en.wikipedia.org/wiki/Grumman_LLV) Here in the state of Missouri they would qualify as an [antique vehicle](http://dor.mo.gov/motorv/historic.php), so yeah they don't meet *modern* safety standards by any means.", "2_Subreddit": "NoStupidQuestions"}], "dwp9fta": [{"0_Comment Submission": "Can someone number the order of steps for me?", "1_Text": "I can see your comment?", "2_Subreddit": "cocaine"}], "dwpjo1j": [{"0_Comment Submission": "Older Redditors: What do you miss most about the 90s?", "1_Text": "\"Dude that's so gay!\" Used to a jab at your buddy, now it's a one way ticket to social suicide.", "2_Subreddit": "AskReddit"}], "dwpk3kd": [{"0_Comment Submission": "Other than stubbing your toe on the edge of a corner what’s the worst accidental pain ever?", "1_Text": "55 comments and nobody has mentioned getting hit in the balls? It's terrible guys, the worst... It's a lingering progressive pain.", "2_Subreddit": "AskReddit"}], "dwrfq16": [{"0_Comment Submission": "The SR-71 Blackbird is 1960's technology. Military technology is now most likely advanced enough to stage an extraterrestrial false flag.", "1_Text": "I've talked before on Reddit (buried in my comments) about when me and a group of friends saw a TR-3B near Rogersville, Missouri. It was the craziest thing in my life. It hovered just a few hundred feet in the air, turned over to it's side and zipped away in the blink of an eye. Unworldly... For years I would draw pictures of it trying to describe it to others and one day I saw its image come on an Ancient Aliens episode. I about shit myself, I didn't realize other people had heard or seen of these.\n\nEdit: [Found my old comment](https://np.reddit.com/r/AskReddit/comments/6f6l8s/what_do_you_swear_you_saw_but_dont_have_any_proof/dig660h) Added NP automod", "2_Subreddit": "conspiracy"}], "dwthifq": [{"0_Comment Submission": "Ned Reynolds fired from his radio Show", "1_Text": "Sorry to bore you with a long story but just trying to show some credibility... my grandfather passed away two years ago and now my grandmother has found a new boyfriend, he's a Sertoma member and Shriner and apparently good buddies with Ned Reynolds. First thing he told me about Ned Reynolds is \"That man likes a bottle of whiskey!\" Come to think of it that's the first and only thing he really said about Ned Reynolds.", "2_Subreddit": "springfieldMO"}], "dwtpm5y": [{"0_Comment Submission": "Moving companies?", "1_Text": "That's 1 or 2 too many things broken. If I hire a moving company it's because I trust professionals not to break my shit. I've moved three times in the last 6 years and don't remember breaking anyting. I don't think there's much of an excuse for the paid professionals to be breaking my stuff.", "2_Subreddit": "springfieldMO"}], "dwtpshh": [{"0_Comment Submission": "I'm Eric Hafner, I'm running for U.S. Congress in Portland, Oregon (OR-3). I want to legalize all drugs, including opiates, but offer ibogaine therapy too, and free drugs for addicts via prescription.", "1_Text": "But what's your number Eric because big Pharma will always find your number and write the checks. If your number is too high then I would expect a \"mysterious suicide\" in your future.", "2_Subreddit": "opiates"}], "dwtqwr2": [{"0_Comment Submission": "I'm Eric Hafner, I'm running for U.S. Congress in Portland, Oregon (OR-3). I want to legalize all drugs, including opiates, but offer ibogaine therapy too, and free drugs for addicts via prescription.", "1_Text": "Damn it I don't know what I was expecting as a response but I don't think you could have said anything better. Good luck and Godspeed!", "2_Subreddit": "opiates"}], "dwtrfd8": [{"0_Comment Submission": "Normal repair of a historical bridge (Kaliningrad)", "1_Text": "Craziest thing I just learned about Kaliningrad for the first time today! I had no idea there was a separate area of land in Europe that is technically still Russia but not attached to Russia. Someone mentioned the Blue Banana in Europe and so I pulled up a map of Europe and I was looking at all the countries cuz I'm not familiar with the smaller countries and I saw this little area of land and it said Russia and I was like \"what the fuck that ain't Russia!\" and here I am looking at this post reminds me of the rabbit hole I went in earlier just this day. Also  baader-meinhof phenomenon I guess...", "2_Subreddit": "ANormalDayInRussia"}], "dwtsmur": [{"0_Comment Submission": "Normal repair of a historical bridge (Kaliningrad)", "1_Text": "Oh I did I just didn't want my rant to going any longer but I learned how the Teutonic Knights basically established the city in the 13th century and Russia basically said fuck you Germany for World War 2 we're going to take this land if you want peace and then and kicked all the Germans out within the next four years.", "2_Subreddit": "ANormalDayInRussia"}], "dwtuiau": [{"0_Comment Submission": "I may have won a Galaxy S9", "1_Text": "I mean if it gives you peace of mind when I was working at T-Mobile around 9 months ago we all had tester phones shared amongst the team so if I needed to use the latest LG or iPhone or Samsung or whatever I just pulled it out of a box.", "2_Subreddit": "tmobile"}], "dwvsm8t": [{"0_Comment Submission": "Video about diverging diamonds. made by a fellow springfieldian.", "1_Text": "My same thoughts, his subscriber count was damn near half a million that's impressive!", "2_Subreddit": "springfieldMO"}], "dwvticx": [{"0_Comment Submission": "'The Office' Characters' Most Distinguishing Words [OC]", "1_Text": "Nice graph! Though as someone who's never watched The Office and only knows it from Reddit and such, why the heck isn't Steve Carell in the last season that's who I think of when I hear of The Office?", "2_Subreddit": "dataisbeautiful"}], "dwvtqkq": [{"0_Comment Submission": "LPT: When trying to figure out the age of someone in a specific grade, simply add 5 to the grade. This also works in reverse when trying to figure out what grade someone is in, subtract 5 from their age.", "1_Text": "Same for America I was 18 my whole senior year but it was close enough I guess.", "2_Subreddit": "LifeProTips"}], "dwvw2ef": [{"0_Comment Submission": "What are some underrated movies?", "1_Text": "Inside Llewellyn Davis. All the other Coen Brothers films are pretty well-known but this I think is one of their best and doesn't seem to have much of a following.", "2_Subreddit": "AskReddit"}], "dwvwofn": [{"0_Comment Submission": "Aren’t music festivals wonderful?", "1_Text": "Good bot. Definitely is literally the only word I think I have trouble spelling on a  weekly basis", "2_Subreddit": "funny"}], "dwvx6y4": [{"0_Comment Submission": "A thief has 3 minutes in your house with nobody home to steal as much as they can get. What’s the value of their loot?", "1_Text": "They'd get my mean ass Pitbull chomping on their ass.", "2_Subreddit": "AskReddit"}], "dwvxnsr": [{"0_Comment Submission": "Well if she moves to Oregon she won't have this problem.", "1_Text": "Or learn to be a damn adult.", "2_Subreddit": "Whatcouldgowrong"}], "dwxr5jw": [{"0_Comment Submission": "I have never done any opiates. I've been browsing this sub for ~2 hours now.", "1_Text": "Now go over to r/quittingkratom and make sure never to touch that shit either. I've kicked opiates amphetamines booze and weed but I can't kick kratom...", "2_Subreddit": "opiates"}], "dwxra0k": [{"0_Comment Submission": "More realistic than fortnite", "1_Text": "Not out of view they were literally stored on gun racks on the back glass of your truck.", "2_Subreddit": "gaming"}], "dwxsfz1": [{"0_Comment Submission": "I have never done any opiates. I've been browsing this sub for ~2 hours now.", "1_Text": "Yeah I guess so low reward but pain and sufferable withdraws.", "2_Subreddit": "opiates"}], "dwxsi3d": [{"0_Comment Submission": "More realistic than fortnite", "1_Text": "Well there's no way in hell anybody's taking their guns to school in gun racks any longer but as you'll see in these comments it was small town rule communities where you didn't really have to worry about crazy people.", "2_Subreddit": "gaming"}], "dwy2c4j": [{"0_Comment Submission": "Young Cameron Diaz", "1_Text": "The lack of eyebrows back then is such a turn off for me.", "2_Subreddit": "gentlemanboners"}], "dwy34q8": [{"0_Comment Submission": "high life night life", "1_Text": "I don't drink anymore but when I did drink I only drank the high life! People say \"Gross, why?\"and I tell them \"It's the only good beer I could get in a 40 ounce bitches!\"", "2_Subreddit": "Vaping"}]}], "1_submissions": [{"60xlkk": [{"0_Title": "Packaging the meds.", "1_Text": "Those [USPS trucks are up to 30 years old.](https://en.wikipedia.org/wiki/Grumman_LLV) Here in the state of Missouri they would qualify as an [antique vehicle](http://dor.mo.gov/motorv/historic.php), so yeah they don't meet *modern* safety standards by any means.", "2_Subreddit": "kratom"}], "66jmul": [{"0_Title": "The S8 does not pass the drop test apparently.", "1_Text": "Those [USPS trucks are up to 30 years old.](https://en.wikipedia.org/wiki/Grumman_LLV) Here in the state of Missouri they would qualify as an [antique vehicle](http://dor.mo.gov/motorv/historic.php), so yeah they don't meet *modern* safety standards by any means.", "2_Subreddit": "techsupportgore"}], "6w8ytz": [{"0_Title": "Where's a place to throw darts?", "1_Text": "Those [USPS trucks are up to 30 years old.](https://en.wikipedia.org/wiki/Grumman_LLV) Here in the state of Missouri they would qualify as an [antique vehicle](http://dor.mo.gov/motorv/historic.php), so yeah they don't meet *modern* safety standards by any means.", "2_Subreddit": "springfieldMO"}], "72d2d1": [{"0_Title": "Perfect 180 (2486x3314)", "1_Text": "Those [USPS trucks are up to 30 years old.](https://en.wikipedia.org/wiki/Grumman_LLV) Here in the state of Missouri they would qualify as an [antique vehicle](http://dor.mo.gov/motorv/historic.php), so yeah they don't meet *modern* safety standards by any means.", "2_Subreddit": "wallpapers"}], "72k2nt": [{"0_Title": "Home setup has finally been made.", "1_Text": "Those [USPS trucks are up to 30 years old.](https://en.wikipedia.org/wiki/Grumman_LLV) Here in the state of Missouri they would qualify as an [antique vehicle](http://dor.mo.gov/motorv/historic.php), so yeah they don't meet *modern* safety standards by any means.", "2_Subreddit": "Darts"}]}]}]}