{"BadManJefe": [{"0_comments": [{"dwerdsv": [{"0_Comment Submission": "ULPT: See a dog shitting on your lawn? Throw a small petard under its ass.", "1_Text": "Throw a small bomb from the 17th century at the dog?", "2_Subreddit": "UnethicalLifeProTips"}], "dwets7s": [{"0_Comment Submission": "Therapists of Reddit, what made you realize you were treating a sociopath?", "1_Text": "Yea I was surprised to see you married after only being together a year. If you didn’t have strong emotions for him why did you accept his proposal?", "2_Subreddit": "AskReddit"}], "dwfiqt5": [{"0_Comment Submission": "What’s your honest opinion about Tinder?", "1_Text": "If I was single I wouldn’t use it. It seems fine for girls to use, but it’s terrible for guys. The least important aspect for a guys chances with a girl is how he looks in a couple pictures. Guys win girls over with humor, wit, and charm which are all dulled or lost completely with Tinder.", "2_Subreddit": "AskReddit"}], "dwgpdh6": [{"0_Comment Submission": "I hate weed", "1_Text": "If he’s trippin that hard over $20 then you might reach out to him about possibly having a drug problem. Xans are super addictive, and if you’re noticing big changes in his mood while on them that’s a red flag.\n\nOr you could just be 15 years old, and $20 is what your mom will give you for the entire weekend like mine did lol", "2_Subreddit": "Drugs"}], "dwiu6l8": [{"0_Comment Submission": "How sure are we that society hasn't existed for millions of years and is now in the stage of total control, fooling us with mis-informations?", "1_Text": "Well I think that if you consider how the population has grown just in our lifetime, if society had been around for millions of years there would be far less free space on earth.", "2_Subreddit": "AskReddit"}], "dwnxija": [{"0_Comment Submission": "What would you do if your best friend was in the military", "1_Text": "The military is just a job like any other. This is like asking “what would you do if your best friend worked at McDonald’s?” You continue to be their best friend, and give them the support they need while deployed.", "2_Subreddit": "Anarchism"}], "dwnxsb2": [{"0_Comment Submission": "What would you do if your best friend was in the military", "1_Text": "It’s not anyone’s job to “murder innocent people”. If you feel this strongly about what your best friend is doing, then how have you two not already discussed this?", "2_Subreddit": "Anarchism"}], "dwo0j2z": [{"0_Comment Submission": "I think I fucked up.", "1_Text": "It’s gonna be close for sure. Piss as many times as you possibly can before the test. You probably already know this but, DO NOT LET THE TEST BE YOUR FIRST PISS OF THE DAY! Good luck, man.", "2_Subreddit": "opiates"}], "dws2gu0": [{"0_Comment Submission": "So I had a batch that was included in the FDA recall and I'm just confused.", "1_Text": "I would contact the vendor, and let them know you’d like a refund. How did you find out it was recalled? If you weren’t notified by the vendor, then I would tell them they need to let all of their customers know immediately or that you will. \n\nThis goal of this salmonella scare is to fast track the banning of Kratom. If retailers are acting like a bunch of shady drug dealers by not letting customers know about the recall, then they’re going to be treated like drug dealers.", "2_Subreddit": "kratom"}], "dws2m9p": [{"0_Comment Submission": "Anyone know what these red pills are?", "1_Text": "The stool softener I take looks exactly like that lmao", "2_Subreddit": "opiates"}], "dws3pbr": [{"0_Comment Submission": "My biggest fear", "1_Text": "In my opinion the most important thing you can do is to keep communication open. Give her amnesty if she comes to you and talks about whatever is going on no matter how bad it is. Things are so different now than when I was growing up, and hard drugs are not a taboo like they used to be.\n\nI think your biggest fear shouldn’t be if she becomes addicted to something, but rather if she becomes addicted and feels so isolated that she can’t talk to anyone about it. Addictions can be cured fairly easily early on, but become much more difficult as time goes on.", "2_Subreddit": "opiates"}], "dws4m92": [{"0_Comment Submission": "In love with a user", "1_Text": "Yea this is the first thing that came to my mind. OP, you could potentially get yourself killed if you keep messing around with this girl. The possibility of her setting you up to get robbed by her boyfriend is very real. Fuck ups like her boyfriend usually end up killing the person they try to rob.\n\nYou have a good heart, and you’re attracted to the danger of it all; Don’t let that get you killed.", "2_Subreddit": "opiates"}], "dwsa3p8": [{"0_Comment Submission": "Need help!", "1_Text": "So you’re going to try a new drug in a setting where if you’re caught there will be negative repercussions? And you want us to tell you how you’re going to react to it?\n\nSeriously?", "2_Subreddit": "Drugs"}], "dwsakda": [{"0_Comment Submission": "why do people have become nerds when they use drugs?", "1_Text": "So you have a problem with people asking harm reduction questions, and sharing experiences related to harm reduction? And you don’t like what some people enjoy doing while they’re high? And you used the most condescending sounding form of broken English to share your viewpoint? \n\nNo.", "2_Subreddit": "Drugs"}], "dwtmnee": [{"0_Comment Submission": "This whole \"disposable plastic bad\" circlejerk will be completely forgotten about in 6 months", "1_Text": "Idk man I’ve seen it catching on in places I wouldn’t have ever expected. My dope dealer only uses post consumer sustainably sourced and biodegradable opossum nut sacks to bag up all my shit now. Even when I complained about the amount of hair I keep finding in my shit he wasn’t tryna hear it.", "2_Subreddit": "unpopularopinion"}], "dwtmte5": [{"0_Comment Submission": "as an extremely depressed usually sad person i find that positivity is so amazing", "1_Text": "It would be extremely positively amazing if you threw in a period every now and then during your stream of consciousness.", "2_Subreddit": "Drugs"}], "dwtnkht": [{"0_Comment Submission": "Ounce in NorCal $?", "1_Text": "This is one of those questions that if you don’t already know the answer to then you shouldn’t be asking.", "2_Subreddit": "cocaine"}], "dwtzy70": [{"0_Comment Submission": "Taken from the Latest Drama with Channel Awesome", "1_Text": "Damn you beat me to it!", "2_Subreddit": "sadcringe"}], "dwvtg62": [{"0_Comment Submission": "Lula getting jailed is another proof of how Obama and the Democrat Party are tied with worldwide corruption", "1_Text": "What are the “big ties” Obama had that would suggest he was aware of criminal activity?", "2_Subreddit": "unpopularopinion"}], "dwwkjgc": [{"0_Comment Submission": "gay people are gross because they engage in anal sex", "1_Text": "How is it any different from sticking your penis up a vagina?", "2_Subreddit": "unpopularopinion"}], "dwwkmyg": [{"0_Comment Submission": "gay people are gross because they engage in anal sex", "1_Text": "Piss, blood, and a lot of other types of discharge comparable to shit comes out of vaginas. Explain why you think that’s why many people have aids.", "2_Subreddit": "unpopularopinion"}], "dwwkssr": [{"0_Comment Submission": "gay people are gross because they engage in anal sex", "1_Text": "You said anal sex is why so many gay people have aids, and that article doesn’t say that. Anal sex is not why there was an aids epidemic in the gay community.", "2_Subreddit": "unpopularopinion"}], "dwwl5uo": [{"0_Comment Submission": "gay people are gross because they engage in anal sex", "1_Text": "Comparable in terms of how gross it is. Yes, it comes out of the urethra but still looks like it’s coming out of the vagina. To the observer, it’s not obviously coming out of a different hole like poop does.", "2_Subreddit": "unpopularopinion"}], "dwwlfqg": [{"0_Comment Submission": "Premade east coast stamp bags, opinions on them?", "1_Text": "Whenever I get a graphic bag I know it’s going to be trash. Usually just fent.", "2_Subreddit": "opiates"}], "dwx9jff": [{"0_Comment Submission": "gay people are gross because they engage in anal sex", "1_Text": "I honestly don’t think period blood is gross at all, but it was more to argue with OPs dumb ass logic.", "2_Subreddit": "unpopularopinion"}]}], "1_submissions": [{}]}]}