{"Ddddooope": [{"0_comments": [{"dv9hsio": [{"0_Comment Submission": "My gf is coming off a year long drug binge and she’s not happy about it", "1_Text": "Ive been keeping a schedule to it for the last month, i don't go back and forth quickly, i have a week between usage. The last week of the month i don't use bc i have my appointment with my doctor.", "2_Subreddit": "opiates"}], "dvar1ah": [{"0_Comment Submission": "My gf is coming off a year long drug binge and she’s not happy about it", "1_Text": "It might be harder in other states, and I know doctors have limits, but theres tons of drs in my area. No ones on a waiting list becaise they can't find a dr. Usually people have a hard time coming up with the 300 cash for the first visit.", "2_Subreddit": "opiates"}], "dveek9k": [{"0_Comment Submission": "My dad in \"jail\" around 1992", "1_Text": "I read 1922 and was very confused for a minute.", "2_Subreddit": "OldSchoolCool"}], "dvef5r6": [{"0_Comment Submission": "Stole off r/drugmemes", "1_Text": "At first dope was awesome, it was like I was a God in bed. Then slowly my dick stopped working. Then I got sober and was with the same girl. Withdrawal dick is the worst. Literally 30 seconds is all you get, plus all the shame in the world. Now I'm on suboxone. It is weird. Some days i have a normal dick, some days a just barely hard dick, and other days the good ol everlasting opiate dick.", "2_Subreddit": "opiates"}], "dvefdc2": [{"0_Comment Submission": "Stole off r/drugmemes", "1_Text": "Sex when i had a decent habit, but not shooting yet, was lots and lots of oral, cuddling, and foreplay. I never got off, while my ex always did... I had to be happy with what I got and perform to my best ability haha", "2_Subreddit": "opiates"}], "dvinoya": [{"0_Comment Submission": "TIL the show Portlandia was banned from a feminist bookstore in Portland for their skits. They claimed that Fred Armisen's dressing as a woman was derogatory mockery towards trans women. They're no longer welcome to film in the location.", "1_Text": "And they won't admit they put it up, a volunteer put it up lol", "2_Subreddit": "todayilearned"}], "dvl4hqp": [{"0_Comment Submission": "Cast", "1_Text": "I had a boot after a cast but that was years ago (2007), I had the foot touched up i guess in 2017 to remove pain, but it did jack shit. That time was a real light cast and a boot. I shattered 4 metatarsals and snapped my talus. In north carolina, in 2007, so they showered me with painkillers.", "2_Subreddit": "funny"}], "dvqsgwh": [{"0_Comment Submission": "How Many Opioid Overdoses Are Suicides?", "1_Text": "\"You also feel like you'll be doing everyone else a favor if you die.\"\n\n\nYup :(\n\nI've od'd 3 times. After the first time they started asking if I'm suicidal. EMTs and police started being way nicer and telling me all the things i have to live for. I've never intentionally od'd, sometimes you just stop giving a shit.", "2_Subreddit": "opiates"}], "dw3puvi": [{"0_Comment Submission": "Ain't that the truth!", "1_Text": "Yea sometimes...other times you poke yourself a million times with a dull needle and curse God for your existence.", "2_Subreddit": "opiates"}], "dw3t00n": [{"0_Comment Submission": "What's a song you like that's over 4 minutes long?", "1_Text": "The decline - nofx\nHeroin - lou reed\nKthdr - the flatliners", "2_Subreddit": "AskReddit"}], "dw6wi67": [{"0_Comment Submission": "Whelp", "1_Text": "More like i spent all my money on drugs and now im doing gift card return scams, panhandling, and middling. Then pay the rent 2 weeks late an $100 short.", "2_Subreddit": "opiates"}], "dwfdie1": [{"0_Comment Submission": "My back is killing", "1_Text": "From what I read you can eat them cause the naloxone doesn't work orally. But don't sniff/iv especially if you got a habit", "2_Subreddit": "opiates"}], "dwgaqi8": [{"0_Comment Submission": "Jesus fucking Christ. “The Doctors” show is stalking about narcan parties..", "1_Text": "Back in my day we had narcan rainbow partys. Shit was dope. We also smoked banana peels. I can't wait until i get narcanned again :D", "2_Subreddit": "opiates"}], "dwgbd8z": [{"0_Comment Submission": "Best day since I started seeing a sub doc. MEDICAL MARIJUANA!", "1_Text": "I've never been drug tested for any cooking job, low level construction, and now a driving job. Granted, none of those jobs paid higher than 15/hr. Costco was the only place in the last 10 years that drug tested.", "2_Subreddit": "opiates"}], "dwgdiga": [{"0_Comment Submission": "Best day since I started seeing a sub doc. MEDICAL MARIJUANA!", "1_Text": "I remember getting arrested in like 2009 with .5g and a pipe. Paid 1200 in fines plus lawyer. Had probation too. Get arrested in 2015 with a bundle and paid 1100 in fines and for a public defender. No probation for heroin tho.", "2_Subreddit": "opiates"}], "dwgezt1": [{"0_Comment Submission": "Best day since I started seeing a sub doc. MEDICAL MARIJUANA!", "1_Text": "Whats prices like? I heard its like 140 a quarter, but its really potent shit. I would get the card just not to get arrested and keep copping of my dude for 200 a zip", "2_Subreddit": "opiates"}], "dwgfibf": [{"0_Comment Submission": "Picked up some of this today. 2nd time ive gotten and the first time I immediately was like wtf is this so i texted my dude and he said its all good these guys add food coloring haha. Anybody ever experienced this?", "1_Text": "Ive gotten white, tan, brown, gray, and red ecp. The red was the only one that threw me off. The gray was one of the best stamps i ever had, blue draino in dec 2015. Also, is this supposed to be an oc 80 or dope?", "2_Subreddit": "opiates"}], "dwgly2b": [{"0_Comment Submission": "Dude, you have no idea I did like so much drugs is college.....", "1_Text": "Its hilarious when people talk about their marijuana withdrawals. Like i get it, you're slightly on edge and really bored...don't compare it to heroin withdrawals. I was in rehab with a girl who was talking like this because everyone had their war stories and she was trying to fit in. I thought it was fucked up that they admitted her to inpatient detox for weed, when there is a shortage of beds for people with actual drug problems. I've had to say im suicidal to get into rehab because a. Theres not enough beds available and b. My insurance only covers mental health treatment, not addiction, so i have to say im going to kill myself or I'd get the boot after a few days.", "2_Subreddit": "opiates"}], "dwi6qhf": [{"0_Comment Submission": "Well, we have all been in this predicament.....", "1_Text": "At the rehab i went to, your counselor comes in the bathroom with you and has to at least glance at your dick when you start pissing to make sure its not a wizzinator.", "2_Subreddit": "opiates"}], "dwi8g0q": [{"0_Comment Submission": "Those Days...", "1_Text": "Pure cocaine. Most street shit is like 25% pure.", "2_Subreddit": "funny"}], "dwj1kp0": [{"0_Comment Submission": "How long to wait until i can use after naltrexone?", "1_Text": "Like 72 hours", "2_Subreddit": "opiates"}], "dwsb6kq": [{"0_Comment Submission": "Opiate Shower thoughts pt. 1", "1_Text": "It kinda means fucking whiteboy...i think, mexicans slang is weird", "2_Subreddit": "opiates"}], "dwsb8uu": [{"0_Comment Submission": "Opiate Shower thoughts pt. 1", "1_Text": "And if its not, \"my bad bro come thru next time, I got you.\"", "2_Subreddit": "opiates"}], "dwv1tzf": [{"0_Comment Submission": "My dboy who sold me these bricks invited me into his trap house to party. I politely declined", "1_Text": "Perfect 11 it looks like", "2_Subreddit": "opiates"}], "dww0rud": [{"0_Comment Submission": "My dboy who sold me these bricks invited me into his trap house to party. I politely declined", "1_Text": "Hmmm thats  strange, I always wonder wtf some of these stamps are supposed to mean. I've gotten moby dick, versace, and larry bird recently.", "2_Subreddit": "opiates"}]}], "1_submissions": [{}]}]}