{"opiburner": [{"0_comments": [{"dvzgc6j": [{"0_Comment Submission": "Park was dark added light but tonight's pick up ain't bad 🌞🌝", "1_Text": "U shooting?", "2_Subreddit": "opiates"}], "dvzgdh2": [{"0_Comment Submission": "Park was dark added light but tonight's pick up ain't bad 🌞🌝", "1_Text": "No prob dude. And some ppl say that bc theyve told all their lives that bud is dangerous etcc but then they smoke and realize it was all a lie. Then they wonder what else was a lie.", "2_Subreddit": "opiates"}], "dvzhebb": [{"0_Comment Submission": "Ferling so, so goosld... =) (3 mg xanax insufflated & .57 g shot)", "1_Text": "Oh  the simply grapefruit is very very acidic. Just a heads up. And you wanna drink it about an hour before dosing. Id always mix it with vodka and get down", "2_Subreddit": "opiates"}], "dvzz16m": [{"0_Comment Submission": "Recently came across some opium...", "1_Text": "Lol im fairly certain you could find and drug EVER MADE at camp biscoe.", "2_Subreddit": "opiates"}], "dw1g3nb": [{"0_Comment Submission": "About 50gs of some Peruvian fire", "1_Text": "This is not what good flake looks like at all.", "2_Subreddit": "cocaine"}], "dw1ga40": [{"0_Comment Submission": "Hope this isn't true.. but be aware always", "1_Text": "Tell that to all the people dieing in western PA and canada. I used to think the same thibf", "2_Subreddit": "cocaine"}], "dw1glw3": [{"0_Comment Submission": "Dealer question", "1_Text": "Are you serious? I know tons of dealers who wont fucking get off their couch unless youre buying an oz.", "2_Subreddit": "cocaine"}], "dw1r2cq": [{"0_Comment Submission": "Hope this isn't true.. but be aware always", "1_Text": "Quit spreading misinformation\n\nhttp://triblive.com/local/valleynewsdispatch/13340474-74/fentanyl-cocaine-combo-taking-lives-in-western-pa", "2_Subreddit": "cocaine"}], "dw35sdk": [{"0_Comment Submission": "Why are so many people posting “fake or not” photos of pills. There is no way anyone can be 100 percent sure based on sight alone what is in your pill. It’s flooding this sub and turning people away who actually need harm reduction. Please stop.", "1_Text": "My guess is that people HATE gettng 'beat' (especially if they prided themselves on being the A1 boss king of drug knowledge) and are looking for affirmation regardless of what people will comment. I see a lot of this on here in fake or real pill posts as well as ppl asking questions/advice but then ignore/argue anyone saying something contrary to what they wanted to hear.", "2_Subreddit": "opiates"}], "dw39444": [{"0_Comment Submission": "Everyone is saying grey dope is fire, but mine is completely not injectable.", "1_Text": "Aint it cray how we are so desparate thatcit contains some fraction of dope that almost all of us would still ingest it somehow? Ive got chunks of drywall before that i still broke down and tried to snort in hopes there was SOME dope in it.", "2_Subreddit": "opiates"}], "dw3989z": [{"0_Comment Submission": "Everyone is saying grey dope is fire, but mine is completely not injectable.", "1_Text": "You say you called him out on the look/smell ehile he was still with you. Not sure if theres gonna be a next time, but was dude a dealer or a middle?", "2_Subreddit": "opiates"}], "dw39dmg": [{"0_Comment Submission": "Everyone is saying grey dope is fire, but mine is completely not injectable.", "1_Text": "Well i imagine the good stuff is easy to find when everyone is terrified youll eat their organs if rhey dont keep you doped up Lurch.", "2_Subreddit": "opiates"}], "dw6q54a": [{"0_Comment Submission": "With OxyContin (OP), how much do you get instantly, (percentage)?", "1_Text": "Definitely not 50/50. The matrix allows for a very slow release so your plasma levels roughly stay the same throughout. What that number is throughout the timeframe i dunno. Be great if an 80mg pill kept your plasma levels at 80 but itd have yo contain more than 80mg. \n\nAnyway the matrix probably allows for builfup to 10-20mg and then maintains that for the rest of the 8 hrs. I.e. the release rate is timed to the metabolism rate.", "2_Subreddit": "opiates"}], "dw6qq45": [{"0_Comment Submission": "Copped my first gram of dope 12 hours ago. I'm still awake and only have .3 left... Read about my ridiculous day... I'm broken man.", "1_Text": "A 1cc syringe should be able to hold wayyyy more than .2 i loaded up 1g last night. You say youre doing pts. Is it tar? Use the full 1cc of water?", "2_Subreddit": "opiates"}], "dw6ryum": [{"0_Comment Submission": "My favorite way to start the day", "1_Text": "Just cause you can cold shake doesnt mean you should. Since youre boofun NBD, butcomeon buddy. You really think youre losing a lot to the cotton? Wihlth that many dillys id bet the coton retains < .1mg", "2_Subreddit": "opiates"}], "dw7ponl": [{"0_Comment Submission": "With OxyContin (OP), how much do you get instantly, (percentage)?", "1_Text": "Im saying it works like the concerta. And no not more than 80mg in the pill.", "2_Subreddit": "opiates"}], "dw7r9v8": [{"0_Comment Submission": "[Serious]What is the most pain you have ever felt?", "1_Text": "Definitely could have performed a nerve block vs local. As your doc stated, local doesn't work well with large swelling. Dr prob hasn't performed block since med school and didn't feel comfortable doing it.", "2_Subreddit": "AskReddit"}], "dw7rmmi": [{"0_Comment Submission": "[Serious]What is the most pain you have ever felt?", "1_Text": "Understandable. The nerve blocks can be VERY tricky (insert at 45 angle then swing 30 deg to right after clearing muscle, continue till you hit bone and then back off a little) and there's some risk of damaging artery/nerve since they all run together. To be fair the adult doc prob wouldn't know how either.  \n\nBtw theyre supposed to continue inserting needle till you hit bone to ensure youre in right spot. It feels weird when you hit it (for patient)", "2_Subreddit": "AskReddit"}], "dw7s5vm": [{"0_Comment Submission": "[Serious]What is the most pain you have ever felt?", "1_Text": "Oh o  no not at all. The technique i was describing was to locate the nerve in the right spot to dump the anesthetic. Sorry if it seemed like just poking it would numb it. You typically put the anesthetic where nerves meet/branch out.", "2_Subreddit": "AskReddit"}], "dw8dk95": [{"0_Comment Submission": "[Serious]What is the most pain you have ever felt?", "1_Text": "Doc put the anesthetic in your vein on accident. It contains an analogue of lidocaine + epinephrine. The epi and *caine will shoot your bp and hr up. Technique calls for pulling back to make sure youre not in vein/artery before injecting. As i mentioned earlier the nerve typically runs with vein/artery. \n\nEdit in regards to numbness lasting too long, they have a reversal agent one can administer. Kids tend to chew their tongue/cheek when numb causing damage.", "2_Subreddit": "AskReddit"}], "dw8eho5": [{"0_Comment Submission": "[Serious]What is the most pain you have ever felt?", "1_Text": "Ooooh oof yea thats the one of the dangers i mentioned above. Typically a stick to a nerve isnt permanent damage but it really sounds like they screwed the pooch.", "2_Subreddit": "AskReddit"}], "dw8epkg": [{"0_Comment Submission": "TIL one of the most brutal prisons in the US was Angola, Louisiana, which was run like a plantation. In the 1930s, hardened prisoners broke down upon learning of their sentence there. At one point, 10% of Angola prisoners were stabbed.", "1_Text": "He's doin' a deuce at the farm for dick waggin'", "2_Subreddit": "todayilearned"}], "dwlv3ld": [{"0_Comment Submission": "$180 for a gram is fuckin killing me.", "1_Text": "Can't make a drive to a bigger city and go on an adventure?", "2_Subreddit": "opiates"}], "dwprygx": [{"0_Comment Submission": "The Dave Brubeck Quartet - Take Five [Jazz](1959)", "1_Text": "Wow I accidentally slipped past the music and only heard the back and forth, which was amazing. Then rewinding it back to hear him blaring take 5 is hilarious.", "2_Subreddit": "Music"}], "dwpt13a": [{"0_Comment Submission": "13 years ago Mitch Hedberg died. What is your favorite joke he told?", "1_Text": "Yeah. When I saw him a few weeks/months before he passed he did a good chunk of the show from behind the stage curtain hidden from view. He was also frustrated that folks kept calling out their favorite bit they wanted to hear, \"I used to do drugs!\", \"rice!\". He was also pretty buzzed, that much was clear.", "2_Subreddit": "AskReddit"}]}], "1_submissions": [{"5y4r4v": [{"0_Title": "Opinions on Elegant Smoking/Smoking-Models network of sites", "1_Text": "U shooting?", "2_Subreddit": "smokingfetish"}], "6gp400": [{"0_Title": "Think I know the meaning of Angel2-6's name", "1_Text": "U shooting?", "2_Subreddit": "LakeCityQuietPills"}], "70dwcs": [{"0_Title": "Ever spill your cooker/setup?", "1_Text": "U shooting?", "2_Subreddit": "opiates"}], "74cvl5": [{"0_Title": "CYP450 testing?", "1_Text": "U shooting?", "2_Subreddit": "opiates"}], "7a7ffi": [{"0_Title": "Complete lack of compassion in this post on personal finance", "1_Text": "U shooting?", "2_Subreddit": "opiates"}], "7c8z4i": [{"0_Title": "Found a full rig on the ground!!! (its mine dont worry)", "1_Text": "U shooting?", "2_Subreddit": "opiates"}], "7dhzd0": [{"0_Title": "Had a good nod going. Got that jerk back awake. Hand near Solution. :(", "1_Text": "U shooting?", "2_Subreddit": "opiates"}], "7m1sze": [{"0_Title": "Lottery Scratchers as gifts", "1_Text": "U shooting?", "2_Subreddit": "opiates"}], "7n6ezm": [{"0_Title": "Why such little H20 in rigs?", "1_Text": "U shooting?", "2_Subreddit": "opiates"}], "7os1m0": [{"0_Title": "I don't consider pill dealers Dboys", "1_Text": "U shooting?", "2_Subreddit": "opiates"}], "7pu4q9": [{"0_Title": "?I_do_not_support_Trump", "1_Text": "U shooting?", "2_Subreddit": "AskTrumpSupporters"}], "7zkrw5": [{"0_Title": "Nice fishy and seeking coke advice.", "1_Text": "U shooting?", "2_Subreddit": "opiates"}], "7zkv01": [{"0_Title": "Some nice fishy and seeking advice.", "1_Text": "U shooting?", "2_Subreddit": "cocaine"}], "802n8p": [{"0_Title": "What's left of the ball and some decent H", "1_Text": "U shooting?", "2_Subreddit": "opiates"}], "899r0w": [{"0_Title": "Amazingly well trained. Showed up at door. What breed(s)?", "1_Text": "U shooting?", "2_Subreddit": "dogs"}], "899x1v": [{"0_Title": "Showed up at door w/ no collar. Incredibly well trained? What breed?", "1_Text": "U shooting?", "2_Subreddit": "dogs"}]}]}]}