{"inlovewithheroin": [{"0_comments": [{"dwwoo0s": [{"0_Comment Submission": "How do you know when it's kicking in", "1_Text": "15-25 minutes. 30 max.", "2_Subreddit": "opiates"}], "dwwoo5d": [{"0_Comment Submission": "How do you know when it's kicking in", "1_Text": "No problem hun", "2_Subreddit": "opiates"}], "dwwoq2c": [{"0_Comment Submission": "Another sex question lol", "1_Text": "Yes. I’m on methadone and I hVe ZERO sex drive. It sucks.", "2_Subreddit": "HeroinHeroines"}], "dwwosnw": [{"0_Comment Submission": "Codiene + Cannabis high is unreal. At about a [8] right now and it’s very enjoyable. What are your guys thoughts on this combo?", "1_Text": "To be honest that combo is like so light and back in da day I wouldn’t have even felt it, but then again I’m a recovering IV heroin addict who had a 1.5-2 gram a day habit. Please listen to me and don’t try to get anything stronger. Run while you still can. Just smoke weed 💚🌿💨", "2_Subreddit": "opiates"}], "dwwov9a": [{"0_Comment Submission": "After lunch snack (euro time). Nom nom nom. My favorite As and M", "1_Text": "Ayyyy. European dwellers represent! 💶", "2_Subreddit": "opiates"}], "dwwp951": [{"0_Comment Submission": "Do you acquire your suboxone from your family doctor, clinic or psychiatrist?", "1_Text": "It’s nice when people like you are understanding because we truly just wanna keep this sub around. It’s not about power tripping it’s about keeping everyone safe happy and avoiding problems with the admins.", "2_Subreddit": "opiates"}], "dwwpajh": [{"0_Comment Submission": "Subs question", "1_Text": "You should be fine. It might not be as intense as it would have been had you not taken them but you’ll deff feel if.", "2_Subreddit": "opiates"}], "dwwpn9b": [{"0_Comment Submission": "Is making the jump from prescription pills to heroin really as big of a deal as it's made out to be?", "1_Text": "Yes. While On pills I worked full time, got a degree, had a social life. I was a beast. When I switched to h I eventually ended up just nodding out on the couch for a year. When I switched to the needle my life spiraled downward faster than the speed of light. If only I hadn’t picked up opiates, but also, if only I hadn’t switched to h. If only I hadn’t needled. If only if only.....", "2_Subreddit": "opiates"}], "dwwpyan": [{"0_Comment Submission": "8 ball price?", "1_Text": "60 for a gram is not that bad if it’s really good quality. I gladly pay half a gram for the amazing stuff I get these days", "2_Subreddit": "cocaine"}], "dwwq19s": [{"0_Comment Submission": "What a bunch of fucking pussies over at r/drugs lol", "1_Text": "If it’s not weed or a psychedelic or mdma it’s not cool or adventurous anymore you go from open minded person to junkie in their eyes. You’re welcome to come to /opiates. We give 0 fucks and NEVER judge. /cocaine is Pretty  chill too", "2_Subreddit": "cocaine"}], "dwwwpw2": [{"0_Comment Submission": "A little 0.3 to scratch that itch without going too crazy. This stuff is pretty damn pure. 25 euros", "1_Text": "Spain", "2_Subreddit": "cocaine"}], "dwwyh07": [{"0_Comment Submission": "Opinions about NA/AA", "1_Text": "In the originals there’s a family of ancient vampires and they always profess  their love to each other by saying it’s for always and forever.", "2_Subreddit": "opiates"}], "dwwypyi": [{"0_Comment Submission": "I have never done any opiates. I've been browsing this sub for ~2 hours now.", "1_Text": "Yes!!! If this sub dissuades just ONE person from starting down this path then it’s a wonderful thing.", "2_Subreddit": "opiates"}], "dwwyuxm": [{"0_Comment Submission": "going to end up homeless soon..any tips?", "1_Text": "Can’t you contact her on your phone? Have a phone An d steal  WiFi off fast food places and libraries or if you can pay for a cheap pay as you go 4g SIM card thing. If you don’t have a phone I’d pay 20-30 euros for a shitty smart phone. I dunno I’ve never been homeless but I’d blow my brains if I didn’t have access to internet lol", "2_Subreddit": "opiates"}], "dwwznid": [{"0_Comment Submission": "Why do you go on one last binge before rehab?", "1_Text": "Cuz you’re constantly trying to justify and find reasons to use and what better justification  than “one last time” hard to logic yourself out of that one", "2_Subreddit": "opiates"}], "dwwzs7y": [{"0_Comment Submission": "going to end up homeless soon..any tips?", "1_Text": "There are plenty of places that have outlets to charge phones. The library, etc. I know The metro where I’m at has charging stations. I don’t know about the price of iPhones. Google it ? Go to a used phone store? No that’s not weird at all. Internet and information is so important. Especially when you’re gonna need it to find places to eat, places to get WiFi etc. yeah I’d use that money to first and foremost get a phone. \n\nEdit: go to the Greece subreddit and ask about the charging stations. Google info about being homeless in that city too.", "2_Subreddit": "opiates"}], "dwwzvpa": [{"0_Comment Submission": "going to end up homeless soon..any tips?", "1_Text": "can you please edit out the city? It’s against the rules.", "2_Subreddit": "opiates"}], "dwx01ch": [{"0_Comment Submission": "going to end up homeless soon..any tips?", "1_Text": "Specifying your location is still against the rules.", "2_Subreddit": "opiates"}], "dwx06n0": [{"0_Comment Submission": "going to end up homeless soon..any tips?", "1_Text": "No problem it’s ok :) now you know xoxo", "2_Subreddit": "opiates"}], "dwx0ibp": [{"0_Comment Submission": "First time doses for morphine and oxycodone", "1_Text": "Run away. Now. Opiates will ruin your life. If you choose to do them this will be the left hand turn at the fork in the road that you will wish you could undo for the rest  of your life.", "2_Subreddit": "opiates"}], "dwx1ymq": [{"0_Comment Submission": "Should i switch from subutex to norco before quitting?", "1_Text": "“Should I start taking norco to quit subs which I started to quit -insert other opiate- to make it easier to get clean” 🧐\n\nI get your question. I do. But honestly regardless of the opiate it’s gonna be hard as fuck. If I were you I would slowly taper down off the subs. You’ll barely feel it.", "2_Subreddit": "opiates"}], "dwx5b4e": [{"0_Comment Submission": "Biologically, it makes more sense for men to wear skirts", "1_Text": "Not really vaginas need to breathe", "2_Subreddit": "Showerthoughts"}], "dwx5oa6": [{"0_Comment Submission": "A donut + a donut hole = a donut without a hole", "1_Text": "That’s kind of why it’s called a donut hole?", "2_Subreddit": "Showerthoughts"}], "dwx5rg0": [{"0_Comment Submission": "A donut + a donut hole = a donut without a hole", "1_Text": "Well I guess that’s true what would you call it then? Donut middle? Donut void?", "2_Subreddit": "Showerthoughts"}], "dwxkg9p": [{"0_Comment Submission": "Ehh", "1_Text": "Sorry you’re not allowed to mention cities", "2_Subreddit": "heroin"}]}], "1_submissions": [{"7twftn": [{"0_Title": "Why don't Americans use the application \"what's app\"?", "1_Text": "15-25 minutes. 30 max.", "2_Subreddit": "AskReddit"}], "7twlel": [{"0_Title": "Some pimp/stalker tried to finesse me into being his hoe (shitpost story time)", "1_Text": "15-25 minutes. 30 max.", "2_Subreddit": "opiates"}], "7u3q7r": [{"0_Title": "Pimp threat update just THANK YOU ALL 💗", "1_Text": "15-25 minutes. 30 max.", "2_Subreddit": "opiates"}], "7ulzfy": [{"0_Title": "I have this fantasy about using propofol.", "1_Text": "15-25 minutes. 30 max.", "2_Subreddit": "opiates"}], "7umemw": [{"0_Title": "HeroinHeroins: a place for ladies of our type to hang out and talk. Feel free to join men and women! (Just wanna make sure you guys know it's there as well I already shared this on /opiates)", "1_Text": "15-25 minutes. 30 max.", "2_Subreddit": "OurOverUsedVeins"}], "7v7p9n": [{"0_Title": "Calling all artists 💕🎨", "1_Text": "15-25 minutes. 30 max.", "2_Subreddit": "HeroinHeroines"}], "7w04gw": [{"0_Title": "Anyone else take your methadone at night cuz or else you’ll be nodding hard in public?", "1_Text": "15-25 minutes. 30 max.", "2_Subreddit": "Methadone"}], "7wvs4j": [{"0_Title": "I think the fact that cocaine (because of the memorable, and also often glamorized ROA) tends to be rather socially accepted I think this makes people more likely to try heroin for the first time.", "1_Text": "15-25 minutes. 30 max.", "2_Subreddit": "opiates"}], "7xasl4": [{"0_Title": "Anyone else sort of brace themselves when scrolling down and checking r/opiates. A reminder to please be careful. (emotional post proceed at your own risk)", "1_Text": "15-25 minutes. 30 max.", "2_Subreddit": "opiates"}], "7y8c7y": [{"0_Title": "I got my period today", "1_Text": "15-25 minutes. 30 max.", "2_Subreddit": "HeroinHeroines"}], "80e8wk": [{"0_Title": "Was looking at some political cartoons...this one is just so fucking true", "1_Text": "15-25 minutes. 30 max.", "2_Subreddit": "opiates"}], "80p887": [{"0_Title": "Anyone love these more than any other sour candy and not understand why they're so rare? (pic off google not my own fyi)", "1_Text": "15-25 minutes. 30 max.", "2_Subreddit": "opiates"}], "81a1bu": [{"0_Title": "Thanks so much /u/DopeFiendDramaQueen for helping making this sub look so badass! Check out the awesome header she made! And thanks /u/kickerS12X for the coding work this place is looking niceeeee", "1_Text": "15-25 minutes. 30 max.", "2_Subreddit": "HeroinHeroines"}], "81ef8m": [{"0_Title": "Check out /r/HeroinHeroines a sub I made for women of the poppy anyone is welcome..men too. Just wanted to share again because thanks to /u/DopeFiendDramaQueen for making an awesome header and /u/KickerSX12 for coding work. It's looking badass wanna give credit where it's due!", "1_Text": "15-25 minutes. 30 max.", "2_Subreddit": "opiates"}], "81ehqe": [{"0_Title": "Yo kicker added me to the mod team! I'm honored. Just wanted to say wassup :)", "1_Text": "15-25 minutes. 30 max.", "2_Subreddit": "heroin"}], "81f2as": [{"0_Title": "Wtf is this dude on about. I asked a question on the bipolar sub and get this random message. WTF? “Women are used pussy whores”", "1_Text": "15-25 minutes. 30 max.", "2_Subreddit": "HeroinHeroines"}], "81qd4h": [{"0_Title": "Got this random PM after posting to r/bipolar", "1_Text": "15-25 minutes. 30 max.", "2_Subreddit": "IncelTears"}], "828r2a": [{"0_Title": "Whose gonna have a ball 🎱tonight? You guessed it! This girl here!", "1_Text": "15-25 minutes. 30 max.", "2_Subreddit": "cocaine"}], "83ap24": [{"0_Title": "I had a dream they were selling fake candy syringes for kids like the candy cigarettes they used to sell", "1_Text": "15-25 minutes. 30 max.", "2_Subreddit": "opiates"}], "83rp7t": [{"0_Title": "A subreddit for women on or off opiates. Women of the poppy. Please don’t take offense. I felt an obligation to share. I just want those that have no support to know there’s a safe place. Why here? I know this is a non judgmental, kind place. And addiction and prostitution can be co-occuring.", "1_Text": "15-25 minutes. 30 max.", "2_Subreddit": "SexWorkers"}], "83ryka": [{"0_Title": "After crucifying/judging/guilt tripping me for my addiction for years, my mother finally admitted to me she tried heroin IV when she was 18 and never did it again. (I need some support guys this has been a lot to process)", "1_Text": "15-25 minutes. 30 max.", "2_Subreddit": "opiates"}], "849czf": [{"0_Title": "Best shit I’ve ever had in my life 0.5 for 30 euros. Worth every penny. Scentless.", "1_Text": "15-25 minutes. 30 max.", "2_Subreddit": "cocaine"}], "8552n9": [{"0_Title": "1 year off heroin", "1_Text": "15-25 minutes. 30 max.", "2_Subreddit": "opiates"}], "8a8ysl": [{"0_Title": "A little 0.3 to scratch that itch without going too crazy. This stuff is pretty damn pure. 25 euros", "1_Text": "15-25 minutes. 30 max.", "2_Subreddit": "cocaine"}], "8aavp5": [{"0_Title": "If there are an infinite number of alternate universes, and in this universe and many others you remain alive, then the opposite also holds true in an infinite number of different ways. Real living and breathing versions yourself are constantly dying every second.", "1_Text": "15-25 minutes. 30 max.", "2_Subreddit": "Showerthoughts"}]}]}]}