{"Diamiosis": [{"0_comments": [{"dw2x3wj": [{"0_Comment Submission": "Another snapshot of my European boy", "1_Text": "[Runs smoothly on foil.] (https://imgur.com/a/zjqmD) I mostly stick to snorting though, especially at work I find it simpler to put a line on my phone display and sniff that shit.", "2_Subreddit": "opiates"}], "dwhzxb6": [{"0_Comment Submission": "Well, we have all been in this predicament.....", "1_Text": "I remember that story. Was it you, someone else or did you copy it?", "2_Subreddit": "opiates"}], "dwi013d": [{"0_Comment Submission": "Well, we have all been in this predicament.....", "1_Text": "Damn my vag hurts thinking about it and I didn't have one last time I checked", "2_Subreddit": "opiates"}], "dwi05cc": [{"0_Comment Submission": "last one", "1_Text": "Yea. Being a cat can be difficult.", "2_Subreddit": "opiates"}], "dwi2s0h": [{"0_Comment Submission": "Anyone else done did this ?", "1_Text": "I thought I was the only one", "2_Subreddit": "opiates"}], "dwi6iui": [{"0_Comment Submission": "After doing a fat shot after taking valium/xans.", "1_Text": "Almost every benzo if not everyone has the same properties just in a different order of magnitude afaik", "2_Subreddit": "opiates"}], "dwnp6sn": [{"0_Comment Submission": "Policy Change regarding human consumption", "1_Text": "Go fuck yourself asshole bot", "2_Subreddit": "opiates"}], "dwnppdf": [{"0_Comment Submission": "Easter colors !!! 😂 60mg Oxy in the blue, 90mg Morphine in the pink.... Happy Easter Nods my friends 🤙🏻", "1_Text": "wrong sub I guess", "2_Subreddit": "opiates"}], "dwnqr0a": [{"0_Comment Submission": "Easter colors !!! 😂 60mg Oxy in the blue, 90mg Morphine in the pink.... Happy Easter Nods my friends 🤙🏻", "1_Text": "Those look really ... big... for an anus hole. Can't you get the smaller ones?\nHere where I live we even have 1ml syringes. I usually used the 2ml.\nYours look like 5 or even more though😂", "2_Subreddit": "opiates"}], "dwnxbbh": [{"0_Comment Submission": "Easter colors !!! 😂 60mg Oxy in the blue, 90mg Morphine in the pink.... Happy Easter Nods my friends 🤙🏻", "1_Text": "Well you are both right. End of discussion. let's start talking about pussy and heroin again", "2_Subreddit": "opiates"}], "dwnxeor": [{"0_Comment Submission": "Easter copped some of these .5mg from my gma while i was over there.(there was 5) She has a script for 90 that I know she takes whenever and i know wont count cause she takes em jus whenever shes stressed from watching grandkids fulltime. Also a .6 of some btthh", "1_Text": "Okay nice. I know many will hate you bc you took your grannys medicine but imho if you don't take something that would be needed urgently otherwise + she can just get new pills if necessary then it's A'ight. I think you're good on that one.\n\nWhat exactly did you get for this easter though? Can't id them", "2_Subreddit": "opiates"}], "dwnxkls": [{"0_Comment Submission": "First time trying tar", "1_Text": "Tar always looked strange/ugly to me. I never ssw that shit in rl though and I guess after you tried it some times you associate the opiate buzz with it so I can imagine the beauty if I'd have the opportunity. I only get Afghan freebase powder so I can't help you with the taste. Especially bc it's hard to describe but yeah it doesn't 100% smell/taste lime vinegar it's usually more unique but with nothing to compare it to it'll be hard to tell you it smells right. If it feels good you should be A'ight tho. Enjoy your smack. first time or tried already? \nI also had to switch from OC after prices skyrocketed and availability dropped.", "2_Subreddit": "opiates"}], "dwnxmmo": [{"0_Comment Submission": "Been off heroin for 10 months, still depressed as fuck and I’m over it", "1_Text": "I feel you. It's like the best gf I ever had. No explaining, no complaining.\n\n\n\nShe had her downsides tho....", "2_Subreddit": "opiates"}], "dwnxo4z": [{"0_Comment Submission": "Why the fuck can I not get high? Is it the gel matrix shit? I used to get high as fuck on these things.", "1_Text": "Did you take diamorphine for a while? Or always oxy only?", "2_Subreddit": "opiates"}], "dwnxp8z": [{"0_Comment Submission": "Might go to the hospital", "1_Text": "Could you post a picture on imgur and link it here", "2_Subreddit": "opiates"}], "dwnxqey": [{"0_Comment Submission": "I love our mods...", "1_Text": "AFOAF can confirm", "2_Subreddit": "opiates"}], "dwnxrl4": [{"0_Comment Submission": "What to do if your H tests positive for Fent?", "1_Text": "Have you thought about getting your dope elsewhere? Like online maybe :)", "2_Subreddit": "opiates"}], "dwsbrum": [{"0_Comment Submission": "Finally got my fix after 3 days of nasty withdrawals. A gram of the best tar I've ever had, courtesy of the darknet. Happy nods y'all. ❤️", "1_Text": "That's what I'd say If I ordered myself", "2_Subreddit": "opiates"}], "dwvl53m": [{"0_Comment Submission": "What are some ways to milk my wife without her knowing?", "1_Text": "I agree with both of you", "2_Subreddit": "AskReddit"}], "dwvla30": [{"0_Comment Submission": "Whores of Reddit, why do you enjoy doing what you do?", "1_Text": "male or female?", "2_Subreddit": "AskReddit"}], "dwx6b7p": [{"0_Comment Submission": "Got my hands on these. I have NO idea how to use them, have only done oral and intranasal oxy. Would be so grateful if someone gave me a step by step. How do I get a needle?", "1_Text": "There should be a white marker (lika a point) where you place your finger (that one next to thumb, forgot what it's called) and then you apply pressure from the other side above your finger. That's how you break it open without damaging it /NB having shards in your solution", "2_Subreddit": "opiates"}], "dwx6die": [{"0_Comment Submission": "Got my hands on these. I have NO idea how to use them, have only done oral and intranasal oxy. Would be so grateful if someone gave me a step by step. How do I get a needle?", "1_Text": "You can find very detailed information on proper IV use online. keep it sterile!", "2_Subreddit": "opiates"}], "dwxw7lh": [{"0_Comment Submission": "\"Why don't you just smoke weed?\"", "1_Text": "It's different for everyone. I don't know if it is connected with psychedelic experiences in the past like _shrooms, LSD etcetera_ since it often changes weed for the worse for many people. For me it did. I can occasionally smoke a little kush without problems but if i get some hard indica strain like some strong haze with high THC content I completely trip balls and get uncomfortably anxious. \nSo no, weed doesn't work for me. It actually worsens the withdrawal.", "2_Subreddit": "opiates"}], "dwxwjz7": [{"0_Comment Submission": "First time OxyContin, how long before i feel shit lol", "1_Text": "You should be glad. Next time start with the lowest dose possible and first of all post a picture of your pill here so we may try to id that stuff the best we can dude. Everyone does mistakes, that was fucking irresponsible tho. Stay safe", "2_Subreddit": "opiates"}], "dwxwm0w": [{"0_Comment Submission": "Definitely had better but gets the job done. Weird taste too lol. Never tried eco or anything only done tar but I love the tar lol", "1_Text": "Works better with a handkerchief", "2_Subreddit": "opiates"}]}], "1_submissions": [{"853qlb": [{"0_Title": "Been jealous the least couple of days y'all copped some sweet stuff. My guy finally came thru - got some pure european euphoria in a bag lol enjoy yo nods fammmm", "1_Text": "[Runs smoothly on foil.] (https://imgur.com/a/zjqmD) I mostly stick to snorting though, especially at work I find it simpler to put a line on my phone display and sniff that shit.", "2_Subreddit": "opiates"}], "8641jc": [{"0_Title": "Another snapshot of my European boy", "1_Text": "[Runs smoothly on foil.] (https://imgur.com/a/zjqmD) I mostly stick to snorting though, especially at work I find it simpler to put a line on my phone display and sniff that shit.", "2_Subreddit": "opiates"}]}]}]}