{"BigLegSmallArm": [{"0_comments": [{"dww4ryo": [{"0_Comment Submission": "Can the community give their input whether or not you guys think these are real?", "1_Text": "Not necessarily concern, just being careful. I usually get prescription, but this is one of the few times Ive collected from the street. I’m more or less of a paranoid person when it comes to this sort of thing. I find comfort when multiple people confirm my opinion on things like this!", "2_Subreddit": "opiates"}], "dww4x51": [{"0_Comment Submission": "Can the community give their input whether or not you guys think these are real?", "1_Text": "He did not have an excess amount. So, the imprints usually aren’t that deep from your experience?", "2_Subreddit": "opiates"}], "dww7rk2": [{"0_Comment Submission": "Can the community give their input whether or not you guys think these are real?", "1_Text": "What part of the country are you from?", "2_Subreddit": "opiates"}], "dwwcehp": [{"0_Comment Submission": "Can the community give their input whether or not you guys think these are real?", "1_Text": "I can understand that guy, I was just looking for opinions other than mine. I’m not going to be selling them as I have researched quite extensively as to what happens if someone else passes away from a narcotic I sell or give them. Thank you for your opinion. I will be getting some test strips", "2_Subreddit": "opiates"}], "dwwcf92": [{"0_Comment Submission": "Can the community give their input whether or not you guys think these are real?", "1_Text": "Thank you, do you have any knowledge in how hard they are to break in half or crush? I’d appreciate it", "2_Subreddit": "opiates"}], "dwwda2v": [{"0_Comment Submission": "First time cocaine", "1_Text": "How neat is that", "2_Subreddit": "Drugs"}], "dwxq3mq": [{"0_Comment Submission": "2 is better than 1!", "1_Text": "Yes, that’s what I call them from where I’m from at least.", "2_Subreddit": "opiates"}], "dwxqxpj": [{"0_Comment Submission": "\"Why don't you just smoke weed?\"", "1_Text": "Tru", "2_Subreddit": "opiates"}], "dwxr71r": [{"0_Comment Submission": "4mg Xanax and then some Ecp later toniggt", "1_Text": "May I ask what ECP is? Thanks! I apologize for the scrub ass question.", "2_Subreddit": "opiates"}], "dwxy6uo": [{"0_Comment Submission": "DMHA=Brain damage?", "1_Text": "You are correct, depending on dosage it’s ** not ** extremely neurotoxic.", "2_Subreddit": "Drugs"}], "dwxy8o0": [{"0_Comment Submission": "finally got pharmacy pills after days of only being able to find bs 30 presses", "1_Text": "How neat is that.", "2_Subreddit": "opiates"}], "dwxyrt8": [{"0_Comment Submission": "Question: IV 5mg immediate release Oxy? Possible? If so, is it water soluble?", "1_Text": "I’m guessing there is no APAP in them? Yes, this substance is water soluble.", "2_Subreddit": "opiates"}], "dwxytfo": [{"0_Comment Submission": "Super long Heroin duration?", "1_Text": "What ROA are you using this by? Snorting, smoking, IV?", "2_Subreddit": "opiates"}], "dwxzlqq": [{"0_Comment Submission": "Vyvanse + wax", "1_Text": "By wax I’m assuming assuming dab? This happened to me whenever I used to smoke dab on a stimulant. Every thing in my vision seemed TOO REAL, like a video game type shit. it was crazy, but I agree with the others; A panic attack.", "2_Subreddit": "Drugs"}], "dwxzn9p": [{"0_Comment Submission": "Vyvanse + wax", "1_Text": "This is not true at all chumlee", "2_Subreddit": "Drugs"}], "dwy00dt": [{"0_Comment Submission": "Why do you go on one last binge before rehab?", "1_Text": "Good for you, I wouldn’t be able to do that, at this point, I need to strengthen my mind. I’ve introduced exercise and a healthy diet, so I’m hoping my metabolism has increased and the next time I take a 2-5 month break the withdrawls will be a bit more bearable.", "2_Subreddit": "opiates"}], "dwy0279": [{"0_Comment Submission": "Vyvanse + wax", "1_Text": "Love you", "2_Subreddit": "Drugs"}], "dwy09gf": [{"0_Comment Submission": "My sister took 350 mg of Tramadol, is she going to be okay?", "1_Text": "I’m glad you didn’t encounter any seizures while quitting cold turkey. From my understanding you only used for a few weeks?", "2_Subreddit": "Drugs"}], "dwy82au": [{"0_Comment Submission": "Super long Heroin duration?", "1_Text": "I haven’t tried H yet, I am curious though. How is smoking it? Have you by chance tried than and can maybe describe that to me please? Or snorting, either way I am just curious and would appreciate the info you give me.", "2_Subreddit": "opiates"}], "dwy861n": [{"0_Comment Submission": "Question: IV 5mg immediate release Oxy? Possible? If so, is it water soluble?", "1_Text": "Yeah, I would advise against IV due to the binders and other shit in the pills, just bump them. Before you do though if you choose to go this route, spray a saline spray in your nose. Pull the powder in your nose slowly so it doesn’t drip and let it about for 10-20 minutes. Then you can sniff it into the back of your throat. That is just my opinion however and the way I snort pills. If you do choose to go the other route, be safe my guy.", "2_Subreddit": "opiates"}], "dwy8b59": [{"0_Comment Submission": "Can the community give their input whether or not you guys think these are real?", "1_Text": "Thank you for this, I tested them with a fent kit and part of one of them came out clean; I tried one and it gave me the oxy energy and effects! I will also try this and get back to you! Thank you for going out of your way and assisting me with this, you have my appreciation!", "2_Subreddit": "opiates"}], "dwy8by6": [{"0_Comment Submission": "Can the community give their input whether or not you guys think these are real?", "1_Text": "Cool man, thank you! These are the real deal after testing and trying them. Thanks again for your help.", "2_Subreddit": "opiates"}], "dwyd5h0": [{"0_Comment Submission": "Friend thinks he OD'd on Oxy, need help on whether he should go to the hospital or not", "1_Text": "What’s karma farming? Sorry for a scrub boi question. I’ll check some other threads as well and delete this if I find it.", "2_Subreddit": "opiates"}], "dwydfkj": [{"0_Comment Submission": "Broke fucks who treat weed like dope", "1_Text": "I’ve had psychological cravings, slight depression, and minor body aches from withdrawing from dab. I did however go through 1-2 grams a week for around a year. No where near as negative as an opioid withdrawl though.", "2_Subreddit": "opiates"}], "dwydjre": [{"0_Comment Submission": "This fat line is dedicated to the mods and all you wonderful folks in the opi community!", "1_Text": "Godspeed", "2_Subreddit": "opiates"}]}], "1_submissions": [{"8a5yzj": [{"0_Title": "Can the community give their input whether or not you guys think these are real?", "1_Text": "Not necessarily concern, just being careful. I usually get prescription, but this is one of the few times Ive collected from the street. I’m more or less of a paranoid person when it comes to this sort of thing. I find comfort when multiple people confirm my opinion on things like this!", "2_Subreddit": "opiates"}]}]}]}