{"Bez_tendo": [{"0_comments": [{"dwdhocb": [{"0_Comment Submission": "Old timers", "1_Text": "The films signature track\n\nhttps://m.youtube.com/watch?v=mxtfdH3-TQ4", "2_Subreddit": "opiates"}], "dweekrk": [{"0_Comment Submission": "My night time meds. Now I’m ready for bed", "1_Text": "Indeed. Used to be .1 from proper soldiers who dont seem to exist anymore and sometimes buns have 10 some up to 14 in certain areas. In recent years Ive heard a fold usually contains .05-.08 or so. 10 piece buns are roughly .6-.8", "2_Subreddit": "opiates"}], "dwef18u": [{"0_Comment Submission": "Old timers", "1_Text": "\"Your worst enemy.. hes not so bad.. The ants in the ground are just doing their thing\"", "2_Subreddit": "opiates"}], "dwejyfc": [{"0_Comment Submission": "The 4 Stages of WD", "1_Text": "Lol indeed. I used to love kratom in my early 20s in south Fla they had kava bars everywhere, few of which served kratom leaf or extracts. I loved this extract they branded \"full spectrum\". I was literally about to leave Florida get back up to my home state and get back on the cheap and 7/10 heron I had the access to way back when, ASAP. Buddy told me \"just try this\". After 30 minutes we were at the beach in del rey talking up some beautiful women and I literally said \"I love Florida!\" (Before I found the smurf village at 8-10 bucks a pop at the time). But a couple people who were also having a tough time and trying to leave and told them \"try this\". At first they seemed all good and were like \"what is this sorcery?!\".. until they started puking and began to feel awful. One of them even tried it multiple times but in the end \"it wasnt for them\" but anything else that stimulated opioid receptors they absolutely loved. Just kratom didnt agree with them. Have seen it up north too but everyone is different. Weak storytime over. Happy and most importantly, Safe nods to all!", "2_Subreddit": "opiates"}], "dwek3l7": [{"0_Comment Submission": "Safety first", "1_Text": "\"Kids, if you find Cocaine in your parents room, do as much of it as possible. Its fun, safe and cannot hurt you.\"\n- Eric Andre (The Eric Andre Show)", "2_Subreddit": "opiates"}], "dwek4y2": [{"0_Comment Submission": "Safety first", "1_Text": "It turns all your bad feelings into good feelings! Its terrible!", "2_Subreddit": "opiates"}], "dwekhll": [{"0_Comment Submission": "My night time meds. Now I’m ready for bed", "1_Text": "Yeah thats what I heard about that area as well and its unheard of in my area. Most gotten was 11 folds in a cinnabun but that was within my heyday of 06-10 until they got knocked. They seriously juxed a ton of clientele their way by doing this but they had a very short run and were one of the crews that were made an example of in the media and the courts. I havent seen a honeybun that didnt contain subpar ecp in so long, only things decent in 1/4, 1/2, or 1gr increments but personally hate when its like that (at my age and in this time of extreme uncertainty beggers cant be choosers I suppose). Always preferred having the illusion of a single 'dose' in a fold but havent seen anything above 5/10 in that sort of packaging since 'back in the bad ol days'.", "2_Subreddit": "opiates"}], "dwfkkyy": [{"0_Comment Submission": "The 4 Stages of WD", "1_Text": "Whaaat\nWhen I was down there it was blus only. Thats crazy but I could see that. Half of delray was very ritzy and upperclass then you go past a gas station and are warned to not really stop at stop signs or go into neighborhoods off main roads whenever possible. It used to be ground zero for carjacking and halfway houses / flophouses. Thats crazy though man Im sorry to hear that.", "2_Subreddit": "opiates"}], "dwfkqai": [{"0_Comment Submission": "Old timers", "1_Text": "Youtube I think has every episode. I too had my DVDs of The Corner stolen -__-", "2_Subreddit": "opiates"}], "dwfl8ot": [{"0_Comment Submission": "The 4 Stages of WD", "1_Text": "Indeed it does. It was literally a substitute at a certain point. Wd wasnt the worst but still there. Me and a homeboy would show up to the kava bar 4 hours early and thered be someone there making the kava and preparing for opening that would serve us our full spectrum lol. Along with a gang of other people pulling up and knocking on their tinted glass door. I used to flirt with the 'kava bartender' ashley shed let me and my boy come in and hang out, play guitar and enjoy our kratom with some honey etc. They were some good times.", "2_Subreddit": "opiates"}], "dwg5tj5": [{"0_Comment Submission": "The 4 Stages of WD", "1_Text": "You know Franky Cash?", "2_Subreddit": "opiates"}], "dwib7d1": [{"0_Comment Submission": "How long before I'd be able to pass a UA if I use once and am clean?", "1_Text": "Usually 2-3 days if your ROA is snorting, Ive seen and tested positive for morphine myself 7 days after IV of some real phyre h. And that was with drinking water, keeping my blood flowing, no excessive sugar etc. I did use 5 days straight though but only once each evening and took a couple hits off the bowl of some trees. Tested positive for morphine not thc lol. Thought it was kind of funny. Was sure Id go down for the thc not morph. It all depends on metabolism, do you move a lot or lay around/sit a lot, water intake plays a role in diluting the urine and at first can help remove some as most opiates metabolites are expelled via urine and are soluble in water so more water the better. Also less sugar intake the better, forgot where I read that but allegedly plays a role. As well as potency, amount used and for how long. But generally like stated in this thread after 4 days you should be good, 5 even better, a week is the best. Happy and safe nods to all", "2_Subreddit": "opiates"}], "dwigu9j": [{"0_Comment Submission": "Out of system time", "1_Text": "Absolutely. 7 days is playing it 100% safe. From extremely potent and clean diamorph I tested pos from a UA 6-7 days later, used once an evening for 5 nights straight and also hit the bowl twice per night. Tested positive for morphine but not thc, found that kind of funny. A lot of variables at play. Your metabolism, are you active in your daily routine or do you lay/sit around, your frequency of usage and amounts, water intake, sugar intake (read that somewhere and some ppl swear to it, no excessive sugars). Ive had it out in 48-72 hours but also got caught up 6 days later so it varies. Drink water, cut back on the sodas and sugary beverages. Keep the blood flowing. Good luck bud!", "2_Subreddit": "opiates"}], "dwkburq": [{"0_Comment Submission": "The 4 Stages of WD", "1_Text": "He runs a couple down that way just curious. Miss it down there", "2_Subreddit": "opiates"}], "dwm3xxi": [{"0_Comment Submission": "I feel like I’m in an on and off again relationship with dope", "1_Text": "Ill be totally miserable, irritable piece of shit to the best of the people that surround me on a daily basis. Get well and poof.. I get my work done faster than everyone else, offer to help with their tasks if theyre stuck, offer to buy lunch or after work smoke everyone up (cant let my opiophilic tendencies to be in the open or my career will be irreparably fucked). Etc etc. Some days Im the opposite and get 'the rage' but its not as often as the other way by damn sight. When Im on subs for too long I get especially introverted and isolate myself even with alpraz to help. So every so often its required I get back on the wagon so to speak. The point I guess Im attempting to make is my coworkers and colleagues along with my closest friends and immediate family have even told me I 'seem to be doing a lot better' or am 'so much more friendly and caring'.. during the times Im actually using. However I never really obliterate myself like I did when I was young. Only on certain evenings when I know I can and its turned into a 'special occasion' thing of late. Happy and safe nods everyone. And if celebrating happy and safe easter sunday 🕺💃", "2_Subreddit": "opiates"}], "dwm4bid": [{"0_Comment Submission": "10 minutes, papi", "1_Text": "They just dont want you hitting up any competitors.. who they probably know unbeknownst to most of their clientele. I live in a very highly populated metropolis and seriously from county to county they know whos who, just dont discuss it unless its absolutely necessary. With that aside, they just want your money and keep your hope on the hook even if their evil bullshit spewing ass doesnt even plan on falling through. Shouldnt have to be this way.. But its like they say.. \"All in the game baby... all in the game\"", "2_Subreddit": "opiates"}], "dwm4gp7": [{"0_Comment Submission": "Mixing morphine and weed?", "1_Text": "Idk personally never had any issues mixing trees with anything. In fact it usually makes the other substance better (aside from some ups unless youre trying to land instead of crash). When it comes to opiates and buds... my personal favorite combo and probably one of the primary reasons I really began to abuse my perc and vic scripts 13-14 years back because trees wasnt doing much anymore.. when I popped a victor or percadelli... it was like my first time burning all over again. Happy and safe nods everyone", "2_Subreddit": "opiates"}], "dwm4m6g": [{"0_Comment Submission": "What's your favorite movie about heroin?", "1_Text": "Candy is a good one in my opinion. \"Love story\" but mostly about heron addiction. The Corner is a mini-series and The Wire a series but those as well. Obviously Trainspotting. Requiem for a Dream I thought was a tad bit dramatic same with Sid and Nancy. Panic in Needle Park was a classic one. Drugstore Cowboy is definitely up there but about all opiates not heron in particular. \n\nEdit: Basketball Diaries is a top favorite film and book of all time as well.", "2_Subreddit": "opiates"}], "dwmvnw9": [{"0_Comment Submission": "What's your favorite movie about heroin?", "1_Text": "Edit 2: Rush (1991) was also excellent", "2_Subreddit": "opiates"}], "dwmw5m0": [{"0_Comment Submission": "10 minutes, papi", "1_Text": "Lol right. Its insanity. Ive had only one crew who was honest but since have 'retired'. The crew that took over  are seriously dumb as rocks. But way back in the day theyd usually be there in 15 if they said 15. If runner was late Id get a call. Sometimes if I had to wait what they deemed too long (30-40min) theyd toss a free cinnabun! They were pros, at least as close to what pros could be considered in this. A middle has been cool but pricey. Its a shame that its the norm to be treated like this but it is, in fact, alll in the game", "2_Subreddit": "opiates"}], "dwnqfio": [{"0_Comment Submission": "10 minutes, papi", "1_Text": "Lol these were, I guess you could say they were like 'la compania' pros, didnt fuck around. If I ever got stuck theyd supply attorney as well and usually turn it into nothing more than acod somehow (for the user that is even if it was quite a few cinnabuns). Man Ive never encountered a crew so organized again in my almost 15 year career of being an opiophile so I was one of the luckier ones when I found them. But since my return to my home state they have since disbanded. 'Cashed out and moved the fuck out bro'. Like I said the dudes that 'replaced' them dont know what real ron is if they were doing it themselves. Sad state of affairs for most these days it seems.", "2_Subreddit": "opiates"}], "dwxku5f": [{"0_Comment Submission": "Waiting For My Man", "1_Text": "Thought T2 was alright considering how great of a film Trainspotting was. Wasnt the best of sequels (like the original T2 / Terminator 2 was for example) but still gave us all a chance to catch up with Rent, Simon, Franco, Spud, Diane, and of course.. Mikey Forrester and provided a decent new storyline that wasnt as abysmal as most put it and it was satisfying in all honesty watching Simon kick the shit out of Rent for pulling that shite, regardless if Sick Boy wouldve done the same and, as said in the film, \"Simon is not a good person\". But I was happy to see the gang again and enjoyed the film and would watch it again.", "2_Subreddit": "opiates"}], "dwxlb4j": [{"0_Comment Submission": "Not going down", "1_Text": "Suboxone, in my honest opinion and personal experience, maybe its due to the fact Ive used opiates for a decade and a half.. but that is bullshit man I feel for you.. suboxone does not have any euphoric or recreational value like full agonists. At least thats from my experience with it. In my opinion that is so fucking unfair Im angry for you. If you dropped for morphine and/or benzos that would be a completely different story. Im sorry to hear this man keep your head up!", "2_Subreddit": "opiates"}], "dwxllqf": [{"0_Comment Submission": "R/drugs compares using heroin to raping children...", "1_Text": "Internet warriors and people who think theyre trolls and being a shit spewer is 'funny' or 'cool' / just complete morons lacking intellect in all aspects of life and the world they exist in makes for so many problems, especially when it comes to the predicament / situations all of us on this sub (for the most part) have in common. So far Ive met some good people on r/opiates only and have had debates, not arguments, and based on fact, not opinions and news media along with parental programming thats stuck on so many ignorant fools in modern society.", "2_Subreddit": "opiates"}], "dwxmau9": [{"0_Comment Submission": "Not going down", "1_Text": "It can be abused no question.. but if youre going to IV subutex (please, from what Ive seen it do to some of my peers veins, do not IV suboxone, please) from my experience Id rather just get a full agonist and use someone elses piss / synthetic piss and go for the gold. Buprenorphine has only ever made me feel like I did before I ever made the foolish decision of abusing opiates in the first place. Not saying I live a life of intense regret but thats one thing I wish I never did. But I hear you bud. When Im actually following my maintenance I prefer 2mg to higher doses. Higher doses give me headaches and digestive issues but everyone is different. Thats one thing that needs to be addressed in treatment (dont mean to digress) were all different, we feel different and react different than the person next to us might. Bothers me how a lot of these 'treatment facilities' are glorified cash grabs putting everyone in a herd so to speak. But I hear you my dude, again keep your head up man.", "2_Subreddit": "opiates"}]}], "1_submissions": [{}]}]}