{"Blueboya215": [{"0_comments": [{"dwabw3q": [{"0_Comment Submission": "Scored a 100 pack of blues... Last hooray before getting sober for good", "1_Text": "Idk I guess cause they’re always fake around here. Well I gusss I never get fakes cause my connects are solid, but I have this mental pre conceived notion that they don’t do shit to me. It’s like I don’t get as high off an A215 as I do m30. Why? Prolly all mental, I absolutely love a215 so obviously I’m gonna be biased toward em when I’d o em ya know? But yea idk just not a fan of mbox lol", "2_Subreddit": "opiates"}], "dwabxum": [{"0_Comment Submission": "Scored a 100 pack of blues... Last hooray before getting sober for good", "1_Text": "E8 is the only real one that’s a real shade of blue. That and v4812 (from pics at least)", "2_Subreddit": "opiates"}], "dwbb2i1": [{"0_Comment Submission": "Got some rare Blue 30s (: Yellow 10s, and a side of xans", "1_Text": "Definitely fake .. that’s why I hate mbox!", "2_Subreddit": "opiates"}], "dwbbwp2": [{"0_Comment Submission": "Scored a 100 pack of blues... Last hooray before getting sober for good", "1_Text": "I hustle on the side to support my habit. Mannnn I make 80k, doesn’t mean I take that home! I probably take home 60k. It’s crazy too cause from the outside nobody has any idea how bad my life is at this point, In terms of being a full blown junkie/addict. I drive a $80k car, have a great job, everyone knows me as successful. I got into a nasty motorcycle accident about 6 years ago now (wow can’t l believe I’ve been fucking with these blue little pills for more than half a decade... sheesh....) and that’s how I got hooked. That was when I was 18 y/o and a senior in high school. I worked at this Fortune 500 company my junior and senior years of college which is where my addiction really took off. And I graduated 2 years ago from college. Since then, my addiction has got much worse, primarily because I’ve had the funds to support it AND i have so much free time. All I do is work 8-4... before I used to be up at 6am go to class all day and then work all day at my internship ($25+/hr) and then go to the library to study after work. I was able to do them recreationally for a while before getting addicted and having a 4 blues a day (120mg) habit. I got on subs from a friend for 8 months after that and then tried getting off them (was only taking 2mg a day) and withdrawal was terrible. I relapsed and then graduated from college and that summer I spent all my savings ($35,000 in 3 months). I got clean off everything, even stopped drinking. I was on vivitrol for 6 months and got clean myself no detox or rehab. And then about a 14 months ago I reapsed again. Every relapse worse and worse. I got clean 2 times in between off everything for a week or two and should’ve got back on the shot but I relapsed time and time again... and that’s where I am today. Still trying to stop killing myself daily with this horrible addiction. The daily sickness/mental health issues (depression, anxiety) have really taken a toll on me as a person. From the outside everyone thinks I have this awesome life, which in a way I worked so hard for and earned for myself l, but little does anyone really know that I’m one of the most depressed, suicidal, self loathing people. I guess I’ve lesrned money really doesn’t equate to happiness. It just causes more problems, in my case, addiction. I continue to make POOR decisions on a daily basis just to support my habit. If I could get back every dollar I’ve ever spent on blues, it would be well over $250,000 in the past 4 years alone.", "2_Subreddit": "opiates"}], "dwbcae7": [{"0_Comment Submission": "Scored a 100 pack of blues... Last hooray before getting sober for good", "1_Text": "I would switch to dope but I’ve been lucky enough to always be able to find blues every single day. I’ve never not been able to get them, which in turn has perpetuated my addiction. I’ve had 3 really really close life friends (not just drug friends) lose their life to heroin overdoses. I’ve had countless other friends die as a result of opiates addiction too. But specifically heroin overdoses. I pledged to myself I would never do heroin, not because doing oxycodone is not as bad as doing heroin (because it’s not, in my opinion they’re the same thing as equally as bad. Either way you’re an addict), but because i pledged to myself I never wanted to make my loved ones feel the pain of losing me over doing heroin. I know it’s the same thing, I just like the fact I know EXACTLY what dose of opiates I’m doing. Heroin is playing Russian Roulette… You never know what you’re getting and you can easily overdose with all this fentanyl out here. The day I can’t find blues and or can’t affofd them maybe I’d consider heroin. Till then I’m all set. Any how I’m tying to get clean my friend, trying.", "2_Subreddit": "opiates"}], "dwprf5y": [{"0_Comment Submission": "105 Days Clean", "1_Text": "How did you get clean? Currently trying and not succeeding ...", "2_Subreddit": "opiates"}], "dwps1f8": [{"0_Comment Submission": "Variety packs are always nice 😎", "1_Text": "Damn just realized I didn’t cop the k57 (greys aka 20mg) damnit! And don’t bother asking about 5s... my tolerance is 300mg a day even the fact I got 10s is embarrassing", "2_Subreddit": "opiates"}], "dwrg62n": [{"0_Comment Submission": "Variety packs are always nice 😎", "1_Text": "No I’m not proud of it man. I’m a engineer I graduated with a 3.8 GPA from a top 10 public university. I work at a Fortune 500 company making 80k a year and a hustle on the side to support my habit. It’s sickening when I think how I fell into this trap and how I haven’t switched to heroin yet. This has been going on on and off 5 years, everyday for the past 3 years with 1.5 ish years of sobriety, half tnat on suboxone half that on vivitrol. Im trying to get my shit back together, this is a $2000+ dollar a week habit. When I add up how much I’ve spend on blues it’s sickening. 300k at least... I could have a house paid off by now, I drive a 70k car and live a pretty good life. Everyone thinks I have it made (which I do in a way, I’m not complaining, I have worked my ass off to get here DONT get me wrong) but money doesn’t equal happiness. Only if I could get sober. Honestly my testosterone is so depleted I stopped caring about girls and anything but getting high... it’s pathetic man. I’m trying to get back to where I was... just 2 years ago I graduated from college with 50k in the back paid off 40k car and staring my great job. Now I live paycheck to paycheck while approaching a 6 figure salary... all because of this addiction. I’m honestly ashame, I want help but don’t know how that get it. I don’t want to disappoint my family again they think I’m clean but after I got off vivitrol I relapsed it’s been about 14 months of relapse with maybe 3 weeks of clean time in between. I really  want to just stop this habit for good... you know how much money I would have? It’s sick dude it really is. I’m risking everything I worked so hard for the past 10+ years just to put oxycodone up my nose... I have a serious addiction, some and he help me get clean", "2_Subreddit": "opiates"}], "dwrg6mo": [{"0_Comment Submission": "Variety packs are always nice 😎", "1_Text": "Honestly no, read my post above", "2_Subreddit": "opiates"}], "dwrg8f6": [{"0_Comment Submission": "Variety packs are always nice 😎", "1_Text": "Wow I’m an idiot I didn’t even think of that haha and a215 you mean? Not a218", "2_Subreddit": "opiates"}], "dws44fw": [{"0_Comment Submission": "Variety packs are always nice 😎", "1_Text": "Do the math playa I told you I do 10 blues a day lol", "2_Subreddit": "opiates"}], "dws4sn8": [{"0_Comment Submission": "OxyContin from Mundipharma, just like the original Purdue ones from 1996", "1_Text": "Please pass along the email my email is bostonjohnny1993@gmail.com", "2_Subreddit": "opiates"}], "dws4t7l": [{"0_Comment Submission": "OxyContin from Mundipharma, just like the original Purdue ones from 1996", "1_Text": "Please pass along the email and instruction on how u got them I currently spend 400$ a day on blues I can’t afford it dude I need that connect my email is bostonjohnny1993@gmail.com", "2_Subreddit": "opiates"}], "dws4tev": [{"0_Comment Submission": "OxyContin from Mundipharma, just like the original Purdue ones from 1996", "1_Text": "Please pass along the email and instruction on how u got them I currently spend 400$ a day on blues I can’t afford it dude I need that connect my email is bostonjohnny1993(at)gmail.com", "2_Subreddit": "opiates"}], "dws4tlj": [{"0_Comment Submission": "OxyContin from Mundipharma, just like the original Purdue ones from 1996", "1_Text": "Please pass along the email and instruction on how u got them I currently spend 400$ a day on blues I can’t afford it dude I need that connect my email is bostonjohnny1993(at)gmail(dot)com", "2_Subreddit": "opiates"}], "dws4txr": [{"0_Comment Submission": "OxyContin from Mundipharma, just like the original Purdue ones from 1996", "1_Text": "Please pass along the email and instruction on how u got them I currently spend 400$ a day on blues I can’t afford it dude I need that connect my emAddy is bostonjohnny1993(at)gmail(dot)com", "2_Subreddit": "opiates"}], "dws4u5o": [{"0_Comment Submission": "OxyContin from Mundipharma, just like the original Purdue ones from 1996", "1_Text": "Please pass along the his mail and instruction on how u got them I currently spend 400$ a day on blues I can’t afford it dude I need that connect my emAddy is bostonjohnny1993(at)gmail(dot)com", "2_Subreddit": "opiates"}], "dws4udg": [{"0_Comment Submission": "OxyContin from Mundipharma, just like the original Purdue ones from 1996", "1_Text": "Please pass along the his mail and instruction on how u got them I currently spend 400$ a day on blues I can’t afford it dude I need that connect my emAddy is bostonjohnny1993(at)gmail(dot)com", "2_Subreddit": "opiates"}], "dws4uju": [{"0_Comment Submission": "OxyContin from Mundipharma, just like the original Purdue ones from 1996", "1_Text": "Please pass along the his mail and instruction on how u got them I currently spend 400$ a day on blues I can’t afford it dude I need that connect my emAddy is bostonjohnny1993 (gmail)", "2_Subreddit": "opiates"}], "dws4uru": [{"0_Comment Submission": "OxyContin from Mundipharma, just like the original Purdue ones from 1996", "1_Text": "Please pass along the his email and instruction on how u got them I currently spend 400$ a day on blues I can’t afford it dude I need that", "2_Subreddit": "opiates"}], "dws4v2f": [{"0_Comment Submission": "OxyContin from Mundipharma, just like the original Purdue ones from 1996", "1_Text": "Dude can you plz help me get these?!", "2_Subreddit": "opiates"}], "dws4v9p": [{"0_Comment Submission": "OxyContin from Mundipharma, just like the original Purdue ones from 1996", "1_Text": "Bro I need this dude", "2_Subreddit": "opiates"}], "dws4wjk": [{"0_Comment Submission": "OxyContin from Mundipharma, just like the original Purdue ones from 1996", "1_Text": "Bro sorry for the spam comments it kept saying “something has went wrong your post didn’t work” I hit refresh and bam... I see 10 fckn posts lol my bad!", "2_Subreddit": "opiates"}], "dwx37v7": [{"0_Comment Submission": "HELP!! 300+mg oxycodone daily - how much Kratom?", "1_Text": "I’m paying 1$/mg... yes my habit is expensive and that’s why I’m stopping. I would have over 250k in the past 2 years if I was clean...", "2_Subreddit": "kratom"}], "dwx3egi": [{"0_Comment Submission": "HELP!! 300+mg oxycodone daily - how much Kratom?", "1_Text": "Bro I’m fucking sick of it. I would literally have a house paid off in cash. Don’t get me wrong I still have a great (materialistic life) brand new m3, I have SOME money in my bank, but I live paycheck to paycheck and I make 80k a year... pretty sad. It also is fucked up what I do just to get high, risk my freedom for this drug, risk my job, my career, the 15 years of working my ass off to get where I am now. Shit is fucked man. I have to stop for good", "2_Subreddit": "kratom"}]}], "1_submissions": [{"86gvlz": [{"0_Title": "Took a sub and snorted blues. Life story of an addict....", "1_Text": "Idk I guess cause they’re always fake around here. Well I gusss I never get fakes cause my connects are solid, but I have this mental pre conceived notion that they don’t do shit to me. It’s like I don’t get as high off an A215 as I do m30. Why? Prolly all mental, I absolutely love a215 so obviously I’m gonna be biased toward em when I’d o em ya know? But yea idk just not a fan of mbox lol", "2_Subreddit": "opiates"}], "86h87z": [{"0_Title": "Scored some greens", "1_Text": "Idk I guess cause they’re always fake around here. Well I gusss I never get fakes cause my connects are solid, but I have this mental pre conceived notion that they don’t do shit to me. It’s like I don’t get as high off an A215 as I do m30. Why? Prolly all mental, I absolutely love a215 so obviously I’m gonna be biased toward em when I’d o em ya know? But yea idk just not a fan of mbox lol", "2_Subreddit": "opiates"}], "871ql7": [{"0_Title": "Scored a 100 pack of blues... Last hooray before getting sober for good", "1_Text": "Idk I guess cause they’re always fake around here. Well I gusss I never get fakes cause my connects are solid, but I have this mental pre conceived notion that they don’t do shit to me. It’s like I don’t get as high off an A215 as I do m30. Why? Prolly all mental, I absolutely love a215 so obviously I’m gonna be biased toward em when I’d o em ya know? But yea idk just not a fan of mbox lol", "2_Subreddit": "opiates"}], "89abjy": [{"0_Title": "Variety packs are always nice 😎", "1_Text": "Idk I guess cause they’re always fake around here. Well I gusss I never get fakes cause my connects are solid, but I have this mental pre conceived notion that they don’t do shit to me. It’s like I don’t get as high off an A215 as I do m30. Why? Prolly all mental, I absolutely love a215 so obviously I’m gonna be biased toward em when I’d o em ya know? But yea idk just not a fan of mbox lol", "2_Subreddit": "opiates"}], "8a96v0": [{"0_Title": "HELP!! 300+mg oxycodone daily - how much Kratom?", "1_Text": "Idk I guess cause they’re always fake around here. Well I gusss I never get fakes cause my connects are solid, but I have this mental pre conceived notion that they don’t do shit to me. It’s like I don’t get as high off an A215 as I do m30. Why? Prolly all mental, I absolutely love a215 so obviously I’m gonna be biased toward em when I’d o em ya know? But yea idk just not a fan of mbox lol", "2_Subreddit": "kratom"}]}]}]}