{"Feern313": [{"0_comments": [{"dvgimul": [{"0_Comment Submission": "Overdraft Line of Credit", "1_Text": "It's self checkout. If it doesn't work just long walk away.", "2_Subreddit": "opiates"}], "dvhhykn": [{"0_Comment Submission": "How do you people find your dealers?", "1_Text": "Give up on cold coping pills anymore.", "2_Subreddit": "opiates"}], "dvmiqxx": [{"0_Comment Submission": "Sooo.. One of my backup dealers tried to kill me today.", "1_Text": "I doubt you would have died shooting it. I've shot so many weird things that weren't dope over the years. Either way it's super fucked up.", "2_Subreddit": "opiates"}], "dvmix2o": [{"0_Comment Submission": "If Walter White whipped up heroin instead.", "1_Text": "Fent analogs can have long legs. I figured everyone knew this by now but damn I hear it a lot", "2_Subreddit": "opiates"}], "dvnh91r": [{"0_Comment Submission": "Am I an asshole?", "1_Text": "Whenever you ask yourself the question the answer is always yes.", "2_Subreddit": "opiates"}], "dvolkj6": [{"0_Comment Submission": "Bth pickup", "1_Text": "No wonder people think us junkies are insane. Look at the shit we happily shove into our veins. Looks good but also looks exactly like a dried old dog turd.", "2_Subreddit": "opiates"}], "dvra5sp": [{"0_Comment Submission": "My wd arsenal: 2 Molly presses and 2 m bombs , my last lonely k pin (hopefully getting more today) flexiril, big bag of weed and a shitload of kratom 💪🏾 I have Lyrica somewhere but my wife stashes it from me on sick days. she knows I can’t control myself but she’s at work ):", "1_Text": "Worst withdrawal kit ever.", "2_Subreddit": "opiates"}], "dvuzpr4": [{"0_Comment Submission": "Calling out your dboy when he shorts", "1_Text": "Half the city wishes they could have a dealer that skimps their bags and gets mad when you stand up for yourself. Sounds like a real gentleman", "2_Subreddit": "opiates"}], "dvz3elu": [{"0_Comment Submission": "Mini cannon", "1_Text": "I looked it up. Holy shit.", "2_Subreddit": "interestingasfuck"}], "dw3wu83": [{"0_Comment Submission": "Reddit content policy update", "1_Text": "Voat deletes subs too.", "2_Subreddit": "opiates"}], "dwdfn5r": [{"0_Comment Submission": "Patience ain't my virtue!", "1_Text": "Potency means so much more than good business practice. If it didn't none of us would be sitting in a sketchy ass parking lot waiting on our dumbass dealer to show up for 30 minutes only because they have the best shit.\n\nI constantly deal with a dude that I fucking hate. Like seriously fucking hate him. But he has the best shit 90% of the time so I deal with all the bullshit though. I have like 4 other dudes who are better with time and attitude and prices and weight, but their shit is never better than the asshole dude with short bags who takes forever to show up. \n\nYou can have a dude with any two of the following, but never more than two; good price, good with time, nice dude, and quality product. Pick two of those four things for them to be good with and they will be horrible at the other two guaranteed. If you ever meet someone who is good at all four of those things he's a cop.", "2_Subreddit": "opiates"}], "dwdg3cp": [{"0_Comment Submission": "When you cant cop...", "1_Text": "This is the only real answer.", "2_Subreddit": "opiates"}], "dwdg7ta": [{"0_Comment Submission": "How how how..", "1_Text": "I got a friend who's huge as fuck (like nearly 7 foot tall) and his short ass og dealer beat his ass and knocked all his teeth out over 50 bucks. Thank God all the dealers I dipped out on after 500+ dollar fronts never did that shit.", "2_Subreddit": "opiates"}], "dwdgnnq": [{"0_Comment Submission": "Every IV question I’ve always wanted to ask", "1_Text": "If you hit an artery you'll know. A regular vein can be numerous shades of red. From light to dark. Usually depending on how beat up and slow the vein is flowing and how hydrated you are.", "2_Subreddit": "opiates"}], "dwdn9ok": [{"0_Comment Submission": "MARCH MEGATHREAD: post your area code here", "1_Text": "MI 313, 248, 734", "2_Subreddit": "dopehangouts"}], "dwfuqz2": [{"0_Comment Submission": "With all the drugs I fucked with opiates were the only ones that ever grabbed a hold of me and made me struggle with addiction and to me it's because I found that sweet spot for everything.", "1_Text": "I don't know where you are in the old murder mitten but there's plenty of drugs here in the bigger cities.", "2_Subreddit": "opiates"}], "dwo9h00": [{"0_Comment Submission": "APRIL MEGATHREAD: post your area code here", "1_Text": "MI 313, 248", "2_Subreddit": "dopehangouts"}], "dwob3ms": [{"0_Comment Submission": "is it safe to drink old kratom?", "1_Text": "He's saying the go ahead and drink it. As long as it was in the fridge it's probably ok. I knew a girl who drank kratom sludge that sat in her fridge for 3 months while she was in jail.", "2_Subreddit": "opiates"}], "dwpkzoq": [{"0_Comment Submission": "A gram of South East Asian #4 China White", "1_Text": "Fent analogs have longer legs now.", "2_Subreddit": "opiates"}], "dwpl2d9": [{"0_Comment Submission": "A gram of South East Asian #4 China White", "1_Text": "Plenty of fent dope has that aa smell to it. There's ways to make it smell whatever way they want.", "2_Subreddit": "opiates"}], "dwtu769": [{"0_Comment Submission": "I passed my drug test for my job using “XSTREAM” synthetic urine. THANK GOD!!!", "1_Text": "Is that fake piss in your rig?", "2_Subreddit": "opiates"}], "dwtuodk": [{"0_Comment Submission": "Oh boy... I've seriously done it now...", "1_Text": "Which brings me to my next point, don't smoke crack.", "2_Subreddit": "opiates"}], "dwtutl7": [{"0_Comment Submission": "Why does dope have such a bad stigma?", "1_Text": "People suck dick for it.", "2_Subreddit": "opiates"}], "dwtuxfc": [{"0_Comment Submission": "Bring it on, dope. You don’t stand a chance", "1_Text": "He's felt that sensation before...ahahah", "2_Subreddit": "opiates"}], "dwtv22x": [{"0_Comment Submission": "how do I fucking poop", "1_Text": "Or if you're a real man use 3 fingers and just rip it out.", "2_Subreddit": "opiates"}]}], "1_submissions": [{}]}]}