{"Poppies_4_the_masses": [{"0_comments": [{"dwmij9r": [{"0_Comment Submission": "Let’s just overgrow the government with poppies ... ?", "1_Text": "There’d still be all the pharma drugs and regular opioids around (probably first choice for most). But when you’re sick and nothing else is around ... there’s always the poppies! Plus the labor in harvest acts as kind of a built-in safety mechanism to prevent overdoing it. 1-2 hours worth of harvesting for one good opium hit may not be such a bad thing..", "2_Subreddit": "opiates"}], "dwmj464": [{"0_Comment Submission": "Let’s just overgrow the government with poppies ... ?", "1_Text": "No offense taken, but yeah I grew/harvested last summer. Pics:\n\nhttps://imgur.com/a/sdmcC", "2_Subreddit": "opiates"}], "dwmlaxt": [{"0_Comment Submission": "Let’s just overgrow the government with poppies ... ?", "1_Text": "I did score them yeah - it's kind of hard to see the lance marks in the top picture but that razorblade sitting in the middle has freshly harvested O! :D  After harvesting the O I cut the pods off the stalk and mailed everything, including the O, to a buddy of mine (I'm currently being forced into Vivitrol injections every month ... but I'm still an opiate enthusiast!!)", "2_Subreddit": "opiates"}], "dwmn8b6": [{"0_Comment Submission": "Let’s just overgrow the government with poppies ... ?", "1_Text": "I'm in the medical profession and also get random UA's on a very regular basis :/ (really wanna keep my medical license haha).", "2_Subreddit": "opiates"}], "dwmotsy": [{"0_Comment Submission": "Let’s just overgrow the government with poppies ... ?", "1_Text": "But yeah, once you've scored the pods I would give the O ~6-8 hours to seep out and start drying. Then once you've scraped the (semi-dried) O off the outer capsule, cut the stalk a few inches below the pod and hang them up to dry for a few days. You'll know they're done drying once they're fully hardened and seeds start spilling out everywhere (definitely put something underneath to catch them or you'll have a mess haha). The tea wont be quite as potent since you've already removed some of the opium, but there's definitely still enough goodies left in there to make it worthwhile :) I updated the image link with another picture for reference: \n  https://imgur.com/a/sdmcC", "2_Subreddit": "opiates"}], "dwmp5qn": [{"0_Comment Submission": "New to Reddit! Picked up half a ball of some decent tar for $75 a couple days ago. What I have left of it. Pretty good deal if you ask me. Stuff is real solid and has a nice smell.", "1_Text": "I think this is just what OP still has left over from the original half ball", "2_Subreddit": "opiates"}], "dwmuyi1": [{"0_Comment Submission": "Let’s just overgrow the government with poppies ... ?", "1_Text": "It's all good my friend, no worries at all :)", "2_Subreddit": "opiates"}], "dwpdswm": [{"0_Comment Submission": "So apparently all emergency departments don't treat addicts like garbage.", "1_Text": "I couldn't agree more! May we always strive to treat our patients with compassion > judgment, and encourage our colleagues to do the same", "2_Subreddit": "opiates"}], "dwpeen1": [{"0_Comment Submission": "Relapsed", "1_Text": "Vivitrol was huge for me. I was initially forced into it, but looking back it was definitely for the best. PM me if you have any questions about it, whether personal experience or medical (I am in the medical field).", "2_Subreddit": "opiates"}], "dwpf546": [{"0_Comment Submission": "Very limited info on these online, help?", "1_Text": "Ehhh, Darvon is like one of the ugly redheaded stepchilds of opioids.  At higher doses it can be arrhythmogenic which is the main reason it was removed from the market (both in the US and Europe). Did you find an old script lying around?", "2_Subreddit": "opiates"}], "dwpfo73": [{"0_Comment Submission": "Very limited info on these online, help?", "1_Text": "Makes sense. Personally I wouldn't take more than couple tabs at once (at most), especially if you happen to be taking methadone, loperamide or anything else that prolongs the QT interval of your heart.", "2_Subreddit": "opiates"}], "dwpgnnr": [{"0_Comment Submission": "Very limited info on these online, help?", "1_Text": "I've never done them, but with minimal opiate tolerance you'll probably catch a little buzz. If you're accustomed to H, fent, oxy or any of the big gun opioids I probably wouldn't bother", "2_Subreddit": "opiates"}]}], "1_submissions": [{"88npaf": [{"0_Title": "Let’s just overgrow the government with poppies ... ?", "1_Text": "There’d still be all the pharma drugs and regular opioids around (probably first choice for most). But when you’re sick and nothing else is around ... there’s always the poppies! Plus the labor in harvest acts as kind of a built-in safety mechanism to prevent overdoing it. 1-2 hours worth of harvesting for one good opium hit may not be such a bad thing..", "2_Subreddit": "opiates"}]}]}]}