{"HoMcShmoe": [{"0_comments": [{"dgtkigl": [{"0_Comment Submission": "What historical fact blows your mind?", "1_Text": "What tastes did you have to acquire?", "2_Subreddit": "AskReddit"}], "dgtkuiw": [{"0_Comment Submission": "What tastes in life did you have to acquire?", "1_Text": "i would think so the bitch is dead", "2_Subreddit": "AskReddit"}], "dgtlnja": [{"0_Comment Submission": "What is your favorite one hit wonder rap song?", "1_Text": "Trinidad James - all gold everything", "2_Subreddit": "AskReddit"}], "dgtxt5u": [{"0_Comment Submission": "Have you ever seen a really ugly baby? How delusional were the parents about the baby's cuteness?", "1_Text": "My friend just became father, and showed the photos of his newborn to everyone. Not just he himself but all the ladies were just crazy about him, of course everybody assured them, that the Kid was sweet. He looked like John travolta when he joined Scientology though", "2_Subreddit": "AskReddit"}], "dgtyee8": [{"0_Comment Submission": "Teachers of reddit: What simple protip made you a much better teacher?", "1_Text": "Whith younger Kids, encouragement can make a difference. We had a new twacher in 5th grade, who told us the first time ”So, word around the school is you're a master class.”\nback then that felt really good", "2_Subreddit": "AskReddit"}], "dgvwen8": [{"0_Comment Submission": "Why can't you just ask a woman if they would like to have sex with you? Why do they consider it rude?", "1_Text": "In Germany an author for Playboy magazine asked a 100 beautiful women this question and nailed 3 of them", "2_Subreddit": "AskReddit"}], "dgvye2x": [{"0_Comment Submission": "Why can't you just ask a woman if they would like to have sex with you? Why do they consider it rude?", "1_Text": "https://www.woman.at/a/vom-herzensbrecher-pantoffelheld-kurt-molzer-woman-interview-291766\n\nNot particularly good looking I think. I think its better to play with open cards and base a relationship (does not have to be partnership) with a woman on the premise that you do want to cadoodle her lady parts. You just should not be apologetic about it. Just normal", "2_Subreddit": "AskReddit"}], "dgvzica": [{"0_Comment Submission": "Who did ever visited oktoberfest Germany?", "1_Text": "I did. It is overcrowded expensive and so full of tourists that its not authentic. If you get the chance to come to Germany and witness true German drinking culture you should visit Gäubodenfest in Straubing, Bavaria, second largest fair and more authentic. Even better is Bergkirchweih in Erlangen, Bavaria. Its located on the old castle hill of an old university City", "2_Subreddit": "AskReddit"}], "dgwkoeu": [{"0_Comment Submission": "Why does it seem like some people have a certain star quality to them?", "1_Text": "Some people have great body language, voice, mimic and extraversion that does not seem like attention whoring", "2_Subreddit": "AskReddit"}], "dgwva6m": [{"0_Comment Submission": "What are you going to put on your tombstone?", "1_Text": "\"I told you assholes to throw me in the trash\"", "2_Subreddit": "AskReddit"}], "dgwvjsi": [{"0_Comment Submission": "What jobs/careers are entering or about to enter their \"golden age\"?", "1_Text": "All IT stuff is becoming more and more important", "2_Subreddit": "AskReddit"}], "dhf3gfk": [{"0_Comment Submission": "What is the most cinematic \"walking around\" music?", "1_Text": "I always feel like an oldschool badass to the tune of the movie \"Django\".", "2_Subreddit": "AskReddit"}], "dj708xi": [{"0_Comment Submission": "What is the most unlikely or unbelievable coincidence that you've ever experienced or heard of?", "1_Text": "My father always told me this one: When he was young, he and his female friend  often used to go to the library at the University. There always was an old grumpy geezer sitting  at the reception, who used to bathe his yeast infected feet in a tub of soap water right there. The female friend asked him once where to find an enyclopedia and he told her \"I don't have any time for ugly hags like you\". So she told my father: \" I hope this guy will have a stroke\" (in German it's a saying that doesn't actually mean a medical stroke). And in the same night the guy dies. From a stroke. Obviously, the girl still feels a bit bad about it today.", "2_Subreddit": "AskReddit"}], "dw8ax79": [{"0_Comment Submission": "One time use in hair follicle test", "1_Text": "Thanks, I do not have a prescription and can start the test when i choose to, but dont want to shave my head or wait a long time.", "2_Subreddit": "opiates"}], "dwo0l7f": [{"0_Comment Submission": "Best shit for the newbie?", "1_Text": "Not very helpful", "2_Subreddit": "opiates"}]}], "1_submissions": [{"40tdhq": [{"0_Title": "Can someone PS the glasses of my teacher? Everyones wondering what he would look like without.", "1_Text": "What tastes did you have to acquire?", "2_Subreddit": "PhotoshopRequest"}], "414x3z": [{"0_Title": "Who can photoshop the glasses off my teacher?", "1_Text": "What tastes did you have to acquire?", "2_Subreddit": "PhotoshopRequest"}], "67vsrx": [{"0_Title": "What tastes in life did you have to acquire?", "1_Text": "What tastes did you have to acquire?", "2_Subreddit": "AskReddit"}], "6sec7r": [{"0_Title": "Good book in voice Training?", "1_Text": "What tastes did you have to acquire?", "2_Subreddit": "AskReddit"}], "6svh2t": [{"0_Title": "Whats a good book for voice training?", "1_Text": "What tastes did you have to acquire?", "2_Subreddit": "AskReddit"}], "86w7ki": [{"0_Title": "One time use in hair follicle test", "1_Text": "What tastes did you have to acquire?", "2_Subreddit": "opiates"}], "88xvpy": [{"0_Title": "Best shit for the newbie?", "1_Text": "What tastes did you have to acquire?", "2_Subreddit": "opiates"}]}]}]}