{"Bernnnz": [{"0_comments": [{"dj14965": [{"0_Comment Submission": "neck pain and headaches, i almost want to take kratom again", "1_Text": "Honestly, if its between you taking Kratom or an Opioid pain medication, you should definitely just go back to Kratom. Id look into other herbal remedies as well before considering a synthetic one. Cannabis could help.", "2_Subreddit": "quittingkratom"}], "dkgo7go": [{"0_Comment Submission": "I turn 21 in 1 hour. I also am approaching day 3 of being clean off of 120mg/day oxy habit.", "1_Text": "Awesome to hear your clean man! Just be really careful with the Kratom as it can be a menacing addiction as well. Some may disagree but I see the withdrawals as a mix of a benzo and opiate withdrawal.", "2_Subreddit": "opiates"}], "dkszlmh": [{"0_Comment Submission": "Catalyst to activate kratom?", "1_Text": "Quite possibly my favorite combination of substances is Kratom mixed with 1-2 Beers. The euphoria I get from this combo is unreal. I dont recommend this, as it obviously has a potential to be dangerous, but in my opinion, it is much safer than mixing alcohol with traditional opiates.", "2_Subreddit": "kratom"}], "dkthodf": [{"0_Comment Submission": "Seriously...", "1_Text": "It definitely is better than being a slave to traditional opiates... However, it is addictive as well. Tread lightly.", "2_Subreddit": "kratom"}], "dkthxzp": [{"0_Comment Submission": "Opms kratom", "1_Text": "Way too expensive. I loved that brand for the longest time but eventually I wasted so much money I became disgusted with myself. The only kratom I will purchase from a headshop nowadays is made by remarkable herbs.", "2_Subreddit": "kratom"}], "dkti5v8": [{"0_Comment Submission": "Agamatine kratom reduce", "1_Text": "Id try to just toss and wash powder. You will definitely see a big difference in effects. Once I started consuming powder over capsules, I never went back.", "2_Subreddit": "kratom"}], "dktnetz": [{"0_Comment Submission": "Opms kratom", "1_Text": "I buy 3oz bags for like $30 where Im at. The Vietnam is good but I prefer the Bali or Maeng Da", "2_Subreddit": "kratom"}], "dkwzz5t": [{"0_Comment Submission": "Agamatine kratom reduce", "1_Text": "Powder hits you faster. Its pretty self explanatory... Your stomach doesn't have to break down a gelatin capsule.", "2_Subreddit": "kratom"}], "dkyxmre": [{"0_Comment Submission": "Has anybody taken kratom and adderall together and gotten liver/kidney pain? Not blaming the kratom, just wondering about the combination.", "1_Text": "I always come down with some Kratom after using Adderall. I havent noticed anything specific, but i usually feel like a truck hit me once the Kratom wears off if I dont fall asleep by that time.", "2_Subreddit": "kratom"}], "dl4292o": [{"0_Comment Submission": "Rambles from a Future Addict", "1_Text": "Look into Kratom. Legal in most of the US states. With no tolerance it should feel pretty similar to oxy. I was seriously depressed before finding out about this plant 2 years ago and my life has seriously improved. I find it has a ceiling and wont completely fuck your life like pills/dope. However, dont be fooled, it is addicting and produces some shitty withdrawals.", "2_Subreddit": "opiates"}], "dl4o1cv": [{"0_Comment Submission": "Finally quitting for good. Day 1.", "1_Text": "Im mainly concerned about it for work. I sweat enough as it is while running around that hot kitchen haha.", "2_Subreddit": "quittingkratom"}], "dl6zxp3": [{"0_Comment Submission": "Friend caught this fish today, what is it?!", "1_Text": "What state?", "2_Subreddit": "Fishing"}], "dlecm9b": [{"0_Comment Submission": "So freaking difficult", "1_Text": "I dont think theres a chance that I wont consume alcohol. So ill do my best to keep it at a minimum.", "2_Subreddit": "quittingkratom"}], "dlk2cb3": [{"0_Comment Submission": "Just got some street oxys... Almost 100% sure they're fake - no markings on them or anything", "1_Text": "I literally bought the same tablets from a plug around here pretty cheap the other day. Im assuming theyre just pressed fent powder, however they seem pretty weak.", "2_Subreddit": "opiates"}], "dlk4i4g": [{"0_Comment Submission": "Just got some street oxys... Almost 100% sure they're fake - no markings on them or anything", "1_Text": "they had no effect?", "2_Subreddit": "opiates"}], "dmea2fq": [{"0_Comment Submission": "LABOR DAY SALE/GIVEAWAY! $69 SPLIT KILOS AND 4 250g WINNERS! ENTER NOW!", "1_Text": "Green Borneo\nGreen Maeng Da\nRed Maeng Da\nRed Bali", "2_Subreddit": "kratom"}], "dmleuh8": [{"0_Comment Submission": "Best places to buy OPMS Silver online?", "1_Text": "Id try out different sources. I used to love OPMS until I tried a few other reputable sources and learned that I was wasting so much money.", "2_Subreddit": "kratom"}], "do1dv91": [{"0_Comment Submission": "I found this little guy on a highway in the Texas panhandle. I've lived here my whole life and never seen one like it. Sorry for the terrible picture. I was trying not to get run over. His defense mechanism was hiding his head. Any ideas?", "1_Text": "Desert Kingsnake (Lampropeltis getula splendida)", "2_Subreddit": "whatsthissnake"}], "do1r0h5": [{"0_Comment Submission": "I found this little guy on a highway in the Texas panhandle. I've lived here my whole life and never seen one like it. Sorry for the terrible picture. I was trying not to get run over. His defense mechanism was hiding his head. Any ideas?", "1_Text": "Definitely a King... Looks like a holbrooki with a lot of splendida influence", "2_Subreddit": "whatsthissnake"}], "dvq51if": [{"0_Comment Submission": "I'm a happy camper right now. Walked away with FIFTY roxy 30's(most I've ever had) plus my tolerance has dropped & I just railed 3 and I'm already nodding. 😍😍", "1_Text": "I had these exact presses or atleast extremely similar for months. Getting them for dumb cheap until plug decided to screw me. Looked really similar to the real deal color just slightly off and much shorter, noddier high.", "2_Subreddit": "opiates"}], "dvvrm03": [{"0_Comment Submission": "Amazing jug today. Made out with $20, eight oxy 10s and two balloons. Happy nods!!!", "1_Text": "it also makes it way worse that you're on here bragging about it...", "2_Subreddit": "opiates"}], "dvx1eqj": [{"0_Comment Submission": "XR. I like them.. anyone wanna join? Lol", "1_Text": "pretty sure you can break the time release on those without much effort", "2_Subreddit": "opiates"}], "dw10j4j": [{"0_Comment Submission": "Does Kratom Block Oxy?", "1_Text": "Depends on when your last dose of kratom was and how much oxy you're doing", "2_Subreddit": "opiates"}], "dw4vq19": [{"0_Comment Submission": "Hydro and Kratom combo?", "1_Text": "save the kratom for when you dont have any hydros", "2_Subreddit": "opiates"}], "dwsyemu": [{"0_Comment Submission": "opiates n kpop", "1_Text": "damn weaboos", "2_Subreddit": "opiates"}]}], "1_submissions": [{}]}]}