{"now_you_see": [{"0_comments": [{"dwwk813": [{"0_Comment Submission": "Tried to repair a TV backlight but I didn't have the correct parts so I had to get creative...", "1_Text": "Mama would be proud", "2_Subreddit": "DiWHY"}], "dwwknir": [{"0_Comment Submission": "How impractical", "1_Text": "I’m guessing a teenager lives in there & wanted light & to know who was knocking", "2_Subreddit": "DiWHY"}], "dwwkrd7": [{"0_Comment Submission": "My dad thinks he’s a bit of a handyman", "1_Text": "Yo, a safety switch saved my life after an electric circuit ‘fix’ in a friends spa. I feel you man, that shits terrifying! I also got a high volt shock via security fencing (on holiday at house I didn’t know was wired up) the pain lasts a long time and it’s one of the worst pains I’ve ever felt and it was a ‘warning’", "2_Subreddit": "DiWHY"}], "dwwol3b": [{"0_Comment Submission": "(Repost cuz rules) Bunch of lesbians crawling through a window, nothing to see here", "1_Text": "This story is actually a joke that is at least 18 years old (the motherfuck is old enough to drink with me) cause I heard it when I came out as a kidlet and have heard it repeated in various manners since.", "2_Subreddit": "thatHappened"}], "dwwom01": [{"0_Comment Submission": "(Repost cuz rules) Bunch of lesbians crawling through a window, nothing to see here", "1_Text": "Fourth tooth?", "2_Subreddit": "thatHappened"}], "dwwomws": [{"0_Comment Submission": "(Repost cuz rules) Bunch of lesbians crawling through a window, nothing to see here", "1_Text": "But sometimes when kept in captivity too long their dorsal curls over a little", "2_Subreddit": "thatHappened"}], "dwwpptj": [{"0_Comment Submission": "Posted by my former manager at Domino’s. She was fired for stealing $800 from the register.", "1_Text": "I have more than a couple of ‘friends’ who’s Facebook posts have made me think poorly of them because of shit like that. Especially the ‘I need a cigarette, can some one pleassseeee buy me and pack and bring it to me or even just bring me a few???” Then they start tagging names (mine included) with begging compliments and “I miss you and want to catch up anyway, you could just bring your smokes with you LOL”\nIt’s awful", "2_Subreddit": "ChoosingBeggars"}], "dwwu6xa": [{"0_Comment Submission": "BP claims an oil spill off Australia's coast would be a 'welcome boost' to local economies", "1_Text": "Can you provide proof? Because it seems to me\nThat your argument is the equivalent of ‘if you smoke cigarettes - people saving you from a car crash is pointless cause you’re gonna die later anyway", "2_Subreddit": "nottheonion"}], "dwwuc10": [{"0_Comment Submission": "BP claims an oil spill off Australia's coast would be a 'welcome boost' to local economies", "1_Text": "Like I said in my other post. Your logic is nonsense. These people ARE saving these animals.\nWe need to stop offshore drilling and there has been a massive campaign in Australia that’s prevented BP’s plans from coming to fruition - but if corrupt governments allow it to happen and there is a spill: saving these animals is saving the world.", "2_Subreddit": "nottheonion"}], "dwwvjb7": [{"0_Comment Submission": "Using 300,000 pennies to pay a bill to the DMV", "1_Text": "Dude. That would be genius! I don’t care what dmv did - this guy is an asshole. He ruined the day of every single customer who would have had to wait for hours due to the lack of staff as well as made the staffs lives insanely difficult, because it’s totally their fault the service has an issue with a customer. He lost a lawsuit, he was clearly wrong and is clearly a dick.\nWould have made him do that for a week before saying that it was not going to be possible and to speak with head office to arrange an appointment where more coins could be counted in time.", "2_Subreddit": "MaliciousCompliance"}], "dwwvlmx": [{"0_Comment Submission": "Using 300,000 pennies to pay a bill to the DMV", "1_Text": "I love that you know this fellow human :-)", "2_Subreddit": "MaliciousCompliance"}], "dwwxw3j": [{"0_Comment Submission": "Do not adjust default alarms for our system!", "1_Text": "I love to do something that I know will set fire to the company then taking the weekend off and ignoring my phones because - if you want to abuse me and insist it’s done one way - I’ll do it that way. You can pick up the pieces of your own failure.\nKudos OP I love it! Medical needs people to have a say in the way things are done. Feet on the ground should making these rules rather than corporate", "2_Subreddit": "MaliciousCompliance"}], "dwyjx8h": [{"0_Comment Submission": "Her friend started seeing her ex (from middle school) they’re 23.", "1_Text": "Who the fuck calls it ‘illnana’ is that another langauge?", "2_Subreddit": "insanepeoplefacebook"}], "dwyjy3u": [{"0_Comment Submission": "My kind of drug!", "1_Text": "Who needs pills when you can swallow the earth", "2_Subreddit": "insanepeoplefacebook"}], "dwyjzdy": [{"0_Comment Submission": "She posts this junk daily. I love it.", "1_Text": "I was with her for the first section. It annoys me when people use those ‘before I was fat’ type tags to get attention and get compliments. But the second 1/2 just went way off the rails", "2_Subreddit": "insanepeoplefacebook"}], "dwyk0fz": [{"0_Comment Submission": "I'd surely have a nibble of human flesh", "1_Text": "Yeah. I kinda of agree. I’d like to try human", "2_Subreddit": "insanepeoplefacebook"}], "dwyk42x": [{"0_Comment Submission": "This is just the tip of the iceberg", "1_Text": "Uhh.....ok, he needs more than a social worker", "2_Subreddit": "insanepeoplefacebook"}], "dwyk5m2": [{"0_Comment Submission": "This is just the tip of the iceberg", "1_Text": "Did you check out the YouTube clip op posted on a comment above? Not even you or your colleagues could save this man. He needs a psych ward right now right now right now", "2_Subreddit": "insanepeoplefacebook"}], "dwymu6z": [{"0_Comment Submission": "Believe in the Big Bang theory and not God?! You hypocrite!", "1_Text": "The ‘man created sentience’ threw me for a minute before I figured out what you meant.\nThe forth thing though is always my issue with religion. Is god a scary evil dictator that will sent you to hell or a loving and kind creator that is worthy of worship?! Because fuck god if he’s a evil dictator - either we should fear him or worship him. You can’t have it both ways", "2_Subreddit": "insanepeoplefacebook"}], "dwyn0cy": [{"0_Comment Submission": "If you jack off to women you’re a submissive homosexual", "1_Text": "I’ve never seen that movie. But the long drugs and jail time rant is spot on. Looks like a good film actually - should check it. Also, I think I need to bang some dudes so I get the chicks knocking on my door again!", "2_Subreddit": "insanepeoplefacebook"}], "dwyn0pp": [{"0_Comment Submission": "If you jack off to women you’re a submissive homosexual", "1_Text": "Neither", "2_Subreddit": "insanepeoplefacebook"}], "dwyn49u": [{"0_Comment Submission": "If you jack off to women you’re a submissive homosexual", "1_Text": "Yeah. That’s exactly it. r/incels being a banned sub is great for the whole ‘ less rape and school shootings’ but shit for the whole ‘who are we going to see now, with an open mouth shocked look, and realise that maybe we aren’t doing so badly in life after all?!", "2_Subreddit": "insanepeoplefacebook"}], "dwyn5nt": [{"0_Comment Submission": "Some discussion with the people from the small town I grew up in.", "1_Text": "I like the way you calmly used a logical argument, then took their answers to the next step down the line", "2_Subreddit": "insanepeoplefacebook"}], "dwynaov": [{"0_Comment Submission": "Some discussion with the people from the small town I grew up in.", "1_Text": "Non American here. To be fair; my government doesn’t contain trump. However, the US are alone in terms of western (and a lot of non-western) countries allowing insane guns to be owed by the masses to literally no reason at all. \nAustralia had 1 mass shooting, back in...1991-ish. The government announced a gun buy back (they crushed literal tons of gun metal) and banned the semi-autos etc. We haven’t had a mass shooting since.\nIf you need a gun as a farmer/hunter etc. That’s cool. You don’t need an automatic weapon for that! \nIf any of you Americans think your automatic weapons are gonna protect you from your government - I’m sorry but that’s idiotic! The government had bomber planes, drones, Nukes, chemical weapons and bombs. Tell me again how your automatic weapon is gonna save you from the drones......", "2_Subreddit": "insanepeoplefacebook"}], "dwyne2k": [{"0_Comment Submission": "Using the moon to measure time is against God", "1_Text": "Lest and shouldest do not mean ‘do not’", "2_Subreddit": "religiousfruitcake"}]}], "1_submissions": [{"61kz6q": [{"0_Title": "Could other planets have been 'destroyed' by a lifeform?", "1_Text": "Mama would be proud", "2_Subreddit": "askastronomy"}], "6tl9b7": [{"0_Title": "When you loose an entire cat for an entire day.", "1_Text": "Mama would be proud", "2_Subreddit": "Eyebleach"}], "6vajo7": [{"0_Title": "Dead fish are petty (X-post r/cringepics)", "1_Text": "Mama would be proud", "2_Subreddit": "insanepeoplefacebook"}], "78nksr": [{"0_Title": "ELI5-Why do pointless words such as 'irregardless' exist?", "1_Text": "Mama would be proud", "2_Subreddit": "explainlikeimfive"}], "7svx5c": [{"0_Title": "This is my last resort (re-post from r/funny)", "1_Text": "Mama would be proud", "2_Subreddit": "PapaRoach"}], "7wsyhx": [{"0_Title": "Sunrise from Mt Dandenong, Victoria, Australia.", "1_Text": "Mama would be proud", "2_Subreddit": "itookapicture"}]}]}]}