{"gunmetalblue60": [{"0_comments": [{"dwu5rsb": [{"0_Comment Submission": "I'm Eric Hafner, I'm running for U.S. Congress in Portland, Oregon (OR-3). I want to legalize all drugs, including opiates, but offer ibogaine therapy too, and free drugs for addicts via prescription.", "1_Text": "It is fortunate. I'm not far from NJ and have family there. We are a rambunctious bunch but we get shit done. ;)", "2_Subreddit": "opiates"}], "dwu6hze": [{"0_Comment Submission": "Just wanted to say", "1_Text": "Happy nods to you as well. I feel the same way about this place. I don't know how I managed without it for the years that I didn't know much about reddit. I'm so glad we all found this little sub. Good night. <3", "2_Subreddit": "opiates"}], "dwu6iod": [{"0_Comment Submission": "Oscar as a pup!", "1_Text": "Awwwwwwww", "2_Subreddit": "opiates"}], "dwu6izy": [{"0_Comment Submission": "My best friend just died, having overdosed on fentanyl.", "1_Text": ".", "2_Subreddit": "opiates"}], "dwu6o98": [{"0_Comment Submission": "I don’t know how to ask new dealer or sideman on phone", "1_Text": "Time to take the training wheels off. You'll do fine. Just stay calm and don't sound nervous when you ask. :)", "2_Subreddit": "opiates"}], "dwu70n1": [{"0_Comment Submission": "How much dope can you get into 1 shot", "1_Text": "This. It's never worth ending your life for. Nothing. Not for a lover, money, housing, friends or jobs or anything in between. You will NEVER know what tomorrow has in store for you. \n\nTreat life with an air of the wheel of fortune.  No, not the game show. I mean that each morning is a new spin. Let destiny take you anywhere.  \n\nOn the off chance this was not a suicide question, I apologize and you should still treat each day like that. \n\nAs for your actual question: based on the other replies you've gotten here, I'm gonna say you can fit a metric shit ton in one shot. I don't shoot, so I know nothing about it. Sorry lol", "2_Subreddit": "opiates"}], "dwu78on": [{"0_Comment Submission": "oxys xanax and vodka will I die", "1_Text": "Trying to puke and the finger down the throat isn't working? Do you have animals? Go to the litter box if you have a cat or the back yard if you have a dog. Scoop up some shit and put it in your toilet. Bend over and lower your face as close to the toilet water as you can. Make yourself cough and smell the shit. I don't know. Just trying to think of what would make me puke. Or watch some geriatric porn. Don't kill yourself. Is this a theme on r/o tonight or something", "2_Subreddit": "opiates"}], "dwu79bi": [{"0_Comment Submission": "oxys xanax and vodka will I die", "1_Text": "Yes. His tomorrow self will be happy he saved it.", "2_Subreddit": "opiates"}], "dwu7auf": [{"0_Comment Submission": "What’re your other vices?", "1_Text": "Coffee and cigarettes.", "2_Subreddit": "opiates"}], "dwu7d0g": [{"0_Comment Submission": "How long does oxycodone last?", "1_Text": "I take 40 mg extended release oxy and I get a good 4 hours out of each dose. If I'm taking stims with it, I feel like I get a longer run out of the dose for some reason.", "2_Subreddit": "opiates"}], "dwu7dyz": [{"0_Comment Submission": "K|56", "1_Text": "Delicious. Thanks!", "2_Subreddit": "opiates"}], "dwu7wsq": [{"0_Comment Submission": "I had to save my friend's life tonight.", "1_Text": "Sucks that both were irate. Sometimes one is the reasonable one. I'm hoping that after your friend pulls through, he will verify your story to them and stick up for you. I doubt that the police will seek you out. It's already on record that you saved him and were free to go after the incident. What puzzles me is why they would even suggest that you'd be the logical choice to drop the ID off. You'd think it would be the police responsibility to bring the ID to his family and professionally deliver the bad news. I highly doubt anything will come of this. I hope your friend pulls through quickly. Good luck!", "2_Subreddit": "opiates"}], "dwu844c": [{"0_Comment Submission": "Just wanted to say", "1_Text": "I found this \"home away from home\" via a Google search for dose conversion. After reading a few posts that day, I bookmarked it. I lurked without making an account for about 6 months. I finally caved in and made a user ID and started commenting and posting.", "2_Subreddit": "opiates"}], "dwu8o67": [{"0_Comment Submission": "Welp, I told my dad..", "1_Text": "I'm so sorry he reacted that way. Moms are generally fixers. Mayve when she gets home and finds out, she will talk some sense into him and all of you can sit down and figure out a solution. Good luck OP. Let us know how it's going", "2_Subreddit": "opiates"}], "dwu93n6": [{"0_Comment Submission": "Guys, just found 30mg hydrocodone in my vehicle. I don't have much of a tolerance , next to none. Should I take It all?", "1_Text": "I think you'll be fine just taking them.", "2_Subreddit": "opiates"}], "dwu9fxe": [{"0_Comment Submission": "Prolong the life of a user", "1_Text": "This is actually the healthy thing to do in order to heal properly. Kudos to you for being so self aware about where you're at in the grieving process (denial and bargaining)  just based on this, I'm going to bet you'll be okay and over her soon. I wish you many happy years ahead of you. You'll find that person. Then, you'll look back on all of this with some pity for her and a \"What in the actual fuck was I thinking back then? \"", "2_Subreddit": "opiates"}], "dwu9yyd": [{"0_Comment Submission": "Ldr’s", "1_Text": "It can work. I didn't have faith this concept for many years but it seems that once sparks start flying...  There's no turning back. One bit of advice. If you tend to be an insecure person, the distance issue will exacerbate that flaw. If you're impatient, same thing. There is a blind bonus to this (providing that you are self confident and patient)... That you get to know the person much better via straight up conversation rather than worrying about clothes hair and make up for example. You're getting one on one time and there are freedoms of asking questions that you'd otherwise be more hesitant to ask if you were out on dates. Also be sure that the person isn't positioning you for financial scams or something. Take your time and see what happens. Good luck!", "2_Subreddit": "opiates"}], "dwua7ch": [{"0_Comment Submission": "today would’ve been your 23rd birthday. i miss you everyday darlin’ 💔", "1_Text": "I don't know. I kind of like the \"straightened arrow\"... Super cute mistake. I love it. Anyway, I'm so sorry about your friend and those babies. I hope you're allowed to be a part of their lives. Remind them often how loving and sweet their mother was and focus on her good attributes. I'm sure they'll hear enough about the bad stuff from someone at some point. You have the opportunity to tip the scales to the good. Hugs to you and those babies.", "2_Subreddit": "opiates"}], "dwuacmc": [{"0_Comment Submission": "today would’ve been your 23rd birthday. i miss you everyday darlin’ 💔", "1_Text": ".", "2_Subreddit": "opiates"}], "dwuag51": [{"0_Comment Submission": "Getting opiates filled.", "1_Text": "I wouldn't mention the anxiety much. It may cause the doctor to believe you'll become an addict due to the anxiety and the relief that opiates bring for people with anxiety or depression. Stick to the complaint about the physical pain. Just my 2 cents. The other questions, I have no clue", "2_Subreddit": "opiates"}], "dww48bj": [{"0_Comment Submission": "Losing my pill plug of 6 years", "1_Text": "One of my plugs passed away last year. Sucked becsuse she was my friend before all the pill nonsense. Started out we were both in pain management and we would spot each other pills now and then. She eventually wanted to get off them. We talked and decided she would continue pain management and just sell me her script. She would take 10 out for her monthly appointments and take them the 3 days prior in case of urine test. It was a well oiled machine. Then she died suddenly (massive heart attack). Fortunately I had two other sometimes plugs that I was able to patronize more often. If your plug passed away, I'm sorry for your loss. If it's other reasons, I'm also sorry for your loss. I hope you can find a replacement plug. Good luck man", "2_Subreddit": "opiates"}], "dww4c9p": [{"0_Comment Submission": "Who got the link of the post about the guy claiming he's in Afghanistan or somewhere in Iraq or something about him and 10 other Muhammad's cooking up dope from start to finish. It was like a 30 pic Imgur link.", "1_Text": "Did it happen recently here? This can't be real life lol", "2_Subreddit": "opiates"}], "dww4opq": [{"0_Comment Submission": "Waiting", "1_Text": "Tell him you're there and been there for 2 hours and you're gonna head home. Ask him to call you when he gets back or if he wants to come to your place on his way home. That's what I do when they're that late.", "2_Subreddit": "opiates"}], "dww4u9v": [{"0_Comment Submission": "Backing out last minute...", "1_Text": "I take these. Same mg. Don't you like them?", "2_Subreddit": "opiates"}], "dwwcuxd": [{"0_Comment Submission": "Backing out last minute...", "1_Text": "Fair enoigh  ☺", "2_Subreddit": "opiates"}]}], "1_submissions": [{"62izf3": [{"0_Title": "Erie County Western NY warning. 7 deaths in 24 hours.", "1_Text": "It is fortunate. I'm not far from NJ and have family there. We are a rambunctious bunch but we get shit done. ;)", "2_Subreddit": "opiates"}], "63j8pb": [{"0_Title": "pill porn close to the stroke of midnight! I hope everyone's getting their groove on", "1_Text": "It is fortunate. I'm not far from NJ and have family there. We are a rambunctious bunch but we get shit done. ;)", "2_Subreddit": "opiates"}], "65nh7h": [{"0_Title": "Selfie Saturday gtfo doxxing no thanks because this is what it looks like. Go ahead....", "1_Text": "It is fortunate. I'm not far from NJ and have family there. We are a rambunctious bunch but we get shit done. ;)", "2_Subreddit": "opiates"}], "6c7u61": [{"0_Title": "Anyone heard from fat_loser_junkie?", "1_Text": "It is fortunate. I'm not far from NJ and have family there. We are a rambunctious bunch but we get shit done. ;)", "2_Subreddit": "opiates"}], "6s26ds": [{"0_Title": "Combo Ritual Doses?", "1_Text": "It is fortunate. I'm not far from NJ and have family there. We are a rambunctious bunch but we get shit done. ;)", "2_Subreddit": "pillhead"}], "6xvqvq": [{"0_Title": "Burned myself a bit while burning the dgirl", "1_Text": "It is fortunate. I'm not far from NJ and have family there. We are a rambunctious bunch but we get shit done. ;)", "2_Subreddit": "opiates"}], "7juld9": [{"0_Title": "I fucked up my kratom attempt today", "1_Text": "It is fortunate. I'm not far from NJ and have family there. We are a rambunctious bunch but we get shit done. ;)", "2_Subreddit": "opiates"}], "83ksqv": [{"0_Title": "Because I forget every damn time", "1_Text": "It is fortunate. I'm not far from NJ and have family there. We are a rambunctious bunch but we get shit done. ;)", "2_Subreddit": "opiates"}]}]}]}