{"Ar0war": [{"0_comments": [{"dvj5mud": [{"0_Comment Submission": "SOS! I'm struggling BAD. Can't use.", "1_Text": "as a guy that wants to feel the opiate high without taking an opiate...., do you believe is safe to take Kratom?", "2_Subreddit": "opiates"}], "dvjbpxl": [{"0_Comment Submission": "Long time lurker first time poster. D-boy pulled through on Thursday! Happy nods...", "1_Text": "I am a no user as well but drugs got my interest since I was a kid, have done a lot from psycheledics, ketamine, cocaine..., never get adicted to anyone and just love cocaine when used once each 2 months. \n\nBut as we know... opioids is another different story, a dragon I will ever wake up. I even was planing to use (had 0.3 H at home), asked reddit for advice 10 days ago (dosage, which effects expect.., etc..) and the /r/opiates users saved a random guy from a posible way down to an endless hole (have an adictive personality, if I would like it I would love it, and I will \"try it again\" for sure).\n\nNow some days later I really want to feel the opioid high... but it wont be with opioids. I ll probbably just get some kratom...", "2_Subreddit": "opiates"}], "dvjiml1": [{"0_Comment Submission": "My first time injecting cocaine", "1_Text": "I hope you know where you are geting yourself into...\n \nI am not talking from experience but from a very near example..., as long as many time reading people lives. Dude..., once you try the needle the worst and most probable scenario is that you will love it and other ways of administration won´t feel the same..., i suppose you already crossed the line yesterday but if I know something is that cocaine fucks you up very fast if you IV..., and even the rush must be awesome soon or later you will understand what paranoia and real comedowns are...\n\nTL; DR Stay far away from the neddle. But your life, your choice. Not trying to give anyone advice..., but I feel I have to say something at least.", "2_Subreddit": "cocaine"}], "dvjj7s8": [{"0_Comment Submission": "WHAT THE FUCK?", "1_Text": "go to the DNM you can see millions of offers like this one", "2_Subreddit": "cocaine"}], "dvmejbj": [{"0_Comment Submission": "Bard turns 3 today!", "1_Text": "people says that a lot... \n\nStop counting the time as months/years and start counting it as experiences you have. If you believe \"time flies\" is because you hadn´t much experience those last years. \n\nAt least thats my point of view.", "2_Subreddit": "leagueoflegends"}], "dvsjvt3": [{"0_Comment Submission": "Candy", "1_Text": "I will just tell you this...\n\nMany years ago, I was 13-15 so about 14 years back, listened to my older sister talking about this book with a friend, so full of curiosity I read it and holy shit! I felt in love with the history... I read it many times in my life and I just can´t recomend this book enough... the history is just too real. As a 15 years old guy i found myself thinking about how the Heroin would feel... \"it must be an awesome feeling holy shit\". Now a bit older I didnt ever tried it and not going to try (Had 0.3g H some weeks ago, wrote a post on /r/opiates looking for advice as a first timer, but reddit users scared me and threw it away).\n\nA year back found this film and is pretty good one...  but the book..., holy shit THAT BOOK....", "2_Subreddit": "opiates"}], "dvsktwo": [{"0_Comment Submission": "First bag ever", "1_Text": "I would say your choice seems fair enough to me and I would do the same. I saw something arround the lines: \"Opiates can only be an option when you have to choose between adiction or pain\" so thats it. \n\nI would do the same for sure.", "2_Subreddit": "opiates"}], "dvt460r": [{"0_Comment Submission": "My 2 favorite hobbies, shitting and smoking blues", "1_Text": "hate to be \"that guy\" but I hope you realize you are addicted again. From the \"just once\" to \"now last once I swear\" to \"ey guys look I am having fun\"\n\nI dont know you and I am no one to say anyone anything specially you who knows exactly where you are getting into. I m just saying think twice and ask yourself if you want to sacrifice the last year... \n\nThat said... have fun dude and do what you like ;). You know better than me what comes after that so if you believe is worth just go for it! ;)", "2_Subreddit": "opiates"}], "dvwrd39": [{"0_Comment Submission": "Can someone please tell me if this is fake?", "1_Text": "dude you can´t be real... I dont even do pills but I can say this one is 100% fake! holy shit everything is wrong there!", "2_Subreddit": "opiates"}], "dvysg1t": [{"0_Comment Submission": "1 year off heroin", "1_Text": "I m very very happy to read that dude, I remember you perfectly btw, you helped me to make a smart choice days ago.\n\nCocaine is a hell of a drug but lets say is not that life-destroyer, I myself do cocaine one at month (dont let me do more even I have the fish scales downstairs, lol...).\n\nKeep fighting and hope you the best ;)", "2_Subreddit": "opiates"}], "dw4bo6e": [{"0_Comment Submission": "Real or fake?? I love my life!!!", "1_Text": "Hi :) \nYou are waaay down on the hole again. Nothing wrong with that my friend, each one is his own boss.\n\nHave fun now that you are on it, just have fun and of course be safe ;)", "2_Subreddit": "opiates"}], "dw4buve": [{"0_Comment Submission": "Real or fake?? I love my life!!!", "1_Text": "Jusst curious. What you are saying is if someone without tolerance takes like 1mg fent, he can OD?", "2_Subreddit": "opiates"}], "dw4ccsr": [{"0_Comment Submission": "⛷⛷⛷", "1_Text": "no we are not, we are saying that what you have there is no more than 30%. You can clearly see it has been repressed.\n\nFind another guy or try different vendors on the DeepWeb till you find \"the one\" that gives you the scales. Once you try the real deal you will just run from cut shit with active cuts that makes your high a different kind of high....\n\nJust so you know, I meet A LOT of people who didnt know how cocaine´s high actually is till they try the real deal... is like day and night...", "2_Subreddit": "cocaine"}], "dw7gj0f": [{"0_Comment Submission": "Just bought ezreal? How to adc as him?", "1_Text": "I bet you are no more than DV. \n\nEz is pretty hard to play.", "2_Subreddit": "leagueoflegends"}], "dw9755h": [{"0_Comment Submission": "Real or fake?? I love my life!!!", "1_Text": "I am glad to read that dude, slowly but surely ;). \nEveryone have their own thing, not comparable but admit I spend 1/4 from my monat earns on good quality weed/hash, and cocaine maybe once each month-3 month...  \n\nHave a nice day ;)", "2_Subreddit": "opiates"}], "dwbx4gb": [{"0_Comment Submission": "Sorry shitpost but..., how it would be if /r/opiates do a meeting in a big city?", "1_Text": "hahah", "2_Subreddit": "opiates"}], "dwbx6go": [{"0_Comment Submission": "Sorry shitpost but..., how it would be if /r/opiates do a meeting in a big city?", "1_Text": "haha, it would be a great social experiment to be honest ;)", "2_Subreddit": "opiates"}], "dwbx7ix": [{"0_Comment Submission": "Sorry shitpost but..., how it would be if /r/opiates do a meeting in a big city?", "1_Text": "true.", "2_Subreddit": "opiates"}], "dwo3q3e": [{"0_Comment Submission": "Best shit for the newbie?", "1_Text": "If you come to /r/opiates to find advice as a new user..., you are in the wrong place. Yes of course people will advice you in name of harm reduction but..., opiates is not a joke, okay?. The people here are suffering everyday because of this adiction..., its a prison in life. Use or feel sick, choose one of them..., every day...\n\nMy case..., I´m very interested on drugs and I am often arround this sub, arround a month ago I had 0.3g of H, I was planing on taking it and this subredit changed my mind..., you just dont want to wake up the dragon. I threw it away.\n\nThink twice before you keep playing with this substance, is waaay too powerful and it changes your brain chemestry..., just stay away until you have to choose between horrible pain and opiates.\n\nI still want so bad to feel the Heroin high..., but I wont. If I like it, it will trap me. I know myself enough to know that I would end up using it very often...\n\nPeople talk here about Kratom btw..., but idk if the \"high\" is enough or just help with the DW", "2_Subreddit": "opiates"}], "dwo577h": [{"0_Comment Submission": "Other Hot Sexy Girl. If this gets enough upvotes, it will be the first result when people search for \"Other Hot Sexy Girl\"", "1_Text": "Guys, if we all repost the same comments every time, we'll all get double the karma", "2_Subreddit": "leagueoflegends"}], "dwor3na": [{"0_Comment Submission": "Best shit for the newbie?", "1_Text": "For some reason is not a common drug. I was thinking on using it because as I wrote before I want to feel the \"opiate high\" but dont know which substance is \"safe\". Anyways, I found out most of the Opium you see in the DNM is TBH or just inciense or some shit..., having no contact who actually knows how Opium smells/tastes, I decided to dont give it a try...", "2_Subreddit": "opiates"}], "dwouvvl": [{"0_Comment Submission": "I am really interested in \"ex pros\" and what they are doing now.", "1_Text": "Love this one from yesterday! Nice use of it ;)", "2_Subreddit": "leagueoflegends"}], "dwstfvw": [{"0_Comment Submission": "Anyone up?", "1_Text": "Hello ;) You have 2 options...\n\n1) What I used to do... Go to someone that looks like he might be into this..., some young people arround 25-35... (avoid junkies, they will try to trick you and/or won´t help just for free). \nThen ask them respectfull something arround the lines: \"sorry, maybe this is the wrong andress and I am asking the wrong person..., if this is the case I am so sorry but..., you know where I can get some Cocaine?\".\nIf they say \"no\", in my case I can´t care less about what other people thinks about me soo I just walk away..., but if You care just excuse yourself by saying that you do It in special occasions and some friends are coming to visit, blablabla.... You shouldn´t care much but there are people that does care about what strangers think about them...  \nThen if they say yes..., now you have to play your cards, don´t tell them you are alone/you don´t know anyone else arround the place,  and NEVER EVER trust the guy 100% (repeat, NEVER!). As said before..., play your cards, you want to look like a guy that knows what he wants..., you dont want cut shit, right? so explain him that you wash your gear for example..., you can even say that you are looking for some other contact because your boy sold you the last times some stuff and you lost more than half of it after the acetone wash. No less important..., you wont EVER pay without an small test..., just NEVER. \nIt might sounds stupid some of those tips... and the story about you wash your stuff, but trust me..., if someone can trick you, they will. So you have to act serious, not like a guy easy to trick... I am not writing all this stuff because I feel to..., I  just know, like pretty much everyone else, how the \"street bussines\" works..., and cocaine is expensive as fuck so a lot of people will try to trick you...\n\n2) Darknet Market..., you just need an USB with the Operative System called Tails..., It s VERY VERY easy if you follow the [Darknet Bible](https://www.reddit.com/r/DarkNetMarketsNoobs/wiki/bible/buyer)\n\nTL; DR I wont ever recomend to buy on the street, is like a 90% chance you will get less than 10% pure... Just go on the DarkNet, is safer than people belive and pretty easy. \n\nJust go on the Darknet.", "2_Subreddit": "cocaine"}], "dwuz68b": [{"0_Comment Submission": "Apdo/Dopa Youtube Q&A (translation)", "1_Text": "> all I want is for time to fastforward a few hours so I can go to sleep lol. Tired as hell.\n\ndude..., that is not life... I mean no offense but once you get out of work is when \"your life\" starts..., while you are working you trade your \"life time\" for money..., it s not actually \"your time\"... It might sound sad and even I do love my job but for me once I wake up in the morning in a week day I feel I m losing the next 9 hours of my life..., trading it for some print paper.\n\nI am no one to say anything and if you are happy then it s allright ;)", "2_Subreddit": "leagueoflegends"}], "dwv9bvt": [{"0_Comment Submission": "Apdo/Dopa Youtube Q&A (translation)", "1_Text": "Get some help. \n\nIf you are not happy go to a doctor, maybe there is some lack of setotonine/any hormone, and your brain chemestry dosnt works the way it should... I mean there is a lot of threatments, and las resource happy-pills, that can make you love your life wonderful..., because it is wonderful...\n\nAnyway... if you are not happy because life problems... well let me tell you you are working, you might have money, you can travel. Depresion is a bad use of your free time ;)", "2_Subreddit": "leagueoflegends"}]}], "1_submissions": [{"5hbsnp": [{"0_Title": "BUG with the profiles", "1_Text": "as a guy that wants to feel the opiate high without taking an opiate...., do you believe is safe to take Kratom?", "2_Subreddit": "leagueoflegends"}], "5hhufg": [{"0_Title": "Shot outs to Ibai. The real All-Stars star!", "1_Text": "as a guy that wants to feel the opiate high without taking an opiate...., do you believe is safe to take Kratom?", "2_Subreddit": "leagueoflegends"}], "6khwxk": [{"0_Title": "FeelsBadMan not getting any Honor Point when you believe you did a really good job.", "1_Text": "as a guy that wants to feel the opiate high without taking an opiate...., do you believe is safe to take Kratom?", "2_Subreddit": "leagueoflegends"}], "6qj7no": [{"0_Title": "How I got Honor level 3", "1_Text": "as a guy that wants to feel the opiate high without taking an opiate...., do you believe is safe to take Kratom?", "2_Subreddit": "leagueoflegends"}], "6zeyem": [{"0_Title": "100% win rate Vayne destroying EUW Solo Q. ¿Who is this guy?", "1_Text": "as a guy that wants to feel the opiate high without taking an opiate...., do you believe is safe to take Kratom?", "2_Subreddit": "leagueoflegends"}], "6zf0fu": [{"0_Title": "100% win rate Vayne OTP destroying EUW Solo Q. ¿Who is this guy?", "1_Text": "as a guy that wants to feel the opiate high without taking an opiate...., do you believe is safe to take Kratom?", "2_Subreddit": "leagueoflegends"}], "74kgw5": [{"0_Title": "I hit Diamond for the first time since Season 1 and +4.000 ranked games.", "1_Text": "as a guy that wants to feel the opiate high without taking an opiate...., do you believe is safe to take Kratom?", "2_Subreddit": "leagueoflegends"}], "7vnosy": [{"0_Title": "Skiing on Thursday because have free. Tell me anything so I don´t feel like shit", "1_Text": "as a guy that wants to feel the opiate high without taking an opiate...., do you believe is safe to take Kratom?", "2_Subreddit": "cocaine"}], "7wehxr": [{"0_Title": "Read this if you believe you are strong to avoid adiction. Cocaine is a hell of a drug...", "1_Text": "as a guy that wants to feel the opiate high without taking an opiate...., do you believe is safe to take Kratom?", "2_Subreddit": "cocaine"}], "80xke6": [{"0_Title": "Serious, need advice.", "1_Text": "as a guy that wants to feel the opiate high without taking an opiate...., do you believe is safe to take Kratom?", "2_Subreddit": "opiates"}], "83jfqv": [{"0_Title": "I forgot how good it actually feels!!", "1_Text": "as a guy that wants to feel the opiate high without taking an opiate...., do you believe is safe to take Kratom?", "2_Subreddit": "cocaine"}], "83jt78": [{"0_Title": "A short story of how a very casual cocaine user got the Holy Grail in form of fish scale. Now I understand why people love his money and life because of this drug.", "1_Text": "as a guy that wants to feel the opiate high without taking an opiate...., do you believe is safe to take Kratom?", "2_Subreddit": "Drugs"}], "85378p": [{"0_Title": "I went somewhere else yesterday... Holy shit!", "1_Text": "as a guy that wants to feel the opiate high without taking an opiate...., do you believe is safe to take Kratom?", "2_Subreddit": "ketamine"}], "87bg0r": [{"0_Title": "Sorry shitpost but..., how it would be if /r/opiates do a meeting in a big city?", "1_Text": "as a guy that wants to feel the opiate high without taking an opiate...., do you believe is safe to take Kratom?", "2_Subreddit": "opiates"}]}]}]}