{"Painandboredom": [{"0_comments": [{"dw5ccar": [{"0_Comment Submission": "When the direct deposit lands", "1_Text": "Ayyy good to see he held onto some for ya! Enjoy homie! Be safe", "2_Subreddit": "opiates"}], "dw5oeny": [{"0_Comment Submission": "X post from another sub. I died a little inside", "1_Text": "Hahaha I don’t do boy but literally every time I run out of my script and go buy 30s as soon as I blow a few and start feeling better I go to McDonald’s and grab a McDouble. No lie I did it 12 hours ago haha", "2_Subreddit": "opiates"}], "dw5oypm": [{"0_Comment Submission": "X post from another sub. I died a little inside", "1_Text": "Nothing wrong with peeing picky! I don’t understand why people think it’s a bad thing, If I’m paying for something I want to enjoy it. And yeah bruh fries on the burger is legit. I generally don’t order fries because I can’t deal with how salty they are but when I actually am in the mood for them I do this too", "2_Subreddit": "opiates"}], "dw5pc2q": [{"0_Comment Submission": "Don’t get me wrong, I fucking hate withdrawals, BUT", "1_Text": "Well first of all, even when I have as much oxy as I want all I do is lay in bed for the most part because I’m crippled and can’t sit for more than like 10 minutes without my pain getting to an unbearable point. So I guess that my lack of shit to do with my life helps me be able to do that. Not that I’m ever sick by choice. \n\nBut to change it from “how do I function” to “how do I deal with it” uh, it was basically just a lot of Soma and weed, and then just enough lope to keep me from shitting every 20 minutes. Not as good as opiates but soma and weed isn’t a bad combo", "2_Subreddit": "opiates"}], "dw69iih": [{"0_Comment Submission": "Wassup 120 perc 10s for the month... 😋", "1_Text": "You stay strong too homie. It’s tough for pain patients Rn, can’t get our monthly refills without being treated like an addict, god forbid you have a fall or something and need help, fuck you cause you’re on pain meds. I’ve even had drs confront me over the fact that I DONT drink alcohol. Like literally multiple doctors, one super aggressively starts asking me about my problem with alcohol and shit. like dude I stopped drinking when I got out on an opiate +a benzo + gabapentin like Shouldn’t that be a good thing? A patient who read enough to know that maybe adding scotch to that combo will be dangerous. It’s crazy out there. Good luck with everything. I’m turning 26 this year so we’re pretty close in age and deal with the same bullshit, I don’t know you at all and I’m like “fuck I don’t want anyone having to deal with shit like this I wish I could take I from this dude since I’m already crippled like atleast 1 of us could be living life” \n\nKeep your chin up, feel free to PM if you ever need to rant to someone who knows what you’re dealing with and also is constantly around because I can’t work haha. Stay strong homie", "2_Subreddit": "opiates"}], "dw76612": [{"0_Comment Submission": "Opiate of choice", "1_Text": "It was just the brand name Opana, the drug (oxymorphone) is still very much available", "2_Subreddit": "opiates"}], "dw7q3w3": [{"0_Comment Submission": "Denied Oxycodone by Physician", "1_Text": "Bruh us chronic pain patients who actually need opiates can barely get them prescribed, and chronic pain is like the only thing that they are allowed to be prescribed for... how tf did you think that conversation was gunna go?  “oh it makes you less depressed? Here’s a script for 300 blues” like cmon dude you had to have known that was a horrible idea. And I can almost guarantee that you’re flagged in the system now so good luck with those 800mg ibuprofen in the future", "2_Subreddit": "opiates"}], "dw8qb4e": [{"0_Comment Submission": "Carving a mug...", "1_Text": "as someone who is a professional potter, I just figured I’d chime in and say that this person knew that it could happen. They appear to be carving at a little drier of a state than most Would, but even with ideal everything you still lose pots. It’s part of the game. The great part about clay is, as long as you don’t fire it, you can reuse it. So that broken mug will go on to be something else and the balance is restored. \n\nBut really everyone, that wasn’t the first nor last piece the artist has lost. I guarantee y’all are more upset than they were. Also, find a local place to take a pottery class. Not “paint your own” type bullshit, take a class where you actually throw on the wheel and make something from nothing. It’s very rewarding and you get to learn a new skill", "2_Subreddit": "gifs"}], "dwd3s1q": [{"0_Comment Submission": "The best part of waking up is pandas in the butt!... and a little oxy on the side to add that stimulating buzz", "1_Text": "I haven’t had Opana but I’ve plugged a lot of morphine and it’s more like snorting than IV in terms of how quick you come up. But it’s more intense than snorting IMO. but you aren’t gunna get a rush or 10-20second onset like you would shooting", "2_Subreddit": "opiates"}], "dwd5bhj": [{"0_Comment Submission": "The best part of waking up is pandas in the butt!... and a little oxy on the side to add that stimulating buzz", "1_Text": "Opana, panda, oxymorphone it’s all the same stuff. I’m in the US and I can’t get my hands on it either I’ve never even heard of someone having any. \n\nI’d also recommend staying away from IV. the only times I’ve had IV opiates is in the hospital, and those few times are still enough that makes it hang around in the back of my head. If I booted myself up I can almost guarantee that I would never use in any other way. \n\nPlug something dude! I don’t really plug oxy because it has such a good bioavailability orally, but it can be done. IMO it’s super worth it with like morphine or hydromorphone (those are the 2 I’ve plugged, others with low oral bioavailability are good as well). People get weird about plugging but I promise that goes away after the first try lol", "2_Subreddit": "opiates"}], "dwd8by3": [{"0_Comment Submission": "The best part of waking up is pandas in the butt!... and a little oxy on the side to add that stimulating buzz", "1_Text": "I’d do half your dose, 15 mg if you take 30. It is stronger but with oxy it isn’t as huge of a difference as other meds. For instance, oxycodone has about an 80% bioavailability orally, plugging might get it up to like 90% but it won’t be that big of a difference. However, with Morphine, you go from 30% orally to 90% plugging, that’s triple the dose. \n\nSo yeah definitely do less than normal, like I said I would go with half. You can always dose more, can’t take any away. And plugging will be stronger but not as noticeable with Oxycodone as with other drugs. Hope that helps!", "2_Subreddit": "opiates"}], "dwe8yb9": [{"0_Comment Submission": "Why I like the train over the bus, private bathrooms", "1_Text": "from the picture I’d assume the hydromorphone, 99% certain bottom left those capsules are hydromorph-Contin", "2_Subreddit": "opiates"}], "dwfxwk8": [{"0_Comment Submission": "A question about stashing prescribed opiates.", "1_Text": "He should absolutely NOT admit to stashing the extras. IF they ask he should simply say that he had a few good days where he didn’t need to take as many, or that he was trying to see if he could control his pain on slightly less because he doesn’t really like being on the narcotics but it didn’t control his pain enough so he continued at his dose again. \n\nI’m not sure how the script is written, but for instance mine is written to say “2 pills every 6 hours as needed” and I take it every 6 hours but if I didn’t “need” a dose then I could not take it. Generally speaking they aren’t going to care about him making a script last longer VS if he was trying to fill it a week or two early, that make sense? \n\nBut I would just not say anything, IF they bring it up (I doubt it) then just say he had some good days where he didn’t need as much, and then he had extra so he didn’t want to call his script in while he still had pills. (Since that seems like their modus operandi when it comes to ‘extra’ anyways they’ll probably appreciate it)", "2_Subreddit": "opiates"}], "dwhs2uw": [{"0_Comment Submission": "Do doctors ever prescribe oxy for chronic migraines?", "1_Text": "No, you won’t get oxy (or any opiate most likely) for migraines. They can cause worse headaches so they aren’t used often for migraines. And there are just other non narcotics that work way better. \n\nAs for the “faking” thing... first of all it’s hard enough to get meds when you actually need them and have proof of pain, like MRI’s and the like. You expecting to complain about “sore bones” or some bullshit and get a script for oxy is setting yourself up for disappointment. And if you go in asking for oxy or any opiate, chances are good that you’ll get flagged and then be stuck riding that 800mg ibuprofen no matter what happens in the future. \n\nMy advice: don’t fake bullshit to get meds that you don’t need, because you make it harder for patients like myself to get the meds that we need, and god forbid if you ever actually DO need pain meds you will have fucked yourself over trying to get high.", "2_Subreddit": "opiates"}], "dwhv0ad": [{"0_Comment Submission": "🐼 no 100mg tho", "1_Text": "😂I just saw that fucking conversation holy shit dude. And guys been commenting and posting a bunch and it’s literally just the most stupid shit. It’s hilarious though. I love when people don’t know shit but THINK they know more then everyone else, it makes for some funny ass material", "2_Subreddit": "opiates"}], "dwhvv0r": [{"0_Comment Submission": "🐼 no 100mg tho", "1_Text": "Ayy that’s legit homie. I’ve never had pandas sadly (and I still know they don’t make no 100mg pill) but the dude I used to get blues from would deliver it was great. Dude would deliver if I was grabbing just 1, he even delivered to me when he was fronting me. It was the best \n\nEnjoy those dude!", "2_Subreddit": "opiates"}], "dwhvy9a": [{"0_Comment Submission": "🐼 no 100mg tho", "1_Text": "Some person was claiming they used to get 60 and 100 mg Opana, and then when it was pointed out by OP that no such pill exists anywhere, instead of admitting that they could be wrong, they doubled down and swore that even google was lying", "2_Subreddit": "opiates"}], "dwhwaiv": [{"0_Comment Submission": "🐼 no 100mg tho", "1_Text": "Me and my boy became friends too that’s funny. He actually fucked me over (I let my Money walk) and then 9 months later he got in contact with me and made good on it and were cool again. Now that I have a script I try to not use more than I get and he barely even sells anymore but he still has the hookups so if I need them I can get them through him", "2_Subreddit": "opiates"}], "dwv6n0s": [{"0_Comment Submission": "This is torture", "1_Text": "I use either orange juice, grapefruit juice or lemonade. I feel like stronger flavored juice works a lot better than like apple juice or anything like that. I mix my dose up as well as I can in a glass of juice, let it sit for like 10 minutes, then mix it again (and it actually mixes in this time) then I chug and have more juice or something else flavored to chase it cause it’s still awful I have no proper way to make it taste ok", "2_Subreddit": "opiates"}], "dwvhepg": [{"0_Comment Submission": "My dboy who sold me these bricks invited me into his trap house to party. I politely declined", "1_Text": "What a prude, I’d had offered you an extra hand or two. I mean if you invite me to party somewhere you should expect that somethings going up someone’s butt, it’s much easier to just prepare for it rather than running around after it happens", "2_Subreddit": "opiates"}], "dwvqzcw": [{"0_Comment Submission": "Getting opiates filled.", "1_Text": "I 100% agree with everyone above me saying to NOT mention the anxiety/ not to try and get the Valium with an opiate script, but I have been on Valium and/or Soma along with my oxy script for well over a year, and I know/ have talked to a number of other phone in the same boat. it’s not as uncommon as you’d think", "2_Subreddit": "opiates"}], "dwvsbbf": [{"0_Comment Submission": "!!! Approaching 72 hours !!! (If you want to quit, you can. That’s the ONLY way)", "1_Text": "Good luck Cap! Purposefully making it to 72 hours is much more impressive than being forced into longer clean time (atleast to me). I mean all clean time is good, but this isn’t because you can’t find anything or because you got picked up and are sitting in a holding cell. You did this because you want it man! That’s the only way for it to work. \n\nI know we don’t know each other but I’m proud of you for making that first step. You can do it! Just take it day by day. Today turns into tomorrow, which turns into next week, month, year. You got it man", "2_Subreddit": "opiates"}], "dwxj7wq": [{"0_Comment Submission": "Finally, something just for us!", "1_Text": "Hope this isn’t already posted here! Just found it over at /trashy and knew it had to be over here. And I love that ONLY ‘druggies’ are allowed it, no normies allowed. \n\nIdk what else to say about it, I’m nodding off some pressed 30’s which I enjoy much more than I should lol slutever tho. ALSO on the subject, anyone ever heard of shit being pressed with H instead of fent/fent analogues?? I’m assuming they’re some type of fent but the guy my boy got them from said they absolutely weren’t fent and they were pressed with boy. Don’t make sense to me tho", "2_Subreddit": "opiates"}], "dwxlyd9": [{"0_Comment Submission": "Finally, something just for us!", "1_Text": "Yea I mean I can’t say it ISNT done but it just seems like a weird concept to me. Like Heroin doesn’t really need any help being sold lol it doesn’t need to be pressed to look like pills it can just be h and we will still want it. \n\nDo you think that, if pills were pressed with Mexican powder like that rumor, the pill would still atleast mildly have that vinegar smell right?", "2_Subreddit": "opiates"}], "dwxnkmi": [{"0_Comment Submission": "Finally, something just for us!", "1_Text": "Huh that’s crazy that it’s really happening. I guess it makes sense, 30’s being the cash cow they are. These ones didn’t smell like dope at all, just as pills and also when going up my nose, so I’m inclined to think they’re fent. Also the duration/ lack of euphoria seems to back that thought up too, however I’ve never (knowingly) taken fent or boy so I can’t pinpoint exactly what it is, other than it’s an opioid and definitely not oxy", "2_Subreddit": "opiates"}]}], "1_submissions": [{"5aax6x": [{"0_Title": "Kinda shit post, but who else can I share with?", "1_Text": "Ayyy good to see he held onto some for ya! Enjoy homie! Be safe", "2_Subreddit": "opiates"}], "5b8gj2": [{"0_Title": "Looking through my old pill porn on my phone", "1_Text": "Ayyy good to see he held onto some for ya! Enjoy homie! Be safe", "2_Subreddit": "opiates"}], "5e23ps": [{"0_Title": "So there's an r/askreddit post about \"what's your addiction\"", "1_Text": "Ayyy good to see he held onto some for ya! Enjoy homie! Be safe", "2_Subreddit": "opiates"}], "5tk784": [{"0_Title": "That feeling when they tell you they're going to give you dilauded in the hospital!!!", "1_Text": "Ayyy good to see he held onto some for ya! Enjoy homie! Be safe", "2_Subreddit": "opiates"}], "5vazf3": [{"0_Title": "Chronic pain fucking sucks/generic shitpost", "1_Text": "Ayyy good to see he held onto some for ya! Enjoy homie! Be safe", "2_Subreddit": "opiates"}], "5wa72x": [{"0_Title": "Ain't mad at it (pill Porn)", "1_Text": "Ayyy good to see he held onto some for ya! Enjoy homie! Be safe", "2_Subreddit": "opiates"}], "5xgpjx": [{"0_Title": "Pill Porn I wish I didn't have to have (meaning I wish I didn't have the pain that warranted them giving me these, but if I'm gunna have it, atleast they gave me them again)", "1_Text": "Ayyy good to see he held onto some for ya! Enjoy homie! Be safe", "2_Subreddit": "opiates"}], "61z76y": [{"0_Title": "Every 7.5 days", "1_Text": "Ayyy good to see he held onto some for ya! Enjoy homie! Be safe", "2_Subreddit": "opiates"}], "68rstc": [{"0_Title": "Fuck doctors 💩post", "1_Text": "Ayyy good to see he held onto some for ya! Enjoy homie! Be safe", "2_Subreddit": "opiates"}], "68vh9l": [{"0_Title": "I mean, they are better than adderall and I probably SHOULD use some today", "1_Text": "Ayyy good to see he held onto some for ya! Enjoy homie! Be safe", "2_Subreddit": "opiates"}], "6b1wrg": [{"0_Title": "When you're sick but then the IV dilly hits ya", "1_Text": "Ayyy good to see he held onto some for ya! Enjoy homie! Be safe", "2_Subreddit": "opiates"}], "6ec8k4": [{"0_Title": "Anyone ever been fucked over and then had the person make it right? (Slightly JJ)", "1_Text": "Ayyy good to see he held onto some for ya! Enjoy homie! Be safe", "2_Subreddit": "opiates"}], "73cr60": [{"0_Title": "Never seen this type of 15", "1_Text": "Ayyy good to see he held onto some for ya! Enjoy homie! Be safe", "2_Subreddit": "opiates"}], "7bg5hp": [{"0_Title": "Light pill Porn (2 week refill of 10mg percs + some 10mg ir oxy because who can make their scripts last)", "1_Text": "Ayyy good to see he held onto some for ya! Enjoy homie! Be safe", "2_Subreddit": "opiates"}], "86hoj7": [{"0_Title": "Don’t get me wrong, I fucking hate withdrawals, BUT", "1_Text": "Ayyy good to see he held onto some for ya! Enjoy homie! Be safe", "2_Subreddit": "opiates"}], "8acgw1": [{"0_Title": "Finally, something just for us!", "1_Text": "Ayyy good to see he held onto some for ya! Enjoy homie! Be safe", "2_Subreddit": "opiates"}]}]}]}