{"LustlessforLife": [{"0_comments": [{"dnztx7v": [{"0_Comment Submission": "Talk me down, please", "1_Text": "Thank you. You are absolutely right. I struggle with anxiety but can no longer get prescribed any kind of benzo because of my addiction history. It's so hard to get through it sometime. I care about him immensely. It was a rash discussion, but sometimes when your head is spinning like that rationality goes out the door right? 😖", "2_Subreddit": "opiates"}], "dnztxy8": [{"0_Comment Submission": "Talk me down, please", "1_Text": "Thank you. You are right. 💕", "2_Subreddit": "opiates"}], "dnztzdd": [{"0_Comment Submission": "Talk me down, please", "1_Text": "Haha good point. I could have but it certainly wasn't a premeditated move.", "2_Subreddit": "opiates"}], "dnzu11v": [{"0_Comment Submission": "Talk me down, please", "1_Text": "Thanks for responding. I didn't wind up taking any and he doesn't know I took the bottle. Now I'm struggling with guilt over it. Would you tell what happened and come clean?", "2_Subreddit": "opiates"}], "dnzu3fq": [{"0_Comment Submission": "Talk me down, please", "1_Text": "Yeah benzos were definitely a sore spot for me. Thank you so much for your response, nothing you said was belittling whatsoever. ❤️", "2_Subreddit": "opiates"}], "dnzu5yr": [{"0_Comment Submission": "Talk me down, please", "1_Text": "Thank you. It's hard to reach out to people in real life sometimes. I always knew the right thing to do. Rationality doesn't always play a role in moments like those unfortunately.", "2_Subreddit": "opiates"}], "dnzu6e1": [{"0_Comment Submission": "Talk me down, please", "1_Text": "❤️", "2_Subreddit": "opiates"}], "dnzu8lg": [{"0_Comment Submission": "Talk me down, please", "1_Text": "Didn't take it. Struggling now though with the guilt over taking the bottle in the first place. Feel like absolute crap but also made me realize how close to the edge I can actually be. Was a real wake up call for sure.", "2_Subreddit": "opiates"}], "do0nail": [{"0_Comment Submission": "Talk me down, please", "1_Text": "I haven't and I'm still struggling with whether or not to say something. I have worked so hard to be trustworthy and I don't want a momentary lapse of judgement in anger to ruin that. At the same time though I feel like I should be honest to hold myself accountable and because I deeply care for him. Any advice? On a lighter note I love your username, makes me laugh happily 😊", "2_Subreddit": "opiates"}], "do1mqvm": [{"0_Comment Submission": "Talk me down, please", "1_Text": "He does, he's an alcoholic in recovery himself, it'll be 4 years for him in December. For me, it's been a little over 18 months, heroin and benzos.", "2_Subreddit": "opiates"}], "do1tnjm": [{"0_Comment Submission": "Talk me down, please", "1_Text": "Thank you, it won't be easy to say out loud but I absolutely agree with you. I need to keep myself accountable for all of my actions if I want a shot at staying sober long term. Thank you so much for your advice and taking the time to chat with me about this. It's so appreciated 💕", "2_Subreddit": "opiates"}], "do7gq6x": [{"0_Comment Submission": "One year.", "1_Text": "Congratulations on your time! I'm really proud of you! Keep up the work and keep sharing your story with others 💕", "2_Subreddit": "opiates"}], "do7gqpr": [{"0_Comment Submission": "Some vein porn if that's a thing", "1_Text": "Oh it's a thing. Very nice. 😍", "2_Subreddit": "opiates"}], "ds4ygla": [{"0_Comment Submission": "(Shit post) Those who are clean. How are you staying clean?", "1_Text": "I’ve got 21 months off an h and benzo habit and I’m doing good. I agree with others that you have to make goals and find new things to fill your time. I moved across the state, disconnected for everyone and everything that triggered me to use and focused on myself. I’ve now got a great job again, started my own side business and have a wonderful relationship with my family. I think what I’ve learned though is all those things aren’t going to keep me sober. What does is remembering how quickly it could all go to shit for me again. I live in the NE and we are going through a brutal cold snap. Going out and helping others who were essentially me 2 years ago helps me have a sense of gratitude and humbles me. Find what works for you and do it, relentlessly.", "2_Subreddit": "opiates"}], "ds4ymar": [{"0_Comment Submission": "(Shit post) Those who are clean. How are you staying clean?", "1_Text": "In response to the having no insurance and doing it from home: does your State have a program like a Section 35? Look it up in MA. You can section yourself and do not have to pay for it. I know a few who have done just this. Good luck! 😊", "2_Subreddit": "opiates"}], "dsuyzoh": [{"0_Comment Submission": "Pregnancy and low dose opiates", "1_Text": "Hi Sweetie, just wanted to throw a comment in for you. First, hang in there! I can only imagine how much stress you are going through. Do the right thing for you and don’t worry about any people with an opinion behind a screen. Second, when I was using, I completely lost my period. It ceased for an entire year until I went to treatment. Then 16 days into treatment, bang! I got it back as did a number of other girls and had no choice but to use pads 😂 Stay strong and keep smiling, you sound like you have you’re head on straight. You’ll be just fine. Feel free to DM me if you need any support. Sending you big hugs 🤗", "2_Subreddit": "opiates"}], "dt0n044": [{"0_Comment Submission": "Almost gave away my laptop for a few bags", "1_Text": "Don’t do it Hun. I’ve been there too. I almost sold my iPad for the same about a year and a half ago. Something deep inside told me not to do it and luckily I didn’t. I know how much it sucks in the meantime, but it’ll suck even worse when you’re without it later and still sick. 💕", "2_Subreddit": "opiates"}], "dtf6xje": [{"0_Comment Submission": "People who lurk here and are sober, what was the moment you decided to quit?", "1_Text": "Wasn’t ready to stop but got sectioned by my family. Fought it for about 14 days while in the facility swearing up and down I’d get right back out and do it over again. Then something changed and my mind came back to me. I felt like my old self and that felt good. Promised myself I’d atleast give it a shot. 22 months on Wednesday! 🤗", "2_Subreddit": "opiates"}], "du3dz5d": [{"0_Comment Submission": "I am a writer looking for readers/someone interested in an interview", "1_Text": "Would love to read as well! I’ve been a proofreader for many years and have an extensive background in writing. Feel free to DM me. 😊", "2_Subreddit": "opiates"}], "dujvzck": [{"0_Comment Submission": "7 weeks clean, struggling not to relapse. Could use someone to chat to.", "1_Text": "Feel free to message me if you feel like talking! I’ve got almost two years and the thing that I do when the cravings get too strong to bear is just keep telling myself to do the next right thing. Try to distract yourself with something else. Go out and help someone. Do a kind deed. God knows it’s not that simple some times but just breaking things down into small chunks and focusing on the next positive thing you’re doing can really help. When I feel good about myself and the things I’m doing I remember how grateful I am for my sobriety. You can do this! Xo", "2_Subreddit": "opiates"}], "dulp69u": [{"0_Comment Submission": "Who would you rather use with?", "1_Text": "Lewis. All day.", "2_Subreddit": "opiates"}], "dulprjw": [{"0_Comment Submission": "track marks", "1_Text": "I’ve got small “bruise” marks that look like I recently had blood drawn from collapsed veins in the crooks of my arms but no one has ever questioned them (from my “normal” life). My worst ones were on my hands and 2 years later (almost) they are a pale white skin color (if you go into my post history you can see comparison pics). As others have mentioned, it won’t stick out as much to others as it does to you. Don’t worry about it. Xo", "2_Subreddit": "opiates"}], "dwft49a": [{"0_Comment Submission": "Girlfriend and her friend got popped over the weekend. Fml.", "1_Text": "What are the actual charges? Right towards the end of my use I was at my absolute worst. I had never been arrested in my life and in a weeks time I racked up two class a possession charges and a class b (just for good measure lol). I wound up going to court and was sectioned on the spot. When I was released, I was put on probation for a year. And looking back on it, it wasn’t the worst thing in the world, although it felt like it at the time. Honestly, if I hadn’t have had a wake up call that big, I might not still even be alive to type this. I’m still sober today, even though I have my moments when my mind runs wild like everyone else, and because I finished my probation without incident, all of my charges were dropped. There can still be a silver lining. Get the help, take it and run with it for all it’s worth. I’m here if you want to talk. Best of luck to your girl.", "2_Subreddit": "opiates"}], "dwr1zb5": [{"0_Comment Submission": "2 years", "1_Text": "Congratulations friend! Your post literally made me cry at my desk at work. I couldn’t have described it better. It was two years for me on Sunday. Keep it up! ❤️", "2_Subreddit": "opiates"}], "dwthaa6": [{"0_Comment Submission": "2 years", "1_Text": "Amazing isn’t it! I can’t seem to figure out how to PM on here but I’d love to hear some of your stand up if you have it posted anywhere and are willing to share! 😊", "2_Subreddit": "opiates"}]}], "1_submissions": [{"6nytdy": [{"0_Title": "Life is good sober, so why...", "1_Text": "Thank you. You are absolutely right. I struggle with anxiety but can no longer get prescribed any kind of benzo because of my addiction history. It's so hard to get through it sometime. I care about him immensely. It was a rash discussion, but sometimes when your head is spinning like that rationality goes out the door right? 😖", "2_Subreddit": "opiates"}], "6q978i": [{"0_Title": "Holy Basil & Suboxone", "1_Text": "Thank you. You are absolutely right. I struggle with anxiety but can no longer get prescribed any kind of benzo because of my addiction history. It's so hard to get through it sometime. I care about him immensely. It was a rash discussion, but sometimes when your head is spinning like that rationality goes out the door right? 😖", "2_Subreddit": "opiates"}], "6sphp4": [{"0_Title": "Your Scar Will Heal...I promise", "1_Text": "Thank you. You are absolutely right. I struggle with anxiety but can no longer get prescribed any kind of benzo because of my addiction history. It's so hard to get through it sometime. I care about him immensely. It was a rash discussion, but sometimes when your head is spinning like that rationality goes out the door right? 😖", "2_Subreddit": "opiates"}], "6wvmtx": [{"0_Title": "Wish App for All Your Opi Needs!", "1_Text": "Thank you. You are absolutely right. I struggle with anxiety but can no longer get prescribed any kind of benzo because of my addiction history. It's so hard to get through it sometime. I care about him immensely. It was a rash discussion, but sometimes when your head is spinning like that rationality goes out the door right? 😖", "2_Subreddit": "opiates"}], "74lyx7": [{"0_Title": "Talk me down, please", "1_Text": "Thank you. You are absolutely right. I struggle with anxiety but can no longer get prescribed any kind of benzo because of my addiction history. It's so hard to get through it sometime. I care about him immensely. It was a rash discussion, but sometimes when your head is spinning like that rationality goes out the door right? 😖", "2_Subreddit": "opiates"}]}]}]}