{"new_usernaem": [{"0_comments": [{"dvlbqa3": [{"0_Comment Submission": "[Google Express App / US] All - 30% OFF First Order", "1_Text": "Can't speak for any other stores/non Google Express. \n\nBut the stock available to buy is probably the nearest physical store to your location. Google Express is all about shipping you stuff from the actual store that has Google Express asap. So if you pick target as the store there are employees literally picking up your items off the shelf at the store,ringing them up, boxing them and mailing them out to you, so they may/are often limited to the available stock in a store in the area near you.", "2_Subreddit": "NintendoSwitchDeals"}], "dvn9810": [{"0_Comment Submission": "[Serious] Men of Reddit who have been raped by women, what happened, did you tell anyone, and did they take you seriously?", "1_Text": "i wish i could explain the full background/history over what happened but cant because of potential future legal reasons but she wanted revenge and told me i had to have sex with her and if i didnt she would call the cops and say that i raped her any ways. She was sierous, after i unwillingly had sex with her she punched herself then called the cops and said i hit her during an argument. she never filed any charges but the police automatically gave her a restraining order against me and i had to sleep in my car for a few weeks, and theres still a chance she could file rape charges against me years later because lets be honest who is going to believe my side of the story.", "2_Subreddit": "AskReddit"}], "dvpxznl": [{"0_Comment Submission": "It's been a year today since my lazy eye operation. My previous posts inspired lots of people to have the same procedure, so here's my final one...", "1_Text": "congrats on the operation and it is pretty damn inspiring, kinda a random question but, I had a similar operation when I was very young (dont remember much just hating the eye drops I had to get while they healed I was probably 4 or younger) I hasnt exactly stood the test of time, and the lazy eye is still there and occasionally even pops up with glasses. does anyone know if it would be possible to get another operation that would fix this or even make it a bit better? \n\nIm tired of staring at the person im talking to, and the vending machine, being stuck reading 90% of the time using my dominate eye and even being called a creeper mostly by chicks who assume im staring at them/their ass/boobs ect when im just sitting there reading my cellphone. (ok... maybe the creeper comments are because they saw /r/dragonsfuckingcars/ who knows, people are such prudes now a days * sigh *)", "2_Subreddit": "pics"}], "dvtwve5": [{"0_Comment Submission": "Change my mind", "1_Text": "I don't get it, I don't hear anything... Oh shit it's finally happened I've gone deaf..", "2_Subreddit": "gaming"}], "dvu8wg2": [{"0_Comment Submission": "Male Rape: Breaking the Silence (2017) BBC Documentary [36:42]", "1_Text": "i used a chrome extension called beebs that has worked 100% of the time. Install it, go to a bbc iplayer video link, register an account with any random zip/postal code for london and now any video i try to watch on their awesome player works, in great HD.\n\n I wish there was a streaming cable package like thing, I like the BBC but not BBC,netflix, HBO GO, HULU ext.each at $10 to $15 plus my cable internet bill and mandatory basic cable at another $100 a month. there should be a simple flat rate package for a pick and choose package of these services.", "2_Subreddit": "Documentaries"}], "dvwfjcr": [{"0_Comment Submission": "IKEA founder Ingvar Kamprad left $23 billion to charity and businesses in Sweden", "1_Text": "the inheritance to his kids includes one of every sized bolt/nut/screw/part for every different piece of ikea furnature ever made, after his death the factory starts removing one of each said part from the products they made and the heirs must choose the one worthy customer who gets the last complete smorgorboard bed.", "2_Subreddit": "UpliftingNews"}], "dw1m06s": [{"0_Comment Submission": "Just visited my first dispensary! THC: 26.24% CBD: 0.03%", "1_Text": "I think it's the other way around if I remember that documentary called black mirror correctly.", "2_Subreddit": "trees"}], "dw1slo1": [{"0_Comment Submission": "Canning beer.", "1_Text": "Wow all these youngins saying watching some of my favorite shows as a kid was some kind of punishment or something... I still watch how things are made and modern Marvel's all the time as entertainment, same as I did when I was a kid especially if I was dixk or faking sick.\n\nIn fact some of my fondest memories of my grandfather growing up was watching history channel and discovery channels back when they were good and featured acutal history and other \"infotainment\" channels. \n\nNothing like watching docs on killing the krauts and Japs to calm and sooth a young child before bed.\n\nIt even inspired me to want to go on to become a documentary film maker when I got to college, and majored in film/cinema.\n\none of my proudest achievements is getting to intern on the production of a national geographic documentary on the then booming medical weed business and the farce that was Californians largely unwatched medical marijuana recommendation system where pretty much anyone could get a rec..\n\nSure it didn't lead to a full-time job or even a real future in the business but it sure as hell was a childhood dream I achieved and I have an IMDb credit to show for it.\n\nSorry for the novel but... Punishment.... Not exactly.\n\nTLDR: the history channel gave me dreams of killing Nazis and all I got was an IMDb credit.", "2_Subreddit": "gifs"}], "dw1sth3": [{"0_Comment Submission": "Canning beer.", "1_Text": "Fucking sweet thanks for telling us. I have today and tomorrow off and I now know what I'm doing...  48 hour marathon of how it's made and modern marvels", "2_Subreddit": "gifs"}], "dw1wotb": [{"0_Comment Submission": "A bachelor party is a lot more appropriate after a divorce than before a wedding.", "1_Text": "Updoots for fellow nin fans!", "2_Subreddit": "Showerthoughts"}], "dw5l6y2": [{"0_Comment Submission": "‘Lone DNC Hacker’ Guccifer 2.0 Slipped Up and Revealed He Was a Russian Intelligence Officer", "1_Text": "So true, I'm hiding my use right now, and just told him I'm at", "2_Subreddit": "worldnews"}], "dw5lr39": [{"0_Comment Submission": "Bringing shrooms on a plane", "1_Text": "If possible, dry the shrooms out, powder then up and put them in herbal supplement bottles. It's a classic trick from the shroomery. Note I've never actually done it before myself over the border. Would be easier to just get them in the states.", "2_Subreddit": "shrooms"}], "dwdlnvh": [{"0_Comment Submission": "Prince died from 'exceedingly high' amount of fentanyl, experts say", "1_Text": "its being added to the street heroin supply lately. I personally oded from it a few weeks ago. I literally remember taking the needle out of my arm and then waking up with the paramedics squirting narcan up my nose.  I went out almost instantly, but thankfully people around me had LOTS of narcan. it took me 4 times the normal dose to get me back to breathing. I was told I had turned blue and was doing the death rattle when random other junkies found me and knew exactly what to do. probably the only reason im still alive.", "2_Subreddit": "Music"}], "dwdub8t": [{"0_Comment Submission": "TIL in 1986 students at UC Santa Cruz voted to make the school's official mascot the Banana Slug. The chancellor refused to honour the result, instead polling just student-athletes on the question... who also voted overwhelmingly in favour of being the Banana Slugs.", "1_Text": "My highschools mascot was an acorn... A fucking acorn. Nut jokes everywhere.", "2_Subreddit": "todayilearned"}], "dwgcgb5": [{"0_Comment Submission": "My hotel in Odessa (Ukraine) tells you which day it is by changing the elevator carpet every day", "1_Text": "am i the only one that instinctively saw nineteen nintyeight when... well you know thought i had spotted a shittymorph.", "2_Subreddit": "mildlyinteresting"}], "dwgf3kt": [{"0_Comment Submission": "Tool fans arguing about Tool w/ Maynard (x-post from r/dontyouknowwhoiam)", "1_Text": "I can 100% see them doing the next album and waiting a looong assed time again to make the next next album their last... or they will hurry up and finish their next and next next album to get out of their contract, tour a bunch then do one last album....", "2_Subreddit": "ToolBand"}], "dwgf7lm": [{"0_Comment Submission": "Tool fans arguing about Tool w/ Maynard (x-post from r/dontyouknowwhoiam)", "1_Text": "isnt there still two albums on their contract? i could see them hurrying and finishing it, but not being their last album. they will probably slow down, assuming the latest long wait really was just legal bullshit. I really wish we knew what exactly what went on that they blame the big delay on.", "2_Subreddit": "ToolBand"}], "dwhf850": [{"0_Comment Submission": "Your actions never go unnoticed. [Image]", "1_Text": "lol i didnt do salvia very much but i do remember sitting in a lawn chair while everything in my vision streaked and it seemed like everything was rumbling... i was convinced i was in a space shuttle lifting off for about 10 minutes then sobered up and remembered i was just sitting in my lawn chair in the back yard  staring off into the distance.", "2_Subreddit": "GetMotivated"}], "dwhw7q0": [{"0_Comment Submission": "I came to SF from Orlando for GDC, and I left missing it terribly. What a beautiful city.", "1_Text": "Hey, an orlandian, much better than a tampon. I moved to SF from DeLand not too far from Orlando myself back in 2000. The only thing I miss from FLA is the beach and the theme parks, otherwise love it out here. Glad you liked sf.", "2_Subreddit": "sanfrancisco"}], "dwiqokn": [{"0_Comment Submission": "Fentanyl testing at my safe injection site", "1_Text": "damn... i CANT FUCKING WAIT till san francisco finally opens their safe injection site. Last i heard it finally got approved and will be opening in july. It will be soooooo much better than shooting up on the streets, and risking getting caught by a cop who makes you squirt out the shot.", "2_Subreddit": "opiates"}], "dwiu1k8": [{"0_Comment Submission": "I just had to explain to an adult how quarters work.", "1_Text": "in las vegas, a town that deals with tons of cash of all places I was denied a transaction using a dollar coin. \"no sorry we cant take casino chips here\" me: its a regular dollar coin. the cashier clearly looks at it, sees sakagawea's face on it and one dollar legal tender cashier:\"we cant take dollar casino chips sorry you will have to cash them out\".. I just facepalmed and left.", "2_Subreddit": "TalesFromRetail"}], "dwix1tu": [{"0_Comment Submission": "Is the media serious with this narcan party shit!!!!", "1_Text": "Lol, reminds me of the oprah episodes that sent parents into a freak out over \"rainbow parties\" where allegedly 12 year old girls would each blow a dude with different colors of lipstick on.... Turns out there was one reported case of it but oprah made it seem like it was the new hot trend in middle schools all across America", "2_Subreddit": "opiates"}], "dwy49rl": [{"0_Comment Submission": "The real reason people like to work from home.", "1_Text": "Hey random question, is it realistic to break into entry level IT or programming with a bachelors degree in a different field completely and one or two certs?\n\nI have a BA in cinema/ Film production. TLDR hasn't lead to a full-time job.\n\nI want to work mostly in it as a server admin eventually as my career goal. \n\nPlanning on getting the AWS administration certification through Amazon. Self taught.\n\nI also have hands on hardware and software level trouble shooting repair upgrade ect. Working test, assembly, and repair at a server assembly factory. But have no other real certs to show for it.\n\nTLDR:\n\nIs there any realistic chance of getting hired entry level IT with a ba in film and the AWS cert?", "2_Subreddit": "gifs"}], "dwy4xqe": [{"0_Comment Submission": "The real reason people like to work from home.", "1_Text": "Any suggestions for the type of jobs to look for? Call center/it help desk seems to be the sterotypical work your way up from the mail room starting point.\n\nAny particular skills or certifications I should focus on?\n\nAny word of mouth or personal opinion on Amazon AWS as a service, certification, and If it/cloud computing is really the next big thing I and everyone else should be learning?", "2_Subreddit": "gifs"}], "dwyaaye": [{"0_Comment Submission": "The real reason people like to work from home.", "1_Text": "great, thanks for answering all of my long winded marijuana infused questions, its greatly appreciated... I would offer a toke/hit in thanks but theres like a computer screen and some tubes in the way...", "2_Subreddit": "gifs"}]}], "1_submissions": [{"69fx56": [{"0_Title": "Any way to check neighboring cities hot areas? And other noob questions", "1_Text": "Can't speak for any other stores/non Google Express. \n\nBut the stock available to buy is probably the nearest physical store to your location. Google Express is all about shipping you stuff from the actual store that has Google Express asap. So if you pick target as the store there are employees literally picking up your items off the shelf at the store,ringing them up, boxing them and mailing them out to you, so they may/are often limited to the available stock in a store in the area near you.", "2_Subreddit": "postmates"}], "6a1v8b": [{"0_Title": "Sold my car, the person I sold it too never registered it in their name, got in an accident and pretended to be my step mom who owned the car previously [California]", "1_Text": "Can't speak for any other stores/non Google Express. \n\nBut the stock available to buy is probably the nearest physical store to your location. Google Express is all about shipping you stuff from the actual store that has Google Express asap. So if you pick target as the store there are employees literally picking up your items off the shelf at the store,ringing them up, boxing them and mailing them out to you, so they may/are often limited to the available stock in a store in the area near you.", "2_Subreddit": "legaladvice"}], "6am1zv": [{"0_Title": "Any walkers in Oakland or Berkeley?", "1_Text": "Can't speak for any other stores/non Google Express. \n\nBut the stock available to buy is probably the nearest physical store to your location. Google Express is all about shipping you stuff from the actual store that has Google Express asap. So if you pick target as the store there are employees literally picking up your items off the shelf at the store,ringing them up, boxing them and mailing them out to you, so they may/are often limited to the available stock in a store in the area near you.", "2_Subreddit": "postmates"}], "6amrd5": [{"0_Title": "This delivery is no longer available?", "1_Text": "Can't speak for any other stores/non Google Express. \n\nBut the stock available to buy is probably the nearest physical store to your location. Google Express is all about shipping you stuff from the actual store that has Google Express asap. So if you pick target as the store there are employees literally picking up your items off the shelf at the store,ringing them up, boxing them and mailing them out to you, so they may/are often limited to the available stock in a store in the area near you.", "2_Subreddit": "postmates"}], "6ayrg6": [{"0_Title": "Anyone work mother's day last year? Busy or slow?", "1_Text": "Can't speak for any other stores/non Google Express. \n\nBut the stock available to buy is probably the nearest physical store to your location. Google Express is all about shipping you stuff from the actual store that has Google Express asap. So if you pick target as the store there are employees literally picking up your items off the shelf at the store,ringing them up, boxing them and mailing them out to you, so they may/are often limited to the available stock in a store in the area near you.", "2_Subreddit": "postmates"}], "6bai76": [{"0_Title": "Anyone rent a scooter?", "1_Text": "Can't speak for any other stores/non Google Express. \n\nBut the stock available to buy is probably the nearest physical store to your location. Google Express is all about shipping you stuff from the actual store that has Google Express asap. So if you pick target as the store there are employees literally picking up your items off the shelf at the store,ringing them up, boxing them and mailing them out to you, so they may/are often limited to the available stock in a store in the area near you.", "2_Subreddit": "postmates"}], "6i0q62": [{"0_Title": "Anyone work stunts/effects? Anyone know how a one arm lift and choke is done?", "1_Text": "Can't speak for any other stores/non Google Express. \n\nBut the stock available to buy is probably the nearest physical store to your location. Google Express is all about shipping you stuff from the actual store that has Google Express asap. So if you pick target as the store there are employees literally picking up your items off the shelf at the store,ringing them up, boxing them and mailing them out to you, so they may/are often limited to the available stock in a store in the area near you.", "2_Subreddit": "Theatre"}], "6my9jt": [{"0_Title": "Anyone else sign up for the e-bike pilot program?", "1_Text": "Can't speak for any other stores/non Google Express. \n\nBut the stock available to buy is probably the nearest physical store to your location. Google Express is all about shipping you stuff from the actual store that has Google Express asap. So if you pick target as the store there are employees literally picking up your items off the shelf at the store,ringing them up, boxing them and mailing them out to you, so they may/are often limited to the available stock in a store in the area near you.", "2_Subreddit": "postmates"}], "6oj7r2": [{"0_Title": "No pending deposits?", "1_Text": "Can't speak for any other stores/non Google Express. \n\nBut the stock available to buy is probably the nearest physical store to your location. Google Express is all about shipping you stuff from the actual store that has Google Express asap. So if you pick target as the store there are employees literally picking up your items off the shelf at the store,ringing them up, boxing them and mailing them out to you, so they may/are often limited to the available stock in a store in the area near you.", "2_Subreddit": "postmates"}], "6oltr5": [{"0_Title": "Wtf is going on with step 2?", "1_Text": "Can't speak for any other stores/non Google Express. \n\nBut the stock available to buy is probably the nearest physical store to your location. Google Express is all about shipping you stuff from the actual store that has Google Express asap. So if you pick target as the store there are employees literally picking up your items off the shelf at the store,ringing them up, boxing them and mailing them out to you, so they may/are often limited to the available stock in a store in the area near you.", "2_Subreddit": "whatisthisthing"}], "6zh6w9": [{"0_Title": "Anyone had the restaurant worker add their own tip?", "1_Text": "Can't speak for any other stores/non Google Express. \n\nBut the stock available to buy is probably the nearest physical store to your location. Google Express is all about shipping you stuff from the actual store that has Google Express asap. So if you pick target as the store there are employees literally picking up your items off the shelf at the store,ringing them up, boxing them and mailing them out to you, so they may/are often limited to the available stock in a store in the area near you.", "2_Subreddit": "postmates"}], "6zxm6a": [{"0_Title": "Anyone going to the SF show tonight?", "1_Text": "Can't speak for any other stores/non Google Express. \n\nBut the stock available to buy is probably the nearest physical store to your location. Google Express is all about shipping you stuff from the actual store that has Google Express asap. So if you pick target as the store there are employees literally picking up your items off the shelf at the store,ringing them up, boxing them and mailing them out to you, so they may/are often limited to the available stock in a store in the area near you.", "2_Subreddit": "AgainstMe"}], "71kpsg": [{"0_Title": "How closely do you guys watch the pick up orders?", "1_Text": "Can't speak for any other stores/non Google Express. \n\nBut the stock available to buy is probably the nearest physical store to your location. Google Express is all about shipping you stuff from the actual store that has Google Express asap. So if you pick target as the store there are employees literally picking up your items off the shelf at the store,ringing them up, boxing them and mailing them out to you, so they may/are often limited to the available stock in a store in the area near you.", "2_Subreddit": "postmates"}], "758oxw": [{"0_Title": "Anyone get paid today?", "1_Text": "Can't speak for any other stores/non Google Express. \n\nBut the stock available to buy is probably the nearest physical store to your location. Google Express is all about shipping you stuff from the actual store that has Google Express asap. So if you pick target as the store there are employees literally picking up your items off the shelf at the store,ringing them up, boxing them and mailing them out to you, so they may/are often limited to the available stock in a store in the area near you.", "2_Subreddit": "postmates"}], "7b713o": [{"0_Title": "Broke off a 31 gauge needle in my arm???", "1_Text": "Can't speak for any other stores/non Google Express. \n\nBut the stock available to buy is probably the nearest physical store to your location. Google Express is all about shipping you stuff from the actual store that has Google Express asap. So if you pick target as the store there are employees literally picking up your items off the shelf at the store,ringing them up, boxing them and mailing them out to you, so they may/are often limited to the available stock in a store in the area near you.", "2_Subreddit": "opiates"}], "7exc0d": [{"0_Title": "Oaklahoma city(PBS YouTube) [1:43:00]", "1_Text": "Can't speak for any other stores/non Google Express. \n\nBut the stock available to buy is probably the nearest physical store to your location. Google Express is all about shipping you stuff from the actual store that has Google Express asap. So if you pick target as the store there are employees literally picking up your items off the shelf at the store,ringing them up, boxing them and mailing them out to you, so they may/are often limited to the available stock in a store in the area near you.", "2_Subreddit": "Documentaries"}], "7hf2j9": [{"0_Title": "Any crafting based mmorpgs/games in general?", "1_Text": "Can't speak for any other stores/non Google Express. \n\nBut the stock available to buy is probably the nearest physical store to your location. Google Express is all about shipping you stuff from the actual store that has Google Express asap. So if you pick target as the store there are employees literally picking up your items off the shelf at the store,ringing them up, boxing them and mailing them out to you, so they may/are often limited to the available stock in a store in the area near you.", "2_Subreddit": "AndroidGaming"}], "7hhksi": [{"0_Title": "Hustling suggestions?", "1_Text": "Can't speak for any other stores/non Google Express. \n\nBut the stock available to buy is probably the nearest physical store to your location. Google Express is all about shipping you stuff from the actual store that has Google Express asap. So if you pick target as the store there are employees literally picking up your items off the shelf at the store,ringing them up, boxing them and mailing them out to you, so they may/are often limited to the available stock in a store in the area near you.", "2_Subreddit": "opiates"}], "7jtr5i": [{"0_Title": "Mother fucking direct deposit", "1_Text": "Can't speak for any other stores/non Google Express. \n\nBut the stock available to buy is probably the nearest physical store to your location. Google Express is all about shipping you stuff from the actual store that has Google Express asap. So if you pick target as the store there are employees literally picking up your items off the shelf at the store,ringing them up, boxing them and mailing them out to you, so they may/are often limited to the available stock in a store in the area near you.", "2_Subreddit": "opiates"}], "7k83nj": [{"0_Title": "Bart, medical emergency Powell closed", "1_Text": "Can't speak for any other stores/non Google Express. \n\nBut the stock available to buy is probably the nearest physical store to your location. Google Express is all about shipping you stuff from the actual store that has Google Express asap. So if you pick target as the store there are employees literally picking up your items off the shelf at the store,ringing them up, boxing them and mailing them out to you, so they may/are often limited to the available stock in a store in the area near you.", "2_Subreddit": "sanfrancisco"}], "7lp5k7": [{"0_Title": "JJ is real!", "1_Text": "Can't speak for any other stores/non Google Express. \n\nBut the stock available to buy is probably the nearest physical store to your location. Google Express is all about shipping you stuff from the actual store that has Google Express asap. So if you pick target as the store there are employees literally picking up your items off the shelf at the store,ringing them up, boxing them and mailing them out to you, so they may/are often limited to the available stock in a store in the area near you.", "2_Subreddit": "opiates"}], "7ooy0l": [{"0_Title": "Any good games (non emulated) that run on pi 3?", "1_Text": "Can't speak for any other stores/non Google Express. \n\nBut the stock available to buy is probably the nearest physical store to your location. Google Express is all about shipping you stuff from the actual store that has Google Express asap. So if you pick target as the store there are employees literally picking up your items off the shelf at the store,ringing them up, boxing them and mailing them out to you, so they may/are often limited to the available stock in a store in the area near you.", "2_Subreddit": "raspberry_pi"}], "7wzby7": [{"0_Title": "Is getting the aws sysops administrator cert a realistic path to getting a job in the it industry? and other noob questions.", "1_Text": "Can't speak for any other stores/non Google Express. \n\nBut the stock available to buy is probably the nearest physical store to your location. Google Express is all about shipping you stuff from the actual store that has Google Express asap. So if you pick target as the store there are employees literally picking up your items off the shelf at the store,ringing them up, boxing them and mailing them out to you, so they may/are often limited to the available stock in a store in the area near you.", "2_Subreddit": "aws"}], "837o5m": [{"0_Title": "Fent in tar warning SF/TL I Just oded!", "1_Text": "Can't speak for any other stores/non Google Express. \n\nBut the stock available to buy is probably the nearest physical store to your location. Google Express is all about shipping you stuff from the actual store that has Google Express asap. So if you pick target as the store there are employees literally picking up your items off the shelf at the store,ringing them up, boxing them and mailing them out to you, so they may/are often limited to the available stock in a store in the area near you.", "2_Subreddit": "opiates"}], "84jqg4": [{"0_Title": "any way to broadcast from android version of the game?", "1_Text": "Can't speak for any other stores/non Google Express. \n\nBut the stock available to buy is probably the nearest physical store to your location. Google Express is all about shipping you stuff from the actual store that has Google Express asap. So if you pick target as the store there are employees literally picking up your items off the shelf at the store,ringing them up, boxing them and mailing them out to you, so they may/are often limited to the available stock in a store in the area near you.", "2_Subreddit": "baldursgate"}]}]}]}