{"Hanfseedz": [{"0_comments": [{"dubtrpk": [{"0_Comment Submission": "2g Come up, notice my Hawaiian shorts", "1_Text": "Sam?", "2_Subreddit": "opiates"}], "dubvazf": [{"0_Comment Submission": "A little scared to sleep.", "1_Text": "good thing breathing is an autonomous body function. you wont forget to breathe", "2_Subreddit": "opiates"}], "dubvwuw": [{"0_Comment Submission": "Would dabbing...", "1_Text": "works better with an e-nail where you can control the exact temp", "2_Subreddit": "opiates"}], "dufixst": [{"0_Comment Submission": "DNM question.", "1_Text": "I reccomend becoming a member at the DNM Avengers forum. They have a great opiate community there who are constantly reviewing vendors from the DNM's", "2_Subreddit": "opiates"}], "duy67ec": [{"0_Comment Submission": "When the pills and d run out, nature is always there to soothe my receptors", "1_Text": "how are you determining the purity of the alkaloids in your latex? most wild strains of poppies have anywhere from 3-20% opiod alkaloid content.", "2_Subreddit": "opiates"}], "duy6g7r": [{"0_Comment Submission": "Oh I forgot to tell you guys this happened...", "1_Text": "to people that are questioning whether these are fake or not...... they all have the same serial number dumb-asses", "2_Subreddit": "opiates"}], "duy70pp": [{"0_Comment Submission": "WDs", "1_Text": "I have tried both ways, and for me personally WD's were the same whether I went from a gram a day and then stopped or if I tapered my dosage down then stopped.\n\none type of taper that HAS worked for me is changing to weaker and weaker opiods. for example going from H then to oxy, then to hydros has made WD's \"lighter\"", "2_Subreddit": "opiates"}], "duy7nh6": [{"0_Comment Submission": "CBD oil for withdrawals", "1_Text": "when I am going through WD's , I take a 1:1 ratio of CBD:THC oil at night time. It helps with sleep and the RLS. I take a good sized dose, it comes out to about 200mg of CBD and 200mg of THC, sometimes I double the dose when I need to sleep and cant", "2_Subreddit": "opiates"}], "duy7y47": [{"0_Comment Submission": "How much does it cost for subs", "1_Text": "you wont need to take them every day because the half life of them. but I garuntee once you start them, you will be re-dosing every 36-48 hours......... (thats the half life and the time when your body kicks into WD's)", "2_Subreddit": "opiates"}], "duy8e0l": [{"0_Comment Submission": "Forgot i ordered a gram of #3 over a week ago shits coming today!!!!!", "1_Text": "weird, I have the science of my neighborhood mail down in the exact same way! like i could have written what you said verbatim", "2_Subreddit": "opiates"}], "duy8mcn": [{"0_Comment Submission": "Have anyone here tried smoking opium? Where did you do it and how was it?", "1_Text": "When I lived in Chicago, only 1 time there was opium hash available. Someone had mixed opium and hash in a 50/50 ratio and were selling it by the ounce (I think i paid either 200 or 250 for the oz). But when that was gone, it was never available again.\n\non the west coast I have harvested my own opium from poppy plants.", "2_Subreddit": "opiates"}], "duy8rr5": [{"0_Comment Submission": "What's the worst part of withdrawals for you?", "1_Text": "insomnia and being cold as fuck and not being able to hold in ANY body heat", "2_Subreddit": "opiates"}], "dv20k2e": [{"0_Comment Submission": "favorite means of potentiation for oxy?", "1_Text": "hydroxizine", "2_Subreddit": "opiates"}], "dvh1jgo": [{"0_Comment Submission": "Has anyone ever smoked real opium the old school way?", "1_Text": "ph adjust your water to between 5.5 and 5.7, dissolve your gear in the water. (warmer water will dissolve it faster). The non water soluble will precipitate out, you then filter your solution and remove the water portion.", "2_Subreddit": "opiates"}], "dvh1vcg": [{"0_Comment Submission": "Paktong Opium Smoking Layout", "1_Text": "with all the H being produced in mexico now, opium is getting more and more common. as a tourist, you can buy a kilo of opium for 2k in  tijuana", "2_Subreddit": "opiates"}], "dvh1wor": [{"0_Comment Submission": "Paktong Opium Smoking Layout", "1_Text": "and it takes 6-8 kilos of opium to make 1 kilo of BTH. or so ive heard.....", "2_Subreddit": "opiates"}], "dvm8rzs": [{"0_Comment Submission": "Wtf is this i thought I scored. Guy said it was black tar. Paid $40", "1_Text": "ive seen tar that looked like this and was actually good quality. try smoking some, then report back", "2_Subreddit": "opiates"}], "dvnzj9b": [{"0_Comment Submission": "Wtf is this i thought I scored. Guy said it was black tar. Paid $40", "1_Text": "sounds like it", "2_Subreddit": "opiates"}], "dvnzm4f": [{"0_Comment Submission": "in the PNW you have to know how to play when it rains.", "1_Text": "lol i bet this is from al", "2_Subreddit": "opiates"}], "dw7cbb0": [{"0_Comment Submission": "kinda miss black tar", "1_Text": "in france it is", "2_Subreddit": "opiates"}], "dwe9wr0": [{"0_Comment Submission": "Look OP homies , NO more walking after tricken n copN 😂", "1_Text": "this is an ad for a pimp.....", "2_Subreddit": "opiates"}], "dwefyzb": [{"0_Comment Submission": "Current dwelling", "1_Text": "brad?", "2_Subreddit": "opiates"}], "dwpwky4": [{"0_Comment Submission": "Opiates and motivation/creativity", "1_Text": "Same story for me, My roommate always knows when I am high because that is when I bust out the colored pencils and start drawing.", "2_Subreddit": "opiates"}], "dwu7n5c": [{"0_Comment Submission": "Waiting", "1_Text": "this was the story of my life before finding a local connect. multiple days a week.... what sucked was how the route was, I could see him for a good 30-40 min before he got to me, and that last 40 minutes was the worst, knowing it was sooo close", "2_Subreddit": "opiates"}], "dwu7t3k": [{"0_Comment Submission": "Is the West Coast turning into WCP and the East turning to Tar?", "1_Text": "i wish", "2_Subreddit": "opiates"}]}], "1_submissions": [{"74l42u": [{"0_Title": "Ahh early start to the weekend", "1_Text": "Sam?", "2_Subreddit": "opiates"}], "754fnc": [{"0_Title": "Getting adulterated product tested", "1_Text": "Sam?", "2_Subreddit": "opiates"}], "7avy31": [{"0_Title": "Thank Junkie Jesus! First cold cop a success!", "1_Text": "Sam?", "2_Subreddit": "opiates"}], "7roryv": [{"0_Title": "This ever happen to you?", "1_Text": "Sam?", "2_Subreddit": "opiates"}]}]}]}