{"CryptoOrchid": [{"0_comments": [{"dwris1d": [{"0_Comment Submission": "User discovers porn bot conspiracy on the nsfw side of reddit [NSFW]", "1_Text": "I think of Individual Retirement Account.. Because I diversify my pornography intake.", "2_Subreddit": "bestof"}], "dwtovka": [{"0_Comment Submission": "YouTube shooter Nasim Aghdam a female california resident, was vegan, bodybuilder and activist who complained about youtube suppression and demonetization of her channels. Media incorrectly called it domestic violence.", "1_Text": "I think they’re just saying they are similar. The similarity is due to bandwidth constraints so you purposely have little except content.. it could be that she just threw crap out there and didn’t care, or mimicked other darkweb sites she visited and just lifted the page. Either way, no one will probably ever know and this lady was clearly having mental problems... I mean.. just look at her web design..", "2_Subreddit": "AskThe_Donald"}], "dwtzexu": [{"0_Comment Submission": "Wage gap explained", "1_Text": "Yeah... she actually didn’t miss that time.", "2_Subreddit": "ImGoingToHellForThis"}], "dwtzqz2": [{"0_Comment Submission": "Wage gap explained", "1_Text": "No, this was a crazy vegan.. afaik biologically a woman and appearing as one as well. She identified as an angry YouTube personality... then she got triggered.", "2_Subreddit": "ImGoingToHellForThis"}], "dwtzzks": [{"0_Comment Submission": "YouTube shooter Nasim Aghdam a female california resident, was vegan, bodybuilder and activist who complained about youtube suppression and demonetization of her channels. Media incorrectly called it domestic violence.", "1_Text": "I totally agree. Her page looks as stylish as a darkweb Page.. but there is absolutely no link to the darkweb and I don’t think anyone can draw one just because her site looks like shit.", "2_Subreddit": "AskThe_Donald"}], "dwu0gfb": [{"0_Comment Submission": "Wage gap explained", "1_Text": "Don’t cheapen the feat of men finally winning woman of the year. We worked hard for that.\n\nHopefully, after smashing that glass ceiling, men can be the first female president!", "2_Subreddit": "ImGoingToHellForThis"}], "dwu2ncf": [{"0_Comment Submission": "Christian teacher who told gay student she must 'repent' or burn in hell, loses legal appeal which claimed she was a victim of religious discrimination and claimed in releases that she was “sacked for saying God loves you”.", "1_Text": "The Bible doesn’t mention hell??\n\nThis is just a quick google search..\n\nhttps://www.biblestudytools.com/topical-verses/hell-bible-verses/\n\nWhat are you talking about when you say the Bible doesn’t mention hell?", "2_Subreddit": "atheism"}], "dwu35u1": [{"0_Comment Submission": "Wage gap explained", "1_Text": "F\n\nFor respect. Because you killed it quicker than she did.. Bravo.", "2_Subreddit": "ImGoingToHellForThis"}], "dwu4y66": [{"0_Comment Submission": "Wage gap explained", "1_Text": "Glamour.. where have you been??", "2_Subreddit": "ImGoingToHellForThis"}], "dwv4642": [{"0_Comment Submission": "YouTube shooter Nasim Aghdam a female california resident, was vegan, bodybuilder and activist who complained about youtube suppression and demonetization of her channels. Media incorrectly called it domestic violence.", "1_Text": "I’m sorry, but I’m not seeing the connection here. \n\nI mean ... she could have lifted the page layout from a darkweb site and threw her own content on it? But what’s it really matter?\n\nHer audience was Iran and Turkey.. .. well ok? Fine. So again, I’d ask how that matters. \n\nIn my eyes she’s trying to get content on a page and doesn’t care about decoration or formatting. This is what you do if you care about bandwidth or are just sloppy. Or both.", "2_Subreddit": "AskThe_Donald"}], "dwvef2z": [{"0_Comment Submission": "YouTube shooter Nasim Aghdam a female california resident, was vegan, bodybuilder and activist who complained about youtube suppression and demonetization of her channels. Media incorrectly called it domestic violence.", "1_Text": "Ok but saying that this is tied in with the darkweb in any way just implies a different side to the story that doesn’t follow any evidence. It’s about like me just commenting that Trix are for kids here. It fits about the same way as trying to tie her into the darkweb or Tor.", "2_Subreddit": "AskThe_Donald"}], "dww8u0q": [{"0_Comment Submission": "YouTube shooter Nasim Aghdam a female california resident, was vegan, bodybuilder and activist who complained about youtube suppression and demonetization of her channels. Media incorrectly called it domestic violence.", "1_Text": "So... ok.. and I could see that.. if it was hosted on the darkweb but it wasn’t. \n\nI’m not saying that she didn’t *also* host a copy on the darkweb.. but the only one I know of was available on the standard web. \n\nUnless someone says.. ‘oh yeah.. she hosted a copy on Tor’.. I don’t really want to make that leap. It’s just a shitty looking website. \n\nYou’re making the assumption that she also hosted a copy on the darkweb. Nothing necessarily wrong with that, but it’s not a leap I’m willing to take without evidence other than her website looking like shit.", "2_Subreddit": "AskThe_Donald"}], "dwwcwla": [{"0_Comment Submission": "YouTube shooter Nasim Aghdam a female california resident, was vegan, bodybuilder and activist who complained about youtube suppression and demonetization of her channels. Media incorrectly called it domestic violence.", "1_Text": "Well... ok then. TRIX ARE FOR KIDS.", "2_Subreddit": "AskThe_Donald"}], "dwxs4ar": [{"0_Comment Submission": "Georgia politician publicly uses N-word as Atlanta suburb declares Confederate History Month.", "1_Text": "You know... I don’t know that using that word does make you a racist.. he wasn’t targeting a person with it, but referring to a location as it was known at the time. I guess. The current lexicon is always changing... words change. As an example.. \n\nidiot once meant mentally disabled. But people started calling each other idiot as an insult \n\nand then they changed it to ‘retarded’ (still in reference to a mentally retarded person).. then guess what happened?? Yep.. people used it as an insult .. \n\nSo now people get mad when you say retard. So they changed it to what now? Mentally challenged? Aaaand now people use that in the same way. \n\nA similar thing happened with the words fag and gay. In high school fag was used a lot.. but no one I knew had problems with or hated gay people. \n\nWhat bothers me the most is when people say ‘r-word’ or ‘n-word’.. Jesus it makes my skin crawl for some reason. It reminds me of elementary school when a kid runs to the teacher and says “he said the s-word!!!” \n\nIt seems so f-wording childish that it’s cringeworthy. \n\nAnyway .. that tirade out of the way.. could the guy be a racist? Maybe? But I don’t think this guarantees he’s a klan member.. \n\nThen again... if you lived next to a place called ‘fag town’ and you wanted to reference that in a speech.. I could easily see how people might think you had issues with gay people.. It’s not really appropriate to reference it that way in public record though. \n\nThat said though.. if it was named that and everyone knew that and you referenced that.. it’s not like you named it fag town.. eh... I dunno. \n\nBefore anyone jumps on this to call me racist or gay hating, I’m not racist. And I don’t hate gay people. I hate dumb people, and consider myself an equal opportunity hater regardless of gender, color, or creed.", "2_Subreddit": "news"}], "dwxttwj": [{"0_Comment Submission": "No more religious exemptions: Montreal is taxing churches", "1_Text": "Actually.. I’m ordained in that internet life church thing.. I can marry people.. I think I can make holy water.. I think this sounds like a business venture. \n\nEdit: Holy shit.. people beat me to the punch\n\nhttp://www.ebay.com/bhp/blessed-holy-water\n\nWater from the Jordan river also goes for $20 on Amazon in a special bottle. \n\nJesus would have been so pleased to see that shit. \n\nWe’re late to the game folks. :(", "2_Subreddit": "atheism"}], "dwxu4o9": [{"0_Comment Submission": "No more religious exemptions: Montreal is taxing churches", "1_Text": "> Meanwhile churches across the island are praying that the city will cease surprising them with taxes they can't afford.\n\nThis is how the prayer will end up...\n\nThey stopped getting taxed = God answered our prayers!!\n\nThey continue getting taxed = God is giving us a trial to see if we can make it..\n\nThey get taxed harder = God is really testing us and our faith and he knows we can pull through! Donate plz. \n\nNever mind the fact that if god didn’t actually like this, he could have stricken the people voting for the bill all sick that day so they couldn’t vote on it. Or you know.. knocked out the electricity at the moment they were going to take the vote. ... hmm... almost like god gives zero craps..\n\nShould have prayed to Joe Pesci.", "2_Subreddit": "atheism"}], "dwyqp8g": [{"0_Comment Submission": "No more religious exemptions: Montreal is taxing churches", "1_Text": "If running it through my holy coffee pot in ‘clean mode’ counts, sure. Extra $5. Filter costs an extra $10. Because that’s holy too.", "2_Subreddit": "atheism"}], "dwyr3tz": [{"0_Comment Submission": "No more religious exemptions: Montreal is taxing churches", "1_Text": ">Do you really believe all religious people are unable to say \"I guess God doesn't want me to have this?\" \n\nOf course not. I was taught in school that God answers prayers with yes, no, or wait awhile. Seriously. That’s what they taught me. \n\nWell it turns out that yes, no, or wait awhile is also how every wish you’ve ever made on a birthday cake is answered. \n\nI was really making a joke in this case where instead of simply saying ‘well.. guess god said no’ the church applies a reason .. as most religious people do. In the example god would have actually said no. But they don’t understand why this could be... so they then turn and justify it by saying ‘he’s testing us’ or giving them a trial or god never throws so much at you that you can’t handle it and finally the famous or infamous\n\nGod works in mysterious ways. \n\nBut if his ways are so mysterious and really help no one better than chance odds what the hell good is he? Basically, why bother with prayer in the first place. \n\nShort answer though.. is no. \n\n>I'm always interested to learn new ways people view church and religion.\n\nI’m always open for discourse. : )", "2_Subreddit": "atheism"}], "dwyr7b5": [{"0_Comment Submission": "No more religious exemptions: Montreal is taxing churches", "1_Text": "You’re right. Never mind that god made Satan knowing how he’d be too. \n\nIt’s like Batman creating the joker while fully knowing the joker will be a giant bastard. \n\nWell... except for the fact that god actually kills more people in the Bible.", "2_Subreddit": "atheism"}], "dwyrl6b": [{"0_Comment Submission": "No more religious exemptions: Montreal is taxing churches", "1_Text": "I think that’s probably ok... because it’s filtered by the holy kidneys that I’ll have to bless. After a hard night of binge drinking, you piss water ... I don’t think you can serve that though. If anyone finds out, you’ll lose out on sales. \n\nOmg people are doing this already...\n\nhttp://www.ebay.com/bhp/blessed-holy-water", "2_Subreddit": "atheism"}], "dwys3sx": [{"0_Comment Submission": "No more religious exemptions: Montreal is taxing churches", "1_Text": "Ok so TIL that you can already buy holy water on amazon and eBay. So.. yeah... some headlines even say ‘blessed by the pope’. Since I can’t compare to the pope as far as holy rank goes... I’ll just have to say some clever headline. \n\nActually... shit I’ll just use blessed by the pope.. it doesn’t say which pope. And I’ll just form a religion where I’m the pope!! Omg problem solved!!!", "2_Subreddit": "atheism"}], "dwz4527": [{"0_Comment Submission": "No more religious exemptions: Montreal is taxing churches", "1_Text": "In my findings some believe in chance to an extent... but they also believe that god has a plan. \n\nSomehow they bake that in with free will. \n\nA lot of times there will be contradictory circumstances that present but they will be explained away with ‘we can’t understand god’. \n\nSo chance is a thing for them. Like flipping a coin is 50/50. But god plans for whatever in the bigger picture.", "2_Subreddit": "atheism"}], "dwz4cvb": [{"0_Comment Submission": "No more religious exemptions: Montreal is taxing churches", "1_Text": "https://www.themonastery.org/ordination\n\nIt doesn't cost money, but it does if you want a wall plaque or framing of your certificate or wallet cards.. that stuff..", "2_Subreddit": "atheism"}], "dwz4vm9": [{"0_Comment Submission": "No more religious exemptions: Montreal is taxing churches", "1_Text": "This is actually a discussion I had recently with some other folks.. To me and how I see it is that God created the rules of existence. God created sin. God created the ability for evil to exist. God created the minds of Adam and Eve to sin in the first place. He therefore wrote the rules of life knowing what would happen and chose it to be that way. \n\nIf god doesn't intervene, then what good is he? Because he created evil, he's in the least a douche right? \n\nGod got what he wanted if he created it because how could he not? By definition he's god and can have anything he wants. He wrote the rules of logic. \n\nThen you have.. Well why the fuck are we special? What about the 'human like' creatures before us? We know homo-sapiens existed for at least 100,000 years. Jesus didn't come along until 2,000 years ago.. Does animal life go to heaven? Well why not? We know animals can feel sadness and loss. Gorillas have friends and families. \n\nLife just *is*.", "2_Subreddit": "atheism"}], "dwz5775": [{"0_Comment Submission": "No more religious exemptions: Montreal is taxing churches", "1_Text": "Hahaha!! Irrefutable proof.. That's a good one. \n\nAnd actually, I could have sworn there was a bible verse that basically said something to the effect of.. God won't give us proof because he wants us to have faith and if you have proof, you don't need faith..\n\nCan't find it now though.", "2_Subreddit": "atheism"}]}], "1_submissions": [{}]}]}