{"edogedog85": [{"0_comments": [{"dkj34fw": [{"0_Comment Submission": "Ports and Chest Hair", "1_Text": "I just shave half of my chest, it's weird looking but feels better than ripping a bunch of hair out.", "2_Subreddit": "cancer"}], "dm4vwpv": [{"0_Comment Submission": "Please Help!! My mom has no appetite left and wants to quit chemo", "1_Text": "Get her some THC asap,  it helps me in so many ways esp apitite dyeing chemo. God bless", "2_Subreddit": "cancer"}], "dm4waz2": [{"0_Comment Submission": "Is this guy seriously faking cancer?", "1_Text": "Sounds very fishy. I'm a stage 4 and haver been through chemo, radiation and lots and lots of surgeries and I look like a very healthy full bearded man.  The only time I ever had a transfusion was during surgery and once during chemo bc my WBC got too low.\nI know what you mean about not knowing about his cancer bc as soon as I found out I had cancer I tried to learn everything about it. I hope he is lying by that's a horrible thing to do.", "2_Subreddit": "cancer"}], "dmrl42x": [{"0_Comment Submission": "Kind thoughts appreciated", "1_Text": "I am very sad to say this but she passed away 2 nights ago. She went easy with loved ones at her side.", "2_Subreddit": "cancer"}], "dvfuh7y": [{"0_Comment Submission": "It's back, starting immunotherapy trial", "1_Text": "Thank you for that study, I can't find anything and I have access to all the medical journals from my sister. I'll keep an update of how it's going.", "2_Subreddit": "cancer"}], "dvq466j": [{"0_Comment Submission": "It's back, starting immunotherapy trial", "1_Text": "I'm so sorry about your wife.\nMy wait was long also they made me wait until my cancer came back to give me and immunotherapy. \nWhere are you located? The START cancer center in San Antonio, TX is doing a bunch of trials right now... I hope for a full recovery for your wife and your family.", "2_Subreddit": "cancer"}], "dvtr0yw": [{"0_Comment Submission": "Starting human trials of INCB001158/ CB-1158", "1_Text": "First was bladder cancer, tumor removed from bladder and was doing fine for a yeast then a lump in my arm popped up,  within  6 weeks I was told to go on hospice due to Stage 4 metastatic bladder cancer that\n Spread to my back, sacrum, hip, had it replaced, shoulder, mouth, Lungs. \nI was free for about 2 months then it's back in my lung. Growing very slow compared to the extremely aggressive I had before.", "2_Subreddit": "cancer"}], "dvtr2pv": [{"0_Comment Submission": "Starting human trials of INCB001158/ CB-1158", "1_Text": "Let me know if I can give any info. So fast in feeling pretty good.  No bag side effects besides alil sleepy but I'm also only 32 so I'm different that older patience", "2_Subreddit": "cancer"}], "dvu0p9z": [{"0_Comment Submission": "Starting human trials of INCB001158/ CB-1158", "1_Text": "If I can help anyone through this trial, I will be happy.  I just started taking it on the 13th of this month, a few days ago. \nNo side effects so fat besides alil sleepy and lazy but I'm always like that. I'm 32 and haven't been working so I've had to become ok with not doing much. Alot of problems from the cancer and radiation in my bones. \nI don't feel any different from before I started but it's only been a few days...\nI hope y'all get the help you need. Let me know if you have amy other questions.", "2_Subreddit": "cancer"}], "dvum4hh": [{"0_Comment Submission": "Starting human trials of INCB001158/ CB-1158", "1_Text": "Yea, it hasn't even been a week yet. We'll know more as time goes by.", "2_Subreddit": "cancer"}], "dwkgg9f": [{"0_Comment Submission": "PRAISE JJ! Can’t even believe it HA!", "1_Text": "Good job!  I found a 100 patch 2 days ago I lost like 6 months ago, I was really stoked!", "2_Subreddit": "opiates"}]}], "1_submissions": [{"834u56": [{"0_Title": "It's back, starting immunotherapy trial", "1_Text": "I just shave half of my chest, it's weird looking but feels better than ripping a bunch of hair out.", "2_Subreddit": "cancer"}], "84jq5y": [{"0_Title": "Starting human trials of INCB001158/ CB-1158", "1_Text": "I just shave half of my chest, it's weird looking but feels better than ripping a bunch of hair out.", "2_Subreddit": "cancer"}]}]}]}