{"Chernoobyl": [{"0_comments": [{"dwvjik7": [{"0_Comment Submission": "*UPDATED* Eric Hafner Democrat for U.S. Congress 3rd District Portland, Oregon 2018", "1_Text": "> I'm actually doing gun owners a big favor in offering an alternative\n\nHAHAHAHA oh shit, the worst part is you probably actually believe this. No, you aren't doing gun owners a favor, you are continuing the purging of our rights. The only way to save them, is to vote out those who advocate against our rights and to not vote in those who do the same. The red tide is coming, and it's going to be glorious.", "2_Subreddit": "oregon"}], "dwvn34g": [{"0_Comment Submission": "Running from the cops wcgw.", "1_Text": "> what kind of shithole country has cops who'll chase someone down \n\nI mean, they will chase you if you run, they don't know *why* you are running so of course they will chase. Do you honestly think police officers should let suspects run from them and not chase? What a stupid thing to say.", "2_Subreddit": "Whatcouldgowrong"}], "dwvn6b6": [{"0_Comment Submission": "Running from the cops wcgw.", "1_Text": "The razorblade up the butthole is slightly more irritating", "2_Subreddit": "Whatcouldgowrong"}], "dwvno6e": [{"0_Comment Submission": "Let me drive too fast, on a slippery road, while passing on the wrong side of traffic, WCGW?", "1_Text": "I see so many people texting when driving, there is literally not a single day that goes by that I don't see 10+ people not paying attention to the road with their faces buried in their phones. It's sickening.", "2_Subreddit": "Whatcouldgowrong"}], "dwvnv9g": [{"0_Comment Submission": "Running from the cops wcgw.", "1_Text": "> Because they get away more than you hear about\n\nI used to watch cops a lot when I was younger and was always amazed that they caught everyone who ran. Then I got older and realized there would be no way they would show the people who run and got away.", "2_Subreddit": "Whatcouldgowrong"}], "dwvohqm": [{"0_Comment Submission": "Let me bench press more than I can, WCGW?", "1_Text": "His palms are sweaty, arms weak, weights are heavy", "2_Subreddit": "Whatcouldgowrong"}], "dwvpenq": [{"0_Comment Submission": "Meet and greet with JBP - what to expect?", "1_Text": "That's a bummer actually", "2_Subreddit": "JordanPeterson"}], "dwvqesn": [{"0_Comment Submission": "A reminder to not sink to the level of your opponent", "1_Text": "We're here, Tactical Gear, Get Used To It!", "2_Subreddit": "liberalgunowners"}], "dwvqhce": [{"0_Comment Submission": "A reminder to not sink to the level of your opponent", "1_Text": "> I don't love my ammo\n\nMy Hornady is pretty damn sexy tho...", "2_Subreddit": "liberalgunowners"}], "dwvqlxq": [{"0_Comment Submission": "A reminder to not sink to the level of your opponent", "1_Text": "> as a bisexual dude who regularly calls '2A Enthusiasts' ammosexuals\n\nAs long as you're ok with others calling you a faggot, that's cool. If you aren't, maybe zip your lip and quit calling others stupid derogatory putdowns.", "2_Subreddit": "liberalgunowners"}], "dwwy2c3": [{"0_Comment Submission": "Thought you guys might like my AR engraving", "1_Text": "Righty here (and one who particularly doesn't like Colin) - this is without a doubt one of the funniest things I've seen in a while lol - well done OP", "2_Subreddit": "liberalgunowners"}], "dwwzq46": [{"0_Comment Submission": "Thought you guys might like my AR engraving", "1_Text": ">  actually condemn that same big government who are murdering minorities or the tyrannical government throwing millions of poor people (including minorities) into prison for dumb shit like marijuana, \n\n\"murdering minorities\" is such a disingenuous thing to say though, it takes away any and all context and discussion when you paint it like that. Sure, there are some examples of gross misconduct and blatant murder (which I will gladly stand up against, and there are plenty of examples of this against white people too - but those go untalked about), but there are plenty of martyrs that absolutely had it coming to them and it's abhorrent anyone is trying to champion those instances. When you deduce complicated things down to simple \"the government is killing black people!\" arguments, I lose any interest in hearing what you have to say. It's silly and isn't a valid way to begin a discussion. I've been arrested and sent to jail for Marijuana crimes and I'm white as fuck, was in jail with plenty people of all races in there for the same, framing EVERYTHING as \"white people/people in power vs minorities\" is just a dangerous game and not one rational adults should be playing (at least in my opinion).\n\n> When you see someone carrying that flag and those same people are cheering for an oppressive police force\n\nAgain, this is not a rational way to have a conversation, you are painting broad strokes and they aren't rooted in realism. I don't know a single person who wants corrupt cops murdering people, but I also personally know police officers who are great upstanding people. Am I to put them down because of the bad ones? That feels like how racists act - using the bad actions of few to disparage the whole. Who is carrying the flag and cheering for \"an oppressive\" police force? Are they specifically cheering for oppressive police? Are you to tell me, you don't value police officers in your neighborhood? You don't honestly feel that police have a very necessary role in our country? The situation is far more complex than you seem to think and your comment/mentality is the primary reason I can't take many leftists seriously - it's all identity politics with every shred of nuance stripped away.", "2_Subreddit": "liberalgunowners"}], "dwwzyt9": [{"0_Comment Submission": "Thought you guys might like my AR engraving", "1_Text": "Ah yeah, disregard the police calls that someone was breaking into things, disregard the helicopter footage showing him breaking into things, disregard his other previous convictions for robbery, disregard the multiple times he was told to stop, disregard him running from the police, and disregard him walking at the police officers in the dark with something in his hand before being shot. If you have to close your eyes to 95% of the facts to present your case, you likely don't have a very strong position. I'm in the area, I've watched the footage multiple times, I absolutely don't think he should have been killed for breaking into cars or even running from cops - but to paint the story as you do is just ridiculous.", "2_Subreddit": "liberalgunowners"}], "dwx0ero": [{"0_Comment Submission": "TIL: Part of Obama's 23 point plan to reduce gun violence included incentives for schools to hire more SRC's (School Resource Officers).", "1_Text": "He also wanted to ban a specific bullet that he deemed \"cop killer bullets\", which every statistic out there proved they were used to kill cops nor were they ever used in any crime anyways.", "2_Subreddit": "liberalgunowners"}], "dwx0ig8": [{"0_Comment Submission": "TIL: Part of Obama's 23 point plan to reduce gun violence included incentives for schools to hire more SRC's (School Resource Officers).", "1_Text": "Civilians with CCW are often more trained than police officers though and since they would be at the school anyways it wouldn't cost as much as it would stationing police there. I really don't see how that's not a positive thing, they wouldn't be giving firearms to people who've never handled one.", "2_Subreddit": "liberalgunowners"}], "dwx5k0s": [{"0_Comment Submission": "ICE T On Gun Control", "1_Text": "Mine was poor as fuck and farming to survive in Norway at the time, yet I've literally been called a \"colonizer\" because I'm white lol", "2_Subreddit": "liberalgunowners"}], "dwx6q98": [{"0_Comment Submission": "Ben Shapiro nails it - \"They separate discourse into two categories: the acceptable and the unacceptable\"", "1_Text": "Shaprio is great, the fuck you going on about here?", "2_Subreddit": "JordanPeterson"}], "dwx6vrm": [{"0_Comment Submission": "My red state Democratic senator's wonderfully noncommittal answer to whether he supports the new AWB", "1_Text": "We should ban new social media posts, would totally be constitutional though because you can keep all your old facebook and twitter posts", "2_Subreddit": "liberalgunowners"}], "dwxanj0": [{"0_Comment Submission": "Ben Shapiro nails it - \"They separate discourse into two categories: the acceptable and the unacceptable\"", "1_Text": "Please explain how your rant is in anyway/shape/form about Ben Shapiro and why he's a \"fucking clown\" or a \"fucking retard\"? You sound unhinged.", "2_Subreddit": "JordanPeterson"}], "dwxbgnp": [{"0_Comment Submission": "Ben Shapiro nails it - \"They separate discourse into two categories: the acceptable and the unacceptable\"", "1_Text": "Here, you may need this:\n\nhttp://finder.psychiatry.org/", "2_Subreddit": "JordanPeterson"}], "dwxdmgv": [{"0_Comment Submission": "Running from the cops wcgw.", "1_Text": "> That's a cute strawman you got there\n\nNot in any way/shape/form was my comment a strawman. You specifically said \"what kind of shithole country has cops who'll chase someone down for a joint\", and I asked a direct question based on what you said - how in the fuck is that a strawman? So do you not think police officers should chase people who run from them? \n\n> what kind of shithole country do people feel inclined to run from the cops over a joint because they actually risk possession charges and draconian sentences\n\nPeople run from police for all sorts of reasons in all sorts of countries. You hate cops and America, awesome, but you didn't answer my question. Do you honestly think police officers should let suspects run from them and not chase?  and some bonus questions - Are all laws in every other country completely fair? Do criminals not run from police in other countries? \n\nIt's cute that you like to come on the internet and talk down about an entire country though, really shows your level of maturity and how tough you are.", "2_Subreddit": "Whatcouldgowrong"}], "dwxf18c": [{"0_Comment Submission": "Running from the cops wcgw.", "1_Text": "And yet again, that is not a strawman nor was my original comment a strawman. Still not answering the questions either, so far you've just said \"strawman\" and deflected and now strutting away like you won lol, classic pigeon.", "2_Subreddit": "Whatcouldgowrong"}], "dwxiy9d": [{"0_Comment Submission": "Running from the cops wcgw.", "1_Text": "> Yes, everything you have said has been a strawman\n\nNo, it absolutely has not. Clearly you do not know the definition of this word, since you keep using it incorrectly. \n\n> I mean shit, you accuse me of deflecting while actively changing the topic from 'overzealous enforcement of drug laws in the USA is bizarre for the western world and has a horrible human cost' to some silly non-sense about 'you hate cops and America'\n\nIncorrect, you said \"what kind of shithole country do people feel inclined to run from the cops over a joint because they actually risk possession charges and draconian sentences\" and I asked a specific question regarding what you said - to which you cried \"STRAWMAN\" (again, incorrectly). Also, your source is bullshit - link something official or it aint worth a damn thing.\n\n> So from shitty strawman to a shitty attempt at a 'not as bad as' defense.\n\nAgain, not a strawman. Learn what that word means, you just look like an imbecile continually prattling on about it. I asked questions, questions aren't a \"defense\". I thought your statement was ridiculous, and I still do. You've yet to show why I should take you or your statement seriously.\n\n>  having unjust laws and use that as a defense for your abusive and unjust laws, and the mindbogglingly high incarceration rates that come with them.\n\nI have not said a single thing about the laws or if they are just/unjust, I asked a question - one you have thus far failed to answer. If you want to talk about specific laws we can, but I asked a question based on what you said specifically, nothing more nothing less - the resulting dumbassery is from your side. \n\n> Like I said, up your trolling game or maybe leave these kinds of discussions to adults. If all you can add to a conversation is 'you just hate 'muricuh and cops' your contribution isn't worth the energy you're expending to type it out.\n\nLike I said, I asked a question about your comment and you haven't answered it and are steering this conversation all over the place for reasons I can't figure out. Yup, you hate cops and America - at least be honest about it. You're a sad Canadian who has to run online and trash talk Americans to feel better about yourself (what kind of shithole country.. then I remembered America exists), it's actually quite pathetic - I can't imagine a single reason why a grown adult would choose to do that with their day. So far you're just screaming \"strawman\" over and over (incorrectly) and refusing to actually answer a single question I asked.", "2_Subreddit": "Whatcouldgowrong"}], "dwxjmks": [{"0_Comment Submission": "Running from the cops wcgw.", "1_Text": "So you're not American, but somehow know the \"vigor\" of our enforcement of laws? Also, it's illegal there - so maybe zip your lip when talking about it being illegal elsewhere.", "2_Subreddit": "Whatcouldgowrong"}], "dwxl9m9": [{"0_Comment Submission": "I asked my boss what kind of designation markers she wanted for the two new bathrooms in the office. She ordered these.", "1_Text": "I've been giving my kid centaur hormones for the last 2 years because he feels like he is one and I trust his decision.", "2_Subreddit": "funny"}]}], "1_submissions": [{"67y67e": [{"0_Title": "The Fantastic 'Prison Architect' Has (Finally) Soft-Launched", "1_Text": "> I'm actually doing gun owners a big favor in offering an alternative\n\nHAHAHAHA oh shit, the worst part is you probably actually believe this. No, you aren't doing gun owners a favor, you are continuing the purging of our rights. The only way to save them, is to vote out those who advocate against our rights and to not vote in those who do the same. The red tide is coming, and it's going to be glorious.", "2_Subreddit": "iosgaming"}], "6934zf": [{"0_Title": "[Help Me] Looking to Replace My Lost Fenix E12", "1_Text": "> I'm actually doing gun owners a big favor in offering an alternative\n\nHAHAHAHA oh shit, the worst part is you probably actually believe this. No, you aren't doing gun owners a favor, you are continuing the purging of our rights. The only way to save them, is to vote out those who advocate against our rights and to not vote in those who do the same. The red tide is coming, and it's going to be glorious.", "2_Subreddit": "flashlight"}], "6avgid": [{"0_Title": "Picked up a new EDC blade off r/knife_swap", "1_Text": "> I'm actually doing gun owners a big favor in offering an alternative\n\nHAHAHAHA oh shit, the worst part is you probably actually believe this. No, you aren't doing gun owners a favor, you are continuing the purging of our rights. The only way to save them, is to vote out those who advocate against our rights and to not vote in those who do the same. The red tide is coming, and it's going to be glorious.", "2_Subreddit": "EDC"}], "6h8589": [{"0_Title": "They Should Make A Star Wars Themed Cooking Competition.", "1_Text": "> I'm actually doing gun owners a big favor in offering an alternative\n\nHAHAHAHA oh shit, the worst part is you probably actually believe this. No, you aren't doing gun owners a favor, you are continuing the purging of our rights. The only way to save them, is to vote out those who advocate against our rights and to not vote in those who do the same. The red tide is coming, and it's going to be glorious.", "2_Subreddit": "Jokes"}], "6h87k9": [{"0_Title": "Take Tolerance Breaks From Drinking Water", "1_Text": "> I'm actually doing gun owners a big favor in offering an alternative\n\nHAHAHAHA oh shit, the worst part is you probably actually believe this. No, you aren't doing gun owners a favor, you are continuing the purging of our rights. The only way to save them, is to vote out those who advocate against our rights and to not vote in those who do the same. The red tide is coming, and it's going to be glorious.", "2_Subreddit": "ShittyLifeProTips"}], "6ieg0g": [{"0_Title": "Why Do People Delete Their Accounts After Making The Front Page?", "1_Text": "> I'm actually doing gun owners a big favor in offering an alternative\n\nHAHAHAHA oh shit, the worst part is you probably actually believe this. No, you aren't doing gun owners a favor, you are continuing the purging of our rights. The only way to save them, is to vote out those who advocate against our rights and to not vote in those who do the same. The red tide is coming, and it's going to be glorious.", "2_Subreddit": "AskReddit"}], "6l1gym": [{"0_Title": "I have a bruise in the shape of the Batman Symbol", "1_Text": "> I'm actually doing gun owners a big favor in offering an alternative\n\nHAHAHAHA oh shit, the worst part is you probably actually believe this. No, you aren't doing gun owners a favor, you are continuing the purging of our rights. The only way to save them, is to vote out those who advocate against our rights and to not vote in those who do the same. The red tide is coming, and it's going to be glorious.", "2_Subreddit": "Jokes"}], "6o2brw": [{"0_Title": "Doomsday/End of the World type books that revolve around the Technological Singularity?", "1_Text": "> I'm actually doing gun owners a big favor in offering an alternative\n\nHAHAHAHA oh shit, the worst part is you probably actually believe this. No, you aren't doing gun owners a favor, you are continuing the purging of our rights. The only way to save them, is to vote out those who advocate against our rights and to not vote in those who do the same. The red tide is coming, and it's going to be glorious.", "2_Subreddit": "printSF"}], "6svw01": [{"0_Title": "Reddit is just a word hosting site for Imgur", "1_Text": "> I'm actually doing gun owners a big favor in offering an alternative\n\nHAHAHAHA oh shit, the worst part is you probably actually believe this. No, you aren't doing gun owners a favor, you are continuing the purging of our rights. The only way to save them, is to vote out those who advocate against our rights and to not vote in those who do the same. The red tide is coming, and it's going to be glorious.", "2_Subreddit": "Showerthoughts"}], "6swy9r": [{"0_Title": "What do you call a group of homosexuals?", "1_Text": "> I'm actually doing gun owners a big favor in offering an alternative\n\nHAHAHAHA oh shit, the worst part is you probably actually believe this. No, you aren't doing gun owners a favor, you are continuing the purging of our rights. The only way to save them, is to vote out those who advocate against our rights and to not vote in those who do the same. The red tide is coming, and it's going to be glorious.", "2_Subreddit": "funny"}], "6sx0l3": [{"0_Title": "Need Help Finding a Song", "1_Text": "> I'm actually doing gun owners a big favor in offering an alternative\n\nHAHAHAHA oh shit, the worst part is you probably actually believe this. No, you aren't doing gun owners a favor, you are continuing the purging of our rights. The only way to save them, is to vote out those who advocate against our rights and to not vote in those who do the same. The red tide is coming, and it's going to be glorious.", "2_Subreddit": "HelpMeFind"}], "6x111l": [{"0_Title": "Darkest Dungeon - It's not a brand new release, but more people should play this amazing game!", "1_Text": "> I'm actually doing gun owners a big favor in offering an alternative\n\nHAHAHAHA oh shit, the worst part is you probably actually believe this. No, you aren't doing gun owners a favor, you are continuing the purging of our rights. The only way to save them, is to vote out those who advocate against our rights and to not vote in those who do the same. The red tide is coming, and it's going to be glorious.", "2_Subreddit": "iosgaming"}], "6x1wk3": [{"0_Title": "Spam", "1_Text": "> I'm actually doing gun owners a big favor in offering an alternative\n\nHAHAHAHA oh shit, the worst part is you probably actually believe this. No, you aren't doing gun owners a favor, you are continuing the purging of our rights. The only way to save them, is to vote out those who advocate against our rights and to not vote in those who do the same. The red tide is coming, and it's going to be glorious.", "2_Subreddit": "cannedmeatproducts"}], "766yh3": [{"0_Title": "What did the Terminator chicken say when it crossed the road?", "1_Text": "> I'm actually doing gun owners a big favor in offering an alternative\n\nHAHAHAHA oh shit, the worst part is you probably actually believe this. No, you aren't doing gun owners a favor, you are continuing the purging of our rights. The only way to save them, is to vote out those who advocate against our rights and to not vote in those who do the same. The red tide is coming, and it's going to be glorious.", "2_Subreddit": "Jokes"}], "79wg5l": [{"0_Title": "What was in the last package you got delivered?", "1_Text": "> I'm actually doing gun owners a big favor in offering an alternative\n\nHAHAHAHA oh shit, the worst part is you probably actually believe this. No, you aren't doing gun owners a favor, you are continuing the purging of our rights. The only way to save them, is to vote out those who advocate against our rights and to not vote in those who do the same. The red tide is coming, and it's going to be glorious.", "2_Subreddit": "AskReddit"}], "7es0mr": [{"0_Title": "Looking for a sci-fi book about eugenics/selective breeding set in the future", "1_Text": "> I'm actually doing gun owners a big favor in offering an alternative\n\nHAHAHAHA oh shit, the worst part is you probably actually believe this. No, you aren't doing gun owners a favor, you are continuing the purging of our rights. The only way to save them, is to vote out those who advocate against our rights and to not vote in those who do the same. The red tide is coming, and it's going to be glorious.", "2_Subreddit": "booksuggestions"}], "7p2g4d": [{"0_Title": "Cash Cards", "1_Text": "> I'm actually doing gun owners a big favor in offering an alternative\n\nHAHAHAHA oh shit, the worst part is you probably actually believe this. No, you aren't doing gun owners a favor, you are continuing the purging of our rights. The only way to save them, is to vote out those who advocate against our rights and to not vote in those who do the same. The red tide is coming, and it's going to be glorious.", "2_Subreddit": "cataclysmdda"}], "7ph847": [{"0_Title": "A roguelike within a roguelike?", "1_Text": "> I'm actually doing gun owners a big favor in offering an alternative\n\nHAHAHAHA oh shit, the worst part is you probably actually believe this. No, you aren't doing gun owners a favor, you are continuing the purging of our rights. The only way to save them, is to vote out those who advocate against our rights and to not vote in those who do the same. The red tide is coming, and it's going to be glorious.", "2_Subreddit": "cataclysmdda"}], "7xk7us": [{"0_Title": "How to make Fallout 4 more like Cataclysm?", "1_Text": "> I'm actually doing gun owners a big favor in offering an alternative\n\nHAHAHAHA oh shit, the worst part is you probably actually believe this. No, you aren't doing gun owners a favor, you are continuing the purging of our rights. The only way to save them, is to vote out those who advocate against our rights and to not vote in those who do the same. The red tide is coming, and it's going to be glorious.", "2_Subreddit": "cataclysmdda"}], "82rhic": [{"0_Title": "I'm going to make an all male massage parlor.", "1_Text": "> I'm actually doing gun owners a big favor in offering an alternative\n\nHAHAHAHA oh shit, the worst part is you probably actually believe this. No, you aren't doing gun owners a favor, you are continuing the purging of our rights. The only way to save them, is to vote out those who advocate against our rights and to not vote in those who do the same. The red tide is coming, and it's going to be glorious.", "2_Subreddit": "Jokes"}], "83aaf9": [{"0_Title": "Office workers who switched to manual labor jobs, how was the transition?", "1_Text": "> I'm actually doing gun owners a big favor in offering an alternative\n\nHAHAHAHA oh shit, the worst part is you probably actually believe this. No, you aren't doing gun owners a favor, you are continuing the purging of our rights. The only way to save them, is to vote out those who advocate against our rights and to not vote in those who do the same. The red tide is coming, and it's going to be glorious.", "2_Subreddit": "AskReddit"}], "83xdl6": [{"0_Title": "I don't think people should be able to buy more than 1 house.", "1_Text": "> I'm actually doing gun owners a big favor in offering an alternative\n\nHAHAHAHA oh shit, the worst part is you probably actually believe this. No, you aren't doing gun owners a favor, you are continuing the purging of our rights. The only way to save them, is to vote out those who advocate against our rights and to not vote in those who do the same. The red tide is coming, and it's going to be glorious.", "2_Subreddit": "unpopularopinion"}], "847795": [{"0_Title": "Most recent Mario Kart available?", "1_Text": "> I'm actually doing gun owners a big favor in offering an alternative\n\nHAHAHAHA oh shit, the worst part is you probably actually believe this. No, you aren't doing gun owners a favor, you are continuing the purging of our rights. The only way to save them, is to vote out those who advocate against our rights and to not vote in those who do the same. The red tide is coming, and it's going to be glorious.", "2_Subreddit": "EmulationOnAndroid"}], "8835eg": [{"0_Title": "Can I still buy an AR?", "1_Text": "> I'm actually doing gun owners a big favor in offering an alternative\n\nHAHAHAHA oh shit, the worst part is you probably actually believe this. No, you aren't doing gun owners a favor, you are continuing the purging of our rights. The only way to save them, is to vote out those who advocate against our rights and to not vote in those who do the same. The red tide is coming, and it's going to be glorious.", "2_Subreddit": "CAguns"}], "8a4aiq": [{"0_Title": "Is there a list of all of JP's full talks and interviews?", "1_Text": "> I'm actually doing gun owners a big favor in offering an alternative\n\nHAHAHAHA oh shit, the worst part is you probably actually believe this. No, you aren't doing gun owners a favor, you are continuing the purging of our rights. The only way to save them, is to vote out those who advocate against our rights and to not vote in those who do the same. The red tide is coming, and it's going to be glorious.", "2_Subreddit": "JordanPeterson"}]}]}]}