{"EndlessHungerRVA": [{"0_comments": [{"dvo2t2v": [{"0_Comment Submission": "[NM] FF Falcon #0100 - 20/$6", "1_Text": "Congratulations, u/Radiolotek !!! Thanks everybody for playing, that was a blast! \nPM me your mailing address, and I'll post it Priority, tomorrow, and send you the tracking info ASAP.", "2_Subreddit": "KnifeRaffle"}], "dvo2ttu": [{"0_Comment Submission": "[NM] FF Falcon #0100 - 20/$6", "1_Text": "thanks, for real", "2_Subreddit": "KnifeRaffle"}], "dvo2yql": [{"0_Comment Submission": "[NM] FF Falcon #0100 - 20/$6", "1_Text": "Haha, that’s how I felt when I won! Glad I could pass it on.", "2_Subreddit": "KnifeRaffle"}], "dvo669v": [{"0_Comment Submission": "[NM] FF Falcon #0100 - 20/$6", "1_Text": "Coming up, sorry", "2_Subreddit": "KnifeRaffle"}], "dvo79cw": [{"0_Comment Submission": "[NM] FF Falcon #0100 - 20/$6", "1_Text": "r/timemachineraffle", "2_Subreddit": "KnifeRaffle"}], "dvql2aa": [{"0_Comment Submission": "sub question", "1_Text": "Preface: people are different, reactions are different, etc.\n\nI take 16 every day and I’ve been on it for less than a year. I went 5.5 or 6 days without and experienced minimal side effects - a few sweaty episodes, had that feverish feeling for a few minutes. I was apprehensive, and every day I thought I’d wake up and start feeling like hell. Nope. Nothing else, didn’t even speed up my GI system, which would have been nice.\n\nGood luck, hope it works out as well for you.", "2_Subreddit": "opiates"}], "dvrabxj": [{"0_Comment Submission": "sub question", "1_Text": "Not a bad idea to get some kratom, just in case. Head shops are a rip-off, search online, search Reddit for more info. Still, I’d bet you’re probably going to be ok, and not yet in the heavy stages of withdrawal. If you are experiencing withdrawal, yes, kratom can alleviate symptoms and is definitely worth trying.", "2_Subreddit": "opiates"}], "dvrwo7u": [{"0_Comment Submission": "Olight S30R III Baton Giveaway!!", "1_Text": "Awesome, I would love to own an Olight!!", "2_Subreddit": "flashlight"}], "dvul48r": [{"0_Comment Submission": "NA meeting?", "1_Text": "Also consider SMART recovery. I just looked up Denver and found a few in your area. They don’t have many meetings, so you won’t be able to find one at almost any time like you can with AA/NA, but there’s no god involved. The focus is a cognitive behavioral therapeutic approach.\n\nhttps://www.smartrecovery.org/local/meetings/?search_keywords=&search_location=Denver%2C+CO%2C+USA&search_categories%5B%5D=&use_search_radius=on&search_radius=50&search_lat=39.7392358&search_lng=-104.990251&search_region=&search_context=92", "2_Subreddit": "OpiatesRecovery"}], "dw2pmnh": [{"0_Comment Submission": "New addition to site-wide rules regarding the use of Reddit to conduct transactions", "1_Text": "If you eat food at a restaurant, you’re using about the same level of trust. It’s not like the e-juice you buy in a store is the product of a super-regulated industry, either.", "2_Subreddit": "announcements"}], "dw2zbjb": [{"0_Comment Submission": "Witless Wednesday - Your weekly silly questions thread", "1_Text": "I thought potassium was 4700mg? I’ve also heard that regular salt/sodium chloride helps your body maintain its potassium, which is the reason you Do NOT need the full 4700 each day, lending credibility to the 2000 (or other amount under 4700). Any info you can offer is appreciated. Thanks.", "2_Subreddit": "fasting"}], "dw49cxs": [{"0_Comment Submission": "[NM] Exclusive Urban Trapper VG-10 (Bronze Ano) - 20/$4", "1_Text": "Two randoms please\n\nEdit: ranDoms", "2_Subreddit": "KnifeRaffle"}], "dw4quim": [{"0_Comment Submission": "Increased heart rate after snorting H", "1_Text": "Of course I’m not telling you to stop being cautious about any of it, but it could totally be the weed.", "2_Subreddit": "opiates"}], "dw746ej": [{"0_Comment Submission": "sub question", "1_Text": "How did it go? You get by ok?", "2_Subreddit": "opiates"}], "dw7u4a1": [{"0_Comment Submission": "Cliff bars!! .25c a box for 12/pk and .50c a box for a 6 pack!", "1_Text": "$.25\n\nThe dollar sign goes in front, Mr. Correction.", "2_Subreddit": "Frugal"}], "dw92npf": [{"0_Comment Submission": "Cliff bars!! .25c a box for 12/pk and .50c a box for a 6 pack!", "1_Text": "What does that have to do with it? Is there a dollar sign in the original post? The cent sign conventionally comes after the number, and the dollar sign before the number.", "2_Subreddit": "Frugal"}], "dw9uomq": [{"0_Comment Submission": "sub question", "1_Text": "Glad to hear it! Also, good for you to know for future reference.", "2_Subreddit": "opiates"}], "dwcej72": [{"0_Comment Submission": "Help with making KetoChow enjoyable", "1_Text": "No", "2_Subreddit": "ketochow"}], "dwlyn4d": [{"0_Comment Submission": "Do you have to piss dirty for opiates to get a sub script?", "1_Text": "It depends on the place. I’ve heard reports both ways. I don’t think I tested positive when induction started, but I would’ve had subs in my system - last time I used heroin was on a Friday, my sub induction was on a Tuesday. I took (illegal/street) subs on Sunday and Monday. However, the week before when I went in for intake/interview, I think they tested me that day, too, and I would’ve tested positive for heroin.", "2_Subreddit": "opiates"}], "dwlzber": [{"0_Comment Submission": "[NM] Boker Plus Panchenko Lancer in S35VN 8 @ $10", "1_Text": "One random please", "2_Subreddit": "KnifeRaffle"}], "dwm97ru": [{"0_Comment Submission": "Depressed after 1 year 3 months", "1_Text": "Sorry I can’t give you any insight,  but I can commiserate. I’m just over seven months clean after 3 years of heroin. The energizing pink cloud of Fresh Sobriety is gone. Apathy and boredom are my closest partners. I limp in their shadow, beating myself up for being apathetic and bored. I’m on subs, and I thought they would always keep the craving at bay. It pushes it down, but knowing what I’m missing can really be a motherfucker. Luckily, having suboxone in my system reminds me that even if I got something I wouldn’t be able to get high for days, so at least it’s a crutch. Sure, I have dreams and wants to be more productive, pursue those dreams and reap the enjoyment and benefits down the road, but motivation is lacking. Heroin would deal with all of those problems, even though it would come at a high price. I know having the desire means I’m supposed to turn harder into my sobriety and go to more meetings and follow the program but some days I just want to get high and feel untouchable. \n\nAll that said: Great fucking job on being clean for 1 year and 3 months! You’ve accomplished something that most people will never understand, and while you don’t get an award for not being a junkie (At least, I don’t think so, but I didn’t watch the Oscars this year, so maybe they’ve added it as a category. Probably, it would be one of those off-screen ones awarded earlier in the day, but still...), you can always remind yourself that you’re capable of more than you think.", "2_Subreddit": "OpiatesRecovery"}], "dwot1t4": [{"0_Comment Submission": "Found this in my children (17 yo) room.. help identify", "1_Text": "I’d guess MDMA (or at least something sold as MDMA).", "2_Subreddit": "opiates"}], "dwtrbc3": [{"0_Comment Submission": "Pin point pupils", "1_Text": "Opcon-A eye drops or any generic/other brand equivalent will increase the size of your pupils. These are over-the-counter eye drops available at every pharmacy. You MUST use eye drops that contain naphazoline, this is the magic ingredient, which is why I recommend Opcon-A or similar. Do NOT overdo it. Overuse will cause dryness and possibly other problems. Try two or three drops in each eye, wait fifteen minutes to see if they have dilated enough, use another drop if necessary, repeat. \n\nI’m clean now but I used to do this when I used heroin, for work if I had a meeting or special occasions when I couldn’t be sus. I have blue eyes. This really works.", "2_Subreddit": "opiates"}], "dwu5hux": [{"0_Comment Submission": "Question about mixing with oil.", "1_Text": "How much oil did you use? You prob already have enough info/answers here, but you could also try olive oil - one that isn’t extra virgin because extra virgin has flavor.  Some are specifically marked “light flavor”. \n\nI’m another person who uses avocado oil, Chosen Foods brand, and find it pleasantly tasteless. Considering this, maybe it’s possible that even with “non-flavored” olive oil you’ll still taste something that I can’t, but at least you can try a small bottle cheaply (in the states, you can buy a small bottle store brand olive oil for <$2, hopefully situation is similar in Canada).\n\nWhatever you try/discover, please report back. Good luck!", "2_Subreddit": "ketochow"}], "dwu7imt": [{"0_Comment Submission": "[WTS] DIY Soylent ingredients(Bret's Oat & Rice); Twin Cities, MN; $175, 130+ days amount left", "1_Text": "If you’re interested in selling/shipping without the flour and oil please let me know. \n\nI understand if this sounds like a ridiculous request, since I’m asking you to keep and discount the bulkiest parts - \nI’m looking to DIY a low carb variant and it looks like I could add acacia fiber to sub the fiber from the oats, and I currently use avocado oil.", "2_Subreddit": "SoylentMarket"}]}], "1_submissions": [{"849zrm": [{"0_Title": "Knife test 2", "1_Text": "Congratulations, u/Radiolotek !!! Thanks everybody for playing, that was a blast! \nPM me your mailing address, and I'll post it Priority, tomorrow, and send you the tracking info ASAP.", "2_Subreddit": "testingground4bots"}], "84abnn": [{"0_Title": "[NM] FF Falcon #0100 - 20/$6", "1_Text": "Congratulations, u/Radiolotek !!! Thanks everybody for playing, that was a blast! \nPM me your mailing address, and I'll post it Priority, tomorrow, and send you the tracking info ASAP.", "2_Subreddit": "KnifeRaffle"}]}]}]}