{"AquaboogyAssault": [{"0_comments": [{"dwduta7": [{"0_Comment Submission": "Relevant", "1_Text": "We tried the whole “catholic priests fucking kids” thing over here for a LONG time and it didn’t touch the obesity epedimic amongst American youth.  That’s exactly the reason Trump is calling for more guns in schools - fear burns calories.  \n\nThese kids are just sitting around for hours a day.  That can’t be good for America’s fat kids problem.  Trumps approach is “put more guns in schools and increase the scheduled school shootings”.  That way our children’s fight or flight system is always in place, shooting constant adrenaline through the bloodstream and burning calories while our kids would otherwise be sitting around in a classroom”  It’s genius in its simplicity - I for one am excited to see the conclusions once all the data comes in.", "2_Subreddit": "ImGoingToHellForThis"}], "dwduzgy": [{"0_Comment Submission": "Relevant", "1_Text": "Why didn’t you just bring your own gun to school?  The only thing that can stop a bad loser with a gun is an even bigger loser with a gun", "2_Subreddit": "ImGoingToHellForThis"}], "dwdv9p1": [{"0_Comment Submission": "Relevant", "1_Text": "Oh no I can't argue with that... it's hard to call somebody a faggot when the priest is banging your sweet choirboy bottom on the reg after mass like clockwork.  I've never heard such a passionate argument in favor of pedophilia before - Kudos to you I guess.\n\nI was talking about Trump's bold initiative to increase gun violence in schools as a tool to combat the obesity crises.  Get those kids blood pumping and keep their pulse up while they would otherwise be sitting listening to Ms. Gershwin try to hold it together and teach the quadratic equation three days after her second divorce finalized.", "2_Subreddit": "ImGoingToHellForThis"}], "dwe1dqx": [{"0_Comment Submission": "Relevant", "1_Text": "Seems to me that a kid like that would have killed himself if pushed to a limit.  If that was the case he wouldn't have been able to kill other people.  So it could be argued he wasn't bullied ENOUGH.\n\n\nI get it, but IGTHFT isn't the place for a conversation about actually preventing tragedy.  Save that logic and compassion for a thread that gives a shit.", "2_Subreddit": "ImGoingToHellForThis"}], "dwf1c76": [{"0_Comment Submission": "Relevant", "1_Text": "If that’s the case you have now blamed the actions of 5 year olds for the mass shooting deaths", "2_Subreddit": "ImGoingToHellForThis"}], "dwf56hw": [{"0_Comment Submission": "Relevant", "1_Text": "As a father and a human being I whole heartedly agree with you.  As a poster on /iagthft/ I believe you are a faggot who should suck a dick.", "2_Subreddit": "ImGoingToHellForThis"}], "dwi6jcp": [{"0_Comment Submission": "U.S. Special Counsel probing Russia contacts at Republican convention: sources", "1_Text": "Damage control, watch Fox, pick fights over twitter, complain about and deal with lawsuits... I mean he did say his VP would be in charge of foreign and domestic policy, so I guess he’s being true to his word.", "2_Subreddit": "politics"}], "dwjaffi": [{"0_Comment Submission": "Stormy Daniels' lawyer: Case against Donald Trump 'grows stronger' due to 'buffoonery' of president's defenders", "1_Text": "\"Buddy of mine went to law school.  They taught this on the first day.  He quit right afterward because he learned all he needed to know.  He now works for the president of the united states of america.\" - Some drunk guy at a bar somewhere talking to strangers who don't believe him even though he is telling the truth.", "2_Subreddit": "politics"}], "dwjldad": [{"0_Comment Submission": "Take the day of(f) work and cum in me.", "1_Text": "Don't need the day, I'll be in and out in five minutes with time enough to make it to work after quick shower.  Please get back to work as soon as you clean yourself up.  My wife is going to the grocery store after she drops the kids off from school, but she'll still be home after an hour or so.  Don't ruin our happy marriage.  Sorry, I don't pay you for anything other than an quick nut off while you are cleaning the house and I don't have time to tend to another needy female.  I am and adult with responsibilities.  Don't forget my daughter tracked mud into her room after soccer practice yesterday and it's sort of caked on - so make sure to get that spot a little extra well.", "2_Subreddit": "gonewild"}], "dwjm459": [{"0_Comment Submission": "Take the day of(f) work and cum in me.", "1_Text": "In fact you know what, this is just too awkward now.  I'm afraid I'm going to have to let you go.  I'll probably just tell my wife I caught you going through her jewelry - that way if you expose me for cheating on her it'll look like you are trying to get back at me.", "2_Subreddit": "gonewild"}], "dwjy9ok": [{"0_Comment Submission": "Good morning, gonewild! ❤😘[f]", "1_Text": "Improper coverage of private parts in an area of food preperation is definitely a health code violation.  Please get out of the kitchen immediately and put your clothes back on, then use 1 cap full of bleach in a small bucket of hot water to disinfect any contaminated areas that you might have come into contact with to prevent bacterial outbreaks.  There is nothing sexier than following proper food preparation guidelines!", "2_Subreddit": "gonewild"}], "dwl12oh": [{"0_Comment Submission": "Good morning, gonewild! ❤😘[f]", "1_Text": "After a long meeting with HR I am tasked with the unfortunate responsibility of informing you that your talents will no longer be needed at our restaurant despite your excellent credentials and contagiously enthusiastic work demeanor.  The third health code violation for nudity in the kitchen shows a clear pattern of disregard for authority and unwillingness to comply with food preparation safety regulations.  Protocol is in place to maintain the safety of every patron we serve and we take our customers health very seriously, starting with where we source our produce, down to the cleanliness of our kitchen, and culminating with a meticulously cleaned spotless dining room. \n  We here at Random Restaurant are deeply saddened that your employment with us did not work out and wish you luck in the future. \n\nRespectfully,\n\nAquaboogyAssault", "2_Subreddit": "gonewild"}], "dwlc0ay": [{"0_Comment Submission": "The office accountant went naughty [F 33]", "1_Text": "Our terms of employment clearly state that any morally questionable activity taken on company property will be grounds for immediate termination.  You signed a form stating that you had read your employment contract fully before you started work here, an employment contract that included this information, and yet you have used company property as a studio while on the clock to produce nude photos with intent of distribution.  This is a clear violation of company policy and your terms of employment.  We are letting you go SlothGoneWild.  Please have your desk cleared out by the end of the day and return any company property you may have there.  Thank you for your compliance.", "2_Subreddit": "gonewild"}], "dwn7sc3": [{"0_Comment Submission": "Guy murdered a 4 year old kid, getting manhandled by police as judge speaks to him", "1_Text": "Getting joy out of somebody elses pain, no matter how terrible the person, is still getting joy from another persons pain.", "2_Subreddit": "PublicFreakout"}], "dwnkkbg": [{"0_Comment Submission": "kinda reminding me of incel logic here", "1_Text": "You should know that English is widely used as a universal language on the Indian subcontinent and is one of the most widely spoken languages, so a website would reach many more Indians publishing in English rather than regional languages...", "2_Subreddit": "IncelTears"}], "dwoehka": [{"0_Comment Submission": "Need someone to talked to about my STBXW and her emotional abuse when we argue and her dual personalities.", "1_Text": "It's a hugely emotional situation.  I remember quite clearly going through the  \"I love her, I hate her, I love her, I hate her\" phase myself.  It's normal, even if it seems insane from the outside looking in.  \n\nEmotional situations make people act irrationally.  My ex-wife would scream at me about how much she hated me, how I was the biggest mistake she'd ever made, etc., then later that day come over and \"want to fix everything\", tell me how much she loved me, how sorry she was for everything...\n\nIt's hard to deal with when you are inside of it even if it is normal.  It really is insane, but it is also completely normal.  Keep in mind, she is also going through the biggest break up of her life... don't expect rationality.  Expect an adult version of a crying teenage girl.", "2_Subreddit": "Divorce"}], "dwostgv": [{"0_Comment Submission": "Next Day Discussion - The Walking Dead S08E14 - Still Gotta Mean Something", "1_Text": "but not necessarily getting people who would act as research subjects, they might be the remnants of the gov't and still follow \"ethical standards\" where they can't infect somebody themselves, but need to have been recently bitten to study or test vaccines, act a various type of research subjects... kind of like CIA can't torture, but they can hogtie your ass, fly you to our buddies in jordan who don't have such rules and watch as the jordanians do their thing, even advising them... but its against the rules for them to get their hands dirty.  I can imagine a sort of ridiculous situation where pockets of US government agencies exist and cling to regulation and pre-breakdown structure as a way to maintain a sense of order (almost like in beth's hospital sidequest) so they work out a deal with a third-party group where they will deliver freshly bitten people, no questions asked, in return for... camera film and film developing chemicals? more garbage? I dunno, I'm reaching here.", "2_Subreddit": "thewalkingdead"}], "dwoted3": [{"0_Comment Submission": "Next Day Discussion - The Walking Dead S08E14 - Still Gotta Mean Something", "1_Text": "Art supplies is clearly code for drugs.  The photographs are the key.  Acetic Anhydride is a key component in the creation of film.  It is also a DEA regulated substance because it is also a key component in the conversion of opium latex into heroin.  The dump was obviously a secret CIA drug production lab used prior to the outbreak to supply the east coast with high quality heroin in order to obtain a discrete source of income for black operations.  Langley, Virginia - where the CIA is located has to be close to where they are in northern Virginia.  Jadis needing her fix explains why she is never far from the site, why she is so emotional about missing her pick-up, and why she has access to film.  It checks out.", "2_Subreddit": "thewalkingdead"}], "dwoy35i": [{"0_Comment Submission": "Next Day Discussion - The Walking Dead S08E14 - Still Gotta Mean Something", "1_Text": "How else would they not have succumbed to infection yet?  I wouldn't be surprised if Rick has a breakthrough, becomes detective Rick, and figures out that the secret reptilian drug lab underneath the CIA garbage dumb was responsible for the zombie epidemic.  He saves the day, shows over.", "2_Subreddit": "thewalkingdead"}], "dwr0zix": [{"0_Comment Submission": "Next Day Discussion - The Walking Dead S08E14 - Still Gotta Mean Something", "1_Text": "LIKE A FOX", "2_Subreddit": "thewalkingdead"}], "dwwr6b9": [{"0_Comment Submission": "Anyone ever think about going on a drug holiday in SE Asia?", "1_Text": "duuude.  Mexico is a waaaay easier/cheaper/more available/closer... go to a fucking border town (one of those that has an american city on one side of a fence and a mexican city on the other, sit in a bar outside, and within an hour an guarantee you'll have dudes fighting eachother trying to get your attention like your walking down parts of philly.  These are guys who are trying to sell dope to americans anyway, but you are saving them the trouble of getting it across the fucking border.", "2_Subreddit": "opiates"}], "dwwwejq": [{"0_Comment Submission": "Anyone ever think about going on a drug holiday in SE Asia?", "1_Text": "I was talking about going specifically for a \"drug holiday\" and not going to stay or smuggling dope across the border personally.  \n\nI've never been or known anybody personally who's gone to SEA (and would have been interesting in checking out that side of it) \n so i can't speak on it, but it seem's like you know your stuff.  Just throwing out an easy, simple alternative :). \n\n\nAnd about not trusting dope from down there, and the fent analogues aside (which you make a decent point about), any cutting is done on THIS side of the border so you'd be getting good product down there.  It doesn't make any sense to cut thing to make it 10 times bigger then ship it, you ship it pure as possible then cut it once it past security checkpoints.\n\nBut yeah, seems like you already have your mind made up.  Not arguing here, you know a lot more about SEA than I do, but I know a lot of people who have had excellent, cheap, \"holy shit i've been doing dope for 20 years, but i've been nodding out while trying to piss for the past 3 hours\" dope from down there, dirt cheap hotels (if you don't mind getting what you pay for - a place to do drugs that has a bed and a bathroom), and ease of getting back home once your money runs out.\n\n\nEdit: All that aside, i have a family member who lives part of the year and does work in Northern Thailand.  We have never talked about drugs (she isn't the type) but I am jealous nearly everytime I see her post new pictures or hear her talk about it just to the sheer alien-ness of the culture, beauty of the surroundings, and hilarious stories.  I'd love to go sometime, dope or no dope.", "2_Subreddit": "opiates"}], "dwx3zc9": [{"0_Comment Submission": "Anyone ever think about going on a drug holiday in SE Asia?", "1_Text": "Oh no worries bubba, i gotcha.  Turns out are talking about two separate things.  Your points are valid, just throwing in my two cents here man on another cheap, more realistic for most peoples idea of a dope vacation (a week or so of easy to access drugs at an affordable price, narcos aint going after you unless you get trafficking amounts which I am not talking about here) rather than an extended stay.  We're all fam here, no worries.  I've been dope free for over 3 years now, but if I had a choice of \"dope vacation\" spots I would definitely choose SEA, but the access to dope is on the bottom of reasons why.", "2_Subreddit": "opiates"}], "dwxn8zg": [{"0_Comment Submission": "(Spoilers Extended) When do you guys think The Winds of Winter will come out?", "1_Text": "In my wildest fantasies TWOW is released simultaneously with ADOS. \n The reason it has taken so long isn't because TWOW took forever to wrap up, but was that he didn't want to finish TWOW and immediately want to start the cycle of \"TWOW was good, can't for ADOS, when is it coming out?\" immediately after publication.  He had half of TWOW finished when ADWD came out - finished it relatively quickly, got stuck in some rewrites after the TV show stole his plotlines and everybody complained about how cornball it was, then moved right on to ADOS a couple of years ago.  He did say that he expected to wrap up the books before the TV show finishes.\n\nThe forward in the two-pack hardcover collectors series says \"Suck it bitches, the ultimate twist.  Haters got played.  Never ask me for shit again.  Gurm out.\"\n\n\n\nOf course realistically he's been swamped with projects, burnt out on this westeros story, and barely slogging through his daily word count goals just so he can tell his publisher he's making progress.", "2_Subreddit": "asoiaf"}], "dwxukbk": [{"0_Comment Submission": "Ugh, another dboy got raided...", "1_Text": "Sucks when you find somebody reliable, and you stick with them, don't run up a $500 tab and ghost because you like this guy, and then he gets busted on some dumb shit and doesn't even have a cousin who will start using his phone number afterwards.  \n\nSeriously though, sucks man.  Glad you weren't in the spot when it got raided, 30 minutes one way or another and you might have had the joy of WD in jail.\n\nI've been clean for 3 years so I had forgotten the feeling, but my reliable as fuck will meet you 5 minutes from your house weed guy has disappeared and I fear the worst.  A WEED GUY.  I thought I was done dealing with this shit.  Luckily one benefit of using dope for over a decade is that finding a new dealer is relatively easy since being constantly on the looking for dealers hones your sketchdar, and finding a weed guy is usually as easy as going to the nearest gas station, loudly joke \"not unless you got a dub I can grab with this\" when they ask if there's anything else they can do for you, and then smoke a cigarette outside until else in line who heard you comes out and says whats up... but it's the goddamn point of the thing.  I work hard.  Stop making it inconvenient for me once every few months to smoke weed.  At this point it's literally like they are just going through the motions until its legalized anything... but I digress...\n\n\nSucks, glad your safe.  You'll find a sweet new regular hook up in no time my dude.", "2_Subreddit": "opiates"}]}], "1_submissions": [{"19q8kq": [{"0_Title": "Karl Radek belongs here.", "1_Text": "We tried the whole “catholic priests fucking kids” thing over here for a LONG time and it didn’t touch the obesity epedimic amongst American youth.  That’s exactly the reason Trump is calling for more guns in schools - fear burns calories.  \n\nThese kids are just sitting around for hours a day.  That can’t be good for America’s fat kids problem.  Trumps approach is “put more guns in schools and increase the scheduled school shootings”.  That way our children’s fight or flight system is always in place, shooting constant adrenaline through the bloodstream and burning calories while our kids would otherwise be sitting around in a classroom”  It’s genius in its simplicity - I for one am excited to see the conclusions once all the data comes in.", "2_Subreddit": "OldSchoolCool"}], "3g9rum": [{"0_Title": "Breaking through methadone with dilauidid", "1_Text": "We tried the whole “catholic priests fucking kids” thing over here for a LONG time and it didn’t touch the obesity epedimic amongst American youth.  That’s exactly the reason Trump is calling for more guns in schools - fear burns calories.  \n\nThese kids are just sitting around for hours a day.  That can’t be good for America’s fat kids problem.  Trumps approach is “put more guns in schools and increase the scheduled school shootings”.  That way our children’s fight or flight system is always in place, shooting constant adrenaline through the bloodstream and burning calories while our kids would otherwise be sitting around in a classroom”  It’s genius in its simplicity - I for one am excited to see the conclusions once all the data comes in.", "2_Subreddit": "opiates"}], "3htj70": [{"0_Title": "Recipe for relapse", "1_Text": "We tried the whole “catholic priests fucking kids” thing over here for a LONG time and it didn’t touch the obesity epedimic amongst American youth.  That’s exactly the reason Trump is calling for more guns in schools - fear burns calories.  \n\nThese kids are just sitting around for hours a day.  That can’t be good for America’s fat kids problem.  Trumps approach is “put more guns in schools and increase the scheduled school shootings”.  That way our children’s fight or flight system is always in place, shooting constant adrenaline through the bloodstream and burning calories while our kids would otherwise be sitting around in a classroom”  It’s genius in its simplicity - I for one am excited to see the conclusions once all the data comes in.", "2_Subreddit": "opiates"}], "3kag9j": [{"0_Title": "Pledge Manuel from 1930", "1_Text": "We tried the whole “catholic priests fucking kids” thing over here for a LONG time and it didn’t touch the obesity epedimic amongst American youth.  That’s exactly the reason Trump is calling for more guns in schools - fear burns calories.  \n\nThese kids are just sitting around for hours a day.  That can’t be good for America’s fat kids problem.  Trumps approach is “put more guns in schools and increase the scheduled school shootings”.  That way our children’s fight or flight system is always in place, shooting constant adrenaline through the bloodstream and burning calories while our kids would otherwise be sitting around in a classroom”  It’s genius in its simplicity - I for one am excited to see the conclusions once all the data comes in.", "2_Subreddit": "SigmaChi"}], "3r7kou": [{"0_Title": "The upcoming religious wars in the Riverlands. (spoilers all)", "1_Text": "We tried the whole “catholic priests fucking kids” thing over here for a LONG time and it didn’t touch the obesity epedimic amongst American youth.  That’s exactly the reason Trump is calling for more guns in schools - fear burns calories.  \n\nThese kids are just sitting around for hours a day.  That can’t be good for America’s fat kids problem.  Trumps approach is “put more guns in schools and increase the scheduled school shootings”.  That way our children’s fight or flight system is always in place, shooting constant adrenaline through the bloodstream and burning calories while our kids would otherwise be sitting around in a classroom”  It’s genius in its simplicity - I for one am excited to see the conclusions once all the data comes in.", "2_Subreddit": "asoiaf"}], "419s02": [{"0_Title": "12 months 9 charges not too shabby", "1_Text": "We tried the whole “catholic priests fucking kids” thing over here for a LONG time and it didn’t touch the obesity epedimic amongst American youth.  That’s exactly the reason Trump is calling for more guns in schools - fear burns calories.  \n\nThese kids are just sitting around for hours a day.  That can’t be good for America’s fat kids problem.  Trumps approach is “put more guns in schools and increase the scheduled school shootings”.  That way our children’s fight or flight system is always in place, shooting constant adrenaline through the bloodstream and burning calories while our kids would otherwise be sitting around in a classroom”  It’s genius in its simplicity - I for one am excited to see the conclusions once all the data comes in.", "2_Subreddit": "opiates"}], "62tnyk": [{"0_Title": "Found on /r/interestingasfuck - hand drawn cartoons sent to a users grandmother from back in ww2.", "1_Text": "We tried the whole “catholic priests fucking kids” thing over here for a LONG time and it didn’t touch the obesity epedimic amongst American youth.  That’s exactly the reason Trump is calling for more guns in schools - fear burns calories.  \n\nThese kids are just sitting around for hours a day.  That can’t be good for America’s fat kids problem.  Trumps approach is “put more guns in schools and increase the scheduled school shootings”.  That way our children’s fight or flight system is always in place, shooting constant adrenaline through the bloodstream and burning calories while our kids would otherwise be sitting around in a classroom”  It’s genius in its simplicity - I for one am excited to see the conclusions once all the data comes in.", "2_Subreddit": "opiates"}], "63gjpc": [{"0_Title": "Pure SCP fuel (first seen on /r/wtf)", "1_Text": "We tried the whole “catholic priests fucking kids” thing over here for a LONG time and it didn’t touch the obesity epedimic amongst American youth.  That’s exactly the reason Trump is calling for more guns in schools - fear burns calories.  \n\nThese kids are just sitting around for hours a day.  That can’t be good for America’s fat kids problem.  Trumps approach is “put more guns in schools and increase the scheduled school shootings”.  That way our children’s fight or flight system is always in place, shooting constant adrenaline through the bloodstream and burning calories while our kids would otherwise be sitting around in a classroom”  It’s genius in its simplicity - I for one am excited to see the conclusions once all the data comes in.", "2_Subreddit": "SCP"}], "78ji16": [{"0_Title": "The strangest thing about life when you get clean...", "1_Text": "We tried the whole “catholic priests fucking kids” thing over here for a LONG time and it didn’t touch the obesity epedimic amongst American youth.  That’s exactly the reason Trump is calling for more guns in schools - fear burns calories.  \n\nThese kids are just sitting around for hours a day.  That can’t be good for America’s fat kids problem.  Trumps approach is “put more guns in schools and increase the scheduled school shootings”.  That way our children’s fight or flight system is always in place, shooting constant adrenaline through the bloodstream and burning calories while our kids would otherwise be sitting around in a classroom”  It’s genius in its simplicity - I for one am excited to see the conclusions once all the data comes in.", "2_Subreddit": "opiates"}]}]}]}