{"PhysiologicalMimosa": [{"0_comments": [{"dnz7hp2": [{"0_Comment Submission": "My first tattoo, tell me your thoughts.", "1_Text": "Eh, I don't get it", "2_Subreddit": "tattoos"}], "do7oe0e": [{"0_Comment Submission": "My friend's (M/29) wife (F/28) who I thought was also my friend embarrassed me (F/25) in front of all of our mutual friends (F/M 20s/30s).", "1_Text": "I don't even hug my friends' boyfriends more than once, if even ever... Find your own significant other to bear hug and text", "2_Subreddit": "relationship_advice"}], "do7onzm": [{"0_Comment Submission": "Is boyfriend’s phone behavior worrying or am I overreacting?", "1_Text": "Keep us updated", "2_Subreddit": "relationship_advice"}], "do7p0hg": [{"0_Comment Submission": "Is my marriage over? Should it be?", "1_Text": "He's a mooching, emotional, lost, and sad human. He's projecting his insecurities onto you. Infecting you with his anxiety & negative emotions. I hope you find strength to start over again and experience a more reciprocal relationship. This man will age you faster by his stressors and criticisms", "2_Subreddit": "relationship_advice"}], "doapfmt": [{"0_Comment Submission": "And you know she drives an Altima", "1_Text": "You better not be taking about nurses. Sexist fools", "2_Subreddit": "BlackPeopleTwitter"}], "doaphas": [{"0_Comment Submission": "And you know she drives an Altima", "1_Text": "You can't type proper grammar you damn loser.", "2_Subreddit": "BlackPeopleTwitter"}], "dob1z45": [{"0_Comment Submission": "And you know she drives an Altima", "1_Text": "This is reddit folks, chill...", "2_Subreddit": "BlackPeopleTwitter"}], "doumrn2": [{"0_Comment Submission": "What's something people say to justify their shitty behavior?", "1_Text": "Call the other people \"psycho\" in any situation. Screams at people like a rude child if they don't get their way or attention. These people run peoples' names through the mud. Stay above the bs", "2_Subreddit": "AskReddit"}], "dqaxtpj": [{"0_Comment Submission": "Reddit took this down: why do ppl think they can become rich & famous one day?", "1_Text": "How though? Waking up early everyday or acting like someone they’re not? Population rise? Social media gain in the 2000’s?", "2_Subreddit": "AskReddit"}], "dqaxw49": [{"0_Comment Submission": "Reddit took this down: why do ppl think they can become rich & famous one day?", "1_Text": "This is supposed to imply why teens and 20-something’s have a preconceived notion they could become famous one day. Not even from real talent. Why does it seem easier to have become famous before the 90’s?", "2_Subreddit": "AskReddit"}], "dqaxy2a": [{"0_Comment Submission": "Reddit took this down: why do ppl think they can become rich & famous one day?", "1_Text": "My question was this originally: Why does it seem like real talent made people rich and famous before social media took over? I need legit responses besides the rise in global population and increased internet usage. Does everyone young think they could become famous one day randomly or is it just me?", "2_Subreddit": "AskReddit"}], "dry3un7": [{"0_Comment Submission": "Females are four times more sensitive than males to economic status cues when rating opposite sex attractiveness, indicating that higher economic status can offset lower physical attractiveness in men much more easily than in women.", "1_Text": "No shit", "2_Subreddit": "science"}], "dsstxrr": [{"0_Comment Submission": "Late to my second day of nursing school. Alarm didn’t have sound on. Lab instructor wants to meet with me tomorrow... Bought a real alarm clock to use. Advice needed", "1_Text": "Hey, thank you everyone for the helpful responses. It went well actually. I kept my cool, and made it clear it’s my responsibility to show professionalism by being early to lab/clinical...forever. I’m on their radar, so if it happens again I have to fill out my reason to some online pdf document and meet with the instructors during their weekly conference on how to make up the time missed. I definitely don’t want to and don’t see myself going down that strike two path.", "2_Subreddit": "NursingStudents"}], "dsuqhtz": [{"0_Comment Submission": "You’re going to have to use a butterfly needle", "1_Text": "I ask for the butterfly needle when I get blood drawn 😅", "2_Subreddit": "nursing"}], "dtg8i1y": [{"0_Comment Submission": "I really wish splatoon 2 had an option to disable the intro sequence.", "1_Text": "Wow, sounds like you all have immediate gratification issues...men and their games", "2_Subreddit": "NintendoSwitch"}], "dtg9361": [{"0_Comment Submission": "Beutifuly done visualisation of human population throughout time.", "1_Text": "A lot of people fighting and fucking", "2_Subreddit": "dataisbeautiful"}], "dtga9jm": [{"0_Comment Submission": "HAHAHAHAHAAAAAHAHAAA! OH MY SIDES!!!!!! HAHAHAHAHAHA *breathes* AHAHAHAHHHHHHHAAA! This meltdown on Redacted is so glorious. Cucks are losing their fucking minds over McCabe getting schlonged!", "1_Text": "Apologies aren’t sorrys", "2_Subreddit": "The_Donald"}], "dtgabr3": [{"0_Comment Submission": "Let your dreams become the memes", "1_Text": "You have a sex trafficking ad on this screenshot 😂", "2_Subreddit": "The_Donald"}], "dtgbch1": [{"0_Comment Submission": "🚨🚨🚨 HERE IT IS!!! THE MEMO WAS JUST POSTED TO WHITEHOUSE.GOV WEBSITE!!! 🚨🚨🚨", "1_Text": "Why do I get banned on Reddit?", "2_Subreddit": "The_Donald"}], "du46yw5": [{"0_Comment Submission": "NBC fires Olympic analyst after comments infuriate South Korea", "1_Text": "Nothing like rich idiots in charge of mass media", "2_Subreddit": "television"}], "dulbisg": [{"0_Comment Submission": "PsBattle: The underside of Jupiter", "1_Text": "Jawbreaker", "2_Subreddit": "photoshopbattles"}], "dup07m9": [{"0_Comment Submission": "Reliable pharmacology website", "1_Text": "Pharmacology is the worst", "2_Subreddit": "NursingStudents"}], "dwsbe5g": [{"0_Comment Submission": "How to Read ABGs Like a Boss: Master Acid-Base Disorders!", "1_Text": "Great tips!! Thank you", "2_Subreddit": "nursing"}], "dwsbg0e": [{"0_Comment Submission": "The true cause of the opioid epidemic", "1_Text": "Tony Hawk a bad guy?", "2_Subreddit": "opiates"}], "dwybhps": [{"0_Comment Submission": "Getting hungry now", "1_Text": "Yes, true. “Can we order? My server went on vacation.”", "2_Subreddit": "trippinthroughtime"}]}], "1_submissions": [{"7pl7uf": [{"0_Title": "Late to my second day of nursing school. Alarm didn’t have sound on. Lab instructor wants to meet with me tomorrow... Bought a real alarm clock to use. Advice needed", "1_Text": "Eh, I don't get it", "2_Subreddit": "NursingStudents"}]}]}]}