{"ItsTime______": [{"0_comments": [{"dvve92y": [{"0_Comment Submission": "Day 10 off subs", "1_Text": "> I could run from day one of abstinence til eternity I would not have needed kratom at all.\n\nI'm learning I can't do this either (I once thought I could). I have made it 4 years, it will probably be 5 or 6 years before I start using kratom religiously again. \n\n\n> Like saying take an aspirin a week after your head-ache has passed...\n\n\nI see what you're saying but most opioid addicts will be plagued with recurrent cravings (depending on life quality of course). I think if one sets a goal like: \"i'll get clean from all opioids [including kratom] now and work on optimizing my body's health and functioning and then return 2-3+ years later to help me cope with future stressors\", it will be much easier to stay clean and have something to look forward to in case shit hits the fan. \n\nI mean yeah if you think about it, if you're 2-3+ years out why would you start back on kratom, but 90% of people I know who I used to smoke dope with are chronic relapsers even after a couple years clean. I have the most clean time out of anyone I have ever used with; the only people I have met with more clean time than me are those I meet at NA meetings.", "2_Subreddit": "kratom"}], "dvvev74": [{"0_Comment Submission": "Some of my thoughts on the controversy that we always seem to go through.", "1_Text": "What's your BP while on kratom?", "2_Subreddit": "Kratomm"}], "dvvexf3": [{"0_Comment Submission": "Some of my thoughts on the controversy that we always seem to go through.", "1_Text": "Major flaw of kratom is the possible uptick of BP. This is why I would much prefer diamorphine maintenance to kratom.", "2_Subreddit": "Kratomm"}], "dvvf5ni": [{"0_Comment Submission": "Some of my thoughts on the controversy that we always seem to go through.", "1_Text": "This is the plight of dealing with people in general. They react differently to different things and then they often believe that because they did not experience a certain side effect that it must mean that others who experience it are lying. \n\n\nKratom's abundance of alkaloids make it sub-ideal to me. I take a lot of supplements and this is also why i'd prefer diamorphine with a relatively tamed MOA.", "2_Subreddit": "Kratomm"}], "dvvfdh5": [{"0_Comment Submission": "Day 10 off subs", "1_Text": "I'm thankful I have never been to jail. I couldn't imagine cold-turkying my habit in a jail cell. I know they put up protective measures to prevent you from killing yourself, but I think I would kill myself even after I got out of jail and was completely detoxed. I have an infantile-tier temperament so that would tilt me so much It would leave a lasting imprint on my psyche; no other way out than just ending it really. I feel that way  today without opiates [and before I ever used them to begin with]. Living an extremely imperfect life as anhedonic perfectionist is suicide fuel; opiates  nearly cure me of this daunting predicament i am in. \n\nIdk how you just do it every once in  a while. For me it has to be everyday 2-3 times a day or none at all.", "2_Subreddit": "kratom"}], "dvvpktq": [{"0_Comment Submission": "Some of my thoughts on the controversy that we always seem to go through.", "1_Text": "Yeah trust me I have been around /r/kratom and the facebook groups enough to know what you're talking about. IMHO they're deathly afraid of it being banned, so misinformation is in their best benefit to keep it legal. \n\nIf the FDA/DEA weren't such money hungry sociopaths then this debate between militant kratom users and those who kind of see kratom as just 'meh' it has its benefits and risks wouldn't even matter. This is because we should be able to choose what do with our bodies as long as it does others no harm.\n\n\nIt's definitely reminiscent of addict behavior though. Kratom is pretty damn safe overall but there is no need to shame those who have something to say that goes against the grain. Long term chronic use definitely comes with challenges that should be talked about more frequently to better understand a way to overcome them.", "2_Subreddit": "Kratomm"}], "dw34eug": [{"0_Comment Submission": "REMINDER of what kratom is (Hint: not a drug)", "1_Text": "It doesn't matter what it's considered as by the people because the FDA/DEA has considered it as a drug (i'm not saying I agree or don't agree with this). If kratom isn't a drug then stop calling opiates/morphine/opium drugs too. Opium isn't an opioid either; it just binds to the same receptors as exercise, dairy, gluten, etc. \n\n\nChamomile tea is no more addicting than kratom? TIL.", "2_Subreddit": "kratom"}], "dw34hoy": [{"0_Comment Submission": "REMINDER of what kratom is (Hint: not a drug)", "1_Text": "How is kratom not psychoactive? What is objectively wrong with his comment?", "2_Subreddit": "kratom"}], "dw353uq": [{"0_Comment Submission": "REMINDER of what kratom is (Hint: not a drug)", "1_Text": "It's actually insulting and counter-productive to people who thrive on opiates compared to kratom really. Kratom users benefit largely from the mu-opioid agonism from MIT and 7OHM. Stop dissasociating kratom from its primary MOA. That's what it is, it's an **redacted**. So many people here throw opioids/opiates under the bus it's disgusting, but fail to acknowledge the fact that they are benefiting from a similar theraputic effect seen from those who take traditional opiates/opioids.  \n\n\nMy life quality would thrive on affordable legally prescribed pharmaceutical grade opiates. It's just not the same for me on kratom. I have to be extra vigilant to what extra supplements and pharmaceuticals I take because of the multiple MOA's of mitragynine alone (not to mention the plethora of other alkaloids in kratom), I don't have to do so if I am taking pure morphine.\n\n\nYou guys hate the FDA/DEA so much but you blindly believe that any opioid other than kratom was designed to keep America addicted and dependent on 'Big Pharma'.\n\n\nI know not everyone thinks this way but this type of thinking sure is is prevelant on this sub and especially so on the FB groups.", "2_Subreddit": "kratom"}], "dw3e40e": [{"0_Comment Submission": "How to kill your entire crew!", "1_Text": "The only source of fun I have gotten from this soulless game is sabotaging my own teamamtes by going on several voayges and then throwing off all of the loot we collected in the middle of the ocean under their noses.", "2_Subreddit": "Seaofthieves"}], "dw3gt6x": [{"0_Comment Submission": "How to kill your entire crew!", "1_Text": "I'm not intentionally trying to ruin it for other people. I just can't shake the fact I spent 60 dollars on this game. I am trying to extract some fun out of this game I wasted my money on. This game was the biggest dissapointment I have ever had in my life in regards to video games.", "2_Subreddit": "Seaofthieves"}], "dwo82zf": [{"0_Comment Submission": "Turmeric Opioid Tolerance", "1_Text": "This is one of those studies that sounds great on paper but doesn't translate well to human subjects. The best tolerance modifiers at the moment are pharmaceuticals.\n'Theracumin' by natural factors has some solid research behind its curcumin product, it has the greatest bioavailability IME.", "2_Subreddit": "kratom"}], "dwocnma": [{"0_Comment Submission": "New Opiate Crisis Website! Share your Kratom story!", "1_Text": "This will just be weaponized as suboxone/methadone, vivitrol implant and life savings-gouging long term rehabilitation propaganda. They are already doing this with the #Stopthespiral campaign. Lets be real here--kratom will never be suggested as a viable alternative to suboxone or methadone maintenance. I have no doubts that we are at the apex of kratom's free for all leaglity. \n\nWhat this community should be doing is demystifying the lies about kratom *and* opioids. For every person here who benefits from kratom, there are an equal amount, if not more, amount of people who benefit from conventional opioid therapy under controlled conditions.\n\nLets not demonize opiates as a whole here, it's a disgusting farce I see trending on this subreddit all too often. The ChronicPain subreddit is experiencing a new horizon of suffering because of vocal addicts who may or may not have had a legitimate reason to use opiates dismissing them as the succubuses of the 21st century.\n\n\nThe focal point of this 'opiate epidemic' isn't even the tried and tested opioids like morphine or oxycodone; it's fentanyl and the innapropriate use of benzodiazepines alongside illicit cut up street heroin. This is why the east coast experinces more overdoses than those who use black tar in the west. It's often because east coast powder is a mix of antihistamines, fentanyl analogues, other random pontentiators and a little bit of heroin- and to top it off tobacco and the occasional benzodiazepine. In this sense heroin is like kratom, they could have a dozen drugs in their system at death but heroin will be the sole culprit.\n\nBecause of kratom's abundance of alkaloids and the multiple MOA's of MIT alone--kratom will not be optimal for everyone. Instead of the governement allocating funds for methadone clinics and suboxone docs they should learn from more sane countries like switzerland or canada, and open up diapmorphine/hydrpmorphine clinics that dispense a controlled amount of either opioid twice a day. \n\n\nEveryone seeking this type of therapy should undergoe a mandatory sleep study to screen for central or obstuctive sleep apnea. They shoul.d also be open about any allergies they might have or other breathing disroders such as asthma. \n\nMy point being that kratom should not be preached as the only superior treatment- because it clearly isn't and the hysteria behing opiates is absurd to put it lightly. The hysteria is a lethal one as bupe or done' will never provide the sustanence the addicts are looking for so they will often relapse and get a fent bag and die. This is true for kratom as well. Most heroin addicts will not find kratom to be a form of maintenance but rather a bridge to their next relapse.\n\n\nI feel like this kratom community and the AKA/BEA are selfishly looking out for themselves because they have got something that works fotthem so they dismiss this potentially game changing modalitiy entirely. \n\n\n\nEDIT: Can't edit spelling because im using my xbox controller to type and it's erasing the words I want to edit. RIP", "2_Subreddit": "kratom"}], "dwodqif": [{"0_Comment Submission": "Turmeric Opioid Tolerance", "1_Text": "Neither of them are game changing lets just say that. Most herbal 'potentiators' or 'tolerance reducers' are actually just toning down the hedonic response you get from kratom or other opioids. They're neuroprotective in the sense that they balance excess dopaminergic signalling. I know there was a study of curcumin extracts that showed a reversal of conditioned place preference of opioids by decreasing abuse potential (euphoria, sedation, etc.). So on paper curcumin should decrease dependence to opioids but that would be at the cost of your mood enhancement. I know it isn't this simple though either because curcumin has effects on histone deacetylase, neurogenic growth factors, nAChRs, etc. which in theory should all have a restorative effect on addiction but this doesn't seem to be the case as its effect is mild at best/.", "2_Subreddit": "kratom"}], "dwodvd9": [{"0_Comment Submission": "Turmeric Opioid Tolerance", "1_Text": "ULDN is alright. People don't take enough of it. It's best suited alongside traditional opioids like morphine or oxycodone. Kratom already has antagonists present albeit they probably aren't competitive antagonists until higher doses are reached. All in all it's better than nothing", "2_Subreddit": "kratom"}], "dwoffx1": [{"0_Comment Submission": "Turmeric Opioid Tolerance", "1_Text": "Have you tried agmatine? IMO it's best used for enhancing analgesia not mood. Agmatine doesn't just target  NMDA/glutamate. Agmatine is like curcumin in the sense that it has a lot of research behind its positive effects on opioid tolerance but it just doesn't translate. They both suck for management of opioid dependence imo. \n\n\nKetamine is what agmatine is on paper excpet it translates to humans. I noticed a great reduction of tolerance when I used ketamine for my dependence back in 2013. One dose had effects on my tolerance for 2 weeks. \n\n\nProglumide is a hit or miss it seems. I have 120g of the stuff just sitting in a briefcase. \n\nThe best potentiator and dependence reducer you can get legally that is safe with minimal side effects and has a novel non-addictive MOA today is Aprepitant. It will cost you ~10$ a dose though.", "2_Subreddit": "kratom"}], "dwohjwn": [{"0_Comment Submission": "what's your typical daily dose?", "1_Text": "Opiates are superior imho. There just needs to be proper protective measures in place for those susceptible to terminal respiratory depression", "2_Subreddit": "Kratomm"}], "dwomzhz": [{"0_Comment Submission": "Something new to worry about: Opioid-Induced Hyperalgesia: When The Painkiller Intensifies Pain", "1_Text": "This is really a result of piss poor patient management by the doctor and the DEA controlling what the doctor is allowed to prescribe. Switching opioid analgesics frequently if not daily is a good way to minimize this outcome. So one day solely take oxycodone, then the next day takean equianalgesic dose of morphine, then the day after take hydromorphone, next day oxymorphone, etc. \n\n But of course as we know this would be utterly impossible because nobody gives a shit about ways to optimize opioid therapy for CP patients because you're a liability. Nobody gives a shit about people who need opioids. \n\n\nCould you imagine getting several different opioids prescribed to you under rational circumstances? The government would probably have you suicided.", "2_Subreddit": "ChronicPain"}], "dwqbbzg": [{"0_Comment Submission": "Intensive Out-patient Program isn't going great...but I guess I have this massive speedball to make me feel better. Happy nods guys <3", "1_Text": "For me IOP was always just a vector to meet new connects.", "2_Subreddit": "opiates"}], "dwsznb0": [{"0_Comment Submission": "Is anybody currently a legal Medical Marijuana Card Holder? If so, for what condition?", "1_Text": "I wish marijuana worked for my problems", "2_Subreddit": "ChronicPain"}], "dwt0ggk": [{"0_Comment Submission": "Take It to the Streets", "1_Text": "Misinformation about opiates and semi-synthetic opioids destroyed lives. People should have the choice to use opiates legally at a low cost regardless of FDA approval.", "2_Subreddit": "kratom"}], "dwt16iv": [{"0_Comment Submission": "Take It to the Streets", "1_Text": "You put yourself in that situation. I am not a fan of trump nor Clinton but if I am asked about my political stance I just say idk what to think about all of that because I don't keep up with it. People who are flamboyant about their political ideology just want to get into arguments and bring attention to themselves.\n\nThere was nothing morally or objectively wrong with you putting up a Hilary sign or an LBGT flag but you open yourself up to harm by people who are militant in their beliefs (left or right). Keep a low profile and watch out for your own.", "2_Subreddit": "kratom"}], "dwt2gz5": [{"0_Comment Submission": "Just got referred Suboxone for kratom withdrawals (not a hate post, please don’t delete)", "1_Text": "Taper off and go into a detox if necessary. Avoid suboxone at all costs. There are great ways to make yourself comfortable during detox as of 2018 that don't require more opioids.", "2_Subreddit": "kratom"}], "dwukq2v": [{"0_Comment Submission": "Best tips you'd give to a newbie like me? (don't want to be addicted)", "1_Text": "Once a month", "2_Subreddit": "kratom"}], "dwx0zzf": [{"0_Comment Submission": "I have never done any opiates. I've been browsing this sub for ~2 hours now.", "1_Text": "I don't regret my use in the slightest. The best times of my life were while I was on heroin. I certainly wouldn't suggest using opiates to anyone, but to me it was very clear that my entire life I had been affilicted with an insufficient endogenous opioid system and opiates remedied that like nothing else could.\n\n\nDon't get inculcated with them by your own curiosity if you absolutely don't need them and don't criticise those who use them out of an existential necessity.\n\n\nI won't write out my story here but if opiates were liberated from their illegality and stigma then a lot of these horror stories you see about opiates would be less frequent.", "2_Subreddit": "opiates"}]}], "1_submissions": [{"6zpy1b": [{"0_Title": "Preparing for a relapse. 4 Years clean from BTH on January of next year.", "1_Text": "> I could run from day one of abstinence til eternity I would not have needed kratom at all.\n\nI'm learning I can't do this either (I once thought I could). I have made it 4 years, it will probably be 5 or 6 years before I start using kratom religiously again. \n\n\n> Like saying take an aspirin a week after your head-ache has passed...\n\n\nI see what you're saying but most opioid addicts will be plagued with recurrent cravings (depending on life quality of course). I think if one sets a goal like: \"i'll get clean from all opioids [including kratom] now and work on optimizing my body's health and functioning and then return 2-3+ years later to help me cope with future stressors\", it will be much easier to stay clean and have something to look forward to in case shit hits the fan. \n\nI mean yeah if you think about it, if you're 2-3+ years out why would you start back on kratom, but 90% of people I know who I used to smoke dope with are chronic relapsers even after a couple years clean. I have the most clean time out of anyone I have ever used with; the only people I have met with more clean time than me are those I meet at NA meetings.", "2_Subreddit": "opiates"}], "77twcs": [{"0_Title": "How has the southwest BTH scene changed since 2013-2014? Is tar cut with fentanyl even a thing?", "1_Text": "> I could run from day one of abstinence til eternity I would not have needed kratom at all.\n\nI'm learning I can't do this either (I once thought I could). I have made it 4 years, it will probably be 5 or 6 years before I start using kratom religiously again. \n\n\n> Like saying take an aspirin a week after your head-ache has passed...\n\n\nI see what you're saying but most opioid addicts will be plagued with recurrent cravings (depending on life quality of course). I think if one sets a goal like: \"i'll get clean from all opioids [including kratom] now and work on optimizing my body's health and functioning and then return 2-3+ years later to help me cope with future stressors\", it will be much easier to stay clean and have something to look forward to in case shit hits the fan. \n\nI mean yeah if you think about it, if you're 2-3+ years out why would you start back on kratom, but 90% of people I know who I used to smoke dope with are chronic relapsers even after a couple years clean. I have the most clean time out of anyone I have ever used with; the only people I have met with more clean time than me are those I meet at NA meetings.", "2_Subreddit": "opiates"}], "7ade4n": [{"0_Title": "Your offer has credited successfully, but your points are currently on hold. This usually happens when you complete a high risk transaction....", "1_Text": "> I could run from day one of abstinence til eternity I would not have needed kratom at all.\n\nI'm learning I can't do this either (I once thought I could). I have made it 4 years, it will probably be 5 or 6 years before I start using kratom religiously again. \n\n\n> Like saying take an aspirin a week after your head-ache has passed...\n\n\nI see what you're saying but most opioid addicts will be plagued with recurrent cravings (depending on life quality of course). I think if one sets a goal like: \"i'll get clean from all opioids [including kratom] now and work on optimizing my body's health and functioning and then return 2-3+ years later to help me cope with future stressors\", it will be much easier to stay clean and have something to look forward to in case shit hits the fan. \n\nI mean yeah if you think about it, if you're 2-3+ years out why would you start back on kratom, but 90% of people I know who I used to smoke dope with are chronic relapsers even after a couple years clean. I have the most clean time out of anyone I have ever used with; the only people I have met with more clean time than me are those I meet at NA meetings.", "2_Subreddit": "Earnably"}], "7deys9": [{"0_Title": "Plan on ordering from RVA for the first time after his site is back up?", "1_Text": "> I could run from day one of abstinence til eternity I would not have needed kratom at all.\n\nI'm learning I can't do this either (I once thought I could). I have made it 4 years, it will probably be 5 or 6 years before I start using kratom religiously again. \n\n\n> Like saying take an aspirin a week after your head-ache has passed...\n\n\nI see what you're saying but most opioid addicts will be plagued with recurrent cravings (depending on life quality of course). I think if one sets a goal like: \"i'll get clean from all opioids [including kratom] now and work on optimizing my body's health and functioning and then return 2-3+ years later to help me cope with future stressors\", it will be much easier to stay clean and have something to look forward to in case shit hits the fan. \n\nI mean yeah if you think about it, if you're 2-3+ years out why would you start back on kratom, but 90% of people I know who I used to smoke dope with are chronic relapsers even after a couple years clean. I have the most clean time out of anyone I have ever used with; the only people I have met with more clean time than me are those I meet at NA meetings.", "2_Subreddit": "HerbalRVA"}], "7ec4jn": [{"0_Title": "Sending BTC to my blockchain wallet taking over an hour and a half?", "1_Text": "> I could run from day one of abstinence til eternity I would not have needed kratom at all.\n\nI'm learning I can't do this either (I once thought I could). I have made it 4 years, it will probably be 5 or 6 years before I start using kratom religiously again. \n\n\n> Like saying take an aspirin a week after your head-ache has passed...\n\n\nI see what you're saying but most opioid addicts will be plagued with recurrent cravings (depending on life quality of course). I think if one sets a goal like: \"i'll get clean from all opioids [including kratom] now and work on optimizing my body's health and functioning and then return 2-3+ years later to help me cope with future stressors\", it will be much easier to stay clean and have something to look forward to in case shit hits the fan. \n\nI mean yeah if you think about it, if you're 2-3+ years out why would you start back on kratom, but 90% of people I know who I used to smoke dope with are chronic relapsers even after a couple years clean. I have the most clean time out of anyone I have ever used with; the only people I have met with more clean time than me are those I meet at NA meetings.", "2_Subreddit": "CoinBase"}], "7faopl": [{"0_Title": "Low amount of surveys today and yesterday?", "1_Text": "> I could run from day one of abstinence til eternity I would not have needed kratom at all.\n\nI'm learning I can't do this either (I once thought I could). I have made it 4 years, it will probably be 5 or 6 years before I start using kratom religiously again. \n\n\n> Like saying take an aspirin a week after your head-ache has passed...\n\n\nI see what you're saying but most opioid addicts will be plagued with recurrent cravings (depending on life quality of course). I think if one sets a goal like: \"i'll get clean from all opioids [including kratom] now and work on optimizing my body's health and functioning and then return 2-3+ years later to help me cope with future stressors\", it will be much easier to stay clean and have something to look forward to in case shit hits the fan. \n\nI mean yeah if you think about it, if you're 2-3+ years out why would you start back on kratom, but 90% of people I know who I used to smoke dope with are chronic relapsers even after a couple years clean. I have the most clean time out of anyone I have ever used with; the only people I have met with more clean time than me are those I meet at NA meetings.", "2_Subreddit": "SwagBucks"}], "7k7yo6": [{"0_Title": "Cannabigerol; blue bird botanicals is out of stock of CBG isolate at the moment. Do you guys know of any place else that stocks CBG oil/isolate?", "1_Text": "> I could run from day one of abstinence til eternity I would not have needed kratom at all.\n\nI'm learning I can't do this either (I once thought I could). I have made it 4 years, it will probably be 5 or 6 years before I start using kratom religiously again. \n\n\n> Like saying take an aspirin a week after your head-ache has passed...\n\n\nI see what you're saying but most opioid addicts will be plagued with recurrent cravings (depending on life quality of course). I think if one sets a goal like: \"i'll get clean from all opioids [including kratom] now and work on optimizing my body's health and functioning and then return 2-3+ years later to help me cope with future stressors\", it will be much easier to stay clean and have something to look forward to in case shit hits the fan. \n\nI mean yeah if you think about it, if you're 2-3+ years out why would you start back on kratom, but 90% of people I know who I used to smoke dope with are chronic relapsers even after a couple years clean. I have the most clean time out of anyone I have ever used with; the only people I have met with more clean time than me are those I meet at NA meetings.", "2_Subreddit": "CBD"}], "7llvh7": [{"0_Title": "West coast BTH users: How often do you come across tar that's been laced with fentanyl?", "1_Text": "> I could run from day one of abstinence til eternity I would not have needed kratom at all.\n\nI'm learning I can't do this either (I once thought I could). I have made it 4 years, it will probably be 5 or 6 years before I start using kratom religiously again. \n\n\n> Like saying take an aspirin a week after your head-ache has passed...\n\n\nI see what you're saying but most opioid addicts will be plagued with recurrent cravings (depending on life quality of course). I think if one sets a goal like: \"i'll get clean from all opioids [including kratom] now and work on optimizing my body's health and functioning and then return 2-3+ years later to help me cope with future stressors\", it will be much easier to stay clean and have something to look forward to in case shit hits the fan. \n\nI mean yeah if you think about it, if you're 2-3+ years out why would you start back on kratom, but 90% of people I know who I used to smoke dope with are chronic relapsers even after a couple years clean. I have the most clean time out of anyone I have ever used with; the only people I have met with more clean time than me are those I meet at NA meetings.", "2_Subreddit": "opiates"}], "7nx6zn": [{"0_Title": "Banned from /r/Kratom for saying \"I'm here because I love opioids\"", "1_Text": "> I could run from day one of abstinence til eternity I would not have needed kratom at all.\n\nI'm learning I can't do this either (I once thought I could). I have made it 4 years, it will probably be 5 or 6 years before I start using kratom religiously again. \n\n\n> Like saying take an aspirin a week after your head-ache has passed...\n\n\nI see what you're saying but most opioid addicts will be plagued with recurrent cravings (depending on life quality of course). I think if one sets a goal like: \"i'll get clean from all opioids [including kratom] now and work on optimizing my body's health and functioning and then return 2-3+ years later to help me cope with future stressors\", it will be much easier to stay clean and have something to look forward to in case shit hits the fan. \n\nI mean yeah if you think about it, if you're 2-3+ years out why would you start back on kratom, but 90% of people I know who I used to smoke dope with are chronic relapsers even after a couple years clean. I have the most clean time out of anyone I have ever used with; the only people I have met with more clean time than me are those I meet at NA meetings.", "2_Subreddit": "Kratomm"}], "7r2suc": [{"0_Title": "I wouldn't ever recommend kratom to someone who is healthy and happy.", "1_Text": "> I could run from day one of abstinence til eternity I would not have needed kratom at all.\n\nI'm learning I can't do this either (I once thought I could). I have made it 4 years, it will probably be 5 or 6 years before I start using kratom religiously again. \n\n\n> Like saying take an aspirin a week after your head-ache has passed...\n\n\nI see what you're saying but most opioid addicts will be plagued with recurrent cravings (depending on life quality of course). I think if one sets a goal like: \"i'll get clean from all opioids [including kratom] now and work on optimizing my body's health and functioning and then return 2-3+ years later to help me cope with future stressors\", it will be much easier to stay clean and have something to look forward to in case shit hits the fan. \n\nI mean yeah if you think about it, if you're 2-3+ years out why would you start back on kratom, but 90% of people I know who I used to smoke dope with are chronic relapsers even after a couple years clean. I have the most clean time out of anyone I have ever used with; the only people I have met with more clean time than me are those I meet at NA meetings.", "2_Subreddit": "Kratomm"}], "7tvrmi": [{"0_Title": "For those of you who use kratom for mental suffering--do you find that kratom is irreplaceable in its efficacy? One of a kind? What would you do if you couldn't take kratom anymore?", "1_Text": "> I could run from day one of abstinence til eternity I would not have needed kratom at all.\n\nI'm learning I can't do this either (I once thought I could). I have made it 4 years, it will probably be 5 or 6 years before I start using kratom religiously again. \n\n\n> Like saying take an aspirin a week after your head-ache has passed...\n\n\nI see what you're saying but most opioid addicts will be plagued with recurrent cravings (depending on life quality of course). I think if one sets a goal like: \"i'll get clean from all opioids [including kratom] now and work on optimizing my body's health and functioning and then return 2-3+ years later to help me cope with future stressors\", it will be much easier to stay clean and have something to look forward to in case shit hits the fan. \n\nI mean yeah if you think about it, if you're 2-3+ years out why would you start back on kratom, but 90% of people I know who I used to smoke dope with are chronic relapsers even after a couple years clean. I have the most clean time out of anyone I have ever used with; the only people I have met with more clean time than me are those I meet at NA meetings.", "2_Subreddit": "Kratomm"}]}]}]}