{"AgathaCrustie": [{"0_comments": [{"dwfufjk": [{"0_Comment Submission": "$10,000 a week for H???", "1_Text": "Fucking “reality” television at its finest.", "2_Subreddit": "opiates"}], "dwigrbx": [{"0_Comment Submission": "152 days.", "1_Text": "Just think about how many days this is! I remember when you got sober, and I got sober shortly after you (today is day 130). I also remember when you found some dope in an old wallet and flushed it. Fucking incredible! \n\nI know that the want to score is there. You don’t *need* to score anymore though. What keeps me going is that I’m able to wake up everyday and get out of bed, that I don’t wake up sick and wanting to give up on life. I can do whatever the fuck I want now! My life isn’t run by that devil of a drug. \n\nI really, REALLY hope that you find the strength to keep going. I know you’ve got it in you. I think that your day will come. 152 days is a long time, but in the long run, how long do 152 days compare to all of the time you spent using? You know that change doesn’t happen overnight. Just keep at it. I really do feel like good things are ahead for you. \n\nI know that we don’t know each other very well, but from what I’ve seen on here, you seem like a good guy with a good head on his shoulders. Dat ass ain’t bad either. 😉\n\nGood luck! Just think about all the times when you were using that you wanted to get sober. You’re here, man!!!", "2_Subreddit": "opiates"}], "dwjytpd": [{"0_Comment Submission": "H.R. Supplies Offer", "1_Text": "You are an angel! I hope that you can generate the interest in moving forward with this!", "2_Subreddit": "opiates"}], "dwjzdt9": [{"0_Comment Submission": "How many of you have an accompanying mental disorder ?", "1_Text": "I was diagnosed with bipolar disorder and anxiety issues yeeeeeears before I started doing drugs. I was diagnosed in high school and then fucked around with alcohol, weed, coke and adderall in college. Opiates came around right after I graduated college. I’m 30 years old now. \n\nI used the opiates to help with the depression part of the bipolar, but using ultimately made things worse because I was masking all of the crazy emotions that come along with the disorder. Opiates made the extreme highs and lows even more extreme. \n\nI’m sober and I’m actually starting to feel the symptoms again, and it kinda feels good. I actually kinda dig some of the mania moments (although I DESPISE them when I’m in bed at 4am trying to sleep). I’m not taking any medication for it at the moment, as I want to experience me as I truly am.\n\nSo yeah, to answer your question...I have an accompanying mental disorder. 🤪", "2_Subreddit": "opiates"}], "dwjzptt": [{"0_Comment Submission": "H.R. Supplies Offer", "1_Text": "That’s awesome. We’ve got to take care of each other, because who else will? Thanks for your compassion and willingness to do something like this.", "2_Subreddit": "opiates"}], "dwmt60g": [{"0_Comment Submission": "First time trying tar, ready to make some monkey water!", "1_Text": "I need this dictionary", "2_Subreddit": "opiates"}], "dwmwh59": [{"0_Comment Submission": "First time trying tar, ready to make some monkey water!", "1_Text": "Too busy reading the fart dictionary to finish my text message, huh???! 🤪\n\nEdit: Happy Easter! No worries, we’ll talk soon!!", "2_Subreddit": "opiates"}], "dwmwwpu": [{"0_Comment Submission": "First time trying tar, ready to make some monkey water!", "1_Text": "Shopping list:\n1. Fart Dictionary \n2. Fifty Farts playing cards", "2_Subreddit": "opiates"}], "dwn818n": [{"0_Comment Submission": "Easter...getting clean?!", "1_Text": "👍👍 Fucking right! Every word.", "2_Subreddit": "opiates"}], "dwnd3fs": [{"0_Comment Submission": "Easter colors !!! 😂 60mg Oxy in the blue, 90mg Morphine in the pink.... Happy Easter Nods my friends 🤙🏻", "1_Text": "Pink in the stink, baby", "2_Subreddit": "opiates"}], "dwobxsk": [{"0_Comment Submission": "Lost my job of 4 years--the one thing is was proud of in my life", "1_Text": "Your cakes are awesome! Really awesome. It also sounds like you’re a good person, and that it wasn’t easy for the bakery to let you go. \n\nCake decorating is obviously something you love to do. Going off on a tangent, my father has been a cake decorator in NYC since the ‘70’s, and he’s the coolest guy I know. \n\nThis firing doesn’t mean your life is over. It can be, though. A lot of people would use this as more of a reason to use, and would dig themselves into an even deeper hole. On the other hand, think about it - you lost your amazing job, and the drugs aren’t even working anymore. At this point, using isn’t going to necessarily make the pain of losing this job go away. It’ll make you feel better for a bit, all the while making everything even worse. I think you know that. \n\nSometimes it takes something like this to happen for someone to wake up. I lost so much in my life due to drugs, and I hated my life. One day, after years and years of having H run my life, I quit that shit. All of the things that I loved and thought I would never be able to get back are coming back; in fact, amazing things that I didn’t even think could happen are happening now because I’m not living that life anymore. \n\nI’m not telling you what you need to do; all I’m saying is that if you really want it, you can get this work and your life back. After all, you’ve got talent! Don’t waste that shit! \n\nGood luck, broski! Keep your head up.", "2_Subreddit": "opiates"}], "dworb3z": [{"0_Comment Submission": "Lost my job of 4 years--the one thing is was proud of in my life", "1_Text": "That’s good! If you’re at this point already, it can and will get worse. It really does take *wanting* to get and stay clean to do so. Experiences like yours can certainly prompt that want. Good luck to you. I really wish you the best. Talent like yours shouldn’t be wasted!", "2_Subreddit": "opiates"}], "dwordng": [{"0_Comment Submission": "Lost my job of 4 years--the one thing is was proud of in my life", "1_Text": "I was also thinking...maybe you can start your own bakery at some point in your life? You can be your own boss and do what you love to do. It’s definitely an attainable goal!", "2_Subreddit": "opiates"}], "dwptqe5": [{"0_Comment Submission": "2 years", "1_Text": "I loved everything about reading this. Congrats! You’re inspiring!", "2_Subreddit": "opiates"}], "dwsyd7r": [{"0_Comment Submission": "dope porn sunrise [nsfw]", "1_Text": "Girl! You’re stunning! I’m actually here in WI too. \n\nCheese, beer, and beer-cheese.", "2_Subreddit": "opiates"}], "dwtenpb": [{"0_Comment Submission": "dope porn sunrise [nsfw]", "1_Text": "Bro I’m a well-read WOMAN", "2_Subreddit": "opiates"}], "dwtr231": [{"0_Comment Submission": "dope porn sunrise [nsfw]", "1_Text": "What about them beer cheese and PRETZELS tho!?", "2_Subreddit": "opiates"}], "dwvqyqf": [{"0_Comment Submission": "me in a nutshell", "1_Text": "PLEASE TELL ME THAT THAT IS A SUCRETS BOX\n\nThe perfect stash box. Fits straws and everything!", "2_Subreddit": "opiates"}], "dwvsgol": [{"0_Comment Submission": "me in a nutshell", "1_Text": "YES! Wow I feel like I’ve met my match! Haha. Seriously the best stash tin ever. The tin always protected my straws from getting dented too! Wow...", "2_Subreddit": "opiates"}], "dwvtet4": [{"0_Comment Submission": "Hey its mr.blackout back with some more hospital goodies", "1_Text": "Oh hi Mr. Blackout!", "2_Subreddit": "opiates"}], "dww6p9i": [{"0_Comment Submission": "if only it was true...", "1_Text": "You mean his son’s and daughter’s?", "2_Subreddit": "opiates"}], "dww7jym": [{"0_Comment Submission": "Learned this the hard way", "1_Text": "“68% normal-ish”", "2_Subreddit": "opiates"}], "dwwbqmg": [{"0_Comment Submission": "Learned this the hard way", "1_Text": "You’re 100% awesome", "2_Subreddit": "opiates"}], "dwwdqa8": [{"0_Comment Submission": "Learned this the hard way", "1_Text": "Thank you! 🤪", "2_Subreddit": "opiates"}], "dwxzaei": [{"0_Comment Submission": "If you could have an opiate-sesh with anybody, dead or alive, who would it be and why?", "1_Text": "Yes! This is my answer. He really was the best.", "2_Subreddit": "opiates"}]}], "1_submissions": [{"7ot8lf": [{"0_Title": "Question for the shooters", "1_Text": "Fucking “reality” television at its finest.", "2_Subreddit": "opiates"}], "7q0rdo": [{"0_Title": "Posted this in r/OpiatesRecovery, but I thought that it was worth posting here, too.", "1_Text": "Fucking “reality” television at its finest.", "2_Subreddit": "opiates"}], "7tyslj": [{"0_Title": "73 days sober, found two folds of H (.1-.2 each) that I had stashed away and forgot about...", "1_Text": "Fucking “reality” television at its finest.", "2_Subreddit": "opiates"}]}]}]}