{"northern_optimist": [{"0_comments": [{"dwknbo6": [{"0_Comment Submission": "Jordan Peterson and Fascist Mysticism", "1_Text": "Who said anything about the left?", "2_Subreddit": "Foodforthought"}], "dwknhpe": [{"0_Comment Submission": "Is Journalism a Form of Activism?", "1_Text": "Did you read the article, or are you just replying to the headline?", "2_Subreddit": "Foodforthought"}], "dwl8rzh": [{"0_Comment Submission": "Any events on 4/20?", "1_Text": "As opposed to know, when it is legal?", "2_Subreddit": "canadients"}], "dwnm5ab": [{"0_Comment Submission": "The Forgotten Drink That Caffeinated North America for Centuries — Cassina, aka Yaupon tea, a botanical cousin to yerba maté, is now almost unknown.", "1_Text": "Can't tell if it was autocorrect, or you just really hate Home Depot.", "2_Subreddit": "Foodforthought"}], "dwo4cq6": [{"0_Comment Submission": "How can I best use my resources to get baked?", "1_Text": "You can just eat the ABV. Mix it in yogurt or a glass of milk or something.", "2_Subreddit": "eldertrees"}], "dwo53cm": [{"0_Comment Submission": "How can I best use my resources to get baked?", "1_Text": "Your vape already did the heating part for you. Just eat it with something fatty.", "2_Subreddit": "eldertrees"}], "dwoidra": [{"0_Comment Submission": "How can I best use my resources to get baked?", "1_Text": "Depends on how much you vaped it basically. The darker brown it is, the less cannabinoids will be left. \n\n2g of ABV could end up being a pretty intense experience.", "2_Subreddit": "eldertrees"}], "dwoz894": [{"0_Comment Submission": "How can I best use my resources to get baked?", "1_Text": "Bud that has been vaped already. Lots of people save it to make edibles because it still has some THC/CBD/other stuff in it.", "2_Subreddit": "eldertrees"}], "dwqgxki": [{"0_Comment Submission": "For Two Months, I Got My News From Print Newspapers. Here’s What I Learned.", "1_Text": "It doesn't even really have to be print, either. Basically, just wait a day or two and read a couple of in-depth articles written after the dust settles. Less anxiety, less wrong information, and the articles are better written because editors have more than a couple of minutes with the piece.", "2_Subreddit": "Foodforthought"}], "dwrgj4t": [{"0_Comment Submission": "FYI to receiving your LP package.", "1_Text": "Can you use flex delivery? I think they legally have to sent the packages to the address on your prescription.", "2_Subreddit": "CanadianCannabisLPs"}], "dwrmvns": [{"0_Comment Submission": "FYI to receiving your LP package.", "1_Text": "Yeah but the LP won't ship to a flex address as far as I know.", "2_Subreddit": "CanadianCannabisLPs"}], "dws8p4w": [{"0_Comment Submission": "Those who sell pot illegally will face $10K fine under Nova Scotia law \b", "1_Text": "Your Alexander Keith's in Ontario is brewed in Ontario, actually.", "2_Subreddit": "canadients"}], "dwsch24": [{"0_Comment Submission": "FYI to receiving your LP package.", "1_Text": "Hmmm, interesting. I'm with Tweed, but I don't think that they will ship to a flex address, as they say the only way to change your address is to have the address on your prescription changed.", "2_Subreddit": "CanadianCannabisLPs"}], "dwshor6": [{"0_Comment Submission": "FYI to receiving your LP package.", "1_Text": "Not a huge deal for me because I work from home a lot of the time, but it is annoying when the delivery comes when I'm out and then I have to wait until the next day to pick it up at the post office.", "2_Subreddit": "CanadianCannabisLPs"}], "dwstza7": [{"0_Comment Submission": "Those who sell pot illegally will face $10K fine under Nova Scotia law \b", "1_Text": ">Originally brewed in the Halifax brewery, Anheuser–Busch InBev expanded production of Alexander Keith's beers to breweries in Ontario (London), Quebec (Montreal), Newfoundland (St. John's), British Columbia (Creston), and New York State (Baldwinsville),[5][nb 1] in addition to the original Halifax brewery which now produces beer for all of the Maritime provinces.\n\nhttps://en.wikipedia.org/wiki/Alexander_Keith%27s_Brewery", "2_Subreddit": "canadients"}], "dwtkl1o": [{"0_Comment Submission": "FYI to receiving your LP package.", "1_Text": "Huh, guess I'm wrong. Always thought that it wasn't an option.", "2_Subreddit": "CanadianCannabisLPs"}], "dwv8tg7": [{"0_Comment Submission": "question about Shalltear", "1_Text": "Personally, I like Shalltear more. Albedo seeks sex even more than Shalltear, like that time her hand went through his pelvis and she says “I couldn’t help myself”. Albedo keeps reminding the readers that she is forced to love him, and despite her being happy about it, it’s not a good thing to mention. Many people talk about necrophilia, but I have yet to see Shalltear interested in an undead skeleton that’s not Ainz, and she’s seen different types of them, so I wouldn’t exactly say it’s her number 1 fetish. Plus Shalltear is badass. It’s more satisfying to see her melt for Ainz (even for his voice), and then see how much she enjoys to cause pain to other creatures. Plus she has to deal with the almost always right next to Ainz overseer Albedo. Shalltear doesn’t get the chance to enjoy that privilege as she must protect Nazarick, and thus it’s not a fair fight.", "2_Subreddit": "overlord"}], "dwv8zpb": [{"0_Comment Submission": "question about Shalltear", "1_Text": "Sorry for being late to the thread, but Shalltear most certainly fell in love with Ainz. It’s not because he’s undead, a skeleton, or whatever, because otherwise she would say she loves them all and would want to marry countless people instead of just one. The words that the Japanese author uses to describe her love for him are certainly romantic as well, the exact same as Albedo’s, so there shouldn’t be any doubts about that. That said, Shalltear is not the only vampire that fell for Momonga, and though I would choose Shalltear over Albedo, I also prefer Evil Eye over Shalltear.", "2_Subreddit": "overlord"}], "dwx0840": [{"0_Comment Submission": "The demise of the nation state", "1_Text": "If you think that global capitalism is working well for 99% of people, you're living in a bubble.", "2_Subreddit": "Foodforthought"}], "dwx84ci": [{"0_Comment Submission": "Convicted Winnipeg pot delivery man pleads guilty to importing fentanyl", "1_Text": "Seems like a really bright guy...", "2_Subreddit": "canadients"}], "dwxhsia": [{"0_Comment Submission": "Positive Medical Stories.", "1_Text": "Same for me. Helps a lot with side effects from the RA meds too.", "2_Subreddit": "eldertrees"}], "dwxs9uq": [{"0_Comment Submission": "Exploring the 5 best licensed producers in Canada for 2018", "1_Text": "Honestly? Probably someone who knew nothing about the topic was paid $20 on Upwork to write this in an afternoon.", "2_Subreddit": "CanadianCannabisLPs"}], "dwxt4fl": [{"0_Comment Submission": "Bakerstreet is Milled?!", "1_Text": "They do list a lower THC % on the milled version, so it isn't like they're trying to trick anyone.", "2_Subreddit": "canadients"}], "dwyzf0z": [{"0_Comment Submission": "Stupid little vial!!", "1_Text": "The length of the tip doesn't really matter at all - even the short 6-8mm ones are long enough. It really just has to get under your skin.", "2_Subreddit": "rheumatoid"}], "dwyzk0x": [{"0_Comment Submission": "Any interest in a meetup?", "1_Text": "Oh yeah? What did you get? \n\nBe warned, it comes super dry. Fine for vaping/edibles, but I find it too dry for smoking. I throw mine in a mason jar with a boveda back and it makes a huge difference.", "2_Subreddit": "northbay"}]}], "1_submissions": [{"6o0tl5": [{"0_Title": "I've lost 15+ lbs since starting methotrexate 6 months ago.", "1_Text": "Who said anything about the left?", "2_Subreddit": "rheumatoid"}], "6rk2e5": [{"0_Title": "Considering an elimination diet - any recommendations?", "1_Text": "Who said anything about the left?", "2_Subreddit": "rheumatoid"}], "6v2qpb": [{"0_Title": "Looking for recommendations for a tattoo artist", "1_Text": "Who said anything about the left?", "2_Subreddit": "northbay"}], "7133j8": [{"0_Title": "Wimped out on my methotrexate injection today", "1_Text": "Who said anything about the left?", "2_Subreddit": "rheumatoid"}], "7g7c82": [{"0_Title": "'This letter is my cry for help'", "1_Text": "Who said anything about the left?", "2_Subreddit": "northbay"}], "838po5": [{"0_Title": "Should I bother growing?", "1_Text": "Who said anything about the left?", "2_Subreddit": "canadients"}], "84w8y3": [{"0_Title": "Any interest in a meetup?", "1_Text": "Who said anything about the left?", "2_Subreddit": "northbay"}], "85dcqu": [{"0_Title": "Legality of carrying a joint?", "1_Text": "Who said anything about the left?", "2_Subreddit": "canadients"}], "88389x": [{"0_Title": "CBD less effective through my vape?", "1_Text": "Who said anything about the left?", "2_Subreddit": "canadients"}], "8adpfp": [{"0_Title": "Is Argyle (Tweed) any good?", "1_Text": "Who said anything about the left?", "2_Subreddit": "canadients"}]}]}]}