{"aaaaaintothevoid": [{"0_comments": [{"dvxj9q5": [{"0_Comment Submission": "Canada has a higher youth suicide rate than Japan, Korea", "1_Text": "LOL what an angry unprovoked attack for no reason. I was trying to bring up the very visible problem of racism here but I guess I'm just \"white trash\" because I think it's a problem. Nice.", "2_Subreddit": "canada"}], "dvxjsm2": [{"0_Comment Submission": "Canada has a higher youth suicide rate than Japan, Korea", "1_Text": "Our free healthcare also doesn't include psychologists or therapy. Where I live it's $200/hour to see a counsellor.", "2_Subreddit": "canada"}], "dvzezj9": [{"0_Comment Submission": "TIL that in 1987 Steve Rothstein took advantage of the AAirpass (a promotion by American Airlines that let people pay a one time $250,000 and have a lifetime of unlimited flights) and quit his job so he could fly continuously. This ended up costing the airline more than 21 million.", "1_Text": "America actually does have prescription methamphetamine. Now they just need to make it OTC or prescribe it to addicts as a replacement therapy like they do with methadone.", "2_Subreddit": "todayilearned"}], "dvzf1di": [{"0_Comment Submission": "TIL that in 1987 Steve Rothstein took advantage of the AAirpass (a promotion by American Airlines that let people pay a one time $250,000 and have a lifetime of unlimited flights) and quit his job so he could fly continuously. This ended up costing the airline more than 21 million.", "1_Text": "I like how America puts marijuana at a higher schedule than meth, really makes me laugh at how backwards that system is.", "2_Subreddit": "todayilearned"}], "dw2zi26": [{"0_Comment Submission": "Band groupies that had sex with their idols, how did it affect the way you saw them afterwards?", "1_Text": "I thought he had an eating disorder and some other medical issues, not an addiction. Feel free to correct me if I'm wrong though.", "2_Subreddit": "AskReddit"}], "dw397yc": [{"0_Comment Submission": "Poor Brianna got hacked", "1_Text": "And she also shames gay and trans people, despite the fact that she literally has done lesbian porn and had a TV show where women (and men) would compete to get to date her.", "2_Subreddit": "sadcringe"}], "dw3cait": [{"0_Comment Submission": "Poor Brianna got hacked", "1_Text": "Lol I'm aware. But at one point she supposedly came out as a lesbian, and was engaged to a woman for a while. So why does she think it's okay to shame gay people when she herself is supposedly a lesbian/bisexual? It's extremely hypocritical.", "2_Subreddit": "sadcringe"}], "dw5mqqp": [{"0_Comment Submission": "Wtf. Only in Cincinnati.", "1_Text": "Damn dude. Congrats on your clean time though. I'm glad you got out before a bad batch hit you.", "2_Subreddit": "trashy"}], "dw7gyio": [{"0_Comment Submission": "A message my friend received", "1_Text": "Here in Canada I had to wait 12 months for my referral, and my therapist ended up being not very helpful so now I have to wait another 8-12 months for a new one. I also had to pay $150 per session with the \"sliding scale\" therapists, despite being a student and barely making any money. Totally not affordable at all. I can understand where the frustration comes from.", "2_Subreddit": "niceguys"}], "dw8zv8u": [{"0_Comment Submission": "Family of four cut groceries in half by simplifying foods.", "1_Text": "Me too! We usually average $100-$125 per week for groceries (including stuff like toilet paper, ziploc bags etc) and there's only 2 of us. We don't eat expensive cuts of meat or anything and always try to shop the sales and buy the no name brands. But I just can't seem to lower our grocery budget without sacrificing fresh produce and healthy foods.", "2_Subreddit": "EatCheapAndHealthy"}], "dwc1pcn": [{"0_Comment Submission": "I once didn't poop for 13 days, and had to ride a motorbike with it pushed back up inside to the hospital.", "1_Text": "I'm on a pretty large dose of morphine every day and my poops have finally become normal again. After a while your body gets used to it eventually! Back when I was doing dope I was frequently constipated to the point where I tore my asshole. Multiple times in the span of a few months. God I do not miss those days.", "2_Subreddit": "confessions"}], "dwc5kfd": [{"0_Comment Submission": "Canadian Federal Government plans to allow wide-spread use of prescription heroin.", "1_Text": "There's also prescription morphine for opioid dependency in BC and Alberta which not a lot of people know about. I had to try methadone and suboxone first and basically prove they weren't working well for me in order to get morphine so I'm assuming to get prescription diacetylmorphine you'd have to do the same thing.", "2_Subreddit": "opiates"}], "dwc5uwq": [{"0_Comment Submission": "Canadian Federal Government plans to allow wide-spread use of prescription heroin.", "1_Text": "I think they give you heroin and supplies to inject it but you have to inject it yourself, they won't do it for you. That's how the current pilot projects in Vancouver are doing it. No heroin take homes, but they give you a dose of methadone every night to tide you over until the clinic opens again in the morning.", "2_Subreddit": "opiates"}], "dwci1l8": [{"0_Comment Submission": "This girl used to make fun of me in middle school.... I guess I get the last laugh", "1_Text": "Pinned af", "2_Subreddit": "awfuleyebrows"}], "dwci9hl": [{"0_Comment Submission": "Would you believe me if I told you she's selling eyeshadow?", "1_Text": "Oh my god I looked at the picture and was like \"what is wrong with her lips why is there a weird fold under them?\" And then I saw this comment and I'm even more confused. Why would she do that?", "2_Subreddit": "Youniqueamua"}], "dwcj036": [{"0_Comment Submission": "Very interesting statistics about the use of Ketamine for depression treatments...", "1_Text": "Does anyone know if it's possible to access ketamine treatment in Canada? I've tried searching but couldn't find anything.", "2_Subreddit": "depressionregimens"}], "dwejveg": [{"0_Comment Submission": "[RANT] I wish the food industry would try to capitalize on low-carb lifestyles like they have with low-fat and gluten-free.", "1_Text": "Big Carba strikes again!", "2_Subreddit": "keto"}], "dwhv2ug": [{"0_Comment Submission": "LateStage department stores: where alcohol and electronics are on the shelves but baby formula has to be kept locked up.", "1_Text": "How could you resell something like that? Is there a black market for baby formula?", "2_Subreddit": "LateStageCapitalism"}], "dwprmiv": [{"0_Comment Submission": "Spring", "1_Text": "My birthday is in June as well and I've definitely had snow on at least a couple of my birthdays.", "2_Subreddit": "Calgary"}], "dwpswt7": [{"0_Comment Submission": "I've been dosing 200mg Modafinil for 12 months - My Personal Experience.", "1_Text": "I've been considering switching from Dexedrine to Modafinil. It seems like the healthier option for long term use and seems to have a lot less side effects. Does Modafinil work anywhere near as well as adderall for you? Does it help you focus and improve working memory?", "2_Subreddit": "Nootropics"}], "dwq9gxy": [{"0_Comment Submission": "So apparently all emergency departments don't treat addicts like garbage.", "1_Text": "Wow you're lucky!! I'm surprised they treated you so well to be honest. My husband tore open his hand pretty bad last week and needed 6 stitches. He was sitting in the waiting room, holding his bleeding hand and in a lot of pain, for 3 hours before someone finally came and stitched him up. Wanna know what they gave him for the pain? A fucking Advil. (I should clarify he is not and has never been a drug user). But unfortunately bad experiences seem to be the norm. I'm glad you had a better time than him though!", "2_Subreddit": "opiates"}], "dwqq2l7": [{"0_Comment Submission": "So apparently all emergency departments don't treat addicts like garbage.", "1_Text": "Honestly based on his pain level he should have been given something more than an Advil. Every person responds to pain differently and if he's feeling like he needs pain control due to the fact he sliced his hand down to the muscle and was in immense pain while getting sutures then he should have received something in my opinion. Like if your patient is sitting there dizzy and nauseous from pain and in quite obvious discomfort you should help them out. I'm not saying he needed a \"script for norco\" but a shot of morphine or even some lidocaine would have been nice to ease his pain while in the ER. He has had oxycodone a few times for pain before and he very much disliked it but it got the job done, so I really don't think he's at risk of developing an addiction anyway, not that it's even relevant in this case.", "2_Subreddit": "opiates"}], "dwqx4m6": [{"0_Comment Submission": "So apparently all emergency departments don't treat addicts like garbage.", "1_Text": "Damn dude. Well I'm glad you're okay now! Is the back pain related to the fall or was that a previously existing condition?", "2_Subreddit": "opiates"}], "dwqxna4": [{"0_Comment Submission": "I've been dosing 200mg Modafinil for 12 months - My Personal Experience.", "1_Text": "Thanks for the reply. It's really hard to get off amphetamines but you'll feel so much better not having to rely on a pill to get out of bed. I went through a similar thing as you but I wasn't abusing my medications, I was snorting/smoking meth. It's very similar in terms of effects but a lot more toxic and addictive. I've been off the meth for close to 8 months but still taking dexedrine 4-5 days a week (only like 10mg/day), so I think Modafinil might be a better option for me at this point.  Do you think your Adderall tolerance affects how the Modafinil works on you?  And what is ASMR?", "2_Subreddit": "Nootropics"}], "dwr01xo": [{"0_Comment Submission": "OK Reddit - What just isn't worth the effort?", "1_Text": "Life", "2_Subreddit": "AskReddit"}]}], "1_submissions": [{"6mqe0l": [{"0_Title": "I overdosed and almost died on Saturday night", "1_Text": "LOL what an angry unprovoked attack for no reason. I was trying to bring up the very visible problem of racism here but I guess I'm just \"white trash\" because I think it's a problem. Nice.", "2_Subreddit": "opiates"}], "77bhk3": [{"0_Title": "42mg methadone to oxycodone?", "1_Text": "LOL what an angry unprovoked attack for no reason. I was trying to bring up the very visible problem of racism here but I guess I'm just \"white trash\" because I think it's a problem. Nice.", "2_Subreddit": "Methadone"}], "7kdelt": [{"0_Title": "Friends who don't use", "1_Text": "LOL what an angry unprovoked attack for no reason. I was trying to bring up the very visible problem of racism here but I guess I'm just \"white trash\" because I think it's a problem. Nice.", "2_Subreddit": "OpiatesRecovery"}], "7pdlox": [{"0_Title": "Raping a sister", "1_Text": "LOL what an angry unprovoked attack for no reason. I was trying to bring up the very visible problem of racism here but I guess I'm just \"white trash\" because I think it's a problem. Nice.", "2_Subreddit": "IncelTears"}], "7vls2z": [{"0_Title": "My doggos doing a heckin snuggle", "1_Text": "LOL what an angry unprovoked attack for no reason. I was trying to bring up the very visible problem of racism here but I guess I'm just \"white trash\" because I think it's a problem. Nice.", "2_Subreddit": "doggos"}], "7ytpb5": [{"0_Title": "I am so frustrated with methadone clinics.", "1_Text": "LOL what an angry unprovoked attack for no reason. I was trying to bring up the very visible problem of racism here but I guess I'm just \"white trash\" because I think it's a problem. Nice.", "2_Subreddit": "Methadone"}], "833v0c": [{"0_Title": "In response to my city getting a new safe injection site.", "1_Text": "LOL what an angry unprovoked attack for no reason. I was trying to bring up the very visible problem of racism here but I guess I'm just \"white trash\" because I think it's a problem. Nice.", "2_Subreddit": "u_aaaaaintothevoid"}]}]}]}