{"doneyrox": [{"0_comments": [{"dwv7648": [{"0_Comment Submission": "This is my band, The Mongols. We're from northeast PA, and are looking to play more shows.", "1_Text": "Thanks!!! Would love to get out of PA and hit some east coast cities/areas.", "2_Subreddit": "punk"}], "dwv7axd": [{"0_Comment Submission": "This is my band, The Mongols. We're from northeast PA, and are looking to play more shows.", "1_Text": "Thanks! I've heard of these places.", "2_Subreddit": "punk"}], "dwv7tts": [{"0_Comment Submission": "This is my band, The Mongols. We're from northeast PA, and are looking to play more shows.", "1_Text": "Check us out at themongolsrock on Facebook. We list our shows there.", "2_Subreddit": "punk"}], "dwv7vqc": [{"0_Comment Submission": "This is my band, The Mongols. We're from northeast PA, and are looking to play more shows.", "1_Text": "Also check us out at themongolsrock on facebook. We list our upcoming shows there.", "2_Subreddit": "punk"}], "dwvqnzs": [{"0_Comment Submission": "Can I mix 10mg oxy with a beer?", "1_Text": "What is this? A newb site. \n\nTake 2 10's and drink a six pack.", "2_Subreddit": "opiates"}], "dwvqste": [{"0_Comment Submission": "If you drink beer, what's your go to/favorite beer?", "1_Text": "Hey you, mother fuckers! I only drink bud.\n\nIf you don't get the reference, you don't belong here.", "2_Subreddit": "punk"}], "dwvtden": [{"0_Comment Submission": "running away/ escaping", "1_Text": "Seriously... sounds like this guy has life dialed in man. SHARE YOUR SECRETS!", "2_Subreddit": "opiates"}], "dww6z0v": [{"0_Comment Submission": "Failed drug test, didn't get script, bought H...", "1_Text": "Ever go swimming on heroin? It's so awesome.", "2_Subreddit": "opiates"}], "dwwyj02": [{"0_Comment Submission": "Opiates don’t feel the same after being clean and off anti-depressants", "1_Text": "Opiates make me mean. Really agitated, short tempered, etc.\nI still took them because I loved the high tho, but they made me a dick to everyone around me. \nWeird side effect I guess. They make most people mellow.", "2_Subreddit": "opiates"}], "dwwyo4r": [{"0_Comment Submission": "This is my band, The Mongols. We're from northeast PA, and are looking to play more shows.", "1_Text": "No! Ghengis Khan's Mongol empire inspired. Our singer is really into history and was fascinated by the Mongol empire.\nNo affiliation to the bike club", "2_Subreddit": "punk"}], "dwx1dwt": [{"0_Comment Submission": "Opiates don’t feel the same after being clean and off anti-depressants", "1_Text": "Nothing killed my buzz.... I'd be high as hell, but flipping out on everyone around me. I think I'm wired backwards. Do a few lines of coke, and I'm mellow as fuck and just chilling. I mean, I'd be talkative and stuff like people on coke get, but physically I'm just chilled out. Do a good bag of H or some Oxys? I'm flying around my house cleaning and organizing, but flipping out on anyone standing in my way. Hell, when I was an addict I got more work done in a day than anyone around me. Now that I'm clean I don't nearly produce as well at work. I even started calling percs \"workocets\" because I would pop a few and GO!!! But yeah, I was a complete asshole at the same time. And when I got on subs? Forget about it. I blame subs for my divorce. Those things turned me into a complete dickhead.", "2_Subreddit": "opiates"}], "dwx286m": [{"0_Comment Submission": "Opiates don’t feel the same after being clean and off anti-depressants", "1_Text": "Yeah, I'm bipolar too. I've been clean for 2 years, was a 20 year addict (I'm 40 and started using opiates in my late teens)\nI figured out after getting clean thay I have a lot of mental issues I was self medicating for. \nI'm not saying subs will turn you into an asshole, everyone is different. I was on them long term, for 2 years. Even lifelong friends were telling me I was different on them, and they knew me as an addict for years and years!!! I think they just removed my filter. I'm generally a shy kinda guy who doesn't speak his mind, but when I was on subs I let whatever I was thinking fly, sometime I should've probably bitten my tongue. Ya know, you should have a good balance in life of opening your mouth and I went from zero (interanlizing everything that made me upset instead of talking about it) to 100 real fast. \nI don't know that a taper would change you, but 2 years on them definitely fucked my head. Just my experience. Everyone is different.", "2_Subreddit": "opiates"}], "dwx3bq6": [{"0_Comment Submission": "Opiates don’t feel the same after being clean and off anti-depressants", "1_Text": "Thank you! I've been clean for 2 years. I lurk this subreddit to offer advice and/or help people. Believe me, I understand the disease. Funny thing is, I quit smoking cigarettes for 7 years, but as soon as I got to rehab to get clean, I started smoking again. I guess my brain is always going to want those pleasure centers rewarded, whether it's opiates or nicotine, lol! For no I'll take the cigs over an opiate habit tho, plan on quitting them again soon. \nAnyhow.... best of luck. I hate to sound cliché, but you'll get clean if you really want it! After nearly 20 years, I realized I wasn't getting any younger and was just sick of the life. Besides the cigarettes (it really pisses me off I started again after 7 years quit!) life is so much better on the other side of that shit. \nBelieve me, I still think of getting high. Stressful days.... depressing days.... but I just don't act on my thoughts. It's that easy. Just don't do it. Definitely harder in the beginning, but it gets easier over the course of time. Best of luck to you!", "2_Subreddit": "opiates"}], "dwx7x4z": [{"0_Comment Submission": "Why do you go on one last binge before rehab?", "1_Text": "When I was in rehab, people told me they loaded up before coming in so that there would be more drugs in their system, that way they got more methadone or suboxone for the taper. \n\nSeemed kind of counterproductive to me. \n\nI went in on day 3 of withdrawal and refused the taper, because I felt like there was no point in introducing more opiates into my system when I was already on day 3. \n\nBut that's just me.", "2_Subreddit": "opiates"}], "dwxhzmd": [{"0_Comment Submission": "I’m strongly considering starting the path to becoming a DH. What advice would you give to me?", "1_Text": "Agreed. I became a D23 DH relatively quickly. I was a DH for 3 years after that, then quit Home Depot and went back into the construction industry. In retrospect, all of the extra responsibility was not worth the extra $2/hr I got for the title of department supervisor. Would I do it again? Nope, would have just stayed a flooring specialist. Not worth it at all.", "2_Subreddit": "HomeDepot"}], "dwxiiuc": [{"0_Comment Submission": "transferring to new district, can i negotiate my pay with the new store.", "1_Text": "I transferred stores and they took $2/hr from me. *different market* bullshit. Nice way to keep your associates happy, huh? I moved states, so I guess I'm lucky I could just get a new job in a new state at a different store (had to switch departments) but yeah.....\n\nMulti million dollar corporate giant had to cut out $80/week to someone. \n\nShould add I was a DH, certified in 3 departments, and qualified on reach truck, fork lift, and (I forget the name of the thing with the flat back you get appliances and doors down with)\n\nI love all of the people who drink the orange kool-aid who thinks this company actually \"cares\" about you.", "2_Subreddit": "HomeDepot"}], "dwxiy2e": [{"0_Comment Submission": "Customers who refuse to believe you", "1_Text": "Former D23 DH here. I told all of my associates to recommend that folks would buy a few extra tiles (or keep a few extra) when the job was done, so 6 years down the road when one cracks or breaks and they wanna replace it, we wouldn't have to deal with the fact that by then it will probably be discontinued. They change the tile selection so fast in that place.", "2_Subreddit": "HomeDepot"}], "dwxj2uc": [{"0_Comment Submission": "Customers who refuse to believe you", "1_Text": "Yup... ANY flooring I do, I recommend they keep a few pieces stashed away somewhere just incase. Someone drops a heavy mixing bowl or something and cracks a tile 5 years down the road....", "2_Subreddit": "HomeDepot"}], "dwxxc6m": [{"0_Comment Submission": "Can you IV these 5 mg Oxys", "1_Text": "*old man rant*\n\nYou kids are lucky to have Reddit and Bluelight and stuff...\n\nBack in my day (shakes fist at sky) we had to actually try stuff and find out the hard way what worked and what didnt....\n\nAs to IVing them, they're loaded with filler. \nJust pop a handful and chew em up and wash em down with your beverage of choice.", "2_Subreddit": "opiates"}], "dwxyvu1": [{"0_Comment Submission": "Can you IV these 5 mg Oxys", "1_Text": "Yeah, I'm 40. I was in high school when Internet came out. I graduated in 95... but even when it first came out, not everyone had it. It was expensive. Basically all the rich kids had it. Wasn't until late 90's/early 00's until it was commonplace in most households.", "2_Subreddit": "opiates"}], "dwxz0dg": [{"0_Comment Submission": "Can you IV these 5 mg Oxys", "1_Text": "I'm 40, but didn't really have access to Internet back in the day", "2_Subreddit": "opiates"}], "dwxz7ga": [{"0_Comment Submission": "Possible bipolar treatment?", "1_Text": "https://www.psychiatryadvisor.com/mood-disorders/buprenorphine-improved-resistant-depression-outcomes/article/368764/", "2_Subreddit": "suboxone"}], "dwxz9ai": [{"0_Comment Submission": "Possible bipolar treatment?", "1_Text": "100% agreed. I was on subs for 2 years. No emotion. Just felt like a zombie. They also made me really, really mean.", "2_Subreddit": "suboxone"}], "dwy00jv": [{"0_Comment Submission": "Can you IV these 5 mg Oxys", "1_Text": "Meh, we're not old!!! I was on drugs for 20+ years of my life, got clean 2 years ago.... I just lurk this reddit to see what's up with the drug scene nowadays.... fent shit, fake pressed pills....it's a whole other ball game these days. I feel great, and am considering this \"phase 2\" of my life. Did the drug thing for a long time, now checking out the sober thing. I still smoke weed, but that's not a drug to me. Basically I don't do opiates anymore, they're my downfall. Other things like some Molly here and there, or some coke here and there I can handle and do in moderation. But pills or H? Forget about it. I have no self control. Again, I refuse to admit I'm old, lol. I feel better now than I've ever felt!", "2_Subreddit": "opiates"}], "dwy0670": [{"0_Comment Submission": "30s Drought", "1_Text": "You guys pay $50 for an oxy 30? Am I reading this correctly?", "2_Subreddit": "opiates"}]}], "1_submissions": [{"86o1vt": [{"0_Title": "Good song.", "1_Text": "Thanks!!! Would love to get out of PA and hit some east coast cities/areas.", "2_Subreddit": "opiates"}], "89taya": [{"0_Title": "This is my band, The Mongols. We're from northeast PA, and are looking to play more shows.", "1_Text": "Thanks!!! Would love to get out of PA and hit some east coast cities/areas.", "2_Subreddit": "punk"}]}]}]}