{"cellxor10": [{"0_comments": [{"dn3ho3z": [{"0_Comment Submission": "Unexpected Phish reference in People V. O.J. Simpson", "1_Text": "Dude I caught this too when I first watched it shortly after it aired! have a pic on my phone somewhere I took that's identical to yours. Loved it. \n\nE- uploaded one of the 3 I apparently took of it https://imgur.com/lmTJHo8", "2_Subreddit": "phish"}], "dn3kzw6": [{"0_Comment Submission": "My gf made a Death Star piñata for my son's 6th birthday. I actually let him destroy it. In tears I said, \"Great shot kid that was one in a million\"", "1_Text": "...What is this???  A DEATH STAR FOR ANTS???", "2_Subreddit": "StarWars"}], "dn3tbkw": [{"0_Comment Submission": "My gf made a Death Star piñata for my son's 6th birthday. I actually let him destroy it. In tears I said, \"Great shot kid that was one in a million\"", "1_Text": "Wow... never knew that sub existed.  Thanks.... and looks like someone already took your advice, and not the OP haha", "2_Subreddit": "StarWars"}], "dnqxqoi": [{"0_Comment Submission": "how badly do you want to cum in my tight asshole? (f)", "1_Text": "yes", "2_Subreddit": "asstastic"}], "domjqks": [{"0_Comment Submission": "'Evedence that men need to stfu!'", "1_Text": "I was switching sides at every turn.  That's good and effective writing IMO.", "2_Subreddit": "facebookdrama"}], "dqjtkge": [{"0_Comment Submission": "I don't think it gets better than this, guys 😉", "1_Text": "Ha, Exeter City is my jam for the last 6-7 years of career mode.", "2_Subreddit": "FifaCareers"}], "dqy0fs7": [{"0_Comment Submission": "Someone sent me this. Thot you guys would like it.", "1_Text": "Thinking maybe it's a (purposely?) misleading title and someone sent them the pic of the messages, not the messages themselves?", "2_Subreddit": "niceguys"}], "dqy17k2": [{"0_Comment Submission": "Someone sent me this. Thot you guys would like it.", "1_Text": "Yeah, who am I kidding.", "2_Subreddit": "niceguys"}], "dr8f8or": [{"0_Comment Submission": "The post was deleted shortly after she read the comment.", "1_Text": "Dude, there's no depth between the shorts and her skin...", "2_Subreddit": "quityourbullshit"}], "dra5y0p": [{"0_Comment Submission": "The Last Jedi Release Day Megathread - Spoilers!", "1_Text": "At first I was really thrown off by the puppet Yoda, but then I started to love it/that they did it.  So that was cool with me.  I also really love the intention of showing Leia being strong with the force even if it hadn't been explored before, but thought that scene was ridiculous and kinda hated the execution of how they showed that.", "2_Subreddit": "StarWars"}], "dra6ioz": [{"0_Comment Submission": "The Last Jedi Release Day Megathread - Spoilers!", "1_Text": "This is... GOLDEN.", "2_Subreddit": "StarWars"}], "dsgp3x7": [{"0_Comment Submission": "I thought I might never see someone this badass in real life. I was wrong", "1_Text": "I eventually figured it out just fine, but with the general theme and feel going on I originally read the ending two lines as \"...And I love my cousin, If this offends you, I don't care\"", "2_Subreddit": "iamverybadass"}], "dtlj89o": [{"0_Comment Submission": "Why is there no information on the call made after 911?", "1_Text": "Sounds like Kyle interpreted it as that he was hiding due to the warrant, hence why Kyle held back the information that he was just on the phone with Brandon from the cop.  Not that, that was in fact the case of what he was doing.  The cop was also apparently unaware that Brandon had made the 911 call in distress, so Kyle too was unaware of it and only knew that his brother had run out of gas prior to that second phone call.", "2_Subreddit": "brandonlawson"}], "dtpqd41": [{"0_Comment Submission": "Stepmom", "1_Text": "I know this is the wrong place to try to mention something that sounds unbelievable, but my dad did actually leave my older sister a voicemail that casually ended with a quick mention that he'd just \"decided\" with his girlfriend that they were going to get married.", "2_Subreddit": "Badfaketexts"}], "dtpqj6a": [{"0_Comment Submission": "We aren't allowed to wear the same dress twice", "1_Text": "Not sure why the dude specifies 'straight men,' cuz even if they might notice, I'm pretty sure gay dudes don't care at all either.", "2_Subreddit": "gatekeeping"}], "dtpqn3h": [{"0_Comment Submission": "Stepmom", "1_Text": "Lol overall yeah I'd say he's fairly close with both my sisters, my brother and I", "2_Subreddit": "Badfaketexts"}], "dtpr4vq": [{"0_Comment Submission": "Stepmom", "1_Text": "Ha, well that does sound worse, but I got to go to the Bahamas! And act as a middle man between my father (who thought nothing was wrong)/his new wife (who is a genuinely great lady), and my two sisters who seemed savvy enough to suicide bomb the entire resort of Atlantis to finally feel like they'd been heard.  Good times.", "2_Subreddit": "Badfaketexts"}], "du2pl4d": [{"0_Comment Submission": "BOLD predictions about 2018 box office?", "1_Text": "I guess I've been out of the loop recently regarding people's general consensus for something like this, because I thought you were being sarcastic here with this(and I'm still not sure I'm comfortable thinking you're serious, tbh).  Cuz, while this is quite a unique scenario considering we're actually talking about the fourth and fifth installments in a series overall, it does feel like a classic example of a movie greatly over performing compared to its relative expectations being followed by a sequel that is indeed successful but by many is deemed a failure due to unreasonably high adjusted initial expectations and not being able to top its predecessor or come close to even matching it.  \n\nMaybe it is a bold prediction against the general consensus, but I wouldn't be crazy surprised with a 38+% drop in WW numbers between the two.  Not at all trying to say your prediction doesn't qualify for a bold prediction- but agreeing with you overall with it, I'd say.", "2_Subreddit": "boxoffice"}], "dukeia0": [{"0_Comment Submission": "Black Panther tops The Last Jedi 4-day opening with $242M, 2nd highest all-time. (Tues AM Update) [Domestic]", "1_Text": "I don't think it's about studios being able to replicate what BP is doing so much as getting to a place where they view potential (big budget) projects starring/directed/written by minorities as equally likely to be successful as ones fronted by white guys.  And having a movie that packs all those in one putting up Star Wars-esque opening weekend numbers should definitely help push us a little bit towards that ideal", "2_Subreddit": "boxoffice"}], "dvhx7t5": [{"0_Comment Submission": "Help me find an old show from random snippets of memory", "1_Text": "3/27/92 13x13 Club Charlotte, NC looks to have the Hood with a fans T-Shirt references. http://phish.net/setlists/phish-march-27-1992-13x13-club-charlotte-nc-usa.html?highlight=250", "2_Subreddit": "phish"}], "dvhy5rl": [{"0_Comment Submission": "Help me find an old show from random snippets of memory", "1_Text": "Yeah I was thinking it being filler on another tape was pretty likely.  Good stuff man!", "2_Subreddit": "phish"}], "dvhyago": [{"0_Comment Submission": "Help me find an old show from random snippets of memory", "1_Text": "Yeah that makes sense.  I gave the Hood a listen on Phish Tracks just now and you must have really worn the tape down cuz your quote is almost verbatim what Fish says haha.", "2_Subreddit": "phish"}], "dvhywq4": [{"0_Comment Submission": "SHALL OW WA TER", "1_Text": "The fact this is using tiles that should act like a template make this so much more frustrating for me.", "2_Subreddit": "keming"}], "dvnv60o": [{"0_Comment Submission": "Mindsets: The Growth Mindset vs Fixed Mindset", "1_Text": "Really shouldn't be giving this video any more views.", "2_Subreddit": "ShitCosmoSays"}], "dwgokyt": [{"0_Comment Submission": "Dude, you have no idea I did like so much drugs is college.....", "1_Text": "Rehab group discussions can literally just be people one-upping stories/having a big-dick roundabout.  Like people explaining why they deserve to be in rehab more than everyone else there.", "2_Subreddit": "opiates"}]}], "1_submissions": [{"4l3vp6": [{"0_Title": "Falcon (albeit 2-Star) Info - If It hasn't been Shared by others yet...", "1_Text": "Dude I caught this too when I first watched it shortly after it aired! have a pic on my phone somewhere I took that's identical to yours. Loved it. \n\nE- uploaded one of the 3 I apparently took of it https://imgur.com/lmTJHo8", "2_Subreddit": "ContestOfChampions"}]}]}]}