{"Kriminalmisfit": [{"0_comments": [{"dhh6jl8": [{"0_Comment Submission": "Traveling as an addict", "1_Text": "Dude i love off with their heads. Saw them play twice. And algernon cadwallader that sounds sick as fuck at a house show at 6 am. The fest is fucking awesome.", "2_Subreddit": "opiates"}], "dhj3dc7": [{"0_Comment Submission": "Try me", "1_Text": "They honestly suck", "2_Subreddit": "opiates"}], "dhjokip": [{"0_Comment Submission": "Sierra Ranch Apartments.", "1_Text": "That taco truck is the shit, i did get robbed at gunpoint right on that corner though a few years back. Its a bit of a shady area but not too bad.", "2_Subreddit": "sanantonio"}], "dhs3t1l": [{"0_Comment Submission": "NEED HELP! SHOULD I GO TO ER MISSED FIRST SHOT IN HAND!", "1_Text": "When I miss I experience a histamine reaction. Swelling, itching and a slight though sometimes moderate burning. Youre fine. Ive hit an artery before and while it was awful for two weeks it healed on its own. You cannot mistake the pain of an artery. Youll feel pain (starting when you push the plunger down) in your fingers or toes.. Somewhere not immediately where youre iv'ing. It hurt ao bad for me that i almost didnt even want to finish the shot haha. (Almost)", "2_Subreddit": "opiates"}], "di4d8fa": [{"0_Comment Submission": "Are the any musicians in here or people that identify with alternative/punk/DIY culture? Travelling kids? I am putting together a zine and looking for contributions.", "1_Text": "hey man i think what you are doing is really fucking cool, from a fellow travel kid/ opiate head. What is your zine called?", "2_Subreddit": "opiates"}], "di7txdw": [{"0_Comment Submission": "Heroin Epidemic as Inspiration for 1%er Haute Cuisine, the only thing more tasteless is the food.", "1_Text": "They should lace that balsamic oil with fentanyl", "2_Subreddit": "opiates"}], "di7u4fz": [{"0_Comment Submission": "Just got a box of these for crps and they don't help at all.", "1_Text": "Gumming them is probably safest. I had the 100 mcg/hr patches and i would just chew a small sliver and stick it on my gum. Leaving the saliva in your mouth, cuz the fentanyl absorbs buccally.", "2_Subreddit": "opiates"}], "dinpuyv": [{"0_Comment Submission": "Roll call sub has been shut down", "1_Text": "Fucking assholes", "2_Subreddit": "FuckingTweakers"}], "diso81e": [{"0_Comment Submission": "When your son passes out on your deck", "1_Text": "Aw, you even blocked out the face of a caterpillar. How considerate.", "2_Subreddit": "trashy"}], "diw3mg6": [{"0_Comment Submission": "Today is International Harm Reduction Day", "1_Text": "I am in missouri with no way of getting narcan, how can i get it sent my way?", "2_Subreddit": "Drugs"}], "diyujay": [{"0_Comment Submission": "Just sound it out (got at a yard sell)", "1_Text": "My dad grew up at the same time and fits every other descriptor you used for yours as well. Must actually be a Missourian thing? We live in Northern KCMO. Could just be a Northern KC thing if your dad is from up here as well.", "2_Subreddit": "trashy"}], "diyuwup": [{"0_Comment Submission": "Priorities...", "1_Text": "They were a friend of mine's cousins.. She is absolutely distraught over this..", "2_Subreddit": "trashy"}], "djhv5e3": [{"0_Comment Submission": "how to find heroin chic GF (shitpost)", "1_Text": "Furthermore, what kind of sicko would waste their dope on someone who was already alseep?", "2_Subreddit": "opiates"}], "djjifus": [{"0_Comment Submission": "I'm coming off prescription codeine and i'm terrified of how the world might be without it", "1_Text": "Don't try heroin either", "2_Subreddit": "offmychest"}], "dkvjx2c": [{"0_Comment Submission": "TREK", "1_Text": "I saw this in salt lake city waiting for the train. Fucking killer spot.", "2_Subreddit": "Bombing"}], "dkwjqck": [{"0_Comment Submission": "TRE REST IN PEACE", "1_Text": "Brings a tear to my damn eye, one love kid. From one writer to another.", "2_Subreddit": "Bombing"}], "dkwjw5g": [{"0_Comment Submission": "The Heroin makes you skinny MYTH..", "1_Text": "Well for one, all metabolisms are different.. Personally, when i'm actively using i'm spending just about all my money on dope, and the rest of the time i just forget to eat when i am on heroin. I always lose a few pounds while i'm on it then in the following weeks end up filling the void with food so i pack on the pounds and look fatter than when i initially started.", "2_Subreddit": "opiates"}], "dkwk1k5": [{"0_Comment Submission": "Quick Question for my opiate related deviant sexual proclivities", "1_Text": "Special ed? These niggas smart as hellll b.", "2_Subreddit": "opiates"}], "dkwy359": [{"0_Comment Submission": "Ask Me Hep C Questions", "1_Text": "Is it possible to contract hepc by sharing a needle between 2 people that are clean. Or by using a needle that has been used (by me- no hep c) and left sitting for a while with a bit of blood still in it.", "2_Subreddit": "opiates"}], "dn91wbj": [{"0_Comment Submission": "Clinical trial...am I dreaming?", "1_Text": "Can you link us to the study op?", "2_Subreddit": "opiates"}], "drz1zu8": [{"0_Comment Submission": "Catching out in socal", "1_Text": "Hey i am here in loma linda trying to get east to tucson. Does anyone have any info about eastbound train stops?", "2_Subreddit": "vagabond"}], "dthxrr4": [{"0_Comment Submission": "7 months and 12 days clean and my brain is glorifying my opiates use right now, please tell remind me what it’s really like?", "1_Text": "Man i'm sitting here on day 1 after a big relapse wishing i was where you are at. Fuck hanging out with selfish \"friends\" and people you really don't like, just to get well. Fuck not talking to anyone that used to care about me because i'm too busy hustling and getting high. Fuck not being able to find your vein, waking up sick, and seeing your sober friends pass you up in life while you are still struggling. I'm rooting for you homie you can do it.", "2_Subreddit": "opiates"}], "duccbex": [{"0_Comment Submission": "Anyone go to love gathering in AZ? Looking for missing friend", "1_Text": "That would be awesome please do ask for me. I am anxious as fuck about this. Here's a link to her Facebook https://www.facebook.com/colbie.jones.5855", "2_Subreddit": "vagabond"}], "duwtddz": [{"0_Comment Submission": "Everyone doing toss and wash..", "1_Text": "I am a beverage concocter personally, and prefer to mix k ratom with some hot coffee or cranberry juice and slug it down. I can't toss and wash just because of the dryness of the powder.. it gets all over my mouth and makes me gag even with a drink.", "2_Subreddit": "kratom"}], "dwlu8se": [{"0_Comment Submission": "Epidemic...I feel like our government (US) couldn't of made the epidemic much worse if they tried", "1_Text": "You're the one that sounds dumb dude. The underlying reason opiates are such a huge crisis is the bullshit social stigma and  mismisinforman, lies. Statistics are that your kids are likely to be addicted to opiates someday maybe you'll tell them to just keep it in the fucking dark lol", "2_Subreddit": "opiates"}]}], "1_submissions": [{"6aklkr": [{"0_Title": "Traveling as an addict", "1_Text": "Dude i love off with their heads. Saw them play twice. And algernon cadwallader that sounds sick as fuck at a house show at 6 am. The fest is fucking awesome.", "2_Subreddit": "opiates"}], "6bbcef": [{"0_Title": "Kansas city trains", "1_Text": "Dude i love off with their heads. Saw them play twice. And algernon cadwallader that sounds sick as fuck at a house show at 6 am. The fest is fucking awesome.", "2_Subreddit": "vagabond"}], "6e5qi7": [{"0_Title": "Bulk kratom websites", "1_Text": "Dude i love off with their heads. Saw them play twice. And algernon cadwallader that sounds sick as fuck at a house show at 6 am. The fest is fucking awesome.", "2_Subreddit": "opiates"}], "6k1ing": [{"0_Title": "What to do with locked ipad", "1_Text": "Dude i love off with their heads. Saw them play twice. And algernon cadwallader that sounds sick as fuck at a house show at 6 am. The fest is fucking awesome.", "2_Subreddit": "opiates"}], "7pb8sd": [{"0_Title": "(Request) riding trains through the southwest usa and lost my food stamp card", "1_Text": "Dude i love off with their heads. Saw them play twice. And algernon cadwallader that sounds sick as fuck at a house show at 6 am. The fest is fucking awesome.", "2_Subreddit": "Random_Acts_Of_Pizza"}], "7xthop": [{"0_Title": "Anyone go to love gathering in AZ? Looking for missing friend", "1_Text": "Dude i love off with their heads. Saw them play twice. And algernon cadwallader that sounds sick as fuck at a house show at 6 am. The fest is fucking awesome.", "2_Subreddit": "vagabond"}], "7xthoq": [{"0_Title": "Anyone go to love gathering in AZ? Looking for missing friend", "1_Text": "Dude i love off with their heads. Saw them play twice. And algernon cadwallader that sounds sick as fuck at a house show at 6 am. The fest is fucking awesome.", "2_Subreddit": "vagabond"}]}]}]}