{"bizzarepeanut": [{"0_comments": [{"dw46cp7": [{"0_Comment Submission": "How the fingers indent the skin in this Bernini sculpture", "1_Text": "I would guess that was probably the rampant syphilis that ran throughout Europe after it was brought back from the Americas.", "2_Subreddit": "interestingasfuck"}], "dw8zs3i": [{"0_Comment Submission": "I think you’re dead", "1_Text": "Hey dude, I feel you. I've been there in the past and still struggle to feel as though life is worth living a lot of the time. It might be lame but I try to focus on the things I enjoy and the people who need me. I've lived through too many people dying before their time and I know how devastating it is to those around them. I know you might just be posting some nihilistic shit on Reddit and don't actually feel this way but if you do just know that there are people whose lives will never be the same without you. Even if you don't have much family or many friends (not saying this is the case for you) there are people whose day you have made better and if you can just hold on I know it's cliche but it can get better. \n\nI feel as though my life has been a lot tougher due to depression, anxiety, addictions, and other hardships but i KNOW (for me at least) I can appreciate the ups and the good things in life so much more cause I've been at the depths of despair and it makes me appreciate the best parts of life. The awe I have about the world surprises me at times and I've had times that I never could have thought I'd ever be able to feel that. \n\nI know it's stupid and I'm sorry about the novel I wrote but if you are for real about your feelings about life pm me. I get it, I can't help you like a professional might be able to but I can listen and I honestly do care because I understand how insufferable living can be at times.", "2_Subreddit": "nosleep"}], "dw9yb76": [{"0_Comment Submission": "Chefs of Reddit, what do we all need to stop ordering?", "1_Text": "Oh god, people with a million severe allergies. One time a server at the restaurant where I work had a woman who was severely allergic to several things. \n\nSo the server went through ingredients and made sure everything was okay for her and not cross-contaminated in the kitchen. The server told her we couldn't vouch for it not being cross-contaminated at the distributor. The woman says to the server, \"Oh that should be fine.\" \n\nSo this woman goes into anaphylactic shock almost immediately. The server called an ambulance and was horrified because the allergy woman's friends were all laughing and joking about how \"this happens every time we go out to eat.\" If you almost die every time you're at a restaurant maybe stop going to restaurants. Like what the actual fuck.", "2_Subreddit": "AskReddit"}], "dwa8ss7": [{"0_Comment Submission": "Chefs of Reddit, what do we all need to stop ordering?", "1_Text": "In your circumstance it's a little different. The restaurant I work at actually has an entire gluten free menu (and have for a long time before the gluten free \"fad\".) I can tell you that every restaurant I've worked for takes allergies extremely serious. The problem is when it's a life or death thing and the guest essentially say I'm so allergic to such and such but when we tell you we can't guarantee it to be free of \"allergen\" they says it's fine. Trust me, we don't want to kill you.  \n\nIf you are gluten free and they offer gluten free items they should already be prepped in an area that will allow it to be free from cross-contamination. The problem isn't you, it's people who say things like: I'm allergic to tomatoes or pickles or something just because they don't like them.  Generally we can tell who is being sincere about an actual allergy but we still take care to treat every allergy seriously. This means we have to take extra care not to cross-contaminate items that really don't need to be and this creates problems for speed or service and accuracy. What you say that you are doing is the correct way to go about it, saying that you are gluten free because you have celiacs should be enough at places that offer gluten free items. If you go to a place that doesn't specifically offer them may be a little different. This is just because we were trained in a certain way and know what celiacs is since we have so many items and they may not be aware of that and may understand allergies more easily. Regardless, most places should treat it like any other allergy as long as you are clear about your needs. \n\n\nTL;DR: if you say you are gluten free, have celiacs, or a gluten allergy your food should be handled in the proper manner to avoid cross-contamination if it is an establishment you feel comfortable eating at.", "2_Subreddit": "AskReddit"}], "dwagidb": [{"0_Comment Submission": "Chefs of Reddit, what do we all need to stop ordering?", "1_Text": "I don't know what type of restaurants you go to but that's not something I've ever seen in a restaurant. I mean I don't like tomatoes but I've never had a problem asking for something without them at a restaurant unless it was something already prepped into that dish. If that's the case then I just get something else. Maybe your friends or family do this but this creates an issue for people who actually have allergies. Generally we want to keep your business and not blind side you into eating something you don't like because then we lose your business.  In such a competitive industry that's just bad business.", "2_Subreddit": "AskReddit"}], "dwcgfb7": [{"0_Comment Submission": "Employees of IKEA, what are some of the worst family meltdowns you have seen?", "1_Text": "You went to one of those too? This lady was fucking insane, she used to lock me in the basement because I couldn't sleep during nap time and  apparently didn't pretend to be sleeping convincingly enough as a 3 year old.", "2_Subreddit": "AskReddit"}], "dwclmru": [{"0_Comment Submission": "Employees of IKEA, what are some of the worst family meltdowns you have seen?", "1_Text": "That's disgusting. The woman who had the daycare I went to was an acquaintance of my mother and I'm not sure if she still has a daycare but I know she never got in legal trouble. \n\nI still hate jelly because she knew I didn't like it so she would make different food for the others but made me eat it every day and if I refused to eat would lock me up for hours. In retrospect I was lucky because to my mother's credit once I did mention the basement thing she immediately pulled me out. She was very upset that I was there for so long without ever mentioning anything but since I was so young I thought it was normal. She was a single mother so I know it was really hard to pull me out while working full time. Parents, listen to your children, don't just take the word of an adult of your child without even looking into it. I'm sure that other children must have mentioned the abuse but nothing came of it because they were just kids. \n\nEdit: I hope you don't have too much psychological damage due to the abuse. I'm not sure how old you are but I'm in my late 20s. I had a rough childhood in other respects (abusive step father, poverty, and sexual abuse) so I have been dealing with long term trauma and I'm not sure how the abuse would have affected me as an adult has it been the singular abuse. I hope it hasn't hurt your ability to trust people and other things that affect your every day life. If it has I hope that you find some peace.", "2_Subreddit": "AskReddit"}], "dwcngv7": [{"0_Comment Submission": "Employees of IKEA, what are some of the worst family meltdowns you have seen?", "1_Text": "Well it clearly won't stop u/xxTurd", "2_Subreddit": "AskReddit"}], "dwcoln3": [{"0_Comment Submission": "For non-users: What it's like chasing the dragon", "1_Text": "Seriously fuck everything about that fucking \"recovery group\". They just replace one drug with another. Keep telling someone they will relapse without you and they eventually believe it when they are fed up with your bullshit and stop going it's still drilled into them almost like a cult, some might say.  So they relapse and go back to this group that tells you it isn't religious but 100% is. It works for some people and that's great for them I wouldn't tell them to stop if it works but it's bullshit that it's ingrained in the US justice system and studies aren't being done to further help addicts because there is already a \"solution.\" Too bad that \"solution\" has a lower success rate than doing NOTHING and quitting cold turkey.  And don't get me started on the shame factor. If I have to go to one more fucking funeral because someone couldn't handle the shame of having to publicly pick up another white chip I will fucking scream. \n\nIt's not even their practices and us-them mentality and cliquey bullshit that bothers me. It's the fact that they are the reason you have limited to no other options. Have fun trying to find a rehab or half way house that isn't totally infiltrated by AA. It's seriously detrimental to newly clean people to have them write every thing wrong they have ever done and their part in every \"perceived\" wrong done to them while they are at their lowest. NO, Courtney I won't write how I had also wronged my rapist or my abusive father, fuck off. \n\n/end rant\n\nEdit: No thanks to them telling me I'll relapse I have 6 years clean. So fuck their keep coming back, fuck their one day at a time, and fuck their we will be here when you're ready.", "2_Subreddit": "opiates"}], "dwfpzae": [{"0_Comment Submission": "Cousin (of a friend) Bridezilla", "1_Text": "Yeah I was gonna say, I haven't had a wedding yet but my family is huge and if I invited everyone on just my side of the family it would probably top 200.", "2_Subreddit": "ChoosingBeggars"}], "dwfrv6u": [{"0_Comment Submission": "Cousin (of a friend) Bridezilla", "1_Text": "Yeah, I mean I've been dating my boyfriend for 8 years so we have talked about it before and I'm not planning on inviting my entire family. We both want a smaller wedding. I'd probably do something like my cousin did last year. She had a small ceremony with immediate family and her best friends and then just rented a hall like a week later for everyone else to come. Nothing fancy, buffet style and a dance floor. It was a lot of fun. I went to say goodbye to her and her husband while she was dancing and she picked me (I'm very petite) and I essentially crowd surfed out of them wedding. Probably my best exit to date.", "2_Subreddit": "ChoosingBeggars"}], "dwg0x2f": [{"0_Comment Submission": "The Ancient Greeks had no word to describe the color blue. What are other examples of cultural and linguistic context being shockingly important?", "1_Text": "I remember looking at one of my boyfriends old uniforms or undershirts from the army and it's referred to as \"olive drab\" which just sounds like the worst color. I actually love olive green but they couldn't have chose a less appealing name.", "2_Subreddit": "history"}], "dwg17uk": [{"0_Comment Submission": "The Ancient Greeks had no word to describe the color blue. What are other examples of cultural and linguistic context being shockingly important?", "1_Text": "I read somewhere interestingly enough that people who had grown up with black and white TV tended to dream in black and white while people who grew up with color TV dream in color. This makes me wonder about people before TV or pictures, I would assume they would dream in color but who knows. I'll see if I can find the article.\n\nEdit: not sure if they same article but [this one](https://mobile.nytimes.com/2008/12/02/health/02real.html) talks about it as well.", "2_Subreddit": "history"}], "dwkjvnk": [{"0_Comment Submission": "TIL Pornhub displayed a message that said it automatically shared the video you were watching on social media for April Fools", "1_Text": "Pornhub has successfully shared video \"hung studs\" to contact \"mom.\" ✅", "2_Subreddit": "todayilearned"}], "dwlr3oe": [{"0_Comment Submission": "My friend's tattoo...", "1_Text": "These wolves won't seem to heel.", "2_Subreddit": "badwomensanatomy"}], "dwm93kf": [{"0_Comment Submission": "Parents of Reddit; who was the worst girlfriend or boyfriend your kid brought home? What is the story?", "1_Text": "Just gotta say that he seems fucking awful but I do agree with not going to AA. It has infiltrated our justice system and is a detriment to anyone trying to get sober. The statistics for remaining sober/clean in AA/NA /any of the fellowships has an abhorrent success rate. It shouldn't even be an option to have AA mandated instead of sentencing because it's a FUCKING CULT. We all look weird at Scientology for their views on psychiatry but AA is no better. \"Just try praying.\" \n\nSorry I have really strong feelings about \"the friends of bill\" I've done plenty of fellowshipping and all it got me was plenty of relapses before I got out of that toxic group and some dead friends to boot.", "2_Subreddit": "AskReddit"}], "dwnj1l5": [{"0_Comment Submission": "Anyone have a favorite dope fiend that they admire/idolize from the past or present?", "1_Text": "Oh man I love Billie holiday grew up on her, Etta James, and Nina Simone. I also love Elliott. Elliott smith though probably is just my all around favorite. He has amazing drug metaphors. He just has a genuine knack for melodies and words. I have a hard time listening to him now though unfortunately since he was my go to junk music and even though it's been 6 years I still get sad (sadder) listening to him.", "2_Subreddit": "opiates"}], "dwnklzr": [{"0_Comment Submission": "Anyone have a favorite dope fiend that they admire/idolize from the past or present?", "1_Text": "Oh he definitely is crazy talented. He was self taught so his songs tend to be hard to cover because his chords aren't \"traditional\". But yeah I love jazz and blues. It definitely had a huge impact on me since I'm a pianist and singer. I get a lot of my influence from old school blues. It just has such an amazing feel to it. Also love jazz piano with its crazy 5 finger chords and shit.", "2_Subreddit": "opiates"}], "dwnpa7q": [{"0_Comment Submission": "Everybody loves April Fools pranks", "1_Text": "Well, that nurse is definitely going to get fired....", "2_Subreddit": "nosleep"}], "dwu5f5x": [{"0_Comment Submission": "Parents of Reddit; who was the worst girlfriend or boyfriend your kid brought home? What is the story?", "1_Text": "It honestly just makes me sad due to the fact that the other options are so sparse for recovery. I had to search to find a non-affiliated relapse prevention group. I consider myself one of the lucky ones because I'm still clean almost 6 years later but there are plenty who are struggling and have no where to turn because the only option is toxic to them.", "2_Subreddit": "AskReddit"}], "dww2eot": [{"0_Comment Submission": "actually it sounds exactly like you're telling us not to even try", "1_Text": "It honestly reminds me of my personal experience with an eating disorder. It's not a moral failing so much as disorder. Trust me I know, trying to eat healthy and the correct amount of calories a day is FUCKING hard. This does not mean that it isn't possible. Although I have the opposite experience if I am not conscientious about my diet and why I am eating or not eating I will inevitably slip back into bad habits. I know some people may think, and I've had people say things to me like, \"oh what a tragedy that you can't gain or keep weight on.\" And honestly fuck those people.\n\nDon't get me wrong, I'm not saying having an eating disorder is a choice or even your fault. You start to be at fault when you continue to do nothing about it. It becomes your problem and nobody else's because once you realize that you have a problem (and have the resources to do something about it) then you either start making excuses and say it is natural and you are just as healthy or you start taking initiative of your health. Yes, you may have bad days, you may have relapses, but you can't take that as a reason as to why it's impossible to do. \n\nIt has taken me years to recover from the ravages anorexia had on my body. I still have bad days and I still have those thoughts around food sometimes. This does not mean I can take all of that work I did and slip back into old ways because it's easier to tell myself it's just how I was born.\n\nEnd rant/\n\nEdit: a couple of typos", "2_Subreddit": "fatlogic"}], "dwwe7vq": [{"0_Comment Submission": "Tonight I am going to bed at 8 o clock my time by choice.", "1_Text": "Fuck yeah, get it my dude! This is awesome, don't be upset with yourself, at least you're taking some initiative. Anytime I see someone running I really admire it because I FUCKING HATE RUNNING. I've been thin all my life and I used to be a dancer so when I had a two month break from dance in the summer I used to run to keep my stamina up for the fall. I literally never stopped liking it less and the famed \"runners high\" always eluded me. You're fucking awesome and this stranger will be rooting for you.  I look forward to hearing your updates on how this goes for you!", "2_Subreddit": "confessions"}], "dwxn19g": [{"0_Comment Submission": "My fringe doing the most to stop me growing it out", "1_Text": "I second this. I had bangs for a couple of years and I keep my hair short so I thought it wouldn't take too long to grow them out. I forgot about the curl factor. Every time I thought about just cutting them I looked at pictures of the beautiful curls they used to make. I stuck with it and they are awesome now!", "2_Subreddit": "curlyhair"}], "dwxntp4": [{"0_Comment Submission": "Lost a regular yesterday.", "1_Text": "This sucks. I'm sorry for your loss. Last year I lost two of my long time regulars at the bar. I was lucky enough to have been able to go to one of their wakes since I knew his son as well. That really sucks. I offer my condolences to you and her family.", "2_Subreddit": "bartenders"}], "dwyh2mo": [{"0_Comment Submission": "I think my sister gaining a considerable amount of weight made me get back into my eating disorder habits.", "1_Text": "I'm sorry about how this whole situation is making you feel. I know it doesn't make much logical sense. If you need to vent you can PM me.", "2_Subreddit": "eating_disorders"}]}], "1_submissions": [{"7zbvey": [{"0_Title": "My parents never locked the doors even on vacation", "1_Text": "I would guess that was probably the rampant syphilis that ran throughout Europe after it was brought back from the Americas.", "2_Subreddit": "PointlessStories"}]}]}]}