{"ddankk9523": [{"0_comments": [{"dtvdlgu": [{"0_Comment Submission": "11-14-16", "1_Text": "Can confirm, was a clingy mf'er, wished i had realized! Hah", "2_Subreddit": "opiates"}], "du6aag4": [{"0_Comment Submission": "Cant sleep, watching youtube when..", "1_Text": "That dollar bill tho...lol", "2_Subreddit": "opiates"}], "dukofc2": [{"0_Comment Submission": "How much dope do you go through in a week?", "1_Text": "Lucky! I went from a decent pill habit straight to smoking half a gram a day. I think the bth arpund my parts is pretty shit tho.", "2_Subreddit": "opiates"}], "dulbvv3": [{"0_Comment Submission": "Fentanyl/Oxy Question", "1_Text": "Ive grabbed blues off a few vendors and they are usually weak as fuck. They also use a binder that stays in your nose and makes for some pretty narly boogers lol.", "2_Subreddit": "opiates"}], "dulc00d": [{"0_Comment Submission": "It's snowing in the PNW. What are some cool TV series I can watch? I really love comedy and crime. But I'd love to hear about anything new and exciting. :)", "1_Text": "I liked parks and rec. Have you watched the ozarks on netfix yet? That show kicks ass.", "2_Subreddit": "opiates"}], "dw1hkl9": [{"0_Comment Submission": "Lol. Bout that life?", "1_Text": "When you finally manage to hustle enough to get well and the dboy says he just sold out.", "2_Subreddit": "opiates"}], "dw3djhh": [{"0_Comment Submission": "I puke everytime I smoke raw heroin?", "1_Text": "After every hit i spit and take a sip of water to get the taste out lol. Never had a problem", "2_Subreddit": "opiates"}], "dw4ouaf": [{"0_Comment Submission": "Walmart Return question...", "1_Text": "As for as the shorts go just walk in and rip some tags off other shorts. The lamp tho is prob a lost cause", "2_Subreddit": "opiates"}], "dw4v7v2": [{"0_Comment Submission": "Does anyone else on this sub trail M30s on foil?", "1_Text": "My buddy smokes fake m box's. Does it smell like some stank ass burnt popcorn?", "2_Subreddit": "opiates"}], "dw7e9oa": [{"0_Comment Submission": "Cambridge Analytica moving \"boxes\" out of their office before the search warrant", "1_Text": "Those boxes are fulk of doughnuts. They are anticipating them him getting caugh thus providing ample time to escape using said loading dock!", "2_Subreddit": "pics"}], "dw8w9yc": [{"0_Comment Submission": "This black sticky shit is pissing me off", "1_Text": "Make sure you tilt the foil slighly so it slowly runs down and try to use only enough heat to get it running.", "2_Subreddit": "opiates"}], "dw910yh": [{"0_Comment Submission": "Facial reconstruction on a child with Crouzon Syndrome", "1_Text": "What are you, a store manager?! Lol jk.", "2_Subreddit": "WTF"}], "dw913sw": [{"0_Comment Submission": "Facial reconstruction on a child with Crouzon Syndrome", "1_Text": "You mean cadavers arent alive inside living women.", "2_Subreddit": "WTF"}], "dwa63bj": [{"0_Comment Submission": "Facial reconstruction on a child with Crouzon Syndrome", "1_Text": "Not bad for department manager! I was with wal mart for about 4 years.", "2_Subreddit": "WTF"}], "dwaqcpg": [{"0_Comment Submission": "Is taking in 2,925mg of acetaminophen dangerous?", "1_Text": "Eat more bro...food i mean! I popped 12 5s/325s at once and was fine but im 6 2 200lb. I think you will be ok just dont make it a habit(lol).", "2_Subreddit": "opiates"}], "dwaqiqg": [{"0_Comment Submission": "Homies Down (shittypost)", "1_Text": "For real, especially if dude has kids. 20 years or a suspended sentence...he talkin.", "2_Subreddit": "opiates"}], "dwaqvn8": [{"0_Comment Submission": "nice depressing shitpost..at least i have you guys..right?:/", "1_Text": "Been there bro..shit im still kinda there but working on it the best i can. I gotta ask, are you even talking with this girl on the reg? I mean if you friends dipped on you they fuck em. Throw the hail mary at this chica and see if you can make it happen. Do me this one favor and shoot her a text. If you donno what to talk about try seeing what she has been watch on netflix or some shit bro. Anything to get some dialogue flowin. You got this man. I wanna update on this girl stat cause i know how you feel my dude. Its better to of tried and failed then to of never tried at all.", "2_Subreddit": "opiates"}], "dwar2e6": [{"0_Comment Submission": "Fuck everything basically. 5 script Ms", "1_Text": "Annnnndd its gone! Lol nice bro", "2_Subreddit": "opiates"}], "dwarhl1": [{"0_Comment Submission": "nice depressing shitpost..at least i have you guys..right?:/", "1_Text": "Damn brother sorry to hear that. How long have you known this girl? Has she always been this distant? Do you have class together or Anything like that?", "2_Subreddit": "opiates"}], "dwavtak": [{"0_Comment Submission": "A case for the memes", "1_Text": "Brock", "2_Subreddit": "opiates"}], "dwgm4bf": [{"0_Comment Submission": "Has anyone bought from sites like theses? Seems too good to be true...", "1_Text": "Is there a minimum order? Maybe get a visa gift card and pick like 4 up and report back to us if it worked or not haha.", "2_Subreddit": "opiates"}], "dwgmas4": [{"0_Comment Submission": "This is so sad. Poor girl.", "1_Text": "Poor mom.", "2_Subreddit": "opiates"}], "dwgmuqi": [{"0_Comment Submission": "Hottest Male Junkie", "1_Text": "You look more like a pearl necklace kinda guy", "2_Subreddit": "opiates_gonewild"}], "dwjxr4y": [{"0_Comment Submission": "What's your secret stash spot ?", "1_Text": "Hah i got the exact same safe! I keep a 9 in it tho", "2_Subreddit": "opiates"}], "dws3uto": [{"0_Comment Submission": "In love with a user", "1_Text": "Like everyone elae has said. Get out while you still can. The next chapter in this story is either you get beat to shit and robbed or straight up found in a ditch.  Im sorry to say there is no fairy tale ending to this one brother. Run for the hills!", "2_Subreddit": "opiates"}]}], "1_submissions": [{}]}]}