{"LonelyNeuron": [{"0_comments": [{"dqqx6tu": [{"0_Comment Submission": "What is something that someone said to you that is so stupid you thought they were joking?", "1_Text": "Sabbath is not a day, silly! It's a band.", "2_Subreddit": "AskReddit"}], "dqwdaw4": [{"0_Comment Submission": "What's the fastest way you've seen someone improve their life?", "1_Text": "Same thing here. However in my case I spent hundreds of BTC on the darknet. If I kept just a portion of them I would be a millionaire now. I literally can't sleep because of it sometimes and I can't stop thinking about what could have been. I feel exactly like you, that I missed the biggest and possibly only opportunity in my life to become a millionaire.", "2_Subreddit": "AskReddit"}], "dr1wn35": [{"0_Comment Submission": "How are you doing?", "1_Text": "I feel like shit and can't stop thinking about the fact that I wasted hundreds of bitcoins a few years ago that would nowadays be worth several million dollars. Now I'm living from paycheck to paycheck, working a 9-5 job that I'm fed up with and dreaming about how different my life could have been right now If I only held onto a tiny fraction of the bitcoins I had. Fuck!", "2_Subreddit": "AskReddit"}], "dr6qkqw": [{"0_Comment Submission": "To those of you who earn a good salary in a low stress job. What do you do?", "1_Text": "Wait, you sleep while driving a train?", "2_Subreddit": "AskReddit"}], "dsbdnzc": [{"0_Comment Submission": "We have survived. Nothing can stop us now.", "1_Text": "Same here. I bought 2000 trx at $0.01 and then 4500 more a bit later around $0.02. Although I'm happy with the returns (obviously) I really wish that I had at least a few thousand $ at the time to invest into tron. I could have been financially set for the next few years.", "2_Subreddit": "Tronix"}], "dsgsa4u": [{"0_Comment Submission": "What are your best “first date tips” for somebody starting the dating game late in life (late 20’s +)?", "1_Text": "Don't be loud and snotty.", "2_Subreddit": "AskReddit"}], "dsogao8": [{"0_Comment Submission": "[January 14, 2018] Daily Discussion", "1_Text": "Same here. I've been thinking we've hit the floor on multiple occasions during the last week and it would always crash straight through it each time. At this point I really don't think that $0.04-0.05 is out of question. I'll happily buy back once things settle down but I'm done watching the value of my portfolio plummet by the hour. Especially since I'm still up by a decent amount on my initial investment so I don't want to see it all disappear.", "2_Subreddit": "Tronix"}], "dsruflb": [{"0_Comment Submission": "[January 16, 2018] Daily Discussion", "1_Text": "I will probably get down voted for this but I really mean this is a good way. If you come to reddit looking for answers on what you should be doing with your money then you're doing it wrong. Reddit is one massive echo chamber, on one side (this subreddit) people will blindly defend tron no matter what happens and will downvote anyone who dares to say anything negative about it. On the other side (cryptocurrency subreddit) it's exactly the opposite, people will hate on tron without any facts to back up their claims. Point being, you are unlikey to find rational unbiased discussion here. And even if you were to find it you shouldn't be listening to other people in this game. Do your own research and make your own decisions.", "2_Subreddit": "Tronix"}], "dt0k22c": [{"0_Comment Submission": "Daily General Discussion - January 21, 2018", "1_Text": "How much less is your portfolio worth than it was 18 hours ago?", "2_Subreddit": "CryptoCurrency"}], "dt6vgnn": [{"0_Comment Submission": "Southwest fills plane with pets, flies abandoned animals from hurricane-ravaged Puerto Rico", "1_Text": "Yeah, it's not like there are thousands of people in Puerto Rico that need help. Better make sure the puppies are okay!", "2_Subreddit": "UpliftingNews"}], "dtp6syo": [{"0_Comment Submission": "Danielle Rising, 2015, oil on panel by Heather Horton", "1_Text": "Yeah the leg really bugs me too, looks super unnatural and strange. The rest of the painting is great though, especially the water.", "2_Subreddit": "Art"}], "du1yii3": [{"0_Comment Submission": "TIFU looking after a drunk friend (NSFW)", "1_Text": "Drunk people are fucking disgusting. I don't understand how this is accepted by society as completely normal, but god forbid you take any illegal drugs like MDMA or cocaine. Then you're suddenly a loser druggie, even if you don't bother anyone or act obnoxious.", "2_Subreddit": "tifu"}], "duiiov8": [{"0_Comment Submission": "Trying to teach I.T in a Ghanaian village.", "1_Text": "Heck, many people still think that today. \"Hey, my Windows crashes all the time! That means I need to buy a new computer, right?\" *facepalm*", "2_Subreddit": "pics"}], "dv1iqfu": [{"0_Comment Submission": "Does dope kill other drugs for you?", "1_Text": "Nah, even after trying most opiods/opiates including heroin I still think that MDMA is the most euphoric drug out there hands down. I also really enjoy good coke and the odd amphetamine high once in a blue moon. However, when you factor in all the other aspects like negative side effects, comedown, neurotoxicity etc. I far prefer opiates (especially oxy) as an overall package over stimulants. I can't imagine taking stimulants on regular basis and being able to function normally whereas I can totally get away with that with opiates. That's what I love about them the most.", "2_Subreddit": "opiates"}], "dv2abvs": [{"0_Comment Submission": "Who would have thought", "1_Text": "Well done! Now go clean your toilet dude.", "2_Subreddit": "opiates"}], "dv67j45": [{"0_Comment Submission": "Pharma oxy score, inb4 \"what's the point of naloxone\" it's designed to stop constipation and makes IV useless. Luckily the naloxone is inactive taken orally (only binds to receptors in the gut for constipation) plus you can crush em and sorta get a 60mg IR. then oxy IR 10s on the right", "1_Text": "Same here. I had a terrible experience with Targin 40/20 (40mg oxy 20mg naloxone). No matter how I would take them, even taking a single un-crushed pill orally, would put me in a severe precipitated withdrawal. The claim that naloxone is inactive orally is simply not true. It just has a very low oral bioavailability (something like 2%) but when you consider that you're taking 20mg of naloxone that's still 0.4mg going into your bloodstream. Which is a ton of naloxone, that's more than what they give you during a typical overdose! I hate Targin sooo much. For me that's the only truly non-abusable version of oxy out there. I can deal with all the other anti-abuse crap (such as pills that gel up) but I couldn't find a way to take these pills without feeling like shit.", "2_Subreddit": "opiates"}], "dv6nihx": [{"0_Comment Submission": "Pharma oxy score, inb4 \"what's the point of naloxone\" it's designed to stop constipation and makes IV useless. Luckily the naloxone is inactive taken orally (only binds to receptors in the gut for constipation) plus you can crush em and sorta get a 60mg IR. then oxy IR 10s on the right", "1_Text": "I'm glad that you were able to get back on oxycontin. I hear that in Australia some doctors now refuse to prescribe oxy in any other form than Targin. It's also becoming more common here in Europe for doctors to peddle this crap. I still have like 30 x 40mg Targins just sitting in my drawer and I refuse to touch them. They literally don't do anything for me other than put me in withdrawal immediately. I suspect that some people must be better at metabolizing naloxone than others, which is why some can take these and get the same effect as if they took regular oxycontin, and some people like us end up feeling like total crap instead.", "2_Subreddit": "opiates"}], "dvscz1p": [{"0_Comment Submission": "What's the most satisfying gaming experience you've ever had?", "1_Text": "This is a good example of how stable those systems were. Good luck leaving a ps4 or Xbox one on for two months straight without crashing.", "2_Subreddit": "AskReddit"}], "dvtu1em": [{"0_Comment Submission": "What's the worst example of poor financial choices you've witnessed?", "1_Text": "I'm sorry but putting your pet's health above your own is just stupid. I'm sure the dog would have been fine with normal, less expensive food and you could have eaten as well. (*here come the downvotes, bring it on!*)", "2_Subreddit": "AskReddit"}], "dw13t6c": [{"0_Comment Submission": "Almost got busted today", "1_Text": "Taxpayer's money well spent, eh? This bullshit war on drugs, aka war on addicts, needs to stop ASAP. How anyone can think that harassing addicts and small-time users like that will lead to anything positive is beyond me.", "2_Subreddit": "opiates"}], "dw86tt2": [{"0_Comment Submission": "My right eye contact lenses are made in the USA but my left are made in Ireland", "1_Text": "I just checked too. I don't have astigmatism nor any contact lenses.", "2_Subreddit": "mildlyinteresting"}], "dwbii8y": [{"0_Comment Submission": "Preferred Opiate/Opioid", "1_Text": "Oxy, hands down.", "2_Subreddit": "opiates"}], "dweyuer": [{"0_Comment Submission": "The Life and Death of Social Networks - Google Trends [OC]", "1_Text": "It's not a percentage. It's relative search interest over time, where 100 means that at that point the highest number of searches were being made for that particular search query over the course of the displayed period. So if it goes down to 50 it tells you that half as many people are searching for it now compared to the peak. The graph is useless for comparing the popularity of these networks because the even if reddit for example is receiving 10x less search volume than Facebook, this graph won't show you that. Reddit might still appear above Facebook on the y axis purely because its current search volume is at its peak, while Facebook's search volume is already on a decline. The fact that despite that far more people are still probably searching for Facebook rather than reddit doesn't have any impact on the graph.", "2_Subreddit": "dataisbeautiful"}], "dwtgutl": [{"0_Comment Submission": "When your co worker comes to you with 2mg dillies and asks if you know anyone that can sell them so you get them for half the price for yourself 👌🏾 #DontKnoHeDaPlug", "1_Text": "Lol why the hell did he trade his 80s for percs? Did he tell you?", "2_Subreddit": "opiates"}], "dwtjngm": [{"0_Comment Submission": "When your co worker comes to you with 2mg dillies and asks if you know anyone that can sell them so you get them for half the price for yourself 👌🏾 #DontKnoHeDaPlug", "1_Text": "Lol that's like saying you prefer a scoop of ice cream over a whole bucket of ice cream. What a weird decision on his part.", "2_Subreddit": "opiates"}]}], "1_submissions": [{"3qavku": [{"0_Title": "Economy passenger handcuffed and led off plane after she 'used business class toilet' to be sick", "1_Text": "Sabbath is not a day, silly! It's a band.", "2_Subreddit": "news"}]}]}]}