{"DrPhilipBlunts": [{"0_comments": [{"dwnhbj9": [{"0_Comment Submission": "What's everybody doing for Easter?", "1_Text": "What surgery? I've been putting mine off for over a decade. Because fuck that.", "2_Subreddit": "opiates"}], "dwni1wz": [{"0_Comment Submission": "What's everybody doing for Easter?", "1_Text": "I'm on 60mg of methadone, 100mg cannabis edible as well.\n\nAuto moderator made me think I needed to edit my post....", "2_Subreddit": "opiates"}], "dwnj18d": [{"0_Comment Submission": "What's everybody doing for Easter?", "1_Text": "I'm not having surgery. That's somebody else.  I was supposed to have surgery 15 years ago. I opted for a crippling opiate addiction for 15 years instead.", "2_Subreddit": "opiates"}], "dwnjnuh": [{"0_Comment Submission": "How’s everyone’s Easter?", "1_Text": "Tell me more about the situation with your daughter.\n\nI'm a bit of an expert in that field.\n\nI had my first son at 22 with somebody I was no longer in a relationship with.\n\nI've fought with his cunt mother ever since. She kept him from me the entire first year he was alive.\n\nI've paid $1,500/month in support for over 16 years. Never been late. Never missed a payment.\n\nShe is a horrible person. She's gone on to have three other children from three other men. She's married to another man that hasn't knocked her up yet.\n\nI've always made my children a priority. I'm now married with another 12 year old son.\n\nMy older son finally just moved in with me on Friday. My rule of always making sure he was a priority has worked flawlessly. He chose to live with me.\n\nMy advice to you. Never bad mouth her mother. Never.  \n\nAlways make her a priority. ALWAYS. Be there for her. Even if it's little shit like a school play or a broken heart when she's older. She is the most important thing now, let her always know that. Even if it is inconvenient. Especially if it's inconvenient.\n\nIf you'd rather PM me, do that.", "2_Subreddit": "opiates"}], "dwnjujw": [{"0_Comment Submission": "What's everybody doing for Easter?", "1_Text": "When I made this was the first time I'd seen it so I edited the fuck out of my post...", "2_Subreddit": "opiates"}], "dwnk1d2": [{"0_Comment Submission": "Girlfriend of 3 1/2 gets hooked on opiates, robs me blind.", "1_Text": "Opiates aren't other drugs. They fundamentally change people.\n\nYou have to decide if she's worth the incredible complications she will add to your life. Even once sober, you'll be dealing with a sober dope fiend.\n\nShe can be the person she used to be, but it'll be a lot of work.\n\nNobody can tell you if she's worth it or not. But things will likely never be what they were before her addiction. They can be good again, but they'll most certainly never be the same.", "2_Subreddit": "opiates"}], "dwnkd4p": [{"0_Comment Submission": "How’s everyone’s Easter?", "1_Text": "If her family is well off it'll be hard because they can afford good lawyers and you can't.\n\nYou have two options as I see it.\n\nChange. Convince them that you've changed. Hope they work with you.\n\nTake her to court. Even if it's supervised visitation, it's better than nothing.\n\nEven if you can't afford a lawyer, go talk to the clerk, ask how you file a petition for visitation. File the paperwork.  When you get to court, beg for a guardian ad litem. That is a court appointed lawyer whose job it is is to determine what's best for the child. Since her family is rich and you aren't, they'll likely have to pay for it.\n\nDo you have a job. Do you have any means to start giving her money? Even $50/month? That'll look good to the guardian. But do it with cashier's checks or something so your have proof she received it.\n\nA postal money order with a delivery confirmation receipt is one way to have proof.\n\nIt won't be easy. But if she's really important, you have options.", "2_Subreddit": "opiates"}], "dwnmabi": [{"0_Comment Submission": "Girlfriend of 3 1/2 gets hooked on opiates, robs me blind.", "1_Text": "Lol", "2_Subreddit": "opiates"}], "dwnmcem": [{"0_Comment Submission": "100 days since I've been a low life junkie loser!", "1_Text": "Good. Keep it up bropiate.", "2_Subreddit": "opiates"}], "dwnmfws": [{"0_Comment Submission": "What's everybody doing for Easter?", "1_Text": "Two weeks ago tomorrow. Hit 50mg yesterday, which was the first time I didn't feel the need to use on top of it. Didn't use today either. I tapered my dope use way down before making the switch", "2_Subreddit": "opiates"}], "dwnmkrf": [{"0_Comment Submission": "Stopped 70 abruptly, double habit", "1_Text": "Naloxone in Suboxone isn't what blocks other opiates, it's the buprenorphine that blocks other opiates.", "2_Subreddit": "Methadone"}], "dwnmoju": [{"0_Comment Submission": "anyone have advice?", "1_Text": "My sixteen year old knows my history. I haven't told my twelve year old everything yet but I will once I think he's ready.", "2_Subreddit": "Methadone"}], "dwno1eq": [{"0_Comment Submission": "How’s everyone’s Easter?", "1_Text": "My father was an abusive cocksucker. I told myself early on that I'd never let my children want for my love, regardless of what I had to do to show them.", "2_Subreddit": "opiates"}], "dwntq3y": [{"0_Comment Submission": "Girlfriend of 3 1/2 gets hooked on opiates, robs me blind.", "1_Text": "She's already made it his problem. Why should he expect that to change?", "2_Subreddit": "opiates"}], "dwntryu": [{"0_Comment Submission": "How’s everyone’s Easter?", "1_Text": "Yeah I'm the worst addict in as well. I just don't let that make me a bad person", "2_Subreddit": "opiates"}], "dwnu3kx": [{"0_Comment Submission": "Using a prank idea from Askreddit, I put vanilla pudding in a mayonnaise jar. My kids were horrified as I ate it while watching them open their Easter presents.", "1_Text": "He's pulling it from his ass apparently.", "2_Subreddit": "funny"}], "dwo7mk6": [{"0_Comment Submission": "Girlfriend of 3 1/2 gets hooked on opiates, robs me blind.", "1_Text": "Are you suggesting that opiates don't fundamentally change people? \n\nOn a biological level, that statement is 100% factual. It doesn't have to be a net negative change, but it changes people at the most basic, fundamental level.\n\nIt completely rewires the reward response in the human brain at a chemical level.", "2_Subreddit": "opiates"}], "dwo7ruc": [{"0_Comment Submission": "Girlfriend of 3 1/2 gets hooked on opiates, robs me blind.", "1_Text": "I wasn't even speaking about something as simple as personality changes.\n\nI used the terminology (fundamentally) for a reason. Opiates change people's brain chemistry. They change people's reward response. It is a fundamental, biological change.\n\nIt doesn't have to be a change for the better or even a change for the worse, but chemically, the person will change.", "2_Subreddit": "opiates"}], "dwo7xux": [{"0_Comment Submission": "What's everybody doing for Easter?", "1_Text": "Hopefully not for life.\n\nI already have a stable job and stable family situation.\n\nMy life is a financial mess. I hope to stay in it long enough to sort out my finances and relearn living my life without having to deal with hustling around to keep myself well.\n\nI'm guessing it'll be a few years. I'm hoping to never go higher than 80mg. I'm at 50 now, which is enough to keep 90% of my withdrawal symptoms away, but it doesn't completely handle the cravings.\n\nI've read conflicting information about whether 60mg or 80mg is the full blockade dose. I hope to not have to go any higher than the full blockade dose so that cravings are handled, and even if i decide to use, it would just be a total waste of cash...", "2_Subreddit": "opiates"}], "dwokol5": [{"0_Comment Submission": "Girlfriend of 3 1/2 gets hooked on opiates, robs me blind.", "1_Text": "I didn't mean to suggest that opiates necessarily change people for the worse, simply that they change people.\n\nIt seems in the instance of this chick, however, that they have changed her for the worse, and significantly at that...", "2_Subreddit": "opiates"}], "dwokq0z": [{"0_Comment Submission": "Girlfriend of 3 1/2 gets hooked on opiates, robs me blind.", "1_Text": "Good conversation BTW. it's been fun!", "2_Subreddit": "opiates"}], "dwolgce": [{"0_Comment Submission": "Girlfriend of 3 1/2 gets hooked on opiates, robs me blind.", "1_Text": "I'm only a dick when somebody else is a dick first.\n\nI think we were seeing eye-to-eye the entire time anyways, just took us a second to work it out and realize that was the case.\n\nIn the corny ass words of my recently deceased gangster ass grandfather - Make it a great day!!!", "2_Subreddit": "opiates"}], "dwon9zh": [{"0_Comment Submission": "New connect has no idea how much to put in a bag!", "1_Text": "To be fair, the saying \"Don't get high on your own supply\" exists for a reason bro.\n\nThankfully you only escaped with an expensive habit, and not a felony.", "2_Subreddit": "opiates"}], "dwq1me3": [{"0_Comment Submission": "I know I relapsed the other day, but I can do this, guys!", "1_Text": "That's true for a lot of people", "2_Subreddit": "opiates"}], "dwxldqi": [{"0_Comment Submission": ":)", "1_Text": "A ball should be 3.5", "2_Subreddit": "opiates"}]}], "1_submissions": [{"7a3pve": [{"0_Title": "I need y'all to make a decision for me", "1_Text": "What surgery? I've been putting mine off for over a decade. Because fuck that.", "2_Subreddit": "opiates"}], "7plrm1": [{"0_Title": "Travelers on Netflix", "1_Text": "What surgery? I've been putting mine off for over a decade. Because fuck that.", "2_Subreddit": "opiates"}], "7sydkf": [{"0_Title": "Zofran (Ondansetron) to help with withdrawal nausea", "1_Text": "What surgery? I've been putting mine off for over a decade. Because fuck that.", "2_Subreddit": "opiates"}], "7v7hvr": [{"0_Title": "I got this shit this time", "1_Text": "What surgery? I've been putting mine off for over a decade. Because fuck that.", "2_Subreddit": "opiates"}], "85jg6k": [{"0_Title": "My heroin salesperson is a kind, caring compassionate person. (lol)", "1_Text": "What surgery? I've been putting mine off for over a decade. Because fuck that.", "2_Subreddit": "opiates"}], "88tq5i": [{"0_Title": "prescription monitoring across state lines", "1_Text": "What surgery? I've been putting mine off for over a decade. Because fuck that.", "2_Subreddit": "opiates"}], "88v7wt": [{"0_Title": "What's everybody doing for Easter?", "1_Text": "What surgery? I've been putting mine off for over a decade. Because fuck that.", "2_Subreddit": "opiates"}]}]}]}