{"Gaphishphan90": [{"0_comments": [{"dm8g79d": [{"0_Comment Submission": "How to deal with dry nose/sinuses?", "1_Text": "I vape so i just blow it out of my nose and it moistens right back up. Always get an extra drip or two. But other than that take a hit shower and breathe in through your nose", "2_Subreddit": "opiates"}], "dmafqe4": [{"0_Comment Submission": "Dude doing a solid", "1_Text": "JJ!", "2_Subreddit": "opiates"}], "dmag8nu": [{"0_Comment Submission": "Morphines lethal dose", "1_Text": "If you have no tolerance to opiates then why are you trying to do that much? You're going to get sick as hell and have a horrible time at best even with 100mg", "2_Subreddit": "opiates"}], "dotki3d": [{"0_Comment Submission": "I vape my candy... Anyone ever tried this. Tastes like the real deal. Have a good week.", "1_Text": "Had this before, its awesome. Try the strawberry watermelon, soo good with the nods", "2_Subreddit": "opiates"}], "dp0d2kw": [{"0_Comment Submission": "Possible Fake Roxie", "1_Text": "Being hard to bust is almost always a sign that its a fent pressed roxy. I had the same experience happen to me and the press was very very close to the real thing. Only thing i noticed was hard to crush down, didnt have roxy taste, and i was dangerously high within 5 min. Be glad your friends were there, i got lucky too. \nBe safe", "2_Subreddit": "opiates"}], "dpa3sci": [{"0_Comment Submission": "What's the BEST script the doctor ever gave you?", "1_Text": "Got 90 hydro tens, 60 demerol, and 150 tramadol a month for a few months from an oral surgeon, thats where it all began", "2_Subreddit": "opiates"}], "dpnvnhk": [{"0_Comment Submission": "A little something for the weekend", "1_Text": "The roxi is definitely fake if it's that color in person", "2_Subreddit": "opiates"}], "drpicmy": [{"0_Comment Submission": "Am I weird for hating Xanax?", "1_Text": "I think it speaks for itself. Bar and retard together equals bartard", "2_Subreddit": "opiates"}], "dsrftev": [{"0_Comment Submission": "Cant use opiates. Next best thing 😉😍", "1_Text": "Thought it was just me that happened to", "2_Subreddit": "opiates"}], "due0d5b": [{"0_Comment Submission": "My favorite Norcos🍌 These will do until the Blue man is back", "1_Text": "Those prices took me back", "2_Subreddit": "opiates"}], "due5ypp": [{"0_Comment Submission": "My favorite Norcos🍌 These will do until the Blue man is back", "1_Text": "The giant green hydros are what started it all for me, been a slippery slope ever since lol", "2_Subreddit": "opiates"}], "duemsi5": [{"0_Comment Submission": "MDMA.....thoughts?", "1_Text": "Yes i was with someone who purchased some very good mdma at a concert and split it with the rest of our group. 1 gram between 5 people and his heart exploded on the way home from the show. Come to find out he had a heart condition not even him or his parents knew about", "2_Subreddit": "opiates"}], "duf1psn": [{"0_Comment Submission": "MDMA.....thoughts?", "1_Text": "Youre thinking about an explosion from a bomb obviously, wrong explosion. Autopsy revealed he had an enlarged heart and confimed that his heart literally popped. Thanks for the input though. In no way was i condoning mdma use, personally love it. Mearly stating a fact that it does happen, seen it first hand", "2_Subreddit": "opiates"}], "duf3jij": [{"0_Comment Submission": "MDMA.....thoughts?", "1_Text": "https://www.intechopen.com/books/etiology-pathogenesis-and-pathophysiology-of-aortic-aneurysms-and-aneurysm-rupture/drug-induced-aortic-aneurysms-ruptures-and-dissections", "2_Subreddit": "opiates"}], "duf3mvl": [{"0_Comment Submission": "MDMA.....thoughts?", "1_Text": "Scroll down to the mdma section on the left hand side. There are the medical terms since you want to be so precise", "2_Subreddit": "opiates"}], "dulcfvz": [{"0_Comment Submission": "How I sniff blues.", "1_Text": "Not really, a mcdonalds straw or something similar is best because they are thick. Chew on it for awhile, unbend and tilt back and let it rip. One straw will make it through several pills", "2_Subreddit": "opiates"}], "dulchbl": [{"0_Comment Submission": "How I sniff blues.", "1_Text": "Got side tracked but you the meaning of that was you can chew it into a fine powder", "2_Subreddit": "opiates"}], "dvlamdu": [{"0_Comment Submission": "Sunday Funday", "1_Text": "Love me some Panic and opiates!", "2_Subreddit": "opiates_gonewild"}], "dvn5jra": [{"0_Comment Submission": "What’s the most fucked thing you’ve seen someone to do to get high?", "1_Text": "This is some seriously fucked up shit if its the truth", "2_Subreddit": "opiates"}], "dvop3uu": [{"0_Comment Submission": "When you take copious amounts of your drug of choice and you still feel empty inside", "1_Text": "Thats my story, aside from grandmas medicine cabinet", "2_Subreddit": "opiates"}], "dw1j2cw": [{"0_Comment Submission": "Anyone else despise \"nodding out\" on opiates? Or just me?", "1_Text": "Love your username! Love some panic, especially the mikey years", "2_Subreddit": "opiates"}], "dw89qob": [{"0_Comment Submission": "How many N64 games to fill a bathtub?", "1_Text": "These^", "2_Subreddit": "n64"}], "dw8pay8": [{"0_Comment Submission": "I'm sad today.", "1_Text": "At some point in addiction most of us have felt this way", "2_Subreddit": "opiates"}], "dwanym6": [{"0_Comment Submission": "Another pick up of 10 8mg dillies and decided to my sugar fix while I was out. Enjoy friends:)", "1_Text": "I love some peach rings when I'm  nice and toasted too", "2_Subreddit": "opiates"}], "dwwmigp": [{"0_Comment Submission": "Cursing myself for the highs I've taken for granted", "1_Text": "Now thats getting geeked if they were anything over the 10mgs", "2_Subreddit": "opiates"}]}], "1_submissions": [{}]}]}