{"heavenleigh2": [{"0_comments": [{"dwp1pcz": [{"0_Comment Submission": "Let the change begin. ~ If your life or someone you know has been affected by OPIATES, please, please, read this. Help is on the way for those in need and if you like to help, pleas read this. This is an Opiate MUST READ!", "1_Text": "The government is getting billions from the drug war.  They do not want the drug war to end.  They knew what purdue was doing andcallowed it to go on for years because they got mad money from it. The fda is trying to make kratom illegal too.  They know that if people can get relief from pain, anxiety, depression, etc., then people will stop taking pharmaceuticals and they will lose money.  I grow my own psilocyban mushrooms for anxiety and depression. I can't take antidepressants.\n\nThe government is playing both ends. The history channel didva documentary on the cia flying in cocaine and heroin.  Our government is in with the cartels. So they get money from the pharmaceutical companies and the cartels.  They fly in drugs to sell and then turn around and arrest the citizens for using them. The systrm is broken.  I do not see anything changing until a bunch of people get off their asses and organize a march to the white house and their state capitals to protest the senseless drug war. \n\nThe drug war is killing our brave men and women in the military.  Drugs are not killing people and law enforcement.  The drug war is killing them and us.  It is ridiculous.  President nixon started it and he was an alcoholic.  Prohibition will NEVER work.  Man has always experimented with inebriants and always will.  Also it is human nature to rebel when told no. \n\nI use mushrooms and pot for depression and anxiety also for spiritual reasons.  I am thinking about trying kratom to get off of suboxone. If I can do that I will be off all pharmaceuticals. That is what the government does not want.  If people start using shrooms, pot and kratom they won't need prescriptions.  Then the pharmaceutical companies and the government will lose money.  They want to keep us like zombies on antidepressants so we won't protest.\n\nI don't think heroin should be sold in gas stations though.  It should be in a clean environment with medical personell overseeing it. Anyway, thats my two cents. Written with love.", "2_Subreddit": "Drugs"}], "dwt806y": [{"0_Comment Submission": "What do you think will happen with the future of opiates ?", "1_Text": "Until people get off their asses and do something besides bitching and complaining about the drug war. Nothing will get done.  Tye governmenment is playing it fro both ends. They get money from both the cartels amd the pharmamceuitical industistries.  The history channel did a docu on how the CIA flies in cocaine and heroin and then sells it its citizens while at the same time locking up its citizens for using the very drugs they fly in. \n\nThey do not want kratom to he legal. They want to make money off of it through the pharmaceiutical industries by making it illegall while they figure out how to create a \"new\"painkillier.  The government is making millions and millions off the drug war. And getting our military and law enforcent killed over it then blaming the drugs.  It is all propaganda set up to bilk millions from the system.\n\nThe DEA steals people's money, while kicking back doung the very drugs they stole, living in luxurious homes, driving top of the line cars and enjoying their personal jets they  bought with dirty money.  The need to decriminilize then watch the cartels fall and pour the money to fight the war into treatment and drug education starting in elementary schools.  Tell the damn truth for once.  It is all bullshit and lies.  But, no they do not want to help the US citizens.  They do not want to lose their jobs by fixing the systems.  It is all bullshit!!", "2_Subreddit": "opiates"}], "dwv9v09": [{"0_Comment Submission": "Phenobarbital & Suboxone treatment", "1_Text": "I have been on subs since december of 2006", "2_Subreddit": "opiates"}], "dwvyalc": [{"0_Comment Submission": "running away/ escaping", "1_Text": "Having kids or not has nothing to do with being an addict. We don't choose to become addicts. I sure didn't. I grew up in it and knew nothing else.  I cannot stand judgy condescending assholes like you.", "2_Subreddit": "opiates"}], "dwvzusp": [{"0_Comment Submission": "running away/ escaping", "1_Text": "Stfu. Go bug someone else dumbass!", "2_Subreddit": "opiates"}], "dww0mmg": [{"0_Comment Submission": "What are your experiences using shrooms?", "1_Text": "I started growing them. They help a lot.", "2_Subreddit": "Drugs"}]}], "1_submissions": [{}]}]}