{"BTC_Collector60": [{"0_comments": [{"dts12x8": [{"0_Comment Submission": "Signing up as new vendor risk?", "1_Text": "I would guess that just about any other market would have a lower bond requirement, perhaps none at all -- I don't know the requirements of other markets but I do know Dream has the reputation of being the highest.", "2_Subreddit": "DarkNetMarketsNoobs"}], "dtsgatd": [{"0_Comment Submission": "Should I use my dead friend's house as a drop?", "1_Text": "Sounds like a bad idea to me... what if right after you order the family gets around to notifying the post office and they start directing it elsewhere where you don't have access to it or returning it marked \"deceased\"?  It's better just to have your mail delivered to you instead of trying to play secret agent.", "2_Subreddit": "DarkNetMarketsNoobs"}], "duf54re": [{"0_Comment Submission": "BTC transaction pending", "1_Text": "Did you check the Proof of Ownership on the BTC address? Doesn't sound like it is headed to your Dream account if it doesn't notify of the pending deposit. Check the destination address on the block chain and make sure there are no other deposits to the same address. The amount of the transaction has no effect on the speed, it's the amount of the transaction fee that matters.", "2_Subreddit": "DarkNetMarketsNoobs"}], "duf5a3g": [{"0_Comment Submission": "kind of an opsec question thank you?", "1_Text": "How do they even know who owns the wallet to ask?", "2_Subreddit": "DarkNetMarketsNoobs"}], "duf5czj": [{"0_Comment Submission": "Do I have to message the vendor?", "1_Text": "I know it's unnerving but often times these transactions are carried out with no communication what-so-ever. No need for unnecessary communication.", "2_Subreddit": "DarkNetMarketsNoobs"}], "duhocq4": [{"0_Comment Submission": "Can’t verify pgp on tails", "1_Text": "What's in this mysterious .asc file that you are trying to import and why are you trying to import it?  Need some context to properly understand your question.", "2_Subreddit": "DarkNetMarketsNoobs"}], "duka06b": [{"0_Comment Submission": "Heroin addict with jury duty part 2", "1_Text": "This only goes to prove that so often \"the truth will set you free\" and it did.  Some people instinctively lie in situations where the truth is a much better card to play.", "2_Subreddit": "opiates"}], "dukau5s": [{"0_Comment Submission": "Beginning Stages of Darknet Setup But No Clue What I'm Doing", "1_Text": "I always recommend [gpg4usb](https://www.gpg4usb.org/) for people that use Tor. It works for Windows or Mac and obviously likes to live on a USB. Make sure you make a backup of your PGP keys and keep them somewhere else (than where you normally use them). Lots of YouTube tutorials specific to this implementation as well.", "2_Subreddit": "DarkNetMarketsNoobs"}], "dukb45w": [{"0_Comment Submission": "Mannn, PGP just keep gettin me.", "1_Text": "The the real world you are going to encrypt a message using someone else's public key (for them to read using their private key) and so you will never be able to decrypt such a message... only the intended recipient will be able to read it by using their corresponding private key (which you will never have).", "2_Subreddit": "DarkNetMarketsNoobs"}], "durjlm4": [{"0_Comment Submission": "Dream Market 2FA help", "1_Text": "No, it isn't. You generate your own pair of keys (public and private) and then you need to paste the public key on your profile (there is a text box for that) and click update. At this point, make sure your profile is set to \"PGP **or** password\" (you need to change that later). Then when you try to log in with 2FA, it will generate a random gibberish password and encrypt it. You decrypt this message (using your private key) and enter it in the decrypted text area to get signed in without using a dumb reusable password. Once you have that down, you can change your profile for \"PGP only\" (which yields \"Password login disabled\" if you try to log in with a password).  You definitely want to do this before you make a deposit.  Make sure you have a backup of your keys somewhere because if you lose them you lose the account.", "2_Subreddit": "DarkNetMarketsNoobs"}], "durqyen": [{"0_Comment Submission": "rsa+ when doing certificate? my guide is using an older version of gpg", "1_Text": "I would go with the older method for maximum compatibility -- should still be uber secure.", "2_Subreddit": "DarkNetMarketsNoobs"}], "duwo116": [{"0_Comment Submission": "I think my Dream account likely compromised, will this inconvenience the vendor?", "1_Text": "If the usual holds true, the phisher will message the vendor (pretending to be you) desperately wanting to cancel the order and get the money back with some sob story. Best to contact the vendors and let them know that you are not you.", "2_Subreddit": "DarkNetMarketsNoobs"}], "duz6e2o": [{"0_Comment Submission": "Need Advice on a situation", "1_Text": "> I'm going to be spending a lot of money on my next order\n\nThat being the case, take a little time and learn how to better protect yourself. Does the market you use allow PGP for authentication?  If so, use it or lose it.", "2_Subreddit": "DarkNetMarketsNoobs"}], "duz6qws": [{"0_Comment Submission": "Vendor failed decrypting pgp", "1_Text": "If you \"change my keys\" like you said you did, he won't be able to answer you unless you send him your new **public** key (obviously **not the private one**)", "2_Subreddit": "DarkNetMarketsNoobs"}], "dv1rl97": [{"0_Comment Submission": "Used clear net to track package via 3rd party tracking site, what to expect?", "1_Text": "Tracking a package from Tor definitely taints the shipment. That's one of the reasons many vendors don't like to give out tracking. The post office knows when a Tor exit node hits their tracking web site.", "2_Subreddit": "DarkNetMarketsNoobs"}], "dv1unm6": [{"0_Comment Submission": "People deserve access to sterile, accurately dosed, pharmaceutical heroin", "1_Text": "I agree but I don't see the need for a \"heroin clinic\". Why can't the pharmaceutical heroin be simply dispensed by a pharmacy like any other drug?  To much insulin is lethal, so is too much heroin but I don't see it being particularly dangerous, not more dangerous than any other drug. Particularly heroin that isn't IVed could be simply passed out like any other pill (and make the IV version available for those that must).", "2_Subreddit": "opiates"}], "dv1yj7i": [{"0_Comment Submission": "People deserve access to sterile, accurately dosed, pharmaceutical heroin", "1_Text": "There was a study done in the UK where they have prescribed heroin that determined if a heroin addict is given an **unlimited supply** they go up to a certain amount that is right for them and then level off, not requiring more after a certain amount.", "2_Subreddit": "opiates"}], "dv1yqpx": [{"0_Comment Submission": "Need Advice on a situation", "1_Text": "Everything \"works out fine\" until it doesn't. If my grandmother can learn to use PGP you certain can (and she does).", "2_Subreddit": "DarkNetMarketsNoobs"}], "dv206w2": [{"0_Comment Submission": "Used clear net to track package via 3rd party tracking site, what to expect?", "1_Text": "I suppose they could but how would they get someone else's tracking number?", "2_Subreddit": "DarkNetMarketsNoobs"}], "dv208qd": [{"0_Comment Submission": "Used clear net to track package via 3rd party tracking site, what to expect?", "1_Text": "Regular Internet is fine but you should use a library or restaurant wifi and/or VPN. You want to avoid tracking if you can.", "2_Subreddit": "DarkNetMarketsNoobs"}], "dv2tcal": [{"0_Comment Submission": "People deserve access to sterile, accurately dosed, pharmaceutical heroin", "1_Text": "It's been a few years since I've seen this but what a great idea, I'm going to dig it up if at all possible. Certainly an associate of mine who is an addict also has access to an unlimited supply (because he has unlimited funds) and has been steadily using the same amount each day for a number of years. He also keeps a couple of months supply on hand.", "2_Subreddit": "opiates"}], "dv35l7t": [{"0_Comment Submission": "Delayed package, with weird tracking, causing stress. Any thoughts?", "1_Text": "I get items from all over South East Asia all the time. They aren't DNM items: If you want a USB cable to charge your phone you can buy one at Walmart for $15 (if you live in the USA) or you can find the same thing on eBay for $2 with free International shipping (don't know how they do it) but you usually have to wait 3 to 6 weeks for it. Sometimes I even get tracking for these small items and it's not at all unusual for them to spend a week or two waiting to pass through customs. **It will likely be along, you just have to be patient as it does take a lot longer than it needs to.**", "2_Subreddit": "DarkNetMarketsNoobs"}], "dv3638n": [{"0_Comment Submission": "Got raided...", "1_Text": "They owe you an apology for invading your privacy if they didn't find anything.", "2_Subreddit": "DarkNetMarketsNoobs"}], "dv38rkk": [{"0_Comment Submission": "Delayed package, with weird tracking, causing stress. Any thoughts?", "1_Text": "I wouldn't worry about it... from the looks of it, it should be along soon. Sometimes I pretty much forgot about ordering whatever little trinket is coming because it takes so long but I can't say any of them have been lost and I haven't had to sign for many (perhaps 1 or 2) over the years, nothing unusual about that either.", "2_Subreddit": "DarkNetMarketsNoobs"}], "dwwp74e": [{"0_Comment Submission": "Appearing in court tomorrow for sentencing on first and only possession charge...", "1_Text": "I can only agree with your point of view and the war on drugs is very wrong (every bit as wrong as alcohol prohibition once was)  but you will only make your situation worse by speaking out with the truth.", "2_Subreddit": "opiates"}]}], "1_submissions": [{}]}]}