{"GuyGregH": [{"0_comments": [{"dw4kye9": [{"0_Comment Submission": "Call me crazy but I’m starting to enjoy Morphine just as much (if not more) than Oxy.", "1_Text": "I much prefer the warm, slow glow of morphine to the harder hit of the synthetic drugs.", "2_Subreddit": "opiates"}], "dw65h80": [{"0_Comment Submission": "Call me crazy but I’m starting to enjoy Morphine just as much (if not more) than Oxy.", "1_Text": "Thebaine isn't inactive--and despite being an opiate, it actually has stimulant effects.  The presence of thebaine (and the other 40-odd alkaloids) is one reason that using opium, poppy straw, etc. is so different from pharms like oxycodone.  Plus of course, morphine (the main active ingredient of opium, etc.) just feels and works different from oxys.", "2_Subreddit": "opiates"}], "dw65uqd": [{"0_Comment Submission": "Don't use alone & if you have 2.....", "1_Text": "This.  Just let people buy stuff at Walgreens that's a standard strength so they know what they're getting and the OD rate will go to near zero.  This is an artificial problem that we could fix in a snap.", "2_Subreddit": "opiates"}], "dw66sps": [{"0_Comment Submission": "Dboy... Falling hard?", "1_Text": "I don't think it counts as being a sex worker if you take money (or drugs) for something you'd be happy to do for free.  If I go over to a girl's house and bring a bottle of wine and she drinks half of it and we have sex, is she having sex to save a few dollars on wine, or because she wanted to anyway?", "2_Subreddit": "opiates"}], "dw67jtj": [{"0_Comment Submission": "I can't believe bag reviews are gone...", "1_Text": "Sounds like Reddit has jumped the shark.", "2_Subreddit": "PoppyTea"}], "dw6br6q": [{"0_Comment Submission": "Reddit content policy update", "1_Text": "bluеlіght.огg ?", "2_Subreddit": "opiates"}], "dw6dbd8": [{"0_Comment Submission": "I can't believe bag reviews are gone...", "1_Text": "My suggestion would be a hybrid approach:  keep /r/PoppyTea here, so people can find it easily, in the same place it's always been.  And be sure that people who find their way here can also find their way to another board, where the important discussions which are no longer allowed on here can take place (the site already exists, I'm not being hypothetical.  I'm sure a PST forum could be created on it.  It's hosted overseas, so the noises from the US government that may be motivating Reddit don't apply.)  I realize that maintaining two boards/reddits/forums would increase the total workload, but hopefully the mods could find some help with that.", "2_Subreddit": "PoppyTea"}], "dwbg5wu": [{"0_Comment Submission": "Craigslist question", "1_Text": "I know this thread is old but I feel like I have to post this:  there is no way that anyone wanting a gift card is anything but a scam, unless they were willing to buy it at a HUGE discount to cash (like a $100 gift card instead of $50 cash).  Not only are they less flexible, and trackable, but you could always call and report it stolen and get your money back.\nIf you say you bought the gift card, they'll just get back to you and demand you send them pictures of it, with the codes.  Then they can drain the card without meeting you.  Don't waste your time, if they mention gift cards, move on.", "2_Subreddit": "opiates"}], "dwbu1h6": [{"0_Comment Submission": "DAE get awful inner ear pressure changes after dosing?", "1_Text": "Never.  I do wonder if the PST is exposing an underlying condition you've developed in the 2 years?  Like for example if you'd developed high blood pressure, not enough to produce symptoms, and use a drug which boosts blood pressure so when you took it you got symptoms that people with normal BP don't.\nIf you can, I'd visit a doctor and explain your symptoms as \"it comes and goes\" without mentioning the PST.", "2_Subreddit": "PoppyTea"}], "dwbugcw": [{"0_Comment Submission": "did i screw up my taper schedule!?", "1_Text": "I don't think one dose is going to have any noticeable effect.", "2_Subreddit": "PoppyTea"}], "dwe8fn2": [{"0_Comment Submission": "A message from the other side...", "1_Text": "Cool!", "2_Subreddit": "PoppyTea"}], "dwe8xfa": [{"0_Comment Submission": "My tea was substantially better after changing methods", "1_Text": "My recipe is:  warm tap water, no additives, shake 75 seconds, squeeze out.  Then immediately do a second wash the same way.\nI agree with the others, at 20 minutes you'll be starting to get the oils, which make the tea milky, odd-tasting, and you're actually losing alkaloids.", "2_Subreddit": "PoppyTea"}], "dwe9ovs": [{"0_Comment Submission": "Special cup", "1_Text": "Just whatever coffee mug I'm using that day.", "2_Subreddit": "PoppyTea"}], "dwfoiic": [{"0_Comment Submission": "Girlfriend and her friend got popped over the weekend. Fml.", "1_Text": "They have computers that do that now--police cars are being equipped with systems that use a camera and OCR software to automatically look up every plate that comes within range.  Presumably the cop driving the car gets a beep when a \"violator plate\" is detected.  \"Doesn't that cost a lot of money\" you say?  Yes, but with the massive fines they get to charge for driving without a license, or registration, or insurance, they probably pay for themselves.  Plus the occasional bust of people caught with something, like OP's girlfriend.", "2_Subreddit": "opiates"}], "dwfoz3k": [{"0_Comment Submission": "Girlfriend and her friend got popped over the weekend. Fml.", "1_Text": "Cops here are judged within the department on a points system.  Busting people earns points, varying with what the bust is (busting a user with heroin is more points than a DUI, busting a dealer with hundreds of folds of heroin is more points than a user, etc.)  At the end of the month, every cop's point count is posted on a bulletin board in a cops-only room in the police building.  Legally, this doesn't exist, and isn't supposed to be used for deciding promotions, etc. but let's be real.", "2_Subreddit": "opiates"}], "dwfr40b": [{"0_Comment Submission": "A message from the other side...", "1_Text": "And see, Tramadol is what got me into trouble with tea.  I would use tramadol daily (250-400 mg) for 6-8 months, then taper down and quit.  Then a month or two later I'd miss it and go back.  I must have done this a dozen or more times over 7 years.  It made me think I have the willpower to quit opiates anytime.  When they scheduled tramadol in 2014 in the US, I found PST.  Once I started on that, I was NEVER able to quit.  Over President's Day weekend I resolved to quit cold turkey, with the help of Vitamin C megadosing.  3 days wasn't long enough but I did cut my dose 85-90%.  That's made my life much better, but even at this low dose, if I skip it I get it all:  unbearable tiredness, nerves screaming, explosive diarrhea, no sleep, freezing cold.  (Part of it is I have no more downtime--every day I have job, kids, non-understanding partner.)\nI'm not saying tramadol withdrawal's not real--it definitely is.  And I was using tea longer than I ever did tramadol at one stretch.  But somehow I could taper with tramadol in a way I never could with tea.", "2_Subreddit": "PoppyTea"}], "dwhbh8v": [{"0_Comment Submission": "The worst withdrawal symptom", "1_Text": "What is it about opiates that a determined person can cut out 80-90% of their dose, but the last bit is so impossible?", "2_Subreddit": "opiates"}], "dwri95i": [{"0_Comment Submission": "PSA: Just a friendly reminder--No matter how miserable your WD gets, no matter how desperate for relief you are, Lope is NOT a toy and should NEVER be taken lightly. If you fail to treat it with the wariness and respect it deserves, it WILL kill you!!!", "1_Text": "As they say in PoppyTeaUniversity, the dose makes the poison.  Everything will kill you if you use too much.\nI am curious how much lope would actually start to help with WDs--the article says 16 mg/day should be a safe level.  Would 16 mg/day provide any WD relief, say for someone who's trying to taper down?", "2_Subreddit": "PoppyTea"}], "dwrior4": [{"0_Comment Submission": "PSA: Airport security now checks food by hand in carry-on bags.", "1_Text": "Welp, that sucks.  Glad you made it through ok.  Everybody should remember that \"good source of omegas\" bit, even if it's not exactly true (nobody's going to argue with you in the security line).", "2_Subreddit": "PoppyTea"}], "dwvtroa": [{"0_Comment Submission": "Travel method that works", "1_Text": "The ideas of PST cubes, and using the SAME water for multiple batches of seeds, are great.  With 2X or 3X strength tea, short trips with no seeds at all are possible.\nI have done a few trips of my own, trying to figure out how to get my daily dose without traveling companions knowing.", "2_Subreddit": "PoppyTea"}], "dwvtwbq": [{"0_Comment Submission": "Travel method that works", "1_Text": "I wrecked a metal travel bottle (like a thermos, but plain metal, not insulated) freezing it with PST for a trip.  Actually the worst part was that it pushed a small crack in the bottom that I didn't see (because the contents were frozen).  I only found out when, on arrival, there was a big wet mess and a lot of my tea was gone.  Lucky for me I also brought seeds as a backup.  I recommend not relying on freezing solid your PST for a trip unless the risk of a hairline crack and it leaking out on you is ok.", "2_Subreddit": "PoppyTea"}], "dwvv4wc": [{"0_Comment Submission": "Why are there so many Dumb(Lack Self Awareness) People?", "1_Text": "The prices now are so outrageous, and when they say they're from the UK and they're from Spain (a completely different product) they are justifiably angry.  At least when your habit is alcohol, and you go down to the store and buy a bottle of whiskey, they don't sell you a bottle of brown water.  I agree they should spare the details but the posts are just trying to save others money.", "2_Subreddit": "PoppyTea"}], "dwvwfgb": [{"0_Comment Submission": "I'm Eric Hafner, I'm running for U.S. Congress in Portland, Oregon (OR-3). I want to legalize all drugs, including opiates, but offer ibogaine therapy too, and free drugs for addicts via prescription.", "1_Text": "The ironic thing is that generic opiate pills (like hydrocodone) are DIRT cheap to manufacture, like pennies a pill.", "2_Subreddit": "opiates"}], "dwxznyx": [{"0_Comment Submission": "Ultrasound cleaner for making PST?", "1_Text": "Thanks!", "2_Subreddit": "PoppyTea"}], "dwxztp9": [{"0_Comment Submission": "Going to Mexico", "1_Text": "Tramadol definitely helps with PST WDs. If you can buy it OTC there, you should be fine.", "2_Subreddit": "PoppyTea"}]}], "1_submissions": [{"6gcx1h": [{"0_Title": "PC-linked install method?", "1_Text": "I much prefer the warm, slow glow of morphine to the harder hit of the synthetic drugs.", "2_Subreddit": "LineageOS"}], "6git11": [{"0_Title": "Cyanogenmod Installer--available for LineageOS or gone?", "1_Text": "I much prefer the warm, slow glow of morphine to the harder hit of the synthetic drugs.", "2_Subreddit": "LineageOS"}], "6giurj": [{"0_Title": "Samsung Galaxy S4 Mini, 3 types supported: how do I know which one to get?", "1_Text": "I much prefer the warm, slow glow of morphine to the harder hit of the synthetic drugs.", "2_Subreddit": "LineageOS"}], "6h23ym": [{"0_Title": "CyanogenMod Installer (Windows install tool)--does it exist for LineageOS?", "1_Text": "I much prefer the warm, slow glow of morphine to the harder hit of the synthetic drugs.", "2_Subreddit": "LineageOS"}], "7xbsrz": [{"0_Title": "Best way to get kratom quickly in Philly?", "1_Text": "I much prefer the warm, slow glow of morphine to the harder hit of the synthetic drugs.", "2_Subreddit": "kratom"}], "7z2t31": [{"0_Title": "Got off opiates, didn't use the kratom. Where do I post?", "1_Text": "I much prefer the warm, slow glow of morphine to the harder hit of the synthetic drugs.", "2_Subreddit": "kratom"}], "7z8zp7": [{"0_Title": "How I quit poppyseed tea after 40 months without a day off--\"secret\" w/d cure", "1_Text": "I much prefer the warm, slow glow of morphine to the harder hit of the synthetic drugs.", "2_Subreddit": "opiates"}], "7z94ql": [{"0_Title": "How I quit opiates* after 40 months without a day off", "1_Text": "I much prefer the warm, slow glow of morphine to the harder hit of the synthetic drugs.", "2_Subreddit": "opiates"}], "7z9sq5": [{"0_Title": "How I quit opiates after 40 months of daily use", "1_Text": "I much prefer the warm, slow glow of morphine to the harder hit of the synthetic drugs.", "2_Subreddit": "opiates"}], "7z9ykh": [{"0_Title": "Day 5 w/d from PST, and what I used that helped", "1_Text": "I much prefer the warm, slow glow of morphine to the harder hit of the synthetic drugs.", "2_Subreddit": "PoppyTea"}], "8a52c5": [{"0_Title": "Ultrasound cleaner for making PST?", "1_Text": "I much prefer the warm, slow glow of morphine to the harder hit of the synthetic drugs.", "2_Subreddit": "PoppyTea"}]}]}]}