{"PleaseGildMe": [{"0_comments": [{"dudo64k": [{"0_Comment Submission": "TSM: LEGENDS - Season 4 Episode 3 - Zven", "1_Text": "Interesting as soon as Mike had Baron stolen Bjergsen went to \"It's fine Mike, it's fine. It's fine.\"  \n\nUnfortunately, he knows how much that will tilt Mike, especially since he lost a dragon too. Doublelift said on the Dive the only thing holding them back is Mike's confidence. He's good and he needs to believe it and play like it. \n\nedit: Mike sounded a lot more confident vs CLG, he was very vocal in teamfights.. at least when calling out targets. Was nice to hear.", "2_Subreddit": "leagueoflegends"}], "duezviy": [{"0_Comment Submission": "Cloud9 vs. Team SoloMid / NA LCS 2018 Spring - Week 5 / Post-Match Discussion", "1_Text": "Copied from Zirene’s twitter. \n\nhttps://twitter.com/lolzirene/status/965023285036527616", "2_Subreddit": "leagueoflegends"}], "duf7ilv": [{"0_Comment Submission": "Another reason I love Bjerg", "1_Text": "You think he’s not worried? Get the fuck out.", "2_Subreddit": "TeamSolomid"}], "duf7lat": [{"0_Comment Submission": "We are going to fucking crush CG tomorrow", "1_Text": "He was in high school until he was 20. Not surprised.", "2_Subreddit": "TeamSolomid"}], "duf7y4b": [{"0_Comment Submission": "Another reason I love Bjerg", "1_Text": "That’s not what you said. You said he should worry about the team getting better and somehow that tweet means he’s not worried? Showing respect to a friend means he has given up? \n\nShowing respect happens in all levels of all competitive sports. It’s the right thing to do.", "2_Subreddit": "TeamSolomid"}], "duf9yq7": [{"0_Comment Submission": "Another reason I love Bjerg", "1_Text": "I’m with you there, but I think it’s ridiculous for fans that believe that to assume they don’t. I guarantee every loss is killing the team.", "2_Subreddit": "TeamSolomid"}], "dug7ov5": [{"0_Comment Submission": "Another reason I love Bjerg", "1_Text": "The handshake at the end is mandatory from Riot. That shows nothing. A tweet is a more personal sign of respect nowadays, it’s crazy, but true. Welcome to 2018.", "2_Subreddit": "TeamSolomid"}], "duthpqv": [{"0_Comment Submission": "OpTic Gaming vs. Team SoloMid / NA LCS 2018 Spring - Week 6 / Post-Match Discussion", "1_Text": "Was fine. C9 built four QSS and had Banshees on mid. That has literally never happened in any other game skarner has been in this split.", "2_Subreddit": "leagueoflegends"}], "duwc47n": [{"0_Comment Submission": "Weldon is back!!!(Kinda)", "1_Text": "Did you watch the video at all?  \n\nWhy would you say if?", "2_Subreddit": "TeamSolomid"}], "dv3p3yk": [{"0_Comment Submission": "Max Olivo's Future in TSM", "1_Text": "Thanks for everything you did for Legends. Can’t wait to see what other amazing content you bring us in the future!  \n\nI hope Andrew is okay with the Twitter spam!", "2_Subreddit": "TeamSolomid"}], "dvh2le6": [{"0_Comment Submission": "All channels black screen", "1_Text": "Yes.", "2_Subreddit": "Twitch"}], "dvh2ljc": [{"0_Comment Submission": "Twitch on Black Screen and No Audio, Can See Chat?", "1_Text": "Yes.", "2_Subreddit": "Twitch"}], "dvj3nw8": [{"0_Comment Submission": "PSA: NA LCS starts 1 hour earlier for non-Americans because North America moved to summer time today!", "1_Text": "“Because of how worthless it is” lol. I should clarify because you’re statement makes it seem like it’s “worthless” everywhere. \n\nThey don’t observe it because the state of Arizona is so fucking hot that the last thing they want is more sunlight. \n\nI live in Wisconsin. This shit is a blessing during the summer. We want all the sunlight we can get and that’s true for the majority of the states in the country.", "2_Subreddit": "leagueoflegends"}], "dvj3wi6": [{"0_Comment Submission": "PSA: NA LCS starts 1 hour earlier for non-Americans because North America moved to summer time today!", "1_Text": "This is horribly fucking incorrect and just straight propaganda. \n\nGrew up and still live in rural Wisconsin aka farms everywhere. Farmers being able to work later in the night from March to the end of summer is a huge deal. They don’t have the ability to work during winter so they pack as many hours into doing what they do during this phase of DST. Sorry that apparently John Oliver and his producers are too caught up in living in a giant fucking city and anyone who watches his videos probably hasn’t ever stepped on a farm, but this video is bullshit. \n\nIt is important for the entirety of the Midwest. Yes it did not start this way and it was used to save electricity during the war (his one percent number is for today not during WW1 and 2 where it saved a lot of money - cherry picking pointless statistics), but it still remains for farming and any video claiming otherwise is just false.", "2_Subreddit": "leagueoflegends"}], "dvj4nrp": [{"0_Comment Submission": "PSA: NA LCS starts 1 hour earlier for non-Americans because North America moved to summer time today!", "1_Text": "The latest sunset really gets is 8:40 PM. That is awesome. I’m not sure why you are advocating against more sunlight. Even for an average 9 to 5 job, maybe get home at 5:30 and change clothes, you’re getting two hours of sunlight (including the time where the sun is setting) per day after work without DST. I’m definitely a huge fan of the extra hour. So are people who work outside and farmers.", "2_Subreddit": "leagueoflegends"}], "dvj4xtt": [{"0_Comment Submission": "PSA: NA LCS starts 1 hour earlier for non-Americans because North America moved to summer time today!", "1_Text": "LOL. \n\nSorry not sorry, but do you eat? Should we not help the people who provide our country something 100 percent necessary to survive? You’re ignorant. That extra hour of sunlight in the evening is important. \n\nOther logical uses, it’s.. nice? That’s logical. I get you probably live in a basement, but sunlight is a good thing. It’s good for you and more of it is a good thing. It’s safer for driving as well. It is proven to cause less accidents as well since a larger percent of driving is during the day. \n\nYou’re going to forget about DST by tonight. Don’t make it seem like it’s a life changing and harmful experience twice a year.", "2_Subreddit": "leagueoflegends"}], "dvj50sy": [{"0_Comment Submission": "PSA: NA LCS starts 1 hour earlier for non-Americans because North America moved to summer time today!", "1_Text": "World? We’re talking about America here, pal. \nThat 2% makes sure you stay alive. Do you want to be a farmer? Didn’t think so. Growing up in the country is different than on a farm, where everyone you know works on a farm. Just seeing you say it doesn’t do a thing shows me how little you know.", "2_Subreddit": "leagueoflegends"}], "dvj5u4z": [{"0_Comment Submission": "PSA: NA LCS starts 1 hour earlier for non-Americans because North America moved to summer time today!", "1_Text": "1 percent from a study 12 years ago wow! How is it unhealthy? Sunlight is a proven remedy for depression in many cases. Not to mention it’s a literal vitamin.", "2_Subreddit": "leagueoflegends"}], "dvjylto": [{"0_Comment Submission": "Team SoloMid vs. Cloud9 / NA LCS 2018 Spring - Week 8 / Post-Match Discussion", "1_Text": "Once is luck, twice is skill.", "2_Subreddit": "leagueoflegends"}], "dvom9d3": [{"0_Comment Submission": "I’m told Jordy Nelson knew he was being released and that he was already targeting the #Patriots as a potential suitor. Makes a ton of sense", "1_Text": "Well that tweet is wrong. Next year is his fourth year not his fifth.\n\nDrafted in 2015, played 2015-2016 and 2016-2017 for Colts. \n\n2017-2018 for us, 2018-2019 will be his fourth year not fifth and will cost 1.5M, not 8.", "2_Subreddit": "Patriots"}], "dvowrtk": [{"0_Comment Submission": "Champions in your main role that you can't play to save your life", "1_Text": "Warwick. What the fuck is that champion. I don’t get him. He feels clunky as shit to me, I have 70% Win rates on multiple junglers but if I play Warwick I int.  \n\nI can’t tell if I just really hate his kit or if I suck.", "2_Subreddit": "leagueoflegends"}], "dvxf5gw": [{"0_Comment Submission": "Tiebreaker 4 / NA LCS 2018 Spring - Week 9 / Post-Match Discussion", "1_Text": "Too bad MVP is always decided before finals so this is irrelevant and never happened.", "2_Subreddit": "leagueoflegends"}], "dwpptua": [{"0_Comment Submission": "Do You Think The Show Is Really That Bad?", "1_Text": "I guess I'm in the minority, but I love this show. Every episode, almost every scene. I'm not sure where the disconnect is between me and the rest of the sub, but I really love it.", "2_Subreddit": "riverdale"}], "dwu3bti": [{"0_Comment Submission": "I'm Eric Hafner, I'm running for U.S. Congress in Portland, Oregon (OR-3). I want to legalize all drugs, including opiates, but offer ibogaine therapy too, and free drugs for addicts via prescription.", "1_Text": "Lol.", "2_Subreddit": "opiates"}], "dwxjteq": [{"0_Comment Submission": "Available Now // TSM Spring 18 Collection!", "1_Text": "I want to buy TSM Merch and accessories, but not this. Not good. Every other org has better designs, from Jersey on. Disappointed.", "2_Subreddit": "TeamSolomid"}]}], "1_submissions": [{"70ouh4": [{"0_Title": "Nervous?", "1_Text": "Interesting as soon as Mike had Baron stolen Bjergsen went to \"It's fine Mike, it's fine. It's fine.\"  \n\nUnfortunately, he knows how much that will tilt Mike, especially since he lost a dragon too. Doublelift said on the Dive the only thing holding them back is Mike's confidence. He's good and he needs to believe it and play like it. \n\nedit: Mike sounded a lot more confident vs CLG, he was very vocal in teamfights.. at least when calling out targets. Was nice to hear.", "2_Subreddit": "Patriots"}]}]}]}