{"Mortal_nebbisH": [{"0_comments": [{"dskwe70": [{"0_Comment Submission": "Currently nodding on H", "1_Text": "You commented somewhere you’re in nursing school.... and this is your explanation...", "2_Subreddit": "Drugs"}], "dskx0lf": [{"0_Comment Submission": "I know it says serving size 5 capsules but does that mean all at once or throughout the day", "1_Text": "I always throw Kratom caps on the scale. 00 size caps weigh about .15g so you can do some quick math and see how much cause they vary a ton", "2_Subreddit": "opiates"}], "dss06gu": [{"0_Comment Submission": "I almost smoked a lethal amount of heroin and i didnt even know what it was.", "1_Text": "No experience but almost OD’d.... come on with this shit", "2_Subreddit": "opiates"}], "dssyl41": [{"0_Comment Submission": "Supplies good enough?", "1_Text": "For cutting the subs I was thinking cutting the first one in 3 pieces, and the second one first cut in half take one of those half’s and cut it into 4 pieces so it would be like 3 doses of 2.7mg, 2 doses of 2mg and 4 doses of 1mg. Thoughts? Spacing tips?", "2_Subreddit": "opiates"}], "dt2pncd": [{"0_Comment Submission": "Not sure what’s going to happen...", "1_Text": "I wish I knew some one to trade this dope to for subs :/ kind of a secret junky", "2_Subreddit": "opiates"}], "dt3l3gf": [{"0_Comment Submission": "Not sure what’s going to happen...", "1_Text": "I did about .2 and feel like a dumbass. The guy actually takes it back cause it’s hard to find where I am so I’m giving it back in the morning. Idk what the fuck I was thinking. Just hope it’s not completely reset off of that", "2_Subreddit": "opiates"}], "du7m13i": [{"0_Comment Submission": "Guy claiming to be able to send via usps off craigslist?", "1_Text": "If you can pick them up at his house do that but never pay anyone in advance", "2_Subreddit": "opiates"}], "du95apk": [{"0_Comment Submission": "Well, this is it boys and girls. Every junkies worst nightmare (shit post)", "1_Text": "Mulungu? Never heard of it", "2_Subreddit": "opiates"}], "du97cgr": [{"0_Comment Submission": "Can u get charged for someone's od death", "1_Text": "This sounds really really bad dude. Lawyer up", "2_Subreddit": "opiates"}], "du97ibt": [{"0_Comment Submission": "Gave my drug dealer a chocolate kiss for Valentine's Day. Didn't get free bag", "1_Text": "This is the same dude who’s worried about getting arrested for the overdose death of someone that he shot up.... no you’re not getting shit for free and you’re lucky the guy is still selling you dope", "2_Subreddit": "opiates"}], "du9acep": [{"0_Comment Submission": "Gave my drug dealer a chocolate kiss for Valentine's Day. Didn't get free bag", "1_Text": "Your previous post says you did. Why would a dealer want to fuck with a kid who just killed somebody?", "2_Subreddit": "opiates"}], "du9pm2n": [{"0_Comment Submission": "Medication reccomendation", "1_Text": "I’m on 300mg a day of the XR version. A generic Bupropion anyway. I admit I started taking it before I got deep into opiates (still did some just not daily) but I used to not be able to get out of bed or have the motivation to do anything at all. It saved my life. It can make you edgy and your patience may disappear at times, at least mine does. But it does give you quite the energy boost. Apparently the instant version has even more of that effect but I haven’t tried it.", "2_Subreddit": "opiates"}], "du9vph6": [{"0_Comment Submission": "Stash pic, love my baseball display case mirror", "1_Text": "No it doesn’t. Case is pretty small when closed. But it has a giant magnet on the back strong enough to use on the underside of a car", "2_Subreddit": "opiates"}], "duaowuk": [{"0_Comment Submission": "Stash pic, love my baseball display case mirror", "1_Text": "It’s Kratom caps", "2_Subreddit": "opiates"}], "duaoyjy": [{"0_Comment Submission": "Stash pic, love my baseball display case mirror", "1_Text": "That’s what it is. Make them my self tho. Just order the “00” size capsules. Can’t drink that dirt lol", "2_Subreddit": "opiates"}], "duapt71": [{"0_Comment Submission": "what's it like", "1_Text": "I was just like that until a year ago. Decent xanax habit at the time had done a couple percs but nothin crazy. Swore I would never touch the stuff, it had just killed a friend of mine I swore up and down it wouldn’t be me. Then it was offered by a girl I had a huge crush on at the time. I did it and just loooooved the feeling. \n\nWorst mistake I ever made in my life. Don’t do it man. \n\nJust don’t. If you like xans enough to get hooked, then you’ll like H enough to get hooked. Don’t take the chance. I couldn’t be any more serious when I say NEVER touch it. Try not to associate with people who do if you are susceptible to peer pressure.", "2_Subreddit": "opiates"}], "duapwvo": [{"0_Comment Submission": "what's it like", "1_Text": "Agreed. Edibles, edibles, edibles. They work great for getting off/replacing xans. But it doesn’t work that way for H", "2_Subreddit": "opiates"}], "duaq2i3": [{"0_Comment Submission": "what's it like", "1_Text": "I don’t mean to preach but I feel strongly about it. It does not feel good enough for all the bullshit it will end up causing", "2_Subreddit": "opiates"}], "duaqv19": [{"0_Comment Submission": "Finally going to a psychiatrist in a few weeks (for social anxiety, depression) so just wondering how people get prescribed benzos?", "1_Text": "Panic attacks. If you only say you have anxiety you’ll get a med that handles depression and anxiety. If you have anxiety attacks describe them in deep detail. If you don’t, just look up the symptoms and tell him that’s what happens. But the guy commenting before me was right. It’s a bandaid and you’ll become dependent quicker than you think. They’re hesitant to give out much more than Ativan but it does wonders for my attacks. I wish I had something stronger but I can’t do that kind at work. Mostly cause I’ve got some kind of opiate in my system usually and I’d be headed straight to nod city", "2_Subreddit": "opiates"}], "dujd8vy": [{"0_Comment Submission": "Feeling terrible after taking a sub,", "1_Text": "Well I opened another one cut it in half and put it Uber my tongue and 30 min later I was sleeping like a baby. Idk. Maybe I need more bupe but in the past even 1mg can get me through 12 hours and my habit hasn’t changed. I figured 4 would be straight and it was for 6 hours then felt like shit ate 2mg of the same old one..nothing. Two hours later opened that me one and I’m fine....", "2_Subreddit": "opiates"}], "dujdaof": [{"0_Comment Submission": "Feeling terrible after taking a sub,", "1_Text": "Yes 24 hours is what I usually do and it’s really smooth transition", "2_Subreddit": "opiates"}], "duw3nju": [{"0_Comment Submission": "Is alprazolam only meant to be taken orally? Have any of you tried it any other way?", "1_Text": "Well we know they weren’t pressed lol. Xanax taste like shit", "2_Subreddit": "opiates"}], "dvbg4lt": [{"0_Comment Submission": "E8 oxycodone sweet taste?", "1_Text": "Klonopin", "2_Subreddit": "opiates"}], "dvl7ce8": [{"0_Comment Submission": "Vacation tips", "1_Text": "I just put the subs wrapper and all in my wallet, threw it in the bin with my phone and belt and stuff never had an issue", "2_Subreddit": "opiates"}], "dwr6eou": [{"0_Comment Submission": "Fasting helps against urges", "1_Text": "So you don’t use opiates but are here on an opiates sub to tell everyone that fasting helps curb urges for opiates....", "2_Subreddit": "opiates"}]}], "1_submissions": [{"7qywcq": [{"0_Title": "Supplies good enough?", "1_Text": "You commented somewhere you’re in nursing school.... and this is your explanation...", "2_Subreddit": "opiates"}], "7s88dy": [{"0_Title": "Not sure what’s going to happen...", "1_Text": "You commented somewhere you’re in nursing school.... and this is your explanation...", "2_Subreddit": "opiates"}], "7xlzqo": [{"0_Title": "Stash pic, love my baseball display case mirror", "1_Text": "You commented somewhere you’re in nursing school.... and this is your explanation...", "2_Subreddit": "opiates"}], "7ytt19": [{"0_Title": "Feeling terrible after taking a sub,", "1_Text": "You commented somewhere you’re in nursing school.... and this is your explanation...", "2_Subreddit": "opiates"}], "83ovsm": [{"0_Title": "Need some advice", "1_Text": "You commented somewhere you’re in nursing school.... and this is your explanation...", "2_Subreddit": "OpiatesRecovery"}]}]}]}