{"Drewmethyltryptamine": [{"0_comments": [{"dvhfn2i": [{"0_Comment Submission": "Untrustworthy padlock", "1_Text": "*oh my god*", "2_Subreddit": "untrustworthypoptarts"}], "dvjbsr8": [{"0_Comment Submission": "[OT] Sunday Free Write - Chop Suey Edition", "1_Text": " Beef wellington? Not a problem to make.\n\nA Soufflé? Honestly, a piece of cake.\n\nMolten Lava Cake? Doesn’t bother me,\n\nCos I’m the best dang chef you’ll ever see.\n\n\n\n I cut vegetables quicker than you can blink,\n\nMaking complex dishes with only bare hands and the kitchen sink, \n\nBetter than all other chefs combined, just wait and see\n\nThat I’m the best darn chef there'll ever be.\n\n\n\n Oh you’re a baker? Cute, but little did you know\n\nI make Earth’s best pies, with hands tied and while I sleep.\n\nWhen you taste my food, from you I won’t hear a peep\n\nCos I’m the best damn chef on Earth, believe me.", "2_Subreddit": "WritingPrompts"}], "dvmkwa4": [{"0_Comment Submission": "DMT and The Story of Me", "1_Text": "You can usually break through with doses from 25-30mg if you manage to vaporize it properly :)", "2_Subreddit": "Drugs"}], "dvs7uov": [{"0_Comment Submission": "The last thing you purchased on online you now have 20,000 of. How awesome did your life just become?", "1_Text": "½g of DMT... \nWith 10,000g of DMT I could become God", "2_Subreddit": "AskReddit"}], "dvvo97q": [{"0_Comment Submission": "[WP] \"So they are a war species then, huh.\" The alien scratched his head: \"Why are you interested in them. The humans, i mean.\" The other alien got closer. \"They fight for peace. No war species ever fights for peace.\"", "1_Text": "Wow, that was amazing man ♥️", "2_Subreddit": "WritingPrompts"}], "dw78nd4": [{"0_Comment Submission": "How much will my tolerance have dropped in 7 days?", "1_Text": "\"no legs\" \nCould you explain what this means, sorry if this sounds like a really fucking dumb question", "2_Subreddit": "opiates"}], "dwn6xb1": [{"0_Comment Submission": "After 7 months I got my vyvanse prescription back! Forgot how much I liked them :) picking up some h today or tomorrow also 😍", "1_Text": "You can't snort Vyvanse", "2_Subreddit": "opiates"}], "dwrbpy2": [{"0_Comment Submission": "Rupture - 2", "1_Text": "SubscribeMe!", "2_Subreddit": "Inorai"}], "dwwoqfs": [{"0_Comment Submission": "Medically assisted suicide becomes legal in Hawaii", "1_Text": "As a last extreme resort? Yeah, maybe. But something about an illness where suicidality is pretty much the greatest concern, then offering euthanasia as anything more than an extreme last resort rubs me the wrong way. When depressed, one of the greatest reasons for justifying suicide is the belief you'll never get better, and that it's to end your pain/suffering.\n\nI'd love to hear anyone else's point of view though", "2_Subreddit": "news"}], "dwwp36i": [{"0_Comment Submission": "Medically assisted suicide becomes legal in Hawaii", "1_Text": "Thank you", "2_Subreddit": "news"}], "dwwqtly": [{"0_Comment Submission": "Medically assisted suicide becomes legal in Hawaii", "1_Text": "If you weren't suicidal prior to being il, wanting to end your own life is very much the depression. Not forcing anyone to live life, its just ending one's life before exploring all other options of trying to treat someone's want to end their own life seems illogical, no?\n\nIf someone is being treated for depression, it's likely they're in need of help, right? Let's at least try to help them before offering euthanization as an option\n\nI'm Canadian though, I was just thinking outloud hoping to expand my thoughts on the subject", "2_Subreddit": "news"}], "dwwrsiw": [{"0_Comment Submission": "Medically assisted suicide becomes legal in Hawaii", "1_Text": "I don't know if I understood the question completely, but depression is very much a real thing that sometimes comes with a very real want to end one's life.\n\nIsn't having a depressive disorder and not wanting to live 2 different things though?\n\nEdit: \"The most common underlying disorder is depression, 30% to 70% of suicide victims suffer from major depression or bipolar (manic-depressive) disorder.\" \nAlso might be relevant- \"Those with substance abuse disorders are six times more likely to complete suicide than those without.\"\nhttp://www.mentalhealthamerica.net/suicide#1", "2_Subreddit": "news"}]}], "1_submissions": [{}]}]}