{"Longlivekenzo": [{"0_comments": [{"dvxazhd": [{"0_Comment Submission": "[Post Game Thread] #9 Kansas State defeats #16 UMBC, 50-43", "1_Text": "The rarest of rare puppers", "2_Subreddit": "CollegeBasketball"}], "dvxjf4t": [{"0_Comment Submission": "Edward Snowden: Facebook is a surveillance company rebranded as 'social media'", "1_Text": "I agree that corporate data collection has a lot of positive traits, and it isn't inherently bad. You said you believe the issue is when companies don't anonymize the data. I would argue that the norm is for these companies to pass that responsibility onto the consumer, and with so many interconnected profiles linked to our real identities, staying anonymous is near impossible. Consciously or not the majority of people give up their anonymity for the sake of convience.", "2_Subreddit": "worldnews"}], "dw4s2fk": [{"0_Comment Submission": "Eagles sign Mike Wallace", "1_Text": "Corey Clement", "2_Subreddit": "nfl"}], "dw4sda1": [{"0_Comment Submission": "Eagles sign Mike Wallace", "1_Text": "As is tradition in Philly. The past year has been.....surreal", "2_Subreddit": "nfl"}], "dw7wt75": [{"0_Comment Submission": "Young Jeezy - Seen It All (feat. Jay Z)", "1_Text": "Now the nets a stone's throw***", "2_Subreddit": "hiphopheads"}], "dw88gmq": [{"0_Comment Submission": "Been meaning to say something about this a long time. Vein in my inner right arm had been slightly puffy like this for a while. Doesn’t hurt or anything and no visible track marks. Not trolling but anyone else have this/should I be concerned?", "1_Text": "I have that. Its scar tissue. Try rotating injection sites. I'm pretty sure its harmless but I'm not exactly a bastion of good health. you might want to not hit there for a while to let it heal.", "2_Subreddit": "opiates"}], "dwbd2ba": [{"0_Comment Submission": "Opiates or a girlfriend", "1_Text": "Opiates. Every single time. Without hesitation or second thought. I Wonder why I'm single.", "2_Subreddit": "opiates"}], "dwcamzr": [{"0_Comment Submission": "Post game thread: WHO UP! FULTZ IS FINALLY BACK AND THE SIXERS WIN THEIR 7TH IN A ROW AGAINST THE DENVER NUGGETS", "1_Text": "WE'RE BUZZIN BOIS!! Such an incredible atmosphere tonight. How can you not love this team", "2_Subreddit": "sixers"}], "dwf2zzp": [{"0_Comment Submission": "RIP OldRapGroup", "1_Text": ".", "2_Subreddit": "opiates"}], "dwk8p2d": [{"0_Comment Submission": "First time help me please! :)", "1_Text": "I wouldnt suggest trying opiates and I absolutley wouldnt suggest driving while high. Especially your first time. 15 mg should be a good first dose tho. Also Norco not narco. Good luck OP", "2_Subreddit": "opiates"}], "dwmwjse": [{"0_Comment Submission": "Do y'all prefer taped stamps (no Ziploc) or untaped bags with the Ziploc double-baggie?", "1_Text": "Absolutley hate taped bags. I can never open them quickly. Where I'm at its all mini ziplocs and I can open them instantly. Trying to fuck around with a taped bag while in severe wds is a fickle bitch. The extra layer of Ziploc is a godsend on the snow or rain too.", "2_Subreddit": "opiates"}], "dwnblou": [{"0_Comment Submission": "I think I'm the only one who wants fenty-dope", "1_Text": "Oh contraire! Fent will not save you money and quickly reaches a point of diminishing returns. It wears off super fast, causing you to redose frequently while also making your tolerance skyrocket. Also a fent high isn't very euphoric and its just kind of an overwhelming tiredness with nausea in my experience. If all of that wasnt shitty enough Its so fucking deadly. To each their own but fent is the absolute worst and I hate how much it has fucked up the game. All for a worse high too.", "2_Subreddit": "opiates"}], "dwnbqep": [{"0_Comment Submission": "Policy Change regarding human consumption", "1_Text": "Kicker. Please say April fools.", "2_Subreddit": "opiates"}], "dwnidsp": [{"0_Comment Submission": "What's everybody doing for Easter?", "1_Text": "Just laying around thinking about what a piece of shit I am.", "2_Subreddit": "opiates"}], "dwnifdf": [{"0_Comment Submission": "What's everybody doing for Easter?", "1_Text": "BAN ME THEN AUTOMOD YOU WONT", "2_Subreddit": "opiates"}], "dwol7mu": [{"0_Comment Submission": "Put on naltrexone for fibromyalgia... is this going to fuck my relapse", "1_Text": "Wow that REALLY sucks. Obviously I'm no doctor just a junkbox on the internet but if you plan on continuing using opiates, you cant take naltrexone or it will fuck you up BAD. If memory serves they(doctors) make you wait 7-10 days after your last dose before you can even start naltrexone. Sorry OP.", "2_Subreddit": "opiates"}], "dwply2b": [{"0_Comment Submission": "[Post Game Thread] #1 Villanova defeats #3 Michigan 79-62 to win the National Championship", "1_Text": "Happy cake day!", "2_Subreddit": "CollegeBasketball"}], "dwplz6q": [{"0_Comment Submission": "[Post Game Thread] #1 Villanova defeats #3 Michigan 79-62 to win the National Championship", "1_Text": "Ouch", "2_Subreddit": "CollegeBasketball"}], "dwpmdgg": [{"0_Comment Submission": "The 1% grabbed 82% of all wealth created in 2017", "1_Text": "Time to revolt fellow peasants!", "2_Subreddit": "worldnews"}], "dww7zuh": [{"0_Comment Submission": "I need to quit, at least for awhile. What has worked for you?", "1_Text": "Kratom probably is available to you OP. Check the Kratom sub. Xanax has always helped me with the sickness. Just get high on benzos and weed for a week and your in the clear With minimal pain. That's what works for the sickness in my expirenece. With the mental part, working out, playing xbox and surrounding yourself with friends, if possible. I mean...I dont have any friends but it sounds like it would help lmao", "2_Subreddit": "opiates"}], "dwwd4f6": [{"0_Comment Submission": "Feelsgoodman.jpg", "1_Text": "Be careful OP thats such a dangerous combo. BUT GODDAMN DO I LOVE IT! POP XANS SHOOT DOPE TILL I MUTHAFUCKIN DIE (which is hopefully soon)", "2_Subreddit": "opiates"}], "dwwddqm": [{"0_Comment Submission": "Fentanyl transdermal system 100 micrograms an hour for 72 hours", "1_Text": "Agreed. The fentanyl high is trash anyway, by far the least euphoric opiate I've ever done. With no tolerance it'll probably just make you super sick/puke a bunch. and probably kill you. that's not even hyperbole. Fent has killed SO many people, people with years and years of tolerance and harm reduction knowledge. Do NOT take it. Trade it. The person above me is 100% right. I just had to second what he said to reiterate that fentanyl in any form is not to be fucked with in any place that isnt a hospital.", "2_Subreddit": "opiates"}], "dwwr4hd": [{"0_Comment Submission": "Is making the jump from prescription pills to heroin really as big of a deal as it's made out to be?", "1_Text": "Agreed. And the jump to the needle will speed up that downward spiral exponentially as well. But nosecandiez how are you doing? Are things still going well?", "2_Subreddit": "opiates"}], "dwwr8r0": [{"0_Comment Submission": "Appearing in court tomorrow for sentencing on first and only possession charge...", "1_Text": "As your junkbox internet lawyer I would advise against that. Tell them what they want to hear or dont say anything at all. Now is not the time to protest.", "2_Subreddit": "opiates"}], "dwx6eep": [{"0_Comment Submission": "2-mcf? Fentanyl analog..proper disposal?", "1_Text": "Mail it to me.... Ill dispose of it properly", "2_Subreddit": "opiates"}]}], "1_submissions": [{"5d1tpt": [{"0_Title": "A long time lurk I'm finally trying to join the r/opiates fam, and a question regarding opiophile", "1_Text": "The rarest of rare puppers", "2_Subreddit": "opiates"}], "6sfmm1": [{"0_Title": "The best day of my life: the ultimate come up", "1_Text": "The rarest of rare puppers", "2_Subreddit": "opiates"}], "6sr2jg": [{"0_Title": "The Ultimate come up part 2: Shit gets real in suburbia", "1_Text": "The rarest of rare puppers", "2_Subreddit": "opiates"}], "6t3pru": [{"0_Title": "Burnt for my freedom: just call me sicky minaj", "1_Text": "The rarest of rare puppers", "2_Subreddit": "opiates"}], "76fw1a": [{"0_Title": "Dopefiend type longreads/blogs?", "1_Text": "The rarest of rare puppers", "2_Subreddit": "opiates"}], "7dwqed": [{"0_Title": "is it plausible/legal to livestream my addiction", "1_Text": "The rarest of rare puppers", "2_Subreddit": "opiates"}], "7nv13u": [{"0_Title": "So frustrating trying to get to treatment", "1_Text": "The rarest of rare puppers", "2_Subreddit": "opiates"}], "7o5wi7": [{"0_Title": "I'm still not in rehab....... Update from yesterday", "1_Text": "The rarest of rare puppers", "2_Subreddit": "opiates"}], "82rpyv": [{"0_Title": "Just fell into the toilet", "1_Text": "The rarest of rare puppers", "2_Subreddit": "opiates"}]}]}]}