{"BaddyVelvet": [{"0_comments": [{"dwkkv0h": [{"0_Comment Submission": "Why is it so hard for so many guys to stay loyal?", "1_Text": "This literally just happened 2 hours ago, we've been sitting in our garage smoking our various substances in silence for the past 30-45 minutes.\n\nHe still hasn't even attempted to do anything to express responsibility, remorse, or compassion towards my pain.", "2_Subreddit": "AskMen"}], "dwkl158": [{"0_Comment Submission": "Why is it so hard for so many guys to stay loyal?", "1_Text": "This input was very useful thank you  I \nappreciate you taking the time to help.", "2_Subreddit": "AskMen"}], "dwkl63g": [{"0_Comment Submission": "Why is it so hard for so many guys to stay loyal?", "1_Text": "He's almost 35, and he has a thing for younger girls. For example I'm 22, and all the girls I've seen him talk to are below the age of 25, and some of them, the most recent batch, are somewhere between 15 to 17 years old", "2_Subreddit": "AskMen"}], "dwklatq": [{"0_Comment Submission": "Why is it so hard for so many guys to stay loyal?", "1_Text": "? Idk try r/askwomen I'm not bashing on men I'm trying to figure out my own shit here. I've literally never cheated so you're asking the wrong female", "2_Subreddit": "AskMen"}], "dwklhxa": [{"0_Comment Submission": "Why is it so hard for so many guys to stay loyal?", "1_Text": "I mean this guy was the opposite of an asshole other than this issue. So I thought I had a different kind of guy. I never would have believed anyone if they told me about this stuff before I found it myself. I'm just at the point where I am keeping everyone at arms length because people can be so God damn deceptive", "2_Subreddit": "AskMen"}], "dwklxpv": [{"0_Comment Submission": "Why is it so hard for so many guys to stay loyal?", "1_Text": "Thank you, appreciate the understanding. I'm working to get clean, just bc i use/abuse shit doesn't mean I put that ahead of the people in my life", "2_Subreddit": "AskMen"}], "dwkntlf": [{"0_Comment Submission": "Why is it so hard for so many guys to stay loyal?", "1_Text": "Thank you so much  this is definitely a perspective I needed, I appreciate it very much", "2_Subreddit": "AskMen"}], "dwknwju": [{"0_Comment Submission": "Why is it so hard for so many guys to stay loyal?", "1_Text": "Thank you, these are the kind of things I need to hear.", "2_Subreddit": "AskMen"}], "dwko9e1": [{"0_Comment Submission": "Why is it so hard for some guys to stay loyal?", "1_Text": "Years of various types of abuse have depleted my self worth", "2_Subreddit": "rant"}], "dwkod6o": [{"0_Comment Submission": "Why is it so hard for so many guys to stay loyal?", "1_Text": "You should look through the comments to get a better understanding of the nature of the relationship", "2_Subreddit": "AskMen"}], "dwm6yk2": [{"0_Comment Submission": "Anybody know what’s going on down Fairway?", "1_Text": "This was just across the street from me but I had no idea what was going on, that's crazy to think someone in this neighborhood would do that kind of stuff", "2_Subreddit": "Roseville"}], "dwm7bl2": [{"0_Comment Submission": "Busy in the foothills | Auburn, CA [OC] [3600x2403]", "1_Text": "I love hanging out where you took this picture from. Awesome shot.", "2_Subreddit": "ruralporn"}], "dwm7cha": [{"0_Comment Submission": "Busy in the foothills | Auburn, CA [OC] [3600x2403]", "1_Text": "Well the town is right off of an interstate, this is the interstate.", "2_Subreddit": "ruralporn"}], "dwnaqdg": [{"0_Comment Submission": "Busy in the foothills | Auburn, CA [OC] [3600x2403]", "1_Text": "Lol have you never been on a road trip? There are many rural towns right off of every single major freeway/highway. That doesn't mean they're any more urban? If you drive from Sacramento to the Bay Area, a good percentage if not most of it will be farmland/\"one horse\" towns  that mainly function as truck stops. On an interstate while simultaneously remaining rural.", "2_Subreddit": "ruralporn"}], "dwnbyvw": [{"0_Comment Submission": "Busy in the foothills | Auburn, CA [OC] [3600x2403]", "1_Text": "That's fine, I don't have a problem disagreeing. \n\nI just have lived in towns that had only a gas station/grocery store, fire department, and a bar but were on a major highway about 45 minutes from the nearest city. You're definitely in a more rural area, I just don't think that makes any farm town on an highway not rural. And that's fine if you don't agree.\n\nJust read your last comment as though you were trying to be sassy so that's the only reason I was too.", "2_Subreddit": "ruralporn"}], "dwnrlfl": [{"0_Comment Submission": "Should I start using benzos?", "1_Text": "If you only use it for those kinds of occasions you should be fine, I think a lot of the commenters are worried about you doing it daily but if you make sure you have multiple days in between using I don't think you will have a problem. Benzo abuse can lead to seizures but as long as you just use it for situations you ACTUALLY have anxiety about, I don't see why you wouldn't be fine.\n\nIf you have an addictive personality or have a history of drug abuse I would avoid them so you don't risk inducing seizures but again if you don't and you use them as needed you should be fine.", "2_Subreddit": "Drugs"}], "dwnug7l": [{"0_Comment Submission": "This rock that was once tree.", "1_Text": "My boyfriend has a rock that's very similar to this, thanks for posting!", "2_Subreddit": "mildlyinteresting"}], "dwnvoc9": [{"0_Comment Submission": "Does she want another message?", "1_Text": "Yeah, just don't push the meeting thing. She doesn't seem ready yet, but if she seems receptive to you otherwise then just engage in that until she decides she's comfortable with it. If you respect that and don't push it, you will probably earn that faster. :)", "2_Subreddit": "OkCupid"}], "dwnvvd0": [{"0_Comment Submission": "Does she want another message?", "1_Text": "And if she doesn't want you to talk to her that's on her to communicate", "2_Subreddit": "OkCupid"}], "dwq1jnu": [{"0_Comment Submission": "Platybelodon, an ancestor of the elephant, looks like a deformed monstrosity from a horror movie", "1_Text": "I laughed so hard the first time I saw this picture when I was like 16 and stoned as fuck", "2_Subreddit": "WTF"}], "dwqwf4q": [{"0_Comment Submission": "How long does PAWS last?!?!", "1_Text": "They will come and go. I needed to take zoloft and do a lot of things that made me feel accomplished before I relapsed.  I relapsed because I stopped doing these fulfilling things", "2_Subreddit": "Drugs"}], "dww9pas": [{"0_Comment Submission": "How to stop making bender a reoccurring thing?", "1_Text": "You have to find a healthy coping habit that directly interferes with using whatever you use. You have to look for other things that fulfill you that you can turn to to feel better so the drugs aren't so tempting or necessary to feel okay. I'm not sure what kind of stuff you're into, but that's the only thing that's ever worked for me.", "2_Subreddit": "Drugs"}], "dwwbud8": [{"0_Comment Submission": "Why is it so hard for so many guys to stay loyal?", "1_Text": "Oh I didn't mean to imply you did, sorry bout that.", "2_Subreddit": "AskMen"}], "dwwci42": [{"0_Comment Submission": "Why is it so hard for so many guys to stay loyal?", "1_Text": "I'm talking about my experience with guys. Not only the guys I've dated but also the guys my female friends have dated and the guys I've had platonic friendships with have seemed to also have this problem. I'm not meaning to put this label on faithful guys, I meant to legitimately get answers from guys who have this problem too so I could try to understand this behavior better. If I understand it, maybe that could help me reverse-engineer a solution.", "2_Subreddit": "AskMen"}], "dwwffx2": [{"0_Comment Submission": "Anybody have exp with this it turns to tar", "1_Text": "Gunpowder, yeah. Normally p good", "2_Subreddit": "opiates"}]}], "1_submissions": [{"7tfaow": [{"0_Title": "Anarcho-capitalist toucan", "1_Text": "This literally just happened 2 hours ago, we've been sitting in our garage smoking our various substances in silence for the past 30-45 minutes.\n\nHe still hasn't even attempted to do anything to express responsibility, remorse, or compassion towards my pain.", "2_Subreddit": "Anarcho_Capitalism"}], "88h04q": [{"0_Title": "Why is it so hard for so many guys to stay loyal?", "1_Text": "This literally just happened 2 hours ago, we've been sitting in our garage smoking our various substances in silence for the past 30-45 minutes.\n\nHe still hasn't even attempted to do anything to express responsibility, remorse, or compassion towards my pain.", "2_Subreddit": "AskMen"}], "88h36s": [{"0_Title": "Why is it so hard for some guys to stay loyal?", "1_Text": "This literally just happened 2 hours ago, we've been sitting in our garage smoking our various substances in silence for the past 30-45 minutes.\n\nHe still hasn't even attempted to do anything to express responsibility, remorse, or compassion towards my pain.", "2_Subreddit": "rant"}], "88x403": [{"0_Title": "\"How did your engagement end?\"", "1_Text": "This literally just happened 2 hours ago, we've been sitting in our garage smoking our various substances in silence for the past 30-45 minutes.\n\nHe still hasn't even attempted to do anything to express responsibility, remorse, or compassion towards my pain.", "2_Subreddit": "NobodyAsked"}]}]}]}