{"Flutterbybyby": [{"0_comments": [{"dndw3li": [{"0_Comment Submission": "He shoots, he scores.", "1_Text": "Is that a real kind of animal or is it a stuffed animal?", "2_Subreddit": "opiates"}], "dne42za": [{"0_Comment Submission": "He shoots, he scores.", "1_Text": "Thank you!", "2_Subreddit": "opiates"}], "dngh8uv": [{"0_Comment Submission": "If your habit only cost $5 a day?", "1_Text": "It would be great, but problem is...it wouldn't etay $5 forever. Tolerance is a bitch.", "2_Subreddit": "opiates"}], "dnngzvg": [{"0_Comment Submission": "Upvotes to the left for 40mg pandas", "1_Text": "I didn't get much out of them either unfortunately", "2_Subreddit": "opiates"}], "dnnt1aq": [{"0_Comment Submission": "Upvotes to the left for 40mg pandas", "1_Text": "Yep", "2_Subreddit": "opiates"}], "do5u4zd": [{"0_Comment Submission": "Time to fuck that shit up", "1_Text": "Why do you think it might the last time you do pill porn? Do you think you might get cut off? 😯", "2_Subreddit": "opiates"}], "do5w4lt": [{"0_Comment Submission": "Time to fuck that shit up", "1_Text": "Ahhh, well I'm glad you won't be losing your script!", "2_Subreddit": "opiates"}], "dobf8sp": [{"0_Comment Submission": "Question about od, medical record, and the military.", "1_Text": "I think you sign a release for the military to obtain your medical records as part of the recruitment process and if you refuse to release them, that would probably be the end of the process for you.", "2_Subreddit": "opiates"}], "dobo46r": [{"0_Comment Submission": "Question about od, medical record, and the military.", "1_Text": "I’m sorry, I don’t know. If I were you, I’d explain everything to your recruiter and see if they think you should go any further. Good luck!\n\nI googled and these results came up that might help:\n\nhttp://www.military.com/join-armed-forces/disqualifiers-alcohol.html\n\nhttps://www.thebalance.com/us-military-enlistment-standards-3354008", "2_Subreddit": "opiates"}], "dof0qgo": [{"0_Comment Submission": "Question about tolerance", "1_Text": "Do you take the same amount of medication at the same time everyday? If so, that is probably one reason your tolerance hasn’t skyrocketed.\n\nIts when the dosages increases sporadically, that tolerance grows because your body creates more opioid receptors in your brain for the increased dosage and then when you go back to the lower dosage it doesn’t cover all the receptors and it doesn’t seem like enough anymore.", "2_Subreddit": "opiates"}], "dolyn3i": [{"0_Comment Submission": "Found on r/trashy, thought this would be a better home", "1_Text": "I love that he’s sporting the matching shorts too!", "2_Subreddit": "opiates"}], "doyoimc": [{"0_Comment Submission": "Off the Market", "1_Text": "You’re not the only one! I had problems with them too.", "2_Subreddit": "opiates"}], "dpfjq6j": [{"0_Comment Submission": "I start new job tomorrow", "1_Text": "My husband is in that profession here in the US and has only been tested when changing jobs", "2_Subreddit": "opiates"}], "dpg9v9s": [{"0_Comment Submission": "I start new job tomorrow", "1_Text": "Isn’t that a statement if I ever heard one for legalization! :)", "2_Subreddit": "opiates"}], "dpnmwag": [{"0_Comment Submission": "because tinychat is unaffiliated with anything that has to do with reddit, we enjoy certain freedoms...", "1_Text": "Can one join to chat thru text but not be on a video feed? I’m not crazy about others seeing me but am potentially interested in participating in a live chat. Thanks", "2_Subreddit": "opiates"}], "dpwwhgp": [{"0_Comment Submission": "Which One of You Hit My Local Pharmacy Last Night? =P", "1_Text": "Damn...the pharmacists carry? I can guess which state you are probably in lol", "2_Subreddit": "opiates"}], "dpzyfll": [{"0_Comment Submission": "Is it safe to sleep?", "1_Text": "Off topic, but if you are ingesting codeine via T3 or T4 tablets I hope you are CWE (cold water extraction) the tylenol out. At the levels of codeine you are talking about ingesting you would also be ingesting toxic levels of tylenol. There is a CWE guide in the sidebar. Just want you to be as safe as possible! :)", "2_Subreddit": "opiates"}], "dtohz6g": [{"0_Comment Submission": "More stuff my roommates crazy wife says pt 2", "1_Text": "Last line, “Google is her undoing”...\n\nI have the impression that even pre-Google you would’ve been able to figure out she was stretching the truth, lol.", "2_Subreddit": "opiates"}], "dtvu1mz": [{"0_Comment Submission": "Or you could just send them to me.", "1_Text": "I looked up DisposeRx and it made me so sad to read that these are packets of biodegradable polymers that pharmacies hand out for free for customers to use at home to eliminate unused opiates from peoples medicine cabinets. When the DisposeRx packet is mixed with water and unused prescriptions in the old rx bottle it solidifies everything and encapsulates the rx chemicals so that they can’t be extracted.\n\n\n\nHere is text from their FAQ section of the website:\n\n\n4. How does DisposeRx work when added to my medication?\nOur non-toxic, cross-linking polymers that, when added to the prescription vial with water and shaken, permanently sequester unused, unwanted and/or expired Rx medications in a safe, viscous biodegradable gel that can simply be discarded in the household waste. Once treated, drugs cannot be extracted for abuse or pollute landfills since the sequestered drugs and the gel matrix rapidly biodegrade.\n\n\nI feel bad for all those good drugs imprisoned and thrown away, never to meet their destiny of bringing pain relief and euphoria.", "2_Subreddit": "opiates"}], "du35szt": [{"0_Comment Submission": "Being a junkie is fucking pathetic", "1_Text": "Good question...you should make this a separate post!", "2_Subreddit": "opiates"}], "dv8wwib": [{"0_Comment Submission": "My gf is coming off a year long drug binge and she’s not happy about it", "1_Text": "I’m glad you found a system that works for you. I have many friends that jumped back and forth though and eventually the sub stopped working for them. Just something to watch out for.", "2_Subreddit": "opiates"}], "dva6a3n": [{"0_Comment Submission": "My gf is coming off a year long drug binge and she’s not happy about it", "1_Text": "Unfortunately, none of the friends that switched back and forth over and over and over again were able to keep doing it after a year or two of weekend binging.\n\nLike u/Native_Nod posted below, its not that the sub stops working altogether...more like it takes a few days of feeling like shit just to induct again. If you are a weekend warrior, by the time you’re inducted again and finally feeling better would be about the same time you would be chipping again the next weekend.", "2_Subreddit": "opiates"}], "dvq054g": [{"0_Comment Submission": "Found this on r/wtf", "1_Text": "What do you mean by “weird lights”?", "2_Subreddit": "opiates"}], "dw7yrdm": [{"0_Comment Submission": "Yummy brown shot and Unbreakable Kimmy Schmidt, this show is so funny!", "1_Text": "She’s alive, dammit!", "2_Subreddit": "opiates"}], "dwwy20i": [{"0_Comment Submission": "What you know about those sour sloths? And these are the weirdest percs I've ever seen.", "1_Text": "I love how the sloth in the picture has braces :)", "2_Subreddit": "opiates"}]}], "1_submissions": [{}]}]}