{"DMVbandz": [{"0_comments": [{"dwnygc4": [{"0_Comment Submission": "Today I learned John F Kennedy used a bunch of drugs.", "1_Text": "Churchill was on an otherworldly amount of pills to go with his drinking habit", "2_Subreddit": "Drugs"}], "dwnzz03": [{"0_Comment Submission": "Need a new dark side of the rainbow", "1_Text": "A little late but rodeo by Travis Scott and I agree with dude who said planet earth 2 it’s fucking insane", "2_Subreddit": "Drugs"}], "dwo0321": [{"0_Comment Submission": "Does anyone else hate the smell of cigarette on their boyfriend/girlfriend?", "1_Text": "Get her a juul lol. I don’t have one but a lot of my friends quit smoking off those or other vapes. Glad I never picked up the habit tbh", "2_Subreddit": "Drugs"}], "dwo0bbl": [{"0_Comment Submission": "Missed a shot about 4 days ago the pain has gone away but it doesnt look much better should i go to the ER or is the pain going away a good sign?", "1_Text": "I’d play it safe and do it for the duration of the antibiotics. You don’t wanna mess around with that sort of shit lol", "2_Subreddit": "opiates"}], "dwo109d": [{"0_Comment Submission": "I love hospitals", "1_Text": "When I was shot I didn’t exactly feel the pain until a second or 2 after. A lower caliber like a 9 felt like a big bee sting until a second or so later. Shock takes care of a lot of it idk getting shot feels like getting shot. All I felt either of the times was white hot pain and when I got hit with a 40 to the lower abdomen it got cold. Idk if that makes sense I’m smacked as shit now tryna remember the details. \n\nFeels like nothing I ever felt before", "2_Subreddit": "Drugs"}], "dwod5o4": [{"0_Comment Submission": "600 mg pregabalin report", "1_Text": "I’m on 600mg right now. My tolerance is fucking absurd so I gotta take a few days off to reset. Rebound anxiety is real with lyrica if you take a lot for a few days", "2_Subreddit": "Drugs"}], "dwohqvm": [{"0_Comment Submission": "Today I learned John F Kennedy used a bunch of drugs.", "1_Text": "Idk how he didn’t die cuz that man was on barbiturates amphetamines opiates and drinking enough to give alcohol poisoning to a small horse lmao", "2_Subreddit": "Drugs"}], "dwoiqem": [{"0_Comment Submission": "Getting 4 wisdom teeth out", "1_Text": "Wait at least 5. I got dry socket smoking a few days after it was a bitch.", "2_Subreddit": "Drugs"}], "dwokgaa": [{"0_Comment Submission": "Was my xanax laced ?", "1_Text": "What else did you take? Maybe some cross contamination idk. With fent idk if you would’ve gotten dope sick you would’ve just been close to overdose. What did it feel like? I’ve done fent accidentally more than a few times so", "2_Subreddit": "benzodiazepines"}], "dwp5orl": [{"0_Comment Submission": "Hallucinating after taking Zopiclone?", "1_Text": "That’s ambian right? Yea lol I used to get pretty fucked up for about 2 hours on that stuff. Idk why exactly it does it something with it being hypnotic and a sedative but if the point of the post was to ask if anyone else experiences this then yea you’re not alone", "2_Subreddit": "Drugs"}], "dwpg12d": [{"0_Comment Submission": "Fent Warning College Park MD", "1_Text": "Good for lookin out moe", "2_Subreddit": "opiates"}], "dwsklqr": [{"0_Comment Submission": "My Buddy Found Me Drunk", "1_Text": "Why tf are you Shooting for views and likes like this is ig or whatever. Earn your like boy post a half decent story god damn", "2_Subreddit": "Drugs"}], "dwsw2g8": [{"0_Comment Submission": "Lyrica pregabalin tolerance ?", "1_Text": "I’ve had almost good reset after 2-3 days. Try not to take that much lol not cuz it’s bad for you but cuz it can take a brick to go back down if you wanna use it with any frequency. I can stick at a 600mg every other other day and take 300mg daily and still get buzzed when I do that increase every few days. I still get some of the more therapeutic effects from my 300mg days too if I take it all at once", "2_Subreddit": "Drugs"}], "dwut4q0": [{"0_Comment Submission": "Lyrica pregabalin tolerance ?", "1_Text": "About 2 weeks", "2_Subreddit": "Drugs"}], "dwv4caj": [{"0_Comment Submission": "Been on benzos for a year, when I ran out I felt no WD?", "1_Text": "For me wds really kicked in about 2 weeks after I stopped taking mine. How much are you on?", "2_Subreddit": "benzodiazepines"}], "dwv4v8h": [{"0_Comment Submission": "rolled too much molly, dope story below but i need advice!", "1_Text": "Man I had a week where I took increasingly large amounts of Molly every day and ended up blowing thru a quarter oz. that was 2 years ago and I still have visual snow. The retarded feeling went away after about a year but smoking weed didn’t hurt but I limited myself to 1 1g cart per week so idk about heavy use. Get some 5htp and chill on any drugs like psychs and Molly. I rolled about 6 months ago and I was able to enjoy it ok this shit just takes time dog", "2_Subreddit": "Drugs"}], "dwv4xnv": [{"0_Comment Submission": "Been on benzos for a year, when I ran out I felt no WD?", "1_Text": "Yea idk why but at least for me withdrawals take a bit to fully kick in. Benzos like klonopin and Valium have crazy long halflife’s so maybe that plays a factor", "2_Subreddit": "benzodiazepines"}], "dwv5fgx": [{"0_Comment Submission": "Holy shit, I'm fucked....", "1_Text": "Learn from your mistakes man. Fucked up that everyone else got bagged bro that’s what I’d be worried about.", "2_Subreddit": "Drugs"}], "dwv5ua7": [{"0_Comment Submission": "Holy shit, I'm fucked....", "1_Text": "Best thing you can do is promise them it won’t happen again and try to make up for it. Ima be real with you a lot of them prolly won’t fuck with you again. Just be extra careful about your business keep that shit separate from your family lol don’t open incriminating shit on a family computer", "2_Subreddit": "Drugs"}], "dwv7srn": [{"0_Comment Submission": "Which strain between these for sex(first time)?", "1_Text": "Whatever you decide on doing you gotta beat your dick like an hour before y’all go at it. The first nut for me is always a wildcard. Could take me half an hour I could get it out in 5 mins I can never tell. Second one is Always more consistent", "2_Subreddit": "kratom"}], "dwv9tzl": [{"0_Comment Submission": "rolled too much molly, dope story below but i need advice!", "1_Text": "Still have the visual snow but no big holes in my vision anymore. That shit was horrible I thought I was dying lol. Tbh you get used to it just try not to stare at any big blank spaces cuz then the static gets really noticeable. Don’t trip out about it and remember that ur brain can heal itself it just takes time", "2_Subreddit": "Drugs"}], "dwva619": [{"0_Comment Submission": "This is torture", "1_Text": "Do a toss and wash with oj and only do it with half teaspoons or quarters cuz I’ve found that a whole one can be a bit much", "2_Subreddit": "opiates"}], "dwva9ip": [{"0_Comment Submission": "What is safe to take with buspar?", "1_Text": "You should be good. I’m on 90mg a day and I smoke n drink regularly. Done psychs and Molly on it too but idk if that was risky or not", "2_Subreddit": "Drugs"}], "dww07cu": [{"0_Comment Submission": "Crushing OxyContin??", "1_Text": "Just eat it. More BA than snorting and if it’s newer it’ll be gel and tnose are impossible to snort unless you shave it.", "2_Subreddit": "Drugs"}], "dww2yy8": [{"0_Comment Submission": "What is safe to take with buspar?", "1_Text": "Tbh I haven’t noticed much and the only reason why I’m on such high of a dose is that it helped me get scripted lyrica, which works great. There might’ve been a small difference but it’s not the drug for me and I’ll be off it shortly. How long have you been on it? The first week my anxiety actually went up and then went back to, or maybe a little below, the baseline. 10mg is a very small dose so if you think it might help you whatsoever go up a little to like 30 a day and then evaluate", "2_Subreddit": "Drugs"}]}], "1_submissions": [{"4doyyr": [{"0_Title": "How to take Hydromorphone 2mg pills", "1_Text": "Churchill was on an otherworldly amount of pills to go with his drinking habit", "2_Subreddit": "opiates"}], "4fwccu": [{"0_Title": "Feeling really sick after use. How long will this last and how should I get rid of it?", "1_Text": "Churchill was on an otherworldly amount of pills to go with his drinking habit", "2_Subreddit": "opiates"}], "4hx0f4": [{"0_Title": "Getting drug tested tomorrow. Am I fucked?", "1_Text": "Churchill was on an otherworldly amount of pills to go with his drinking habit", "2_Subreddit": "opiates"}], "4l3qj6": [{"0_Title": "Fucked up. How long until withdrawals end.", "1_Text": "Churchill was on an otherworldly amount of pills to go with his drinking habit", "2_Subreddit": "Drugs"}], "4tt4yk": [{"0_Title": "Questions about kpins", "1_Text": "Churchill was on an otherworldly amount of pills to go with his drinking habit", "2_Subreddit": "benzodiazepines"}], "4uwts1": [{"0_Title": "How long should it take for klonopin to hit sublingually?", "1_Text": "Churchill was on an otherworldly amount of pills to go with his drinking habit", "2_Subreddit": "benzodiazepines"}], "4wj9h1": [{"0_Title": "How much Klonopin to get high while prescribed a high dose?", "1_Text": "Churchill was on an otherworldly amount of pills to go with his drinking habit", "2_Subreddit": "benzodiazepines"}], "4wtt9e": [{"0_Title": "Kpins+alcohol?", "1_Text": "Churchill was on an otherworldly amount of pills to go with his drinking habit", "2_Subreddit": "benzodiazepines"}], "4xavis": [{"0_Title": "Heroin+klonopin. Will I die? This is sourcing but I can't find any solid answers anywhere else", "1_Text": "Churchill was on an otherworldly amount of pills to go with his drinking habit", "2_Subreddit": "opiates"}], "517uqg": [{"0_Title": "On a lot of klonopin, how much to get really fucked up with this tolerance?", "1_Text": "Churchill was on an otherworldly amount of pills to go with his drinking habit", "2_Subreddit": "benzodiazepines"}], "6q4lca": [{"0_Title": "110mg of Valium", "1_Text": "Churchill was on an otherworldly amount of pills to go with his drinking habit", "2_Subreddit": "benzodiazepines"}], "7ghe9y": [{"0_Title": "Tolerance question", "1_Text": "Churchill was on an otherworldly amount of pills to go with his drinking habit", "2_Subreddit": "opiates"}], "7hjkx1": [{"0_Title": "Midazolam", "1_Text": "Churchill was on an otherworldly amount of pills to go with his drinking habit", "2_Subreddit": "benzodiazepines"}], "7k4oeb": [{"0_Title": "Does it get easier as time goes by?", "1_Text": "Churchill was on an otherworldly amount of pills to go with his drinking habit", "2_Subreddit": "opiates"}], "7p8upw": [{"0_Title": "Gaia shipping times?", "1_Text": "Churchill was on an otherworldly amount of pills to go with his drinking habit", "2_Subreddit": "kratom"}], "83xv3f": [{"0_Title": "Family member filling my script", "1_Text": "Churchill was on an otherworldly amount of pills to go with his drinking habit", "2_Subreddit": "Drugs"}]}]}]}