{"LoudQuietPlaces": [{"0_comments": [{"duxxr5j": [{"0_Comment Submission": "Official Ticket Buy/Sell/Trade Thread", "1_Text": "LOOKING FOR: Chicago 1 or 2 GA (Saturday 7/7)", "2_Subreddit": "radiohead"}], "duxyuvy": [{"0_Comment Submission": "These are in my area again. Yellow 30s, and I love em 🤪", "1_Text": "I'm curious, why do people smoke oxycodone instead of just eating it or, if your looking for a faster onset, snort it? Does it hit harder, is it a better or longer high?", "2_Subreddit": "opiates"}], "duzx5el": [{"0_Comment Submission": "These are in my area again. Yellow 30s, and I love em 🤪", "1_Text": "Ah I see, thank you for the response. To each his own puts it perfectly.", "2_Subreddit": "opiates"}], "dvjkgl2": [{"0_Comment Submission": "What songs do you think or hope will be played in the upcoming tour that haven't been played in a long time?", "1_Text": "Well realistically I'd like Go to Sleep. If I'm just going with something super unlikely then High and Dry. I'm highly doubting that since, as someone said above me, Thom hates it. One can always hope though!", "2_Subreddit": "radiohead"}], "dvjl6pj": [{"0_Comment Submission": "Song of the Week: emotional haircut", "1_Text": "While I don't think this is a bad song by any means I just can't seem to get into it. I've seen it live twice and while seeing a LCD song live it usually makes it more enjoyable to listen to on the LP afterwards for me this one just really didn't. It is my least favorite song on the album but maybe one day it'll really grow on me.", "2_Subreddit": "LCDSoundsystem"}], "dvjnjxn": [{"0_Comment Submission": "Getting hyped! What concerts are seeing to hold yourself off into Lolla?!", "1_Text": "Cut Copy (The Riv), Jack White (Milwaukee), Bishop Briggs (The Metro), LCD Soundsystem vs. Yeah Yeah Yeahs (Hollywood Bowl; both nights), Yeah Yeah Yeahs (Aragon Ballroom), Radiohead (United Center; both nights), Arcade Fire (Milwaukee).. I would also like to hit one of the nights of Foo Fighters but only if I can find a decently priced ticket and I'm doubting that.", "2_Subreddit": "Lollapalooza"}], "dw0xjbg": [{"0_Comment Submission": "Looks like The Weeknd-Bruno Mars-Arctic Monkeys-Jack White", "1_Text": "•July 13: Jimmy Buffet and the Coral Reefer Band.\n•July 14: Def Leppard and Journey.\n•July 29 & July 30: Foo Fighters.\n•August 18 & August 20: Pearl Jam.\n•September 1: Luke Bryan.\n•September 7: Billy Joel.\n•September 8: Fall Out Boy with Rise Against and Machine Gun Kelly\n\nThose bands not being there is what's hurting Lollapalooza? I'm personally glad none of these people are playing. Foo Fighters is the only one I want to see at all but they play such long shows that I'd rather see them somewhere they can play as long as they want. They played an official aftershow last year at the Metro despite not even playing the fest so I don't think crowd size matters to them as the Metro's capacity is 1100.", "2_Subreddit": "Lollapalooza"}], "dw0xyl1": [{"0_Comment Submission": "Looks like The Weeknd-Bruno Mars-Arctic Monkeys-Jack White", "1_Text": "I agree I think it's pretty much a lock because Lollapalooza is way bigger than Riot Fest but yea if not Lolla it'll be RF for sure. I'm driving up to Milwaukee in exactly a month to see him at the Rave!", "2_Subreddit": "Lollapalooza"}], "dw0z2xi": [{"0_Comment Submission": "Looks like The Weeknd-Bruno Mars-Arctic Monkeys-Jack White", "1_Text": "I felt that same way about The xx when pretty much everyone in the park was at Chance the Rapper. It wasn't the best show ever for me but it was a great show made even better by a small crowd.", "2_Subreddit": "Lollapalooza"}], "dw107ta": [{"0_Comment Submission": "Looks like The Weeknd-Bruno Mars-Arctic Monkeys-Jack White", "1_Text": "I wasn't saying Wrigley Field is a bad venue, I'm just trying to say if anyone playing Wrigley this year, besides Foo and PJ, was a headliner people would be pissed. Also, that's not how it works for bands getting paid for festivals. They don't get a cut, they get a set payment regardless of the ticket sales.", "2_Subreddit": "Lollapalooza"}], "dw1y33x": [{"0_Comment Submission": "Lollapalooza 2018 Lineup", "1_Text": "You thought the aftershow at the Concord, which oddly was before the fest, wasn't that great? I thought they absolutely killed it. Starting with 3rd Planet and ending with Float On and hitting pretty much every major song along the way. I didn't see them at Riot Fest though so I can't speak to that.", "2_Subreddit": "Lollapalooza"}], "dw33rn1": [{"0_Comment Submission": "From a Basement on the Hill: Survivor (Round 6)", "1_Text": "I agree. I don't understand why people get so upset over these. It's not just the Elliott page either, it's like that with LCD Soundsystem as well and I'm sure others that I don't read. I vote but I don't have any hard feelings if the song I voted for doesn't get voted out.", "2_Subreddit": "elliottsmith"}], "dw36k9f": [{"0_Comment Submission": "Radiohead, if there’s any chance you’re reading this, please for the love of God play more songs from Kid A during the 2018 tour", "1_Text": "That was one of the best concerts I've ever seen. The Karma Police sing along to end it was just perfect. Man, I hope their United Center shows are as good!", "2_Subreddit": "radiohead"}], "dw9qqmf": [{"0_Comment Submission": "Radiohead, if there’s any chance you’re reading this, please for the love of God play more songs from Kid A during the 2018 tour", "1_Text": "If you had to pick just one show to go back to of those 4 which would you pick?", "2_Subreddit": "radiohead"}], "dw9re5m": [{"0_Comment Submission": "LCD Soundsystem Madness Bracket: Round One!", "1_Text": "Seriously! Followed by Dance Yrself Clean vs Us vs Them. The 2 toughest calls IMO", "2_Subreddit": "LCDSoundsystem"}], "dwi3wu2": [{"0_Comment Submission": "Saturday Sold Out", "1_Text": "Ever since 2012 all single day tickets usually sell out the day they were put on sale. Saturday is always the quickest to go regardless of who's playing. It used to be different though. In 2010 I went on Sunday and bought 2 tickets at the box office at 1PM that day to see MGMT, Cypress Hill and Arcade Fire.", "2_Subreddit": "Lollapalooza"}], "dwjzae0": [{"0_Comment Submission": "FYF Line Up :/", "1_Text": "Now that I see she's doing fests around the United States I wish Florence was in place of Bruno Mars for Lollapalooza. I know she was there in 2015 but so was The Weeknd.", "2_Subreddit": "Lollapalooza"}], "dwk77u9": [{"0_Comment Submission": "Aftershow Wishes?", "1_Text": "I second Vampire Weekend at the Metro! Arcade Fire was amazing there last year.", "2_Subreddit": "Lollapalooza"}], "dww1tb8": [{"0_Comment Submission": "Oof", "1_Text": "Well besides that it has a higher BA when used orally as opposed to intranasal, it could be it just doesn't absorb well nasally for you. I'm not a fan of snorting oxy either, but have friends who swear by it and would never eat a pill.", "2_Subreddit": "opiates"}], "dww4bv5": [{"0_Comment Submission": "Kratom sucks!!!", "1_Text": "You mean 15-20 grams** right?", "2_Subreddit": "opiates"}], "dww4xdz": [{"0_Comment Submission": "Deluxe bundles back online today", "1_Text": "Thank you!! Finally snagged a bundle, now I'm just hoping I get it within the next 60 days.", "2_Subreddit": "LCDSoundsystem"}], "dwxzp0t": [{"0_Comment Submission": "Your worst Lolla conflicts ever -- come tell the tale", "1_Text": "Well I hope you went back last year and saw Cage AND Run the Jewels! Bastille vs City & Colour was def a tough one for me too. I picked C&C and it was good but I was sad he didn't play \"The Girl\" though.", "2_Subreddit": "Lollapalooza"}], "dwy3dy7": [{"0_Comment Submission": "Kratom sucks!!!", "1_Text": "That's what I figured, no worries dude just wanted to make sure.", "2_Subreddit": "opiates"}], "dwy3q7r": [{"0_Comment Submission": "Oof", "1_Text": "For me absolutely not, I honestly can't feel much of a difference besides that it kicks in a bit faster. I have a feeling a lot of people would disagree with me though.", "2_Subreddit": "opiates"}], "dwy3vw8": [{"0_Comment Submission": "Your worst Lolla conflicts ever -- come tell the tale", "1_Text": "Nice! I saw RTJ in 2014 but not at Lolla, I caught them at the Double Door Aftershow. Yea, I remember it raining pretty hard during those sets so maybe that had something to do with the shit sound.", "2_Subreddit": "Lollapalooza"}]}], "1_submissions": [{}]}]}