{"BlueMcgee123": [{"0_comments": [{"dvu3coj": [{"0_Comment Submission": "After I sifted out all of the (cut)powder, this was left.", "1_Text": "Wow that shit it noiceeeee 👌🏼👌🏼👌🏼", "2_Subreddit": "cocaine"}], "dvv9d1o": [{"0_Comment Submission": "How do people rave on MDMA?", "1_Text": "I’m the same way bro. I take some fire MDMA and I just melt into the couch and listen to music w some friends and we just talk about weird random shit lol", "2_Subreddit": "MDMA"}], "dvz7jxn": [{"0_Comment Submission": "Instead of using keys or a small spoon I've always just hit my bumps off of pen caps. The little dip in the edge is perfect for holding coke. I'm a server/bartender at a sports bar so we always have pens on us. Anyone else do this???", "1_Text": "I use a bunch of different shit. Bought a new nail clipper the other day. Instead I used it to bump some white. It was great. 👍🏼", "2_Subreddit": "cocaine"}], "dvz7ljm": [{"0_Comment Submission": "🙃", "1_Text": "And then you get mad because “how could they not trust me!!!” 😂😂😂", "2_Subreddit": "opiates"}], "dvz7mus": [{"0_Comment Submission": "true", "1_Text": "Too real", "2_Subreddit": "opiates"}], "dvz7vua": [{"0_Comment Submission": "For myself a treat for getting a new job and finally getting into that 6 figure range. It’s been a lot of work and sacrifice but I fucking did it! $70 for this doesn’t seem like too bad of a deal...and yes I know they’re real as we went harvesting together in the CVS field.", "1_Text": "Not too bad??? You got ALL OF THAT for $70????? That bag would cost me ballpark $240. My brain is exploding right now my dude 😂", "2_Subreddit": "opiates"}], "dvz87z8": [{"0_Comment Submission": "For those moments of bliss", "1_Text": "I have two. I agree everyone who uses opiates recreationally should have naloxone on hand. Ideally everyone shouldn’t use alone but fuck it I like to be by myself and play video games lmao but I know if God forbid something happened, no one would be there to give it to me. It’s a simple nasal spray for anyone who was wondering what the OP was holding. One spritz in one nostril. Very easy packaging. Easier than opening a fuckin Benadryl that’s for damn sure. \n\nOne of my boys couldn’t wait to get home about 2 months ago. Shot up 4 blocks away in a diner bathroom and ODed. He was an experienced IV user, but still ODed. I know people (including myself) say, “I know my limits.” And, “I’m not stupid enough to OD,” but it’s possible. Even if you’ve been using and copping from the same plug for years. It’s good to have it on hand. You can get it at the pharmacy.", "2_Subreddit": "opiates"}], "dvze945": [{"0_Comment Submission": "A fine way to end the night", "1_Text": "Would kill for a bar right now dude. Enjoy!", "2_Subreddit": "benzodiazepines"}], "dwidk8y": [{"0_Comment Submission": "Well, we have all been in this predicament.....", "1_Text": "Omg I’m crying bro 😂😂☺️", "2_Subreddit": "opiates"}], "dwidobt": [{"0_Comment Submission": "Benzo stash atm (dropper bottle and the pez are cLam, small containers are Etiz)", "1_Text": "Was guna comment those could go right in a pen dispenser.", "2_Subreddit": "benzodiazepines"}], "dwidtoe": [{"0_Comment Submission": "Is the media serious with this narcan party shit!!!!", "1_Text": "My dad (Trump butthole licker) was talking about this garbage earlier. I tried to tell him that if there IS a 0.00001% of the opiate addicted population doing this, the majority of addicted users know better and DAMN sure wouldn’t waste a good fuckin high and a ton of dope to get revived by fuckin narcan. Fuckin idiot.", "2_Subreddit": "opiates"}], "dwidwfb": [{"0_Comment Submission": "Last line of the night before watching the inbetweeners whilst falling asleep. Who else is having a big bank holiday weekend?", "1_Text": "Just copped a g about an hour ago. Playing The Last Of Us for the 6th damn time while my girl does crossword puzzles. This is fine everything’s fine 😂", "2_Subreddit": "cocaine"}], "dwie00r": [{"0_Comment Submission": "Where it all started.", "1_Text": "God I’m so glad social media wasn’t around when I was in 7th grade. I probably would’ve posted some dumbass shit like this 😂😂😂😂", "2_Subreddit": "opiates"}], "dwimmdp": [{"0_Comment Submission": "Benzo stash atm (dropper bottle and the pez are cLam, small containers are Etiz)", "1_Text": "Nice dude 👌🏼👌🏼", "2_Subreddit": "benzodiazepines"}]}], "1_submissions": [{"85ppy1": [{"0_Title": "On the bunny hill ⛷", "1_Text": "Wow that shit it noiceeeee 👌🏼👌🏼👌🏼", "2_Subreddit": "cocaine"}]}]}]}