{"AboveAdorable": [{"0_comments": [{"dvjgzra": [{"0_Comment Submission": "Kratom can be a slippery slope", "1_Text": "Everybody's different, but after 15 years of tramadol hcl dependency (400mg daily, in divided doses towards the end), using strictly kratom for 5 months now, and the WD upon waking is more mild, but still uncomfortable. Not nearly as bad as tramadol was, though.", "2_Subreddit": "opiates"}], "dvjnvs4": [{"0_Comment Submission": "Mixing pills to achieve that perfect feel", "1_Text": "At the moment kratom / etizolam", "2_Subreddit": "benzodiazepines"}], "dvjr4dc": [{"0_Comment Submission": "Is my daughter using drugs? (opioids maybe?)", "1_Text": "It's impossible to answer this question. It could be yes. It could be no. I hope it's no. I started in on RX amphetamine when I was 14. I, too, researched about drugs tirelessly. I wanted to know why they made me feel the way they did. Couple weeks into RX amphetamine use- cardiovascular related side effects began to manifest. I stopped using it. A few months later, I discovered tramadol (an atypical opioid). During this time, tramadol's abuse potential and dependency risks were still little known, and not documented, so it was easy to acquire it via doctor. I had the best intentions. The drug simply made me feel better. What started as 50-75mg every Friday, 15 years later had  turned into 400mg daily in divided doses. I've been off the tram since October 27th, 2017. It was a joyous, and hellish 15 years at the same time. \n\nApproach her with interest in her research. It is very good she is an avid reader. It is possible researching made her curious to try opioids. With tons of research, it is doubtful she would accidentally OD or anything. But dependency and personality changing effects will occur. Just a matter of time. If she begins to act manic (overly happy), followed by lethargy and drowsiness. Keep your eyes and ears peeled. If she begins to isolate herself from friends, and has moments of severe mood swings (signs of dependency, and acute withdrawal). You yourself should research opioids. Their effects, and their withdrawal symptoms. It will help you overwatch her more closely.", "2_Subreddit": "Drugs"}], "dvjvzjq": [{"0_Comment Submission": "Look what I found in MY kratom..", "1_Text": "Brilliant. Especially with the earlier post", "2_Subreddit": "kratom"}], "dvq5nz3": [{"0_Comment Submission": "What is the etizolam high like and what is it comparable to?", "1_Text": "Feels very much like alprazolam to me. Etizolam actually seems more euphoric. Effects come on quick, and leave fast. I've read the half-life is 6.2 hours  (8 for metabolite). However, I've also ready barely over 3 hours being the median. This will lead to frequent re-dosing. The good news is, etizolam has not been found to accumulate. Even for those re-dosing every 3-4 hours daily.", "2_Subreddit": "benzodiazepines"}], "dvq5r8t": [{"0_Comment Submission": "Is etizolam worth if I'm already using clonazolam?", "1_Text": "Absolutely give etiz a try. Safe, and consistent. Given you have a good vendor, and you don't act like a bartard.", "2_Subreddit": "benzodiazepines"}], "dvqnxmi": [{"0_Comment Submission": "So I finally tried SoCal...", "1_Text": "Canopy is definitely great. SoCal is as well, though. \nI have been getting a lot of green hulu from Canopy. Each batch has been great. Highly recommend", "2_Subreddit": "kratom"}], "dvqxddh": [{"0_Comment Submission": "My wd arsenal: 2 Molly presses and 2 m bombs , my last lonely k pin (hopefully getting more today) flexiril, big bag of weed and a shitload of kratom 💪🏾 I have Lyrica somewhere but my wife stashes it from me on sick days. she knows I can’t control myself but she’s at work ):", "1_Text": "Tramadol was my thing, too. For FIFTEEN years. \nDuring WD phases, I'd usually just cop hydro, or oxy from family for free until refill. Then came kratom. Used it and it only, with a sprinkle of benzos, and WD was a breeze. Kratom has worked so well, that I've actually been off of tramadol for four months by sticking with just kratom. First 1-5 days were meh, but after that point, kratom has been a 100% viable solution. My doctor is probably wondering why I vanished lol. Went to him every 6 months like clockwork for tramadol renewals. 120 tabs, 5 refills. \n\nKratom, and a bit of etizolam and I have been a-okay", "2_Subreddit": "opiates"}], "dvr5btj": [{"0_Comment Submission": "My wd arsenal: 2 Molly presses and 2 m bombs , my last lonely k pin (hopefully getting more today) flexiril, big bag of weed and a shitload of kratom 💪🏾 I have Lyrica somewhere but my wife stashes it from me on sick days. she knows I can’t control myself but she’s at work ):", "1_Text": "Greens and reds. Gold bali was amazing for night. Love the green hulu, and red hulu. Green malay. List goes on. They'll all help you. A batch or two may not be great sometimes. But its a life saver", "2_Subreddit": "opiates"}], "dvrygfx": [{"0_Comment Submission": "It's me again ! With a little additional surprise ;)", "1_Text": "Wow. Just wow", "2_Subreddit": "pelfie"}], "dvuo6da": [{"0_Comment Submission": "Black Bikini", "1_Text": "God help me", "2_Subreddit": "RealGirls"}], "dvur7a9": [{"0_Comment Submission": "I bought tianeptine sodium. Lets see how this goes.", "1_Text": "I've only tried the sulfate version and it was  (probably a good thing) not very good. Considered getting sodium version  solution from a vendor, but have changed my mind. \n\nKratom  FTW", "2_Subreddit": "Tianeptine"}], "dvurz2i": [{"0_Comment Submission": "I bought tianeptine sodium. Lets see how this goes.", "1_Text": "Kratom is great. \nIt got me free from a 15 year tramadol dependency.", "2_Subreddit": "Tianeptine"}], "dvvd636": [{"0_Comment Submission": "It's me again ! With a little additional surprise ;)", "1_Text": "I'd give anything to kiss it", "2_Subreddit": "pelfie"}], "dvvd7aw": [{"0_Comment Submission": "Confession: I've only been eaten out twice 🙈", "1_Text": "Crazy. It's my speciality.\nIt's a shame. Beautiful", "2_Subreddit": "pelfie"}], "dw5x59m": [{"0_Comment Submission": "Short hands but I tried", "1_Text": "Love it", "2_Subreddit": "pelfie"}], "dwj4q96": [{"0_Comment Submission": "Most euphoric benzos?", "1_Text": "Not chemically a benzo, but Etizolam. \nRemoves anxiety, and tension with subtle euphoria and a bit chatty. Fav so far. It is actually  a thienodiazepine. Check spelling.", "2_Subreddit": "benzodiazepines"}], "dwj4ra4": [{"0_Comment Submission": "After three weeks of no benzos, just took 1.75.. GOD MODE ACTIVATED.", "1_Text": "I imagine so", "2_Subreddit": "benzodiazepines"}], "dwj4vig": [{"0_Comment Submission": "Questions about etizolam/xanax", "1_Text": "Yeah, etizolam is great. \nOnset similar to alprazolam. \nPeak similar to alprazolam. \nLength just a tiny bit shorter than alprazolam, but etizolam carries no risk of accumulation with frequent re-dosing. Do it", "2_Subreddit": "benzodiazepines"}], "dwjk253": [{"0_Comment Submission": "Doing Tramadol Recreationally", "1_Text": "Kratom is surprisingly cheap. Got to find right vendor. One I use is cheap, and each order lasts a good while. \n\nI was on tramadol for 15 years, friend. I got up to 400mg daily. Surprised I did not surpass this. I also added in benzos here and there during the peak of tramadol dependency. I have been OFF tramadol since October 27, 2017 with help of kratom. It's important to note I began to experiment with kratom in spring 2015 as a substitute whe running out of trams 14 days early every single month. So, I actively chose to remain on tramadol for over 2 more years when I first started messing with kratom. \n\nKratom WILL work as a replacement. 100%. \nIf you are jumping off of tramadol cold turkey, and begin to use kratom, your physical WD symptoms will be knocked out 80-90%. You may still experience some mental symptoms. But stick with kratom for 3-5 days and you will turn around. Trust me on this. You will even be able to lower your kratom dosage, and dosing frequency after about 7 days. This is when kratom will really begin to shine. Never thought I'd say it, but I prefer it to tramadol now.", "2_Subreddit": "Drugs"}], "dwjkfih": [{"0_Comment Submission": "Doing Tramadol Recreationally", "1_Text": "I mixed with OJ in my early days. \nNow I just toss and wash with water when I became serious to get off of tramadol. \n\nJust measure your dose. Put it in a cup. Place  a pool of water in your mouth, dump kratom onto, then take another swig of water. Easier as you practice. I promise. Fast, and painless. My usual dose is 3-4 grams. I will usually use this toss and wash method using 1 to 2.5 grams at a time. If I have to do it twice per dose, no big deal. It truly is easy, and fast acting this way  great results", "2_Subreddit": "Drugs"}], "dwojtro": [{"0_Comment Submission": "Etiz underdosed or tolerance too high.", "1_Text": "I've got F-Pam \nDaily etiz user, here. May give FPam a try tomorrow. 3mg range is light I'm assuming. That half life. Phew. A good thing.", "2_Subreddit": "Etizolam_2"}], "dwokfip": [{"0_Comment Submission": "BARTARD Ep 4.5 a quickie!", "1_Text": "I've never had one issue with that guy. Drama, or not. Not one issue. \nAnd this is my own alt-acct that anyone would be accustomed to, inclusing Red. Standup guy.\n\nI have not gone into Dread yet, and do not plan to, but the guy is legit, intelligent, and fine vendor", "2_Subreddit": "Etizolam_2"}], "dwokno2": [{"0_Comment Submission": "Legality in TN?", "1_Text": "Georgia has half a brain to make it schedule IV at least. \nI thought Louisana also went the CIV route. Guess I was wrong.", "2_Subreddit": "Etizolam_2"}], "dwp1tk2": [{"0_Comment Submission": "Tramadol relapse after 5 months", "1_Text": "I've always loved it. My first time was just 25mg, with 25mg two hours after that. I was amazed. Fifteen years later it would be 300-350mg daily if I were to continue treatment. Which I don't really plan to. \n\nI believe I find kratom to be more enjoyable, and useful now. \n\nThat is unfortunate to hear. I thought it caused false positive for triazolam, and would be confirmed as negative after extensive test. I only found info on that through a reddit discussion, though.", "2_Subreddit": "opiates"}]}], "1_submissions": [{"893bcr": [{"0_Title": "Tramadol relapse after 5 months", "1_Text": "Everybody's different, but after 15 years of tramadol hcl dependency (400mg daily, in divided doses towards the end), using strictly kratom for 5 months now, and the WD upon waking is more mild, but still uncomfortable. Not nearly as bad as tramadol was, though.", "2_Subreddit": "opiates"}]}]}]}