{"Bopeep28": [{"0_comments": [{"dw1avvl": [{"0_Comment Submission": "Moving to the MA area, need some help!", "1_Text": "You know where's nice; North Reading", "2_Subreddit": "massachusetts"}], "dw1b2yu": [{"0_Comment Submission": "Moving to the MA area, need some help!", "1_Text": "This^^", "2_Subreddit": "massachusetts"}], "dw1bqyr": [{"0_Comment Submission": "She is changing the sign", "1_Text": "Because I have a phone and not a computer. Iv never seen Reddit on a computer, must be nice.", "2_Subreddit": "chipchan"}], "dw1crtf": [{"0_Comment Submission": "The age of Idiocracy like in that 2006 movie, is now here.", "1_Text": "I'm not having the same experience as you. It seems to me it's the younger people always on their phones. I engage with people and put my phone away when I leave the house or interact with others. I think it's a perception issue maybe?", "2_Subreddit": "C_S_T"}], "dw2gd7c": [{"0_Comment Submission": "At some point I just had to point out...", "1_Text": "Only glanced at the site, I'm confused is it a joke site? To sell you water? Also this is all concerning, I guess there are people who barely finished high school or not at all, maybe that's who fall for all this? I can't imagine anyone well educated would believe in this but I could be wrong.", "2_Subreddit": "Parenting"}], "dw94slm": [{"0_Comment Submission": "The US Drug supply is tainted with fentanyl. Get naloxone. Be safe.", "1_Text": "What would it hurt for everyone to have naloxone? It doesn't seem harmful if someone mistakenly gives it.", "2_Subreddit": "Drugs"}], "dw95yku": [{"0_Comment Submission": "If allowed, can someone post the names of what were the vetted companies on this sub so I can bookmark them? The new rule is bs, and I might quit reddit honestly.", "1_Text": "Saidit.net is a place", "2_Subreddit": "CBD"}], "dw965h5": [{"0_Comment Submission": "Where did the love go?", "1_Text": "I'm deeply in love with my partner. We stayed in the \"honeymoon\" phase for almost a decade.", "2_Subreddit": "Retconned"}], "dw96c8e": [{"0_Comment Submission": "All of a sudden?", "1_Text": "Maybe we have alien brain parasites?", "2_Subreddit": "Retconned"}], "dwcswl2": [{"0_Comment Submission": "Reason for MEs", "1_Text": "I'v been thinking maybe alien brain parasites or some kind of mkultra situation using the \"smart\" devices, I'm worried it will be to late by the time it's apparent.", "2_Subreddit": "Retconned"}], "dwdtvgj": [{"0_Comment Submission": "My wife accuses me of not pulling my weight after our son was recently born, but I feel as though she's asking for too much. Can't talk about this with her (without a fight) and nearing end of my rope. [xpost from r/relationships]", "1_Text": "I'd forever say baby want take bottle from me ;)", "2_Subreddit": "Parenting"}], "dwdufi2": [{"0_Comment Submission": "My wife accuses me of not pulling my weight after our son was recently born, but I feel as though she's asking for too much. Can't talk about this with her (without a fight) and nearing end of my rope. [xpost from r/relationships]", "1_Text": "I'd be all like; I'v been thinking about what you said an your right, the dogs deserve better, but I can't take time away from my son for them, he didn't ask to be born into a house with pets... So I'v decided to take them to the pound (da da daam) o dry dog food then and a dog walker? We'll make it up to them. Unless she's ok with that then maybe rehome? Good luck!", "2_Subreddit": "Parenting"}], "dwfqo6u": [{"0_Comment Submission": "Saving Money on Menstrual Cycle Supplies", "1_Text": "After reading a post the other day on twoxchromosomes about a lady who had to go to ER because her cup was stuck, I can't but I'm going to give thinkx period panties a try instead of pads and maybe try period leggings and reusable/washable pads.", "2_Subreddit": "povertyfinance"}], "dwfxzwp": [{"0_Comment Submission": "Need help: My son is sleepwalking and inappropriately touching his sister.", "1_Text": "I don't have personal experience with this exactly but my SO sleep walks so while learning about that i also read about different parasomnias one is sexsomnia where the person acts out sexualy, so thought I'd add this, good luck.", "2_Subreddit": "Parenting"}], "dwg0b6w": [{"0_Comment Submission": "My 13yo daughter has become interested in things like astrology, healing crystals, and psychics", "1_Text": "Exactly", "2_Subreddit": "Parenting"}], "dwg0f5z": [{"0_Comment Submission": "My 13yo daughter has become interested in things like astrology, healing crystals, and psychics", "1_Text": "My family has Christians and Wiccans so who knows how my kid will rebel, it could always be worse.", "2_Subreddit": "Parenting"}], "dwg3z7d": [{"0_Comment Submission": "Halloween going flat", "1_Text": "Took my kid trick or treating for first time last year. I'v always hated holidays but now their so fun, watching my little girl get so excited and swept up in the occasion, it's great.", "2_Subreddit": "Retconned"}], "dwjw506": [{"0_Comment Submission": "I feel like a normal person again!", "1_Text": "I have to take kratom to control my anxiety but it's giving me my life back.", "2_Subreddit": "Anxiety"}], "dwre5rs": [{"0_Comment Submission": "I'm a \"nice girl\" and I don't know how to stop being one, a lot later than most women learn to stop being one.", "1_Text": "Maybe find an unattractive guy with decent personality and together work on body's?", "2_Subreddit": "Nicegirls"}], "dwrebq5": [{"0_Comment Submission": "Problem and I don't know what to do.", "1_Text": "Went through your post history you seem interesting and I'd like to be your friend, so pm me anytime. I hope things start looking up for you soon.", "2_Subreddit": "povertyfinance"}], "dwt498y": [{"0_Comment Submission": "Nootropic for remembering names and faces?", "1_Text": "Lions mane mushrooms helped me with that.", "2_Subreddit": "Nootropics"}], "dwtiqbh": [{"0_Comment Submission": "Single father, jerking off, and drugs", "1_Text": "This made me laugh. You sound like a good father. I'm sorry for your loss. I think as long as you don't do this much more than what your saying, your doing fine. I wouldn't tell others what your doing. Would not get a hooker, they are not safe. Sounds like you have a good thing going, that works for you. Maybe cross post to r/parenting", "2_Subreddit": "Drugs"}], "dwtj05v": [{"0_Comment Submission": "Smoking cigarettes while high on amphetamines?", "1_Text": "Vaping would be safer.", "2_Subreddit": "Drugs"}], "dwtjr2o": [{"0_Comment Submission": "Emergency chill pills for autism rage?", "1_Text": "Kratom could help, magnesium supplements are calming also. How often do you have this feeling?", "2_Subreddit": "Drugs"}], "dwtx9w0": [{"0_Comment Submission": "Help me get off this ride... advice for OTC meds for WDing etc", "1_Text": "I'v seen people use kratom to get off opiates. Check out r/kratom", "2_Subreddit": "opiates"}]}], "1_submissions": [{"4v7xku": [{"0_Title": "Strange stuff with radio", "1_Text": "You know where's nice; North Reading", "2_Subreddit": "Glitch_in_the_Matrix"}], "5l9k39": [{"0_Title": "How clean should my house be?", "1_Text": "You know where's nice; North Reading", "2_Subreddit": "Parenting"}], "5pmb7p": [{"0_Title": "Encouraging words", "1_Text": "You know where's nice; North Reading", "2_Subreddit": "postpartumdepression"}], "73hs2w": [{"0_Title": "Earliest Memories", "1_Text": "You know where's nice; North Reading", "2_Subreddit": "AskReddit"}], "7yrit2": [{"0_Title": "Kratom for Anxiety?", "1_Text": "You know where's nice; North Reading", "2_Subreddit": "Anxiety"}]}]}]}