{"pauz43": [{"0_comments": [{"dwt1b0y": [{"0_Comment Submission": "Who is profiting from denying opioids to CP patients? And why isn't the DEA listening to us?", "1_Text": "Agreed! I know gaba works like a charm for a lot of neuro patients. I've always wondered if it's due to different body chemistry that science hasn't yet developed a way of testing.\nMy doctor insisted that methadone had to build up in your body for it to work effectively, but I could feel it reducing the pain within 20 minutes of taking it. I was informed it was my \"imagination\", and that I *expected* it to work. Uh huh. Whatever, doc.\nLet's hear it for gut feelings!!", "2_Subreddit": "ChronicPain"}], "dwt1szg": [{"0_Comment Submission": "‘Get up, it’s Jesus day!’: Mom used Taser to make her son attend Easter service, police say", "1_Text": "AND... another atheist is born!\n\nIdiot woman didn't get her own ass to her precious church for Easter, much less her kid. This story is a ringing endorsement for the theory that religion attracts the less-intelligent among us.", "2_Subreddit": "narcsinthewild"}], "dwt23wx": [{"0_Comment Submission": "Teddy is growing rapidly! This is him at almost 10 months old 😳", "1_Text": "Teddy will keep growing until he's around 4 yrs old, or so the vet told me. Beautiful boy! Hope you're ready to feed this hulk and scoop his litterbox...", "2_Subreddit": "mainecoons"}], "dwt37nl": [{"0_Comment Submission": "Does anyone else have this problem?", "1_Text": "Welcome to \"Blame the Victim\". It's easier for people to label you a slacker and lazy goof-off than acknowledge you are in pain. That would mean they need to offer you help, requiring their time and energy as well as a positive emotional commitment on their part.\n\nLazy? I'd say it's your *family* that's lazy. Save your sanity and get away from them asap!", "2_Subreddit": "ChronicPain"}], "dwt48kd": [{"0_Comment Submission": "Teddy is growing rapidly! This is him at almost 10 months old 😳", "1_Text": "Between the two of them you could have a sweater's worth of fur in less than a year! I have a friend who spins pet hair into yarn; cat hair is so fine that it needs to be combined with silk to produce usable fiber. \nHe's gorgeous, btw. Love that little face! Does his sister look like him? Are then pedigreed or of \"unknown ancestry\"?", "2_Subreddit": "mainecoons"}], "dwt4jht": [{"0_Comment Submission": "It's hard for me to describe the pain to my friends, but this is it!", "1_Text": "Exactly! And it has no rhyme or reason -- rain, sunshine, day or night, it can fire up without warning. The worst is when I'm driving or out in public and can't get my shoes off fast enough!\n\nWhat I really hate is when it wakes me up in the middle of the night. I'm lying there wondering if it'll stop by itself, or do I need to get out of bed and bring the ice packs back. Then, just as I start to fall back asleep I get another shot of agony.", "2_Subreddit": "neuropathy"}], "dwt57aa": [{"0_Comment Submission": "We are better than this!", "1_Text": "Exactly. My kids are the ONLY reason I didn't get into heavy drugs. I also kept the scumbags away from them and out of my home. \n\nLE and the media jump all over stories like this as a reason to keep drugs illegal and persecute users. Nobody stops to think about the many terrible abuse cases that do NOT involve narcotics!", "2_Subreddit": "opiates"}], "dwt5wmq": [{"0_Comment Submission": "People Who Have Never Experienced Back Pain Have No Business Making Opioid Policy", "1_Text": "Chronic pain in all its ghastly forms is driving thousands of otherwise law-abiding people to illegal drugs. The heartbreaking stories on r/chronicpain are enough to make a stone cry.\n\nI've helped people in their 70s and 80s go on the darknet so they can search for opiates to control their chronic pain. Some of them have been using oxy and morphine for years as a way to cope with broken backs, neuro disorders, crippling birth defects that get worse as they age, third- and fourth-degree burns that haven't healed well, and even cancer. They never peed positive, always took their drugs exactly as prescribed, but the politicians and the DEA decided they had to stop all their opiates because other people were overdosing on illegal fentanyl.\n\nMore and more of the elderly and military veterans are committing suicide -- we can't have opiates, but a loaded gun is just fine. Our elected officials don't want to hear from us, our doctors' hands are tied, so the only alternative is killing ourselves, trying to find pharmaceutical-quality pills from a dealer or using a needle.\n\nIf the sight of a 70 yr old grandmother trying to learn how to shoot heroin as an alternative to killing herself with her dead husband's gun doesn't tear your heart out, you must be a DEA agent or a politician. This entire \"war on drugs\" is disgraceful!!", "2_Subreddit": "opiates"}], "dwt6b3b": [{"0_Comment Submission": "Teddy is growing rapidly! This is him at almost 10 months old 😳", "1_Text": "Big snuggles and chinrubs for both of them!", "2_Subreddit": "mainecoons"}], "dwtzkrp": [{"0_Comment Submission": "People Who Have Never Experienced Back Pain Have No Business Making Opioid Policy", "1_Text": "Totally agree! WTF are they thinking?? I'm not vindictive, but I relish the image of these fuckers being hit with the level of chronic pain we live with every damn day. Love to see Jefferson Beauregard's face if his spine started to disintegrated, and watch the head of the DEA slip on ice and shatter a hip and knee.\n\nAnd you gotta know it's coming for them, just like it did us. Wait... even better: They get non-terminal cancer! Bwahahahahaha!!!\n\nOkay, sorry 'bout that. End of the day and I get a little crazy from \"coping\".", "2_Subreddit": "opiates"}], "dwv7rtq": [{"0_Comment Submission": "People Who Have Never Experienced Back Pain Have No Business Making Opioid Policy", "1_Text": "Do NOT apologize for ranting! Otherwise, we'll both have to, and I'm sick of apologizing (women are trained from birth to apologize). I agree about getting rid of us Boomers. Old people are expensive and use up a huge % of medical services. But the govt. is in for a surprise if they think we can't defend ourselves! Many of us are lawyers who wouldn't mind tying up a courtroom, and many of us stood at the barricades and dared LE and the army to do their worst when Vietnam and civil rights protests were at their peak.\n\nNow, we've got the experience and the time to get into the fight of our lives. Beware the Gray Panthers! The fact that many of us are living with severe pain makes the govt. over-confident and sure that we'll just sit back and take it. Nope, not gonna happen.\n \nAnd, no, they do NOT care about addicts. Or, rather, they care about white addicts from wealthy families, but only just enough to bother spouting nonsense about \"opiate-related deaths\". 480,000 people die every year from cancer, and most lung cancer can be traced directly to a lifetime of cigarettes. Yet those are legal, as is alcohol! \n\nI live in Wisconsin, a state with a powerful Tavern League that has kept penalties for first through fourth DWI convictions at fines and restricted licenses. No jail time unless you kill someone or are arrested for the *fifth* offense. That's how much government cares about human lives. \n\nBusting up meth labs is left to county sheriffs, and imported fentanyl is too damn hard to catch. But those pain patients are *easy* to go after! Let's blame wounded vets and grandparents with severe arthritis *and* diabetes for the so-called \"epidemic\", which is nothing more than skewed and massaged statistics that are meaningless.\n\nMy physician had a patient with end-stage COPD who towed around his oxygen tank everywhere he went. He also had liver failure (lifetime of drinking), smoked and had enough bad habits to kill himself three times over. He died with physician-prescribed opiates in his body and MY DOCTOR WAS CALLED BEFORE THE STATE MEDICAL BOARD to explain why he gave the man opiates for pain!! The board didn't bother to read the man's medical records; just demanded to know why he died. (gee, I dunno -- because he was killing himself with cigs and booze for the past 50 years? and his blood pressure was through the roof but he wouldn't take the meds because they made him impotent? and he weighed 300 pounds? ya think that might have had something to do with it?) This is the crap physicians are up against. I've lost all respect for our government and the medical establishment.", "2_Subreddit": "opiates"}], "dwv91b1": [{"0_Comment Submission": "Chronic nerve damage just diagnosed through EMG. What to expect? What do i do?", "1_Text": "I was diagnosed 18 years ago with peripheral neuropathy in my feet and lower legs. It doesn't get better and there's nothing you can do to stop it from causing progressively more damage. All you can do is treat the pain and try not to aggravate your body.\n\nEveryone reacts differently to various medications -- gabapentin really messed me up after I'd taken it for about six weeks (lost memory, fatigue), but it's a miracle drug for others. Best thing you can do for yourself is research the hell out of your disorder and find a sympathetic physician who is willing to listen to you.\n\nMost doctors are practicing the assembly-line school of medicine: no more than 15 minutes per patient, discourage the complicated cases, and don't accept anyone who needs opioids for pain. You'll find most of your friends on the internet and sites like this one; trying to be a fully-functioning person when you have nerve damage is nearly impossible. \n\nHang out with us. We're all in various states of misery, so we'll be understanding when you tell us you're hurting, scared and angry about it!", "2_Subreddit": "ChronicPain"}], "dwv9o6n": [{"0_Comment Submission": "Just had my worst day, really need someone to talk to, as I'm having difficulty coping with what happened.", "1_Text": "It might have been *his* \"once in a lifetime experience\", but that doesn't mean it was anyone else's. Concerts can be great fun, but I'm not sure listening to someone sing on stage through a mediocre sound system and with thousands of people screaming, singing along and yapping at each other does not a delightful listening experience make. Besides, I've found  that a \"once in a lifetime experience\" usually means it's the LAST experience in your lifetime!\n\nPain screws up everything, and nothing is enjoyable when you're dealing with it. Now throw in all the other crap that was going on, and I'd say you're fortunate to have survived with your mind intact!\n\nAnd blame the Effexor withdrawal for what you experienced -- it's nasty to come off of. I'd suggest buying a Lorde album or two and re-listening to everything. It might help get that bad time out of your head.", "2_Subreddit": "ChronicPain"}], "dwvaec8": [{"0_Comment Submission": "Two women show uncovered legs in public for the first time in Toronto. 1937", "1_Text": "people fawking love having sex with the people they choose. Those losers are letting their little heads choose for them. Gawking at women is not only crude, it's the equivalent of putting on a red rubber clown nose.\n\nOr maybe they really *haven't* seen womens' legs and they're virgins!", "2_Subreddit": "interestingasfuck"}], "dwvajwu": [{"0_Comment Submission": "A very bad editor", "1_Text": "That vid has so many breaks in it I can't follow the action. Yep, shitty editing job.", "2_Subreddit": "interestingasfuck"}], "dwviyl5": [{"0_Comment Submission": "Two women show uncovered legs in public for the first time in Toronto. 1937", "1_Text": "Not if I see them gawking at me! There are many enjoyable ways to humiliate men who believe it's acceptable to gawk at women. Just because their mama didn't teach them no manners doesn't mean it's too late for someone else to do it.", "2_Subreddit": "interestingasfuck"}], "dwwyheq": [{"0_Comment Submission": "This shouldnt be allowed to happen!", "1_Text": "Most physicians today work for corporations that base their profits on how many patients are seen per day. Patients with complex medical needs and multiple medications (oh, NO!! not *opioids!!*) are immediately rejected by the doctor, who doesn't want to be bothered by someone who will need more than the standard 15 minutes of their time. \n\nThe physician *can't* refuse to take you on, but certainly has ways of letting you know you're unwanted. They use everything from the scowl at the mention of opioids to arguing with you about little details and disagreeing with another physician's diagnosis. \n\nWhat, you can't hear me saying \"go away!!\"? Well, l'll just increase my shitty attitude and RUN YOU OFF!\n\nPatients like you (and me and many of us here) are \"gomers\": get outta my emergency room. Or, in this case, \"gomos\": get outta my office. You will receive minimal care from this doctor. Even recording the conversation for her/his employer and possibly your state's medical board won't help -- firing or disciplining a physician is more trouble than it's worth, and it's very difficult to prove something as nebulous as attitude.\n\nDon't waste your time with this loser. Find another doctor; explain tactfully to the practice that you need a \"better fit\". Doctors can be a hard-hearted bunch who quickly grow accustomed to tears and sobs. Too bad about you being in pain and suffering. The *doctor* feels just fine, and that's all that matters to them.", "2_Subreddit": "ChronicPain"}], "dwwz1ak": [{"0_Comment Submission": "My son doesn't want his grandmom, my mom, touching him, hugging him or kissing him unless he okays it. My mum says there's no point having a relationship if she can't do that when she wants", "1_Text": "You have your son's back -- THAT'S far more important that your mother's delicate feelings! All she wants is a doll to play with. She isn't interested in getting to know the actual person your child is becoming.\n\nGrandma is most assuredly a narc. Cutting herself off from your son is the kindest thing she can do for him. If she didn't stop your father from \"pantsing\" you, she's as bad as her husband.\n\nIt is NEVER okay to violate anyone's boundaries, no matter how you're related to them or how much you insist you \"loooove\" them.", "2_Subreddit": "raisedbynarcissists"}], "dwwz87y": [{"0_Comment Submission": "My Boy Max. I’m obsessed with taking his picture.", "1_Text": "Maine Coons seem to have the most intelligent, expressive faces of all breeds. This guy is a winner -- your photo should be on the cover of a national cats magazine!", "2_Subreddit": "mainecoons"}], "dwxxtmo": [{"0_Comment Submission": "My Boy Max. I’m obsessed with taking his picture.", "1_Text": "He looks just like a coony! Those ears, those eyes, that beautiful face -- does Max *know* he's not a Maine Coon? If not, don't tell him.", "2_Subreddit": "mainecoons"}], "dwxxujf": [{"0_Comment Submission": "Two women show uncovered legs in public for the first time in Toronto. 1937", "1_Text": "You say I'm a bitch like it's a bad thing!", "2_Subreddit": "interestingasfuck"}], "dwxxx8o": [{"0_Comment Submission": "Two women show uncovered legs in public for the first time in Toronto. 1937", "1_Text": "Possible, I guess. But if so, I've gotten all pissed off for nothing.", "2_Subreddit": "interestingasfuck"}], "dwxy803": [{"0_Comment Submission": "People Who Have Never Experienced Back Pain Have No Business Making Opioid Policy", "1_Text": "The more I look into this the more it starts to smell like three-day-old fish. Left out in the sun. Something is going on when a quick internet search pulls up comments from doctors and researchers (Johns Hopkins, Mayo, Columbia, etc) that disagree with *everything* the CDC says in their opiate reduction \"recommendations\". WTF would PROP make statements that can so easily be disputed and disproved, and why would LE and the media be so quick to accept them as gospel? (don't answer, I already know).\n\nBut... what does the CDC get out of it? What is in it for them?\n\nTime to start disputing their BS -- if the media likes conflict, they'll love this!", "2_Subreddit": "opiates"}], "dwxyy4a": [{"0_Comment Submission": "I have never done any opiates. I've been browsing this sub for ~2 hours now.", "1_Text": "I never used opiates for fun because I knew I'd like them waaaayyyy too much. Got enough problems, don't need that one, too.\n\nBut then, along came a neurological disability that not only crippled me but has delivered a 7-level of pain on a scale of 1 (feelin' great!) to 10 (set on fire). I became an expert in opiates out of sheer survival, but was careful not to take more than enough to control the pain (not make it go away, just 'control' it). \n\nAll was copacetic until the CDC decided to take away chronic pain patients' prescription opioids because people were ODing and dying on illegal fentanyl. Make that *white* people -- our esteemed lawmakers didn't give a shit when it was just brown and black people who were dying. Oh, and make that *rich* white people; again, little concern was seen when poor whites were overdosing or blowing themselves up in meth labs.\n\nSo the elderly, the disabled and the chronically ill are having to educate themselves about the drugs they *should* be receiving from their physicians and pharmacists. Thanks ever so much, LE. Thanks, politicians. And a big shout-out to the CDC and their badly skewed statistics that \"prove\" people are dying from taking prescription opiates. \n\nNuh uh. Not so. Liar, liar, pants on fire!", "2_Subreddit": "opiates"}], "dwy0gye": [{"0_Comment Submission": "People Who Have Never Experienced Back Pain Have No Business Making Opioid Policy", "1_Text": "Exactly!! \n\nThe \"underground\" newspapers are terrific for alternative news (\"alternative\" being anything that doesn't come from the power structure). But they only reach a local audience. Maybe Rolling Stone or Mother Jones...", "2_Subreddit": "opiates"}]}], "1_submissions": [{"7v033h": [{"0_Title": "Look out, diarrhea patients: You're about to lose your Imodium A-D to idiots trying to get 'high'!", "1_Text": "Agreed! I know gaba works like a charm for a lot of neuro patients. I've always wondered if it's due to different body chemistry that science hasn't yet developed a way of testing.\nMy doctor insisted that methadone had to build up in your body for it to work effectively, but I could feel it reducing the pain within 20 minutes of taking it. I was informed it was my \"imagination\", and that I *expected* it to work. Uh huh. Whatever, doc.\nLet's hear it for gut feelings!!", "2_Subreddit": "ChronicPain"}], "7yigyx": [{"0_Title": "Blistering Report Shows That Opioid Makers Funneled Millions to Patient Advocacy Groups “This is part of how the game works: You have people speaking on your behalf but it’s not clear that they are.”", "1_Text": "Agreed! I know gaba works like a charm for a lot of neuro patients. I've always wondered if it's due to different body chemistry that science hasn't yet developed a way of testing.\nMy doctor insisted that methadone had to build up in your body for it to work effectively, but I could feel it reducing the pain within 20 minutes of taking it. I was informed it was my \"imagination\", and that I *expected* it to work. Uh huh. Whatever, doc.\nLet's hear it for gut feelings!!", "2_Subreddit": "ChronicPain"}], "800ymc": [{"0_Title": "My wonderful old Bernina 540 needs repairs...", "1_Text": "Agreed! I know gaba works like a charm for a lot of neuro patients. I've always wondered if it's due to different body chemistry that science hasn't yet developed a way of testing.\nMy doctor insisted that methadone had to build up in your body for it to work effectively, but I could feel it reducing the pain within 20 minutes of taking it. I was informed it was my \"imagination\", and that I *expected* it to work. Uh huh. Whatever, doc.\nLet's hear it for gut feelings!!", "2_Subreddit": "sewing"}], "804fq1": [{"0_Title": "Nobody understands this need better than chronic pain patients!", "1_Text": "Agreed! I know gaba works like a charm for a lot of neuro patients. I've always wondered if it's due to different body chemistry that science hasn't yet developed a way of testing.\nMy doctor insisted that methadone had to build up in your body for it to work effectively, but I could feel it reducing the pain within 20 minutes of taking it. I was informed it was my \"imagination\", and that I *expected* it to work. Uh huh. Whatever, doc.\nLet's hear it for gut feelings!!", "2_Subreddit": "ChronicPain"}], "804tqn": [{"0_Title": "Why your pharmacist can't tell you prescriptions could cost less if you paid cash", "1_Text": "Agreed! I know gaba works like a charm for a lot of neuro patients. I've always wondered if it's due to different body chemistry that science hasn't yet developed a way of testing.\nMy doctor insisted that methadone had to build up in your body for it to work effectively, but I could feel it reducing the pain within 20 minutes of taking it. I was informed it was my \"imagination\", and that I *expected* it to work. Uh huh. Whatever, doc.\nLet's hear it for gut feelings!!", "2_Subreddit": "ChronicPain"}], "80dmby": [{"0_Title": "This is what our physicians, the DEA and the CDC need to read. But will they? Or do they prefer \"easy answers\"?", "1_Text": "Agreed! I know gaba works like a charm for a lot of neuro patients. I've always wondered if it's due to different body chemistry that science hasn't yet developed a way of testing.\nMy doctor insisted that methadone had to build up in your body for it to work effectively, but I could feel it reducing the pain within 20 minutes of taking it. I was informed it was my \"imagination\", and that I *expected* it to work. Uh huh. Whatever, doc.\nLet's hear it for gut feelings!!", "2_Subreddit": "ChronicPain"}], "81j5dj": [{"0_Title": "Trump's inexperienced head of refugee resettlement forcing teenagers to give birth", "1_Text": "Agreed! I know gaba works like a charm for a lot of neuro patients. I've always wondered if it's due to different body chemistry that science hasn't yet developed a way of testing.\nMy doctor insisted that methadone had to build up in your body for it to work effectively, but I could feel it reducing the pain within 20 minutes of taking it. I was informed it was my \"imagination\", and that I *expected* it to work. Uh huh. Whatever, doc.\nLet's hear it for gut feelings!!", "2_Subreddit": "prochoice"}], "82iig2": [{"0_Title": "Peripheral neuropathy pain coming from brittle bones in feet ('da foot bone connected to 'da leg bone... and so forth).", "1_Text": "Agreed! I know gaba works like a charm for a lot of neuro patients. I've always wondered if it's due to different body chemistry that science hasn't yet developed a way of testing.\nMy doctor insisted that methadone had to build up in your body for it to work effectively, but I could feel it reducing the pain within 20 minutes of taking it. I was informed it was my \"imagination\", and that I *expected* it to work. Uh huh. Whatever, doc.\nLet's hear it for gut feelings!!", "2_Subreddit": "ChronicPain"}], "82oikx": [{"0_Title": "These parents may not be narcs, but many of us can remember similar attempts to help a child that *didn't* come from a place of love and concern.", "1_Text": "Agreed! I know gaba works like a charm for a lot of neuro patients. I've always wondered if it's due to different body chemistry that science hasn't yet developed a way of testing.\nMy doctor insisted that methadone had to build up in your body for it to work effectively, but I could feel it reducing the pain within 20 minutes of taking it. I was informed it was my \"imagination\", and that I *expected* it to work. Uh huh. Whatever, doc.\nLet's hear it for gut feelings!!", "2_Subreddit": "narcsinthewild"}], "82yh6e": [{"0_Title": "Male physician: \"You shouldn't have this much pain.\" Female patient: \"No, *MEN* shouldn't. But *WOMEN* do!\"", "1_Text": "Agreed! I know gaba works like a charm for a lot of neuro patients. I've always wondered if it's due to different body chemistry that science hasn't yet developed a way of testing.\nMy doctor insisted that methadone had to build up in your body for it to work effectively, but I could feel it reducing the pain within 20 minutes of taking it. I was informed it was my \"imagination\", and that I *expected* it to work. Uh huh. Whatever, doc.\nLet's hear it for gut feelings!!", "2_Subreddit": "ChronicPain"}], "832sha": [{"0_Title": "It's the stale-Twinkie-and-a-bag-of-Cheetos of junk science!", "1_Text": "Agreed! I know gaba works like a charm for a lot of neuro patients. I've always wondered if it's due to different body chemistry that science hasn't yet developed a way of testing.\nMy doctor insisted that methadone had to build up in your body for it to work effectively, but I could feel it reducing the pain within 20 minutes of taking it. I was informed it was my \"imagination\", and that I *expected* it to work. Uh huh. Whatever, doc.\nLet's hear it for gut feelings!!", "2_Subreddit": "ChronicPain"}], "837yrc": [{"0_Title": "People love a good witch-hunt", "1_Text": "Agreed! I know gaba works like a charm for a lot of neuro patients. I've always wondered if it's due to different body chemistry that science hasn't yet developed a way of testing.\nMy doctor insisted that methadone had to build up in your body for it to work effectively, but I could feel it reducing the pain within 20 minutes of taking it. I was informed it was my \"imagination\", and that I *expected* it to work. Uh huh. Whatever, doc.\nLet's hear it for gut feelings!!", "2_Subreddit": "ChronicPain"}], "83kpp9": [{"0_Title": "How will this impact cannabis sales in states that have legalized it? Will the DOJ push for pot suppliers to get the death penalty?", "1_Text": "Agreed! I know gaba works like a charm for a lot of neuro patients. I've always wondered if it's due to different body chemistry that science hasn't yet developed a way of testing.\nMy doctor insisted that methadone had to build up in your body for it to work effectively, but I could feel it reducing the pain within 20 minutes of taking it. I was informed it was my \"imagination\", and that I *expected* it to work. Uh huh. Whatever, doc.\nLet's hear it for gut feelings!!", "2_Subreddit": "Marijuana"}], "83wt7d": [{"0_Title": "This story has a major problem...", "1_Text": "Agreed! I know gaba works like a charm for a lot of neuro patients. I've always wondered if it's due to different body chemistry that science hasn't yet developed a way of testing.\nMy doctor insisted that methadone had to build up in your body for it to work effectively, but I could feel it reducing the pain within 20 minutes of taking it. I was informed it was my \"imagination\", and that I *expected* it to work. Uh huh. Whatever, doc.\nLet's hear it for gut feelings!!", "2_Subreddit": "ChronicPain"}], "849arp": [{"0_Title": "But the DEA is still taking away chronic pain patients' prescriptions!", "1_Text": "Agreed! I know gaba works like a charm for a lot of neuro patients. I've always wondered if it's due to different body chemistry that science hasn't yet developed a way of testing.\nMy doctor insisted that methadone had to build up in your body for it to work effectively, but I could feel it reducing the pain within 20 minutes of taking it. I was informed it was my \"imagination\", and that I *expected* it to work. Uh huh. Whatever, doc.\nLet's hear it for gut feelings!!", "2_Subreddit": "opiates"}], "849bsj": [{"0_Title": "Chronic pain patients are collateral damage in the government's \"war on drugs\"", "1_Text": "Agreed! I know gaba works like a charm for a lot of neuro patients. I've always wondered if it's due to different body chemistry that science hasn't yet developed a way of testing.\nMy doctor insisted that methadone had to build up in your body for it to work effectively, but I could feel it reducing the pain within 20 minutes of taking it. I was informed it was my \"imagination\", and that I *expected* it to work. Uh huh. Whatever, doc.\nLet's hear it for gut feelings!!", "2_Subreddit": "ChronicPain"}], "85b6rr": [{"0_Title": "If it's this simple, why isn't my doctor interested in doing the testing?", "1_Text": "Agreed! I know gaba works like a charm for a lot of neuro patients. I've always wondered if it's due to different body chemistry that science hasn't yet developed a way of testing.\nMy doctor insisted that methadone had to build up in your body for it to work effectively, but I could feel it reducing the pain within 20 minutes of taking it. I was informed it was my \"imagination\", and that I *expected* it to work. Uh huh. Whatever, doc.\nLet's hear it for gut feelings!!", "2_Subreddit": "ChronicPain"}], "85p59x": [{"0_Title": "A Nation in Pain: Healing our Biggest Health Problem – by Judy Foreman", "1_Text": "Agreed! I know gaba works like a charm for a lot of neuro patients. I've always wondered if it's due to different body chemistry that science hasn't yet developed a way of testing.\nMy doctor insisted that methadone had to build up in your body for it to work effectively, but I could feel it reducing the pain within 20 minutes of taking it. I was informed it was my \"imagination\", and that I *expected* it to work. Uh huh. Whatever, doc.\nLet's hear it for gut feelings!!", "2_Subreddit": "ChronicPain"}], "85u93h": [{"0_Title": "“Human Rights Watch” has taken an interest in our cause. They realized that ignoring a large group of citizens who live with untreated or under-treated chronic pain is inhumane!", "1_Text": "Agreed! I know gaba works like a charm for a lot of neuro patients. I've always wondered if it's due to different body chemistry that science hasn't yet developed a way of testing.\nMy doctor insisted that methadone had to build up in your body for it to work effectively, but I could feel it reducing the pain within 20 minutes of taking it. I was informed it was my \"imagination\", and that I *expected* it to work. Uh huh. Whatever, doc.\nLet's hear it for gut feelings!!", "2_Subreddit": "ChronicPain"}], "862sm5": [{"0_Title": "Government data and drug enforcement policy don't agree - but that doesn't stop the DEA from coming after pain patients and their MDs!", "1_Text": "Agreed! I know gaba works like a charm for a lot of neuro patients. I've always wondered if it's due to different body chemistry that science hasn't yet developed a way of testing.\nMy doctor insisted that methadone had to build up in your body for it to work effectively, but I could feel it reducing the pain within 20 minutes of taking it. I was informed it was my \"imagination\", and that I *expected* it to work. Uh huh. Whatever, doc.\nLet's hear it for gut feelings!!", "2_Subreddit": "ChronicPain"}], "86c080": [{"0_Title": "Looking for political murder mystery from the early 1990s...", "1_Text": "Agreed! I know gaba works like a charm for a lot of neuro patients. I've always wondered if it's due to different body chemistry that science hasn't yet developed a way of testing.\nMy doctor insisted that methadone had to build up in your body for it to work effectively, but I could feel it reducing the pain within 20 minutes of taking it. I was informed it was my \"imagination\", and that I *expected* it to work. Uh huh. Whatever, doc.\nLet's hear it for gut feelings!!", "2_Subreddit": "whatsthatbook"}], "86t32k": [{"0_Title": "I *said* not to ever serve this brand of chow again!! Are *all* humans as stupid as you?", "1_Text": "Agreed! I know gaba works like a charm for a lot of neuro patients. I've always wondered if it's due to different body chemistry that science hasn't yet developed a way of testing.\nMy doctor insisted that methadone had to build up in your body for it to work effectively, but I could feel it reducing the pain within 20 minutes of taking it. I was informed it was my \"imagination\", and that I *expected* it to work. Uh huh. Whatever, doc.\nLet's hear it for gut feelings!!", "2_Subreddit": "CatsAreAssholes"}], "87rujp": [{"0_Title": "Is the CDC this ignorant OR did the opioid recommendation committee have a hidden agenda?", "1_Text": "Agreed! I know gaba works like a charm for a lot of neuro patients. I've always wondered if it's due to different body chemistry that science hasn't yet developed a way of testing.\nMy doctor insisted that methadone had to build up in your body for it to work effectively, but I could feel it reducing the pain within 20 minutes of taking it. I was informed it was my \"imagination\", and that I *expected* it to work. Uh huh. Whatever, doc.\nLet's hear it for gut feelings!!", "2_Subreddit": "ChronicPain"}], "88za9z": [{"0_Title": "Who is profiting from denying opioids to CP patients? And why isn't the DEA listening to us?", "1_Text": "Agreed! I know gaba works like a charm for a lot of neuro patients. I've always wondered if it's due to different body chemistry that science hasn't yet developed a way of testing.\nMy doctor insisted that methadone had to build up in your body for it to work effectively, but I could feel it reducing the pain within 20 minutes of taking it. I was informed it was my \"imagination\", and that I *expected* it to work. Uh huh. Whatever, doc.\nLet's hear it for gut feelings!!", "2_Subreddit": "ChronicPain"}], "89skc2": [{"0_Title": "Pharmaceutical-quality opiates almost impossible to find.", "1_Text": "Agreed! I know gaba works like a charm for a lot of neuro patients. I've always wondered if it's due to different body chemistry that science hasn't yet developed a way of testing.\nMy doctor insisted that methadone had to build up in your body for it to work effectively, but I could feel it reducing the pain within 20 minutes of taking it. I was informed it was my \"imagination\", and that I *expected* it to work. Uh huh. Whatever, doc.\nLet's hear it for gut feelings!!", "2_Subreddit": "opiates"}]}]}]}