{"justplayinghanzo": [{"0_comments": [{"dvuannh": [{"0_Comment Submission": "When to smoke the sleeper blunt while/after tripping.", "1_Text": "Nah :/", "2_Subreddit": "Drugs"}], "dvvdgtb": [{"0_Comment Submission": "When to smoke the sleeper blunt while/after tripping.", "1_Text": "It was really weird. I peaked 3 hours in and it lasted a couple hours but after that I was only kinda like semi tripping for the next few hours like I would feel almost sober for several minutes at a time but every now and then I'd start tripping again (mentally at least the visuals were gone at that point).  For like 20 seconds then it would go away.", "2_Subreddit": "Drugs"}], "dvvk209": [{"0_Comment Submission": "Smoking weed the day after tripping", "1_Text": "This was my second time on acid, first time was last year and I had a terrible trip. I've done mdma multiple times as well so if you count that as a psych I wouldn't say I'm terribly inexperienced. Weeds still been the same for me since my first trip but I didn't smoke on it the first time so maybe that's why. Boutta spark this bleezy tho so we'll see", "2_Subreddit": "Drugs"}], "dvvqug6": [{"0_Comment Submission": "Smoking weed the day after tripping", "1_Text": "My first trip was a nightmare as well. This time I honestly had some demons I wanted to face and I went in head first with a 500 ug trip. I had 6 xans in case it got to be too much to handle and a friend there who was also tripping on 100 ug. We smoked weed on the come up and it was euphoric as hell. We laughed for a couple hours before all the psychedelic head fuck started to kick in. Minutes later I had a 10 second panic attack while listening to a song that I had heard in my first trip but after that I was fine for the most part\n\nEven though I was able to enjoy myself though I would occasionally feel an almost menacing presence. The head fuck and visuals were even stronger than I expected I eventually laid down and closed my eyes and had completely unreal CEVS. The whole time I felt a blanket of euphoria all over me and the more it consumed me something weird started to happen. The drug literally started stripping my identity away. Eventually everything that made me myself was just no longer there. I was simply observing the world through a vessel that was not me. I wouldn't even necessarily I was observing the world because I it wasn't me, It was something else entirely. At some point o returned, I couldn't tell you when.Then my dumbass forgot about the xans and stayed up til 11 am. I still don't know what to make of it tbh with you. \n\nBut if you do go for a second trip just make sure your mindsets right and your in a good environment. I kept myself in a good mindset this time by refusing to be scared and always reminding myself that it was a drug. I saw demons and laughed in there faces. And if some shit started happening that I didn't enjoy I didn't let it get me down too much and took some advice someone gave and just recognized that it was just a part of my trip that was pissing me off a bit and it'll get better quickly. The biggest thing for me was having no fear.", "2_Subreddit": "Drugs"}], "dvvr04s": [{"0_Comment Submission": "Damn X isn’t underground anymore", "1_Text": "I don't understand why people hate him becoming more popular. I mean musically wise he's not selling out so I don't see why it's an issue. I want him to go platinum multiple times and become a fucking legend.", "2_Subreddit": "XXXTENTACION"}], "dvvshns": [{"0_Comment Submission": "Damn X isn’t underground anymore", "1_Text": "I may have agreed with you after 17 but ? Erased all doubt in my mind. This is the best music x has released in his career.", "2_Subreddit": "XXXTENTACION"}], "dvwf5zm": [{"0_Comment Submission": "500 ug trip. Something really fucking weird happened.", "1_Text": "I was actually waiting for this response. Listen I know lsd tugs away at the ego I've become confused about my identity and sense of self before on psychs, this was different. I literally was not there. I completely ceased to exist for a couple hours.", "2_Subreddit": "Drugs"}], "dvwg48v": [{"0_Comment Submission": "500 ug trip. Something really fucking weird happened.", "1_Text": "I'm afraid I'm not familiar with the term. But I'm glad to know it's actually a thing not just something crazy that happened to me. I've had my ego tugged at before, but I've never experienced a total cease in existence.", "2_Subreddit": "Drugs"}], "dvwlrcu": [{"0_Comment Submission": "since we're doing \"?\" rankings here's mine lol", "1_Text": "You sleeping on numb and the remedy to a broken heart.", "2_Subreddit": "XXXTENTACION"}], "dvwog2e": [{"0_Comment Submission": "500 ug trip. Something really fucking weird happened.", "1_Text": "A lot of the \"demons\" I wanted to face were related to my anxiety. I wanted to completely kill my fear, and well the thought of a normal dose wasn't \"scary\" and I couldn't kill my fear without confronting it.", "2_Subreddit": "Drugs"}], "dvwp5ob": [{"0_Comment Submission": "500 ug trip. Something really fucking weird happened.", "1_Text": "For now yes. I feel much more at ease and am less of a slave to my anxiety, as a matter of fact I haven't felt much anxiety at all since my trip. We'll see if it lasts though. Also I don't think I would have been able to do it without knowing I had xans around so I'm not quite as Ballsy as it may seem lbs.", "2_Subreddit": "Drugs"}], "dvwqqb8": [{"0_Comment Submission": "500 ug trip. Something really fucking weird happened.", "1_Text": "Well I saw demons and fire look back it me Through the window through my pupils and laughed. I felt the world fall into insanity and when I usually would have clung desperately to my sense of self due to fear of not being in control I let go and literally felt my sense of self die and be resurrected later. Normally this all would have terrified me, but I had never felt more at peace. Except for when I wasn't there, then I couldn't feel anything. My point is just because you don't find high doses to be therapeutic that doesn't mean they can't be for other people. Also I had 6 xans ready to go if it became too much to handle.", "2_Subreddit": "Drugs"}], "dvwra5y": [{"0_Comment Submission": "500 ug trip. Something really fucking weird happened.", "1_Text": "That must have been wild. I don't think I could ever accomplish this on Molly tho I just feel way too much lbs.", "2_Subreddit": "Drugs"}], "dwbfqz9": [{"0_Comment Submission": "I tried lsd for the first time in my life yesterday! It blew my fucking mind!!", "1_Text": "My first time tripping I thought it was cars driving past...all night...that we could hear from  inside a house no where fucking near the road 😂", "2_Subreddit": "Drugs"}], "dwbfynv": [{"0_Comment Submission": "Has Donald Trump \"sold Christians down the river?\"", "1_Text": "*Spending tax payer money to save the lives of unborn children. Abortion rates would sky rocket without planned parenthood, nearly all research on the topic suggests this. Lack of sex Ed/birth control=more abortions, STD's, teen pregnancies, etc.", "2_Subreddit": "Christian"}], "dwcjoe1": [{"0_Comment Submission": "What am I suppose to do?", "1_Text": "Switch doctors", "2_Subreddit": "Drugs"}], "dwjobsl": [{"0_Comment Submission": "Partying on adderall come down?", "1_Text": "Good advice cause it kills my appetite. I'll make sure I force something down before I leave.", "2_Subreddit": "Drugs"}], "dwjovpi": [{"0_Comment Submission": "Partying on adderall come down?", "1_Text": "Yeah fun until I go home four hours later and can't sleep lol. If I redose I think it'll be just a little bit to keep me going.", "2_Subreddit": "Drugs"}], "dwjt9sq": [{"0_Comment Submission": "5 minutes into kratom and chill and he gives you this look", "1_Text": "Hey kid, wanna try some harm reduction?", "2_Subreddit": "drugscirclejerk"}], "dwp0gvb": [{"0_Comment Submission": "Tried Purple Molly for the first time last night. Never going back to presses after the experience ❤️", "1_Text": "We get purple Molly around here too. Not sure about the purity I've never done it cause I've got a solid plug giving me normal looking shit but you are aware color has absolutely nothing to do with purity right?", "2_Subreddit": "MDMA"}], "dwp4jrd": [{"0_Comment Submission": "This message was approved by dr.xxxtentacles", "1_Text": "But sometimes you just gotta catch chlamydia on these niggas 😪", "2_Subreddit": "XXXTENTACION"}], "dwt1w8m": [{"0_Comment Submission": "Would you have switched to heroin if oxys were still everywhere?", "1_Text": "No they still would have switched? Or no as in it wasn't a factor", "2_Subreddit": "opiates"}], "dwtig22": [{"0_Comment Submission": "Would you have switched to heroin if oxys were still everywhere?", "1_Text": "How dare I search for input from people with first hand experience on the topic. My bad man 😖", "2_Subreddit": "opiates"}], "dwtoapg": [{"0_Comment Submission": "Would you have switched to heroin if oxys were still everywhere?", "1_Text": "Trust me Reddit won't be on my works cited page lol. This was more or less to get opinions from people who've actually experienced the transition from pharms to heroin, and if their motivation is what I predicted it was(less supply/rising price). I'll have to go find some case study to back it up before I put it in my paper. Just wanted some first hand input", "2_Subreddit": "opiates"}], "dww1f4j": [{"0_Comment Submission": "Would you have switched to heroin if oxys were still everywhere?", "1_Text": "No you're good man. And I've always fucked w this community, I do my fair share of drugs myself actually so I've found myself here before just to get information on dosage and things like that from time to time. Everyone's always been really helpful just like they have been with this post.", "2_Subreddit": "opiates"}]}], "1_submissions": [{"7prb2q": [{"0_Title": "Weird ass Molly experience", "1_Text": "Nah :/", "2_Subreddit": "MDMA"}], "7pv4gs": [{"0_Title": "6s speakers not working ?", "1_Text": "Nah :/", "2_Subreddit": "iphone"}], "7r293n": [{"0_Title": "First time on adderall", "1_Text": "Nah :/", "2_Subreddit": "Drugs"}], "7r297r": [{"0_Title": "First time on adderall", "1_Text": "Nah :/", "2_Subreddit": "Stims"}], "7s0i98": [{"0_Title": "Currently barred out so bear with me", "1_Text": "Nah :/", "2_Subreddit": "Drugs"}], "7sm46b": [{"0_Title": "Adderall after an all nighter?", "1_Text": "Nah :/", "2_Subreddit": "Drugs"}], "7tz7lx": [{"0_Title": "Why can't I sleep", "1_Text": "Nah :/", "2_Subreddit": "Drugs"}], "7ul9tu": [{"0_Title": "Friend just took 90 mg adderall xr. Is she going to be okay?", "1_Text": "Nah :/", "2_Subreddit": "Drugs"}], "7uln9z": [{"0_Title": "Is my friend going to be okay?", "1_Text": "Nah :/", "2_Subreddit": "Stims"}], "7v55a4": [{"0_Title": "Trip sitting help", "1_Text": "Nah :/", "2_Subreddit": "Drugs"}], "7w0x5e": [{"0_Title": "Losing aid for weed charge", "1_Text": "Nah :/", "2_Subreddit": "StudentLoans"}], "7wxex7": [{"0_Title": "How to manage MDMA tolerance effectively", "1_Text": "Nah :/", "2_Subreddit": "Drugs"}], "7xs6kw": [{"0_Title": "2CB questions", "1_Text": "Nah :/", "2_Subreddit": "Drugs"}], "7z0ayz": [{"0_Title": "How much lean to take with no tolerance?", "1_Text": "Nah :/", "2_Subreddit": "Drugs"}], "7z1ycp": [{"0_Title": "When will the Mexicans next door be deported?", "1_Text": "Nah :/", "2_Subreddit": "The_Donald"}], "80qx2b": [{"0_Title": "Looking to buy Xanax in bulk", "1_Text": "Nah :/", "2_Subreddit": "darknet"}], "8120mr": [{"0_Title": "Sourin rips help with weird induced unproductiveness", "1_Text": "Nah :/", "2_Subreddit": "Drugs"}], "82morv": [{"0_Title": "This Molly tolerance break is becoming very difficult", "1_Text": "Nah :/", "2_Subreddit": "Drugs"}], "84hr59": [{"0_Title": "The timberwolves problem", "1_Text": "Nah :/", "2_Subreddit": "nba"}], "84tajs": [{"0_Title": "Currently finishing up infinity and so far this album is pure gold.", "1_Text": "Nah :/", "2_Subreddit": "XXXTENTACION"}], "857zfw": [{"0_Title": "Smoking weed the day after tripping", "1_Text": "Nah :/", "2_Subreddit": "Drugs"}], "85ckbh": [{"0_Title": "500 ug trip. Something really fucking weird happened.", "1_Text": "Nah :/", "2_Subreddit": "Drugs"}], "88chk8": [{"0_Title": "Partying on adderall come down?", "1_Text": "Nah :/", "2_Subreddit": "Drugs"}], "89mf5i": [{"0_Title": "How long does xanax tolerance last", "1_Text": "Nah :/", "2_Subreddit": "Drugs"}], "89rqlf": [{"0_Title": "Would you have switched to heroin if oxys were still everywhere?", "1_Text": "Nah :/", "2_Subreddit": "opiates"}]}]}]}