{"Milksteak_MedRare": [{"0_comments": [{"drh9dzl": [{"0_Comment Submission": "Budget friendly eatery near the Fox for some special kids", "1_Text": "I used to work at the Broadway diner, would be a good choice, but it closed quite some time ago. The Varsity would be perfect. Or maybe split a pizza at Goodfellas?", "2_Subreddit": "Atlanta"}], "drxne8z": [{"0_Comment Submission": "This cat looks like it’s ready to lead the First Order in smashing the rebellion.", "1_Text": "Slendercat!", "2_Subreddit": "funny"}], "drymwds": [{"0_Comment Submission": "Any of y'all need a buddy?", "1_Text": "Hey! I'm 27 and my husband is 28. We just moved up here and don't know many people in the area but love meeting people, drinking, DND, video games, and staring off into space!! No NYE plans either. Would love to make some new friends :)", "2_Subreddit": "Atlanta"}], "dsgb7kl": [{"0_Comment Submission": "What little thing can I help with?", "1_Text": "27 year old with long-term clinical depression. I've learned the only thing that actually helps me, is helping others. Find anything you're passionate about and figure out how it can benefit others. I've always been fascinated by neurology and I'm a sleep therapist now. It's literally my saving grace. It's hard to live for myself, but I can live to help others.\n\nThese are my favorite \n\nhttps://suicidepreventionlifeline.org/our-network/\n\nhttps://www.linkedin.com/jobs/view/volunteer%3A-neurologist-at-careervillage.org-418808665\n\nhttps://www.volunteermatch.org/search/org37010.jsp", "2_Subreddit": "Atlanta"}], "dsgbph7": [{"0_Comment Submission": "Looking for friends to attend metal concerts with!", "1_Text": "Seeing Whitechapel and Gwar on Halloween together 5 or 6 years ago was the best concert I've ever been to! 27, F, loves metal more than anything. Hit me up! Let's go to a show!", "2_Subreddit": "Atlanta"}], "dsk5rj9": [{"0_Comment Submission": "Sleep Therapist?", "1_Text": "Ooooh!! I'm a sleep therapist! I work all the way in Gainesville but I'd be happy to answer any questions if you wanted to PM me :)", "2_Subreddit": "Atlanta"}], "dtk9c0n": [{"0_Comment Submission": "Women be aware", "1_Text": "Their physical description doesn't matter. They're NOT sex traffickers. Read the above comments or take two seconds to check on Google", "2_Subreddit": "Atlanta"}], "du0lxtq": [{"0_Comment Submission": "I’m moving to the West Coast soon, so I painted the most Atlanta scene I could think of to remind myself of this special city. Oil on canvas, 18x24”", "1_Text": "Also interested!! This is amazing!", "2_Subreddit": "Atlanta"}], "du43opf": [{"0_Comment Submission": "Just overdosed", "1_Text": "Idk why but I always felt like you were so much safer snorting it. This really hit home for me. So glad you're safe.... that's such a small amount.... I'm really shocked.", "2_Subreddit": "opiates"}], "du43vt1": [{"0_Comment Submission": "Carpet Tar...", "1_Text": "Dreamt about my ex last night and woke up NEEDING to get high just to forget about it. Fuck my subconscious :(", "2_Subreddit": "opiates"}], "du44936": [{"0_Comment Submission": "Bud and The Magic Cello - An unfortanute update, a helping hand, and a missing ear?", "1_Text": "You and your friends are cunts", "2_Subreddit": "opiates"}], "dugo4h8": [{"0_Comment Submission": "/r/Atlanta Random Daily Discussion - February 18, 2018", "1_Text": "This is amazing and I need all of them now", "2_Subreddit": "Atlanta"}], "duj2u2i": [{"0_Comment Submission": "Cobb woman who faked being cop for Chick-Fil-A discount indicted", "1_Text": "This woman knows no shame", "2_Subreddit": "Atlanta"}], "dujkk8z": [{"0_Comment Submission": "/r/Atlanta Random Daily Discussion - February 19, 2018", "1_Text": "My husband did set design for that movie! I enjoyed it even more than I thought I would. Both cast and crew did an amazing job (but maybe I'm a little biased) ;)", "2_Subreddit": "Atlanta"}], "dv00dtp": [{"0_Comment Submission": "Police make third arrest in deadly robbery at Barcelona Wine Bar", "1_Text": "You're fucking disgusting", "2_Subreddit": "Atlanta"}], "dw58bmw": [{"0_Comment Submission": "I give you my ultimate Atlanta bucket-list (over 300 items including bars/food/events/outdoor activities etc)", "1_Text": "Second VideoDrome!!", "2_Subreddit": "Atlanta"}], "dwnxi8y": [{"0_Comment Submission": "Girlfriend of 3 1/2 gets hooked on opiates, robs me blind.", "1_Text": "Nobody can analyze you 3 1/2 year relationship over one Reddit post, and I don't know if she was a good person or not, but I can say that heroin fucked my life up and sent me on a path that quickly snowballed out of control doing all the things I swore I never would. I never stole money from anyone, but I truly believe if I hadn't gotten help when I did, it's something that I definitely think could have happened. I've watched heroin change my closest friends who I've known all my life \nand change them into people I barely recognize. It is an extremly powerful drug that robs its users of their morals, will to live, and sense of self. I genuinely hope things work out for the both of you, whatever you choose.", "2_Subreddit": "opiates"}], "dwoarsu": [{"0_Comment Submission": "A story about an overdose.", "1_Text": "That was amazing and I need you to write more so I can read it :)", "2_Subreddit": "opiates"}]}], "1_submissions": [{}]}]}