{"Onlytofallbackdown": [{"0_comments": [{"d89nymq": [{"0_Comment Submission": "What is ECP?", "1_Text": "east coast powder", "2_Subreddit": "opiates"}], "d8bgyoq": [{"0_Comment Submission": "The Junkie Fairy is real!", "1_Text": "My junkie Jesus story. I went away for a weekend( 4 hours away to a Podunk town in PA) empty handed. I was broke and said okay I can do this. By that night I was sick. I couldn't sleep tossin and turning popping NyQuil every few hours. I woke up the next day feeling horrible. \n\nI was miles away from home and I couldn't do anything. At about 6 pm I was like maybe I can scrap together some empties in the bottom of my bag. So I'm looking through my backpack finding nothing but all ripped apart bags. Then I see it! i see what looks like a unopened stamp bag at the bottom of my backpack. I was like \"no way\". I reach for it and yup it's a full bag. I was shaking I was so happy. \n\nIt's nuts cause I really keep on top of how many bags I have ( we all do)and I never recall really missing a bag. It was perfect timing to find it. I was so sick and so far from anywhere even if I could go out and cop. Junkie Jesus indeed. \n\n\nI once also found a full bottle of 180mg methadone. Just lying there on the sidewalk by a bus stop. I felt really bad for the dude who lost it. I even looked him up on Facebook to return it. I couldn't find him though.", "2_Subreddit": "opiates"}], "d8c2jg9": [{"0_Comment Submission": "Missed u47 IV complications persist 6 mo. later - wtf is wrong with me??", "1_Text": "Have you've gotten any Mri's? You should get a full body mri. Maybe the chemicals affected your brain as well as your hands? It wouldn't hurt. \n\n\nI have Ms. And during my worst exacerbation my right hand wouldn't work. They were so numb and weak I couldn't even turn the water faucet. So maybe testing for a neurological disorder may find something ?", "2_Subreddit": "Drugs"}], "d8ci9o7": [{"0_Comment Submission": "Shooting while driving", "1_Text": "I watched an episode of intervention when the guy did this.if I recall correctly He was steering ( with knees or one hand) and prepping at the same time. I was pretty impressed. Maybe I can search YouTube for it?", "2_Subreddit": "opiates"}], "d8fhz5k": [{"0_Comment Submission": "Post for the ladies of r/opiates", "1_Text": "Yup. It's gone. Years.", "2_Subreddit": "opiates"}], "d8jingz": [{"0_Comment Submission": "Dog food", "1_Text": "I've was asked \"are you're a dog or cat ?\" meaning do you get tend to be energized? or do you mostly nod out while high? Maybe it has something to do with that?", "2_Subreddit": "opiates"}], "d8mc6t5": [{"0_Comment Submission": "First time cold copping how do I order?", "1_Text": "That sucks I cold copped twice. First time I was robbed by two crackheads girls. It was only 15 bux and weed I found earlier that day. Second time I found a young homeless dude and it worked out. We actually became friends after that. For future sake it's a lot easier to cop in midtown then downtown. Also I'm in NYC. Pm me if you ever need a friend to chat and hang out with.", "2_Subreddit": "opiates"}], "d8nslcu": [{"0_Comment Submission": "Anybody ever have much luck with fronts?", "1_Text": "I have a middle who used to be my main. Anyways he lets me front for hundreds sometimes. It's really awesome, of course the tax is a bun but when you don't have to worry about getting sick it's worth it.", "2_Subreddit": "opiates"}], "d8oz2zg": [{"0_Comment Submission": "How did your family/friends find out you use opiates?", "1_Text": "Now ex-boyfriend told my mom.", "2_Subreddit": "opiates"}], "d95qynb": [{"0_Comment Submission": "ON THE NEXT EPISODE OF DBOY Z", "1_Text": "Haha, too familiar..11:07 so it seems like you're not counting the minutes and just calling him. Why are dboys all the same?", "2_Subreddit": "opiates"}], "d95r1w2": [{"0_Comment Submission": "ON THE NEXT EPISODE OF DBOY Z", "1_Text": "Yes, totally ask \"you good?\"", "2_Subreddit": "opiates"}], "d9bqw7q": [{"0_Comment Submission": "19 days since Vivitrol injection, possible to break through?", "1_Text": "Sorta related, I ived 2 mg of subs and it was one of the worst feelings ever. I don't think I'll ever do that again. It wasnt pwds cause I was 24 hrs past. It didn't feel like wds either. It was a real gross feeling. I guess whatever floats your boat but that was a high I can live without. Do people enjoy that?", "2_Subreddit": "opiates"}], "db53wxb": [{"0_Comment Submission": "New connect gave me this and I've never seen anything like it. Can you guys help me out, what's your opinion?", "1_Text": "Yup I'm thinking gunpowder as well.", "2_Subreddit": "opiates"}], "db621mf": [{"0_Comment Submission": "Merry Christmas to me!", "1_Text": "The other day I was just about to get sick. So I think to myself maybe I dropped one in my bag... so low and behold I did. I was pretty happy even though one bag won't get me off it will keep me well for a bit. i usually lose track of what I have when it's a good payday ( high commission or laying off the advances) or a busy rollcall day. So congrats on being blessed by JJ!", "2_Subreddit": "opiates"}], "db72lb5": [{"0_Comment Submission": "I figured out a little trick this past weekend that relieves opiate constipation without softeners or laxatives", "1_Text": "I used to get colonics. They are the best. You feel like you can take on the world after one.", "2_Subreddit": "opiates"}], "db731pl": [{"0_Comment Submission": "Has anyone heard of this band and do you listen to them while on the DOC?", "1_Text": "I used to listen to bandits all the time.", "2_Subreddit": "opiates"}], "db907uj": [{"0_Comment Submission": "That terrifying moment when your dealer...", "1_Text": "I've gotten this as well. It's crazy how they all talk the same way. Or \"my guy had shitty stuff have to go through someone else I'll let you know.\"", "2_Subreddit": "opiates"}], "dbi9uj3": [{"0_Comment Submission": "Dealer sold me fent...and told me it was fent.", "1_Text": "Never copped fent but my dude(s) usually tells me to test it / do less when he thinks it's stronger dope.", "2_Subreddit": "opiates"}], "dbnv7u0": [{"0_Comment Submission": "Some of that east coast FIRE", "1_Text": "Omg that looks great. It's like you picked up driveway stones and took a photo.", "2_Subreddit": "opiates"}], "ddc8jte": [{"0_Comment Submission": "Can't post subs in other threads without me being called a junkie!", "1_Text": "Yeah, I never post anywhere else knowing they'll automatically disregard anything I say bc I post here and use.", "2_Subreddit": "opiates"}], "denpplp": [{"0_Comment Submission": "Junkie ghost robbing homeowners ( x-post paranormal)", "1_Text": "This makes the most sense or they have a secret squatter hiding out.", "2_Subreddit": "opiates"}], "denpq6g": [{"0_Comment Submission": "Junkie ghost robbing homeowners ( x-post paranormal)", "1_Text": "I love the fact that the ghost is stealing money.", "2_Subreddit": "opiates"}], "denprhg": [{"0_Comment Submission": "Junkie ghost robbing homeowners ( x-post paranormal)", "1_Text": "I saw this is in the paranormal subreddit. So it's not me.. thank god!", "2_Subreddit": "opiates"}], "dppmpj5": [{"0_Comment Submission": "Ranting, angry and confused", "1_Text": "You gotta go into general >settings and fix the keyboard. “I seems to have the issue. You gotta go to text replacement and switch I with a lower case I. That what I did and it seems to help. I hate updates.", "2_Subreddit": "opiates"}], "dwqgm6g": [{"0_Comment Submission": "/r/Opiates can be a depressing place, but after a lot of research and thought I have determined that this user is the best user of /r/Opiates and possibly the best person on Reddit too!", "1_Text": "Haha, I was like “really? Me?” for 1/2 a sec. Good stuff :).", "2_Subreddit": "opiates"}]}], "1_submissions": [{"54ywjm": [{"0_Title": "Hi! I'm Sorta new :). I did something with all those rubber bands.", "1_Text": "east coast powder", "2_Subreddit": "opiates"}], "5y5a6l": [{"0_Title": "Junkie ghost robbing homeowners ( x-post paranormal)", "1_Text": "east coast powder", "2_Subreddit": "opiates"}]}]}]}