{"pHgC": [{"0_comments": [{"dwuqh5x": [{"0_Comment Submission": "The come up", "1_Text": "Fuck the comments man do you", "2_Subreddit": "opiates"}], "dwuqjiy": [{"0_Comment Submission": "Around 200 pressed busses, just woke up from a long blackout", "1_Text": "Must have been LIT to move to fla", "2_Subreddit": "opiates"}], "dwuvgw4": [{"0_Comment Submission": "My dboy who sold me these bricks invited me into his trap house to party. I politely declined", "1_Text": "That amount of dope might mean an appearance ticket in North Jersey cities. Take the same amount to the suburbs in upstate New York and your friends won't see you for 5 years", "2_Subreddit": "opiates"}], "dwuwj4b": [{"0_Comment Submission": "Phenobarbital & Suboxone treatment", "1_Text": "Phenobarbital helps. With your habit a Valium taper might not be a bad idea I'd try bringing up Valium or Librium before you leave the doctors. Good luck", "2_Subreddit": "opiates"}], "dwux6t2": [{"0_Comment Submission": "Feeling like I have a good dentist, but is this common for this practice?", "1_Text": "You kinda sound like a bitch dude. If your on subs your not going to feel any better with a T3. I get the anxiety part but root canals aren't the end of the world ibuprofen and Tylenol work fine", "2_Subreddit": "opiates"}], "dwuxgtx": [{"0_Comment Submission": "Time to forget about the day i had, fuk the whole probation and court system ...... free my babe I miss her soo much I would trade places with u if i could i pray I could every night, I’m jus happy she went to detox a week ago so she’s not kicking in pcj rn", "1_Text": "Is that some indoor bubba kush?", "2_Subreddit": "opiates"}], "dwv017z": [{"0_Comment Submission": "Girlfriend problems here.. am I nuts?", "1_Text": "Just sounds like growing pains my dude. You've made so much progress and your so young don't let yourself be taken in by these whirl wind relationships you have a good heart don't give it all away right now", "2_Subreddit": "opiates"}], "dwv04o5": [{"0_Comment Submission": "HOLY CANNOLI", "1_Text": "Top that off with a blunt cruise and that's what's up", "2_Subreddit": "opiates"}], "dwv0kpr": [{"0_Comment Submission": "today would’ve been your 23rd birthday. i miss you everyday darlin’ 💔", "1_Text": ".", "2_Subreddit": "opiates"}], "dwv1x6n": [{"0_Comment Submission": "Time to forget about the day i had, fuk the whole probation and court system ...... free my babe I miss her soo much I would trade places with u if i could i pray I could every night, I’m jus happy she went to detox a week ago so she’s not kicking in pcj rn", "1_Text": "Hell yeah looks familiar for sure. Nice bags too. Hope your girl gets out soon. She get a date yet or still have an open case?", "2_Subreddit": "opiates"}], "dwv24se": [{"0_Comment Submission": "Nothing like sealed bottles to start my day.", "1_Text": "Throw in a bottle of kpins and you got a Boston breakfast", "2_Subreddit": "opiates"}], "dwv2acu": [{"0_Comment Submission": "Going to be flying with ~23 Oxy blues. Planning to just put them in a Tylenol bottle. Is it okay check that bottle with my luggage or do I need to carry it on for some reason?", "1_Text": "TSA gives no fucks about your percs", "2_Subreddit": "opiates"}], "dwv2bmo": [{"0_Comment Submission": "These are a LIFE SAVER when using. What’s your favorite anti-nausea medicine or remedy?", "1_Text": "Zofran or phenrgan", "2_Subreddit": "opiates"}], "dwv35cn": [{"0_Comment Submission": "Girlfriend problems here.. am I nuts?", "1_Text": "Shit homie. I'm sending you positive vibes all weekend. I've seen you around on here for a minute now. You can always message me if your struggling. I'm about 10 years older than you and have an absentee father in another way. I feel you on the therapist thing. The ones that take Medicaid are usually fresh out of college starting a career so it is hard to get on the same page and even harder to repeat it with a new one. The best thing you can do is just go to NA or AA not even for the program but to meet some good people. If the program rubs off on you then so be it but you'll at least find people who are tolerant twords drug users. My inbox is open. Much love.", "2_Subreddit": "opiates"}], "dwv98us": [{"0_Comment Submission": "Found out I may possibly only have a few years to live", "1_Text": "Well wishes good luck!", "2_Subreddit": "opiates"}], "dwvw9x6": [{"0_Comment Submission": "Drug kingpin", "1_Text": "S' hard out here for a pimp", "2_Subreddit": "opiates"}], "dwvwgdh": [{"0_Comment Submission": "Real Xanax bars straight from the Pharmacy and 8mg Suboxone! Sorry it has been a while since I have posted. I have been working and push so many bars that I don't have time for shit. Happy nods guys.", "1_Text": "I've settled down alot lately this and some good weed is all I really need to function now a days maybe some speed on a rough morning", "2_Subreddit": "opiates"}], "dwvwkp0": [{"0_Comment Submission": "Wondering how you guys met your now-dealers? (Don't worry, I'm not trying to source)", "1_Text": "Just people's I had business with weather it was landscaping or painting/ sub contractors then selling tree the last ten years in a bigger illegal market I know about everyone", "2_Subreddit": "opiates"}], "dwvx10u": [{"0_Comment Submission": "What do y’all think?", "1_Text": "Just depends where your at I'll have periods of the same manufacturers for sometimes up to a couple years they eventually switch up though. I hated the brand name Vicodin personally.", "2_Subreddit": "opiates"}], "dww0zs8": [{"0_Comment Submission": "What do y’all think?", "1_Text": "I just didn't care for the ES and HP formulations they contain 2-3x more apap then a Norco", "2_Subreddit": "opiates"}], "dww1osy": [{"0_Comment Submission": "What do y’all think?", "1_Text": "Same here. There were times I'd eat 10-15 Norco at a time when I first started doing dope I hadn't fully committed yet and still ended up sick with no plug from time to time on a good day I could at least get a few OCs but there were times I would wake up too sick eat a bunch of yellows and puke them up right after don't miss that", "2_Subreddit": "opiates"}], "dww47ms": [{"0_Comment Submission": "What do y’all think?", "1_Text": "Yeah chewing up all those pills tastes foul too", "2_Subreddit": "opiates"}], "dww5fsc": [{"0_Comment Submission": "Today’s pick up", "1_Text": "Like your style. Stay up.", "2_Subreddit": "opiates"}], "dww5jv8": [{"0_Comment Submission": "Who got the link of the post about the guy claiming he's in Afghanistan or somewhere in Iraq or something about him and 10 other Muhammad's cooking up dope from start to finish. It was like a 30 pic Imgur link.", "1_Text": "Mohammad is the most commonly used name on Earth.", "2_Subreddit": "opiates"}], "dwxeqm5": [{"0_Comment Submission": "Who got the link of the post about the guy claiming he's in Afghanistan or somewhere in Iraq or something about him and 10 other Muhammad's cooking up dope from start to finish. It was like a 30 pic Imgur link.", "1_Text": "I couldn't help myself", "2_Subreddit": "opiates"}]}], "1_submissions": [{"7uwe4j": [{"0_Title": "Need a crash course in kratom", "1_Text": "Fuck the comments man do you", "2_Subreddit": "kratom"}], "7vc993": [{"0_Title": "New strain", "1_Text": "Fuck the comments man do you", "2_Subreddit": "trees"}], "7vck1o": [{"0_Title": "New strain = Hawaiian OG X bubba X chemdog", "1_Text": "Fuck the comments man do you", "2_Subreddit": "trees"}], "7wjttw": [{"0_Title": "Just a reminder with tax return season on us", "1_Text": "Fuck the comments man do you", "2_Subreddit": "opiates"}]}]}]}