{"PineForest555": [{"0_comments": [{"dwii3q1": [{"0_Comment Submission": "Morphine/Statex 5mg tablet?", "1_Text": "No worries :)", "2_Subreddit": "opiates"}], "dwiiubb": [{"0_Comment Submission": "Man im barred out", "1_Text": "Sounds like you dont have too much of a tolerance and 2-3mg clonazepam has quite a punch for someone with no tolerance. \n\nDrinking on that is indeed quite risky. You probably wouldnt die but the risk is still there. You would however probably blackout and do some shite you'll have no memory of.\n\nOr if you're like me you'll just puke your guts out, Benzo's and alcohol just make me spew, Mixing the two has always ended terribly for me.", "2_Subreddit": "benzodiazepines"}], "dwivcn7": [{"0_Comment Submission": "Hard to get a clear image but this is the best I could do", "1_Text": "\"NK WZN 20\" Is famotidine 20mg, Also known as pepcid, Used to alleviate heartburn or acid reflux.\n\nThe green pill has a backwards abbott pharmaceuticals logo on it, kind of questionable", "2_Subreddit": "pillhead"}], "dwiwn9b": [{"0_Comment Submission": "Injavenq huge clonazolam problem.", "1_Text": "Yeah thats an unreal amount of clonazolam to be taking daily, Tapering with the clonazolam itself would probably be the best idea but take it slow and be careful.\n\nI imagine it would take a ridiculous amount of phenobarbital or librium to taper down a habit like this in a medical setting, Other anticonvulsants like phenytoin or pregabalin would probably have to be used aswell.\n\nIf your habit really is this severe, I wish you the best of luck in the future and hope that you can make it through this.", "2_Subreddit": "ResearchRecovery"}], "dwixp3q": [{"0_Comment Submission": "Man im barred out", "1_Text": "\"Not good answers here\" \n\nif you only wanted reinforcing input what was the point of posting this lol \n\nBut if doing \"crazy stupid stuff\" is what you're into, benzos + liquor can definitely assist you in doing just that.", "2_Subreddit": "benzodiazepines"}], "dwixw7x": [{"0_Comment Submission": "Girls on benzo? Clonazepam", "1_Text": "Lmao", "2_Subreddit": "benzodiazepines"}], "dwkpxen": [{"0_Comment Submission": "How deadly would Mixing anti depressants benz is and sleeping pills with alcohol", "1_Text": "Whatever you're planning on doing, dont do it. It gets better, I promise you.", "2_Subreddit": "askdrugs"}], "dwm5rw0": [{"0_Comment Submission": "How deadly would Mixing anti depressants benz is and sleeping pills with alcohol", "1_Text": "When I was growing up I thought the same thing, But it really does, It takes time.", "2_Subreddit": "askdrugs"}], "dwm6e8t": [{"0_Comment Submission": "Time to relax! God's Green Crack and some K-Pins", "1_Text": "canadian indeed", "2_Subreddit": "benzodiazepines"}], "dwnq0ce": [{"0_Comment Submission": "Opinions", "1_Text": "Lyrica works really well for me for w/d. Its gives a relaxing buzz but I dont find it all that addicting. Can be hard to come by though as its still a prescription drug", "2_Subreddit": "benzodiazepines"}], "dwrs1vb": [{"0_Comment Submission": "Snorting Valium 5mg?", "1_Text": "Just swallow it. More drug will absorb through the stomach than through nasal passages", "2_Subreddit": "benzodiazepines"}], "dwrs4be": [{"0_Comment Submission": "300mg Etizolam and 10mg Diazepam", "1_Text": "🇨🇦 represent", "2_Subreddit": "benzodiazepines"}], "dwrs8s7": [{"0_Comment Submission": "Snorting Valium 5mg?", "1_Text": "No problem, 30mg is a nice dose, Enjoy !", "2_Subreddit": "benzodiazepines"}], "dws2nx0": [{"0_Comment Submission": "Drugs you've bought on Ebay? (Discussion)", "1_Text": "Promethazine, Not really controlled though. I see codeine pills, prescription antidepressants, dapoxetine and other weird stuff quite often on there too. The codeine is tempting sometimes but its questionable if it will even arrive and its usually easier to get better stuff in person.", "2_Subreddit": "opiates"}], "dws2op2": [{"0_Comment Submission": "Anyone know what these red pills are?", "1_Text": "Coricidin / Dxm ?", "2_Subreddit": "opiates"}], "dwuf6ra": [{"0_Comment Submission": "Da cartel", "1_Text": "It got shut down, A bunch of other similar subs got closed too. Reddits been cracking down :(", "2_Subreddit": "benzodiazepines"}], "dwug84g": [{"0_Comment Submission": "Diazepam coming off", "1_Text": "Have you only been taking it once a week ? If so I cant imagine the withdrawal will be too bad at all. Might not even have any ill effects, besides some rebound anxiety or insomnia, maybe. \n\nI think youll be fine and shouldnt have a problem quitting this. And the propranolol could probably help out when needed.", "2_Subreddit": "benzodiazepines"}], "dwwc5pr": [{"0_Comment Submission": "Diazepam coming off", "1_Text": "From what you've told us theres zero chance you will have a seizure. Unless you have an underlying epilepsy condition or something like that.\n\nI know it can be hard to calm down with anxiety, I deal with it everyday. But you have to try and relax and think rationally. \n\nDiazepam has a pretty long half life too, Witch means to some degree its self-tapering and has a lower risk of causing severe withdrawal symptoms. \n\nDont get caught up in all the horror stories you read on here either", "2_Subreddit": "benzodiazepines"}], "dwwosbc": [{"0_Comment Submission": "Fake, telling stupid for buying these on the open market. 😣", "1_Text": "95% of bars on the street are pressed, And that one doesent even look too bad. Have you tried it to see if it hits yet?", "2_Subreddit": "benzodiazepines"}], "dwwtk98": [{"0_Comment Submission": "Fake, telling stupid for buying these on the open market. 😣", "1_Text": "Thats a bit of a waste... Good luck finding real bars these days unless you find someone trustworthy thats prescribed them. And ive never even heard of people putting melatonin in bars lmao.\n\nBut if you're not even willing to try them you probably have no need to be doing benzo's anyways, And using them recreationally is risky and very adddictive, so good on you for steering clear of that at least.", "2_Subreddit": "benzodiazepines"}], "dwwu1iy": [{"0_Comment Submission": "how to drop xan in prange juice help", "1_Text": "instructions not clear", "2_Subreddit": "ambien"}], "dwwutl8": [{"0_Comment Submission": "Fake, telling stupid for buying these on the open market. 😣", "1_Text": "Making the doctor appointment would definitely be a smart move in that situation, He might even give you just what you need, Never know until you try, And unless you act really feindish you arent going to get in any trouble for it. Just tell him exactly how you feel and dont ask for anything in particular, And be open to other options / medications. \n\nAnd I can understand not wanting to take something harmful, Especially with your kids around, Wouldnt want to put them through something like that. But thats just the way it is with street bars these days (It sucks, I know)\n\nIf you do however find some real alprazolam / xanax it will certainly be a very effective band aid for anxiety and problems, But its too easy to get used to not having anxiety, And thats what makes it so addictive, And once you're hooked, Itll just add onto all of lifes other struggles. The key is to use it only when its absolutely needed, Or occasionally to relax after a long day, This will take some willpower though.\n\nSorry for the wall of text, Been down the benzo road many times lol. I hope you can find some relief from your stress", "2_Subreddit": "benzodiazepines"}], "dwwv3zp": [{"0_Comment Submission": "Alternatives for alcohol", "1_Text": "Lyrica", "2_Subreddit": "askdrugs"}], "dwwvby5": [{"0_Comment Submission": "Fake, telling stupid for buying these on the open market. 😣", "1_Text": "No worries, And if weed helps you, then by all means stick to that 😁", "2_Subreddit": "benzodiazepines"}], "dwxmd8i": [{"0_Comment Submission": "Diazepam coming off", "1_Text": "Im glad that helped a bit, You will be ok I promise you that :) I have really bad anxiety and jump to conclusions like that quite often too so I know what its like.\n\nI also quit smoking cannabis about 2 months ago as well after a 3ish year daily habit, And that definitely caused some extra stomach pain and anxiety, So thats totally normal, passed after a week or two for me. After 2 months clean of smoking now and feeling worlds better", "2_Subreddit": "benzodiazepines"}]}], "1_submissions": [{"4b99b1": [{"0_Title": "Tried a pack of these for a change", "1_Text": "No worries :)", "2_Subreddit": "Cigarettes"}], "4c1ox7": [{"0_Title": "One of my go-to smokes", "1_Text": "No worries :)", "2_Subreddit": "Cigarettes"}], "4cyapi": [{"0_Title": "Amazing", "1_Text": "No worries :)", "2_Subreddit": "Cigarettes"}], "4r0a3f": [{"0_Title": "<3", "1_Text": "No worries :)", "2_Subreddit": "drugsarebeautiful"}], "4tdn9w": [{"0_Title": "Much luv from Canada", "1_Text": "No worries :)", "2_Subreddit": "Cigarettes"}], "4z45uj": [{"0_Title": "Tell me whats wrong here....", "1_Text": "No worries :)", "2_Subreddit": "Justrolledintotheshop"}], "58d8ei": [{"0_Title": "Nortriptyline", "1_Text": "No worries :)", "2_Subreddit": "askdrugs"}], "58tvev": [{"0_Title": "Nothing quite like it 👌🏻", "1_Text": "No worries :)", "2_Subreddit": "Cigarettes"}], "5e8qnx": [{"0_Title": "Got a half pack of these given to me and never seen them before, Identical filter and similar tase to Pyramid reds.", "1_Text": "No worries :)", "2_Subreddit": "Cigarettes"}], "5eu1bl": [{"0_Title": "Found in a box of circuit board components. Marked \"RCA\" \"6J5\". Similar size to a vaccuum tube but metal construction.", "1_Text": "No worries :)", "2_Subreddit": "whatisthisthing"}], "5hsob4": [{"0_Title": "Decided to get half-decent smokes for once, loving these", "1_Text": "No worries :)", "2_Subreddit": "Cigarettes"}], "5jzgsx": [{"0_Title": "Happy holidays all ✌🏻️ Picked these up as an early Christmas pack 🎄", "1_Text": "No worries :)", "2_Subreddit": "Cigarettes"}], "7ulr25": [{"0_Title": "Benzodiazepine lead structure in the background of Migos Motorsport music video, Anyone else notice this? 😂", "1_Text": "No worries :)", "2_Subreddit": "benzodiazepines"}], "852gm9": [{"0_Title": "The load", "1_Text": "No worries :)", "2_Subreddit": "DrugStashes"}], "8553xe": [{"0_Title": "Someone hung these all over my town last summer...", "1_Text": "No worries :)", "2_Subreddit": "spongebob"}]}]}]}