{"Blazing_blue_burrito": [{"0_comments": [{"dwlrlm8": [{"0_Comment Submission": "Seems legit...", "1_Text": "There's being an asshole, and then there's being a heartless, soulless bastard not worthy of the air they breath into their dejected husk of a body. You sir skipped that stage and have been condemned to hell because of it.", "2_Subreddit": "gaming"}], "dwlrp7l": [{"0_Comment Submission": "Seems legit...", "1_Text": "But, kvatch", "2_Subreddit": "gaming"}], "dwlrwxp": [{"0_Comment Submission": "Seems legit...", "1_Text": "Except they didn't plan on dealing with the awesome power of a dragonborn with a wabbajack!! All the sweetroll elves will be eaten on this glorious day!!", "2_Subreddit": "gaming"}], "dwlshoc": [{"0_Comment Submission": "Seems legit...", "1_Text": "God damn suicidal elves, need to keep their big dirty elf noses out of the affairs of men.", "2_Subreddit": "gaming"}], "dwltco8": [{"0_Comment Submission": "Seems legit...", "1_Text": "Not on PC hehe, if the game had a realistic economic system it would crash", "2_Subreddit": "gaming"}], "dwltpzj": [{"0_Comment Submission": "Seems legit...", "1_Text": "Golden diamond necklace for the win. Not gonna question how smithing gold necklaces lets me forge the bones of a dragon into armor and weapons. It just does.", "2_Subreddit": "gaming"}], "dwlw4i2": [{"0_Comment Submission": "Seems legit...", "1_Text": "Well my dad can beat your dad in a fight so I'm right loser", "2_Subreddit": "gaming"}], "dwlx5mq": [{"0_Comment Submission": "Seems legit...", "1_Text": "That's until you get addicted to the Reddit. It's so enticing with it's funny gifs and relatable tales of grandeur that entertain with their embarrassing and cringey conclusion. You begin to need the Reddit. Your attention span has been reduced for other things is non existent while your ability to last longer while pleasing yourself has grown vastly as you have discovered such specific niche fetishes that tantalize your brain with virtual scenery that can only be dreamed of achieving in life. Your family notices your growing reclusivity, once a cheery, positive individual, genuinely interested in others well being. That has been changed for the better, or so you think as reddit controls you now, you no longer have a name, merely a number.", "2_Subreddit": "gaming"}], "dwlxuyb": [{"0_Comment Submission": "Anatomy of a dope fiend (original artwork)", "1_Text": "It's cause they're made of dope and I've been breaking off chunks to get high. I don't wanna lose my legs but I need to get high. Anyone got a free wheelchair for a kind hearted soon to be leg less dope fiend? I got a dollar!", "2_Subreddit": "opiates"}], "dwly1vb": [{"0_Comment Submission": "Anatomy of a dope fiend (original artwork)", "1_Text": "In withdrawal my joints feel like they're made of glass, and need to be oiled up because some asshole replaced the grease with sand. Can't imagine being old and feeling like that all the time. Need to start growing fields of poppys in preparation for my old bones.", "2_Subreddit": "opiates"}], "dwlyeb5": [{"0_Comment Submission": "i’m fiending like a bitch rn", "1_Text": "Hell yeah it is, honestly requires some dedication just dealing with all the douchebag slow witted middles and dealers, then when it gets rough and you have to hustle it's like you've gone super saiyajunkie, and you think it's the last level. But then you get ripped off by some roach who thinks they can do whatever, and you discover super saiyajunkie 2...", "2_Subreddit": "opiates"}], "dwlyn63": [{"0_Comment Submission": "i’m fiending like a bitch rn", "1_Text": "No wonder everyone gets dope sick, we've got these little assholes inside of us. Well, time to do some home surgery.....", "2_Subreddit": "opiates"}], "dwlz42p": [{"0_Comment Submission": "Seems legit...", "1_Text": "Exactly, existential nihlism has been my veiw point on the world since I was a kid. Would be great to know that it's the true way of the universe.", "2_Subreddit": "gaming"}], "dwlz5bl": [{"0_Comment Submission": "Seems legit...", "1_Text": "Fake and gay. Should be screen shotted and posted on 4chan.", "2_Subreddit": "gaming"}], "dwm45s4": [{"0_Comment Submission": "Oxy got me laid last night", "1_Text": "It was lit af fam haha. I'm turning 22 on April 7th and the younger generation as well as some of my generation kind of annoyed me with their newfound lingo. Especially the word \"fam\", just don't like it for some reason.", "2_Subreddit": "opiates"}], "dwn8evr": [{"0_Comment Submission": "Two things: 1) Withdrawing while ill. 2) Vaping H from a bag.", "1_Text": "Why wouldn't you have the same control with snorting it? You can just do small bumps. And unless you have black tar or #3 which is from Europe, it's not gonna be good to try to vape it", "2_Subreddit": "opiates"}], "dwn8wqn": [{"0_Comment Submission": "Hydro5s", "1_Text": "Eat them. I shoot everything I can and I would never try to shoot hydro.", "2_Subreddit": "opiates"}], "dwn97xo": [{"0_Comment Submission": "Opiate induced Bad Moods", "1_Text": "Yea, I'm a daily user but still get it sometimes. It seems like only certain batches of h make me rage.", "2_Subreddit": "opiates"}], "dwn9fh2": [{"0_Comment Submission": "What do people call dope where you live?", "1_Text": "I just say dope. The most common slang by me is heron (no I) and blows when sold in bags. It's pretty obvious where I'm at.", "2_Subreddit": "opiates"}], "dwnngkv": [{"0_Comment Submission": "Policy Change regarding human consumption", "1_Text": "I'm all for a contingency plan if this goes south. Been coming to this subreddit for 5 years, albeit under different usernames and mostly a lurker but greatly enjoy the community here.", "2_Subreddit": "opiates"}], "dwsuidy": [{"0_Comment Submission": "LPT: If you ordered Mcdonald’s via Mcdelivery, add in an ice cream to ensure a fast delivery.", "1_Text": "There's no Whataburger in the Midwest...", "2_Subreddit": "LifeProTips"}], "dwsvwq2": [{"0_Comment Submission": "LPT: If you ordered Mcdonald’s via Mcdelivery, add in an ice cream to ensure a fast delivery.", "1_Text": "H-town? Where's that? I'm in North East Illinois.", "2_Subreddit": "LifeProTips"}], "dwt7gv2": [{"0_Comment Submission": "LPT: If you ordered Mcdonald’s via Mcdelivery, add in an ice cream to ensure a fast delivery.", "1_Text": "Lol nah screw that, too far south for me. Illinois summers already are too hot for me.", "2_Subreddit": "LifeProTips"}], "dwtc1gs": [{"0_Comment Submission": "The true cause of the opioid epidemic", "1_Text": "As a kid I used to watch my dad play it when he'd play ps1. I was good at THPS and Spyro, but Dragoon was a bit above my level at the time.", "2_Subreddit": "opiates"}], "dwtc8pa": [{"0_Comment Submission": "The true cause of the opioid epidemic", "1_Text": "As did many others. It's the perfect way to turn kids who are likely delinquents into junkies, making it even easier for the better well off kids to be successful with more opportunities since there's less competition.", "2_Subreddit": "opiates"}]}], "1_submissions": [{"7d0l87": [{"0_Title": "Fuck my life, got robbed and ran over", "1_Text": "There's being an asshole, and then there's being a heartless, soulless bastard not worthy of the air they breath into their dejected husk of a body. You sir skipped that stage and have been condemned to hell because of it.", "2_Subreddit": "opiates"}], "7hlm6r": [{"0_Title": "Will using a different charger damage my laptop?", "1_Text": "There's being an asshole, and then there's being a heartless, soulless bastard not worthy of the air they breath into their dejected husk of a body. You sir skipped that stage and have been condemned to hell because of it.", "2_Subreddit": "24hoursupport"}]}]}]}