{"billinsandiego": [{"0_comments": [{"dux304a": [{"0_Comment Submission": "Inside the secret lives of functioning heroin addicts", "1_Text": "The article and some of the comments below remind me of a story from Bill W when he makes a comparison to a \"heavy drinker\" and an \"alcoholic\".  IMO it is the same thing has  saying the difference between being straight, gay or bi-sexual. Is there really a problem with any sexual preference?  Or is it all in your mind?  Why do sober people that never have used heroin commit suicide?  \n\nMaybe being a functioning heroin addict is the right thing to be.", "2_Subreddit": "opiates"}], "dv6mzo1": [{"0_Comment Submission": "Let's Do This!", "1_Text": "I was an Army Ranger, during operation desert shield/storm.  I also participated in another conflict, but I don't want to DOX myself (because it did not last that long).  I am 49 years old.", "2_Subreddit": "opiates"}], "dv6n2i4": [{"0_Comment Submission": "Let's Do This!", "1_Text": "Because I have been in a few \"drug\" programs, I have met my fair number of HA.  They tell me that alcohol is a lot worst than H.", "2_Subreddit": "opiates"}], "dv6n7ro": [{"0_Comment Submission": "Let's Do This!", "1_Text": "Thanks for the advice!  I have been thinking about doing acid, however, again I really like to isolate and have a hard time trying to obtain it.  Actually, it seems as though the only conversations I have that I engage into are on the subreddit (first post, mostly read every day).  \n\nMy PTSD is very bad, I am unable to work.  I do not get violent, however, I \"act-out\" in other was to keep people away from me.", "2_Subreddit": "opiates"}], "dv6p16b": [{"0_Comment Submission": "Let's Do This!", "1_Text": "Is this okay?", "2_Subreddit": "opiates"}], "dv6qakt": [{"0_Comment Submission": "Let's Do This!", "1_Text": "I do not live in San Diego, it's just a place in my heart.", "2_Subreddit": "opiates"}], "dv6qyui": [{"0_Comment Submission": "Let's Do This!", "1_Text": "Yes I do receive compensation from the military.", "2_Subreddit": "opiates"}], "dv6vlm0": [{"0_Comment Submission": "Let's Do This!", "1_Text": "You are welcome!", "2_Subreddit": "opiates"}], "dv6vsf4": [{"0_Comment Submission": "Let's Do This!", "1_Text": "That's why I want to try H.  I mean alcohol is doing a number on my liver.  Consequently, I had yellow eyes from drinking so much.  I have been sober for almost a year, however this is not the first time I've been sober this long.  \n\nI still have nightmares, which makes it very hard to sleep.", "2_Subreddit": "opiates"}], "dv6vxiv": [{"0_Comment Submission": "Let's Do This!", "1_Text": "BTW For all of you H A complaining about OD, alcohol is by far slot worse!  If you don't ID on H, at least you die old.", "2_Subreddit": "opiates"}], "dv757vi": [{"0_Comment Submission": "Let's Do This!", "1_Text": "Trust me, this is not my first, merry go round, Meg.  I don't have any felonies, for that matter, I have never been arrested.  I have a Master's degree in a technical field.  \n\nSo I can talk to people, because I was paid to do that very thing (don't want to Dox myself).  \n\nIDK, money will not be a problem because I am 100 percent disabled.  I was thinking about going to a country where H is legal and hire a \"doctor\".", "2_Subreddit": "opiates"}], "dv8lljb": [{"0_Comment Submission": "Let's Do This!", "1_Text": "Thanks Meg!", "2_Subreddit": "opiates"}], "dv8lnr5": [{"0_Comment Submission": "Let's Do This!", "1_Text": "That not good news.  I scare everyone at my homeless shelter at night with my nightmares.  I hate to see them get worse.", "2_Subreddit": "opiates"}], "dwt7vpx": [{"0_Comment Submission": "We are better than this!", "1_Text": "How much would it cost to use a seedy hotel for a day?  The husband holding the kid while opening the door is a nut job!  What happens if a \"John\" has a gun?", "2_Subreddit": "opiates"}], "dwx35if": [{"0_Comment Submission": "Anyone ever think about going on a drug holiday in SE Asia?", "1_Text": "I basically did the same thing you are planning.  So here's my experience teaching online in SE Asia:\n\nGet approval from your employer prior to leaving.  Your employer will say no because of the tax code.  Moreover, the country you want to \"vacation\" thinks like Trump (we can have a citizen do your job).\n\nSecond, from my experience locals don't trust foreigners for the same reason  WE don't (snitch factor).  Locals doing drugs have a family to worry about (snitching).  Whereas, a foreigner, well is a foreigner.  If you go around asking for drugs, you will be set up, unless you are married with your wife/husband (from that country).  LE will love to perform a undercover buy in order to take ALL of your money.\n\nThird, there's a 12 hour time difference in SE Asia.  This means that 9am here us 9pm over there (the next day).  \n\nSo what happened to me?  I did not ask my employer and felt I could get away with it.  While in SE Asia, I met a person that saved me from #2 because I am not white (a whole different problem in your case).  This person not only gave me the run down on illegal drugs, he provided a few examples (read expat blogs from the SE Asia country you plan to visit).  \n\nTherefore (because I am an alcoholic),. I made the decision to \"work\" at a bar because I could enjoy the nightlife (see #3). \n\nWell. . . I am now in rehab here in the US.", "2_Subreddit": "opiates"}]}], "1_submissions": [{"820uus": [{"0_Title": "Let's Do This!", "1_Text": "The article and some of the comments below remind me of a story from Bill W when he makes a comparison to a \"heavy drinker\" and an \"alcoholic\".  IMO it is the same thing has  saying the difference between being straight, gay or bi-sexual. Is there really a problem with any sexual preference?  Or is it all in your mind?  Why do sober people that never have used heroin commit suicide?  \n\nMaybe being a functioning heroin addict is the right thing to be.", "2_Subreddit": "opiates"}], "89rxga": [{"0_Title": "We are better than this!", "1_Text": "The article and some of the comments below remind me of a story from Bill W when he makes a comparison to a \"heavy drinker\" and an \"alcoholic\".  IMO it is the same thing has  saying the difference between being straight, gay or bi-sexual. Is there really a problem with any sexual preference?  Or is it all in your mind?  Why do sober people that never have used heroin commit suicide?  \n\nMaybe being a functioning heroin addict is the right thing to be.", "2_Subreddit": "opiates"}], "8abovj": [{"0_Title": "My plug drives a bus.", "1_Text": "The article and some of the comments below remind me of a story from Bill W when he makes a comparison to a \"heavy drinker\" and an \"alcoholic\".  IMO it is the same thing has  saying the difference between being straight, gay or bi-sexual. Is there really a problem with any sexual preference?  Or is it all in your mind?  Why do sober people that never have used heroin commit suicide?  \n\nMaybe being a functioning heroin addict is the right thing to be.", "2_Subreddit": "opiates"}]}]}]}