{"internetguy789": [{"0_comments": [{"dv9a3ki": [{"0_Comment Submission": "Buying a netflix account related question", "1_Text": "Wow this racked my brain. Personally I would change it", "2_Subreddit": "DarkNetMarketsNoobs"}], "dv9a7ep": [{"0_Comment Submission": "If you were rich, what extremely petty thing would you do just to piss off people?", "1_Text": "This is buried but who gives a shit. If I had bill gates money I would walk back into my high school and offer the meanest teacher there (me.reed) 5 million to let me shit in her mouth in front of the whole school. If that wasn’t enough i would give her 50 million.  Then laugh because she is still poor compared to me and because she is eating shit in front of me", "2_Subreddit": "AskReddit"}], "dv9wnsz": [{"0_Comment Submission": "If you were rich, what extremely petty thing would you do just to piss off people?", "1_Text": "Me shitting in someone’s mouth, even just once, is worth it lmao.", "2_Subreddit": "AskReddit"}], "dv9wozj": [{"0_Comment Submission": "Buying a netflix account related question", "1_Text": "Do you think it was recovered?", "2_Subreddit": "DarkNetMarketsNoobs"}], "dvf8csz": [{"0_Comment Submission": "Guy goes on Dragon's Den to sell a pyramid scheme", "1_Text": "Lmao. Dude went to his tailor and said make me look less suspicious and his tailor was still waiting on his return. 😂", "2_Subreddit": "videos"}], "dvrbw5g": [{"0_Comment Submission": "*starts shaking violently*", "1_Text": "Only watch dbz and Naruto so this was extremely informative. Honestly some r/bestof shit. Thanks for explaining.", "2_Subreddit": "cringepics"}], "dvwcgpv": [{"0_Comment Submission": "To all WPD subscribers.", "1_Text": "Because we all going in the same dirt at the end of our trip", "2_Subreddit": "watchpeopledie"}], "dvzea5i": [{"0_Comment Submission": "Willing to pay someone to make orders from me regularly", "1_Text": "This is sourcing and should be removed. Sorry homie", "2_Subreddit": "DarkNetMarketsNoobs"}], "dwe0im8": [{"0_Comment Submission": "Character design with Mr. Ubi", "1_Text": "I like that he's excited about cargos. They are very operator", "2_Subreddit": "Rainbow6"}], "dwfm1tb": [{"0_Comment Submission": "Why do I have such shitty luck with Adderall?", "1_Text": "Too make a long story short, when I was in 11th grade I found my mom's xanax and wanted a script because it legit helped me and I thought it was cool. Tell my mom im depressed and that I wanted to go to a psychiatrist. We go in and without even telling him all of the symptoms I had researched he gave me a mental wellness form. I filled it out with some cranked answers, he looked at about 100 answers in 15 seconds and gave me a script for Adderall all in about 25 minutes. \n\nI was shocked by how easy it was and now that I'm older I'm greatful for the script and scared some doctor's mil it out so regularly to devoloping children.", "2_Subreddit": "DarkNetMarketsNoobs"}], "dwfmtm9": [{"0_Comment Submission": "Why do I have such shitty luck with Adderall?", "1_Text": "Wanna trade Drs? Lmao maybe they know what we were trying to get", "2_Subreddit": "DarkNetMarketsNoobs"}], "dwgo14m": [{"0_Comment Submission": "My brother found this masterpiece at his school", "1_Text": "This is perfect blotter art work honestly", "2_Subreddit": "BikiniBottomTwitter"}], "dwih3fq": [{"0_Comment Submission": "How do bitcoin mixers/tumblers work? Where do mixer fees go?", "1_Text": "TL;dR: coin mixing is no longer safe, it is a waste of crypto, use monero\n\nBitcoin was never designed to be anonymous. The addresses of all transactions are recorded in the ledger. \n\nLet's say Uncle Internetguy wants to order some primo LSD or BTH off the darknet. If I purchase Bitcoin then chances are (because it's the easiest way) I will use something like coin base to turn my national currency into Bitcoin. Well most governments require some sort of ID to purchase BTC through a vendor, they also need a bitcoin wallet to send it to. \n\nI order the good and get them; hooray! Now let's say the vendor got busted and they looked through his clients. Through the power of block chain analysis algorithms they are able to link the address that sent the vendor btc to all of the addresses that were used to \"tumble\" the coin, which started with my credit card linked account on coin base. While this creates deniability it does not prevent LE from coming and knocking on the door of the first person to procure the coin.\n\nThese algorithms were at one point thought to be impracticle for reasons such as: the length of the block chain, the independence of accounts(maybe I paid someone to move a couch and he used my old btc to buy drugs, and the fact that there is vastly high ceiling on the number of wallets that can be created. \n\nOur brightest minds in the NSA, CIA, and academics realized that most people only tumbled once or twice before sending to a wallet they would use for illegal activity. They also noticed that the amounts we're almost always the same with a deviation of common mixing fees (they are proportional to the amount of coin being mixed). This and the slow verification rate of the block chain (think how long it takes to get BTC, or rather how long it took in last December) led some people to creating efficient algorithms that can make a mapping of the accounts that transfer crypto to one another. It may not be 💯% effective at solving the crime but these algs can make a clear link between hundreds of accounts just by walking through the BTC ledger and recording the accounts as they are created. If they have a target address then it's even easier to track.\n\nThere are multiple \"secure/private\" currencies but the most practical, stable, and widely accepted is Monero(XMR). It uses ring structures in combination with an RSA like algorithm to keep the sender and receiver isolated from one another. This creates many extra steps in tracking transaction history. There are many problems with monero such as a poorly designed GUI and less support that btc. Some people believe that mixing monero is effective but this is a tricky problem. The factors of the ring can be determined from the end of each block in the block chain.\n\nAlways try to buy cryto with cash and secure messaging. \n\n\nThis being said a little headache setting everything up is worth your freedom the only way to never get caught by the law is to never break the law.", "2_Subreddit": "DarkNetMarketsNoobs"}], "dwihko5": [{"0_Comment Submission": "Gamers of Reddit, What video game made you emotional?", "1_Text": "The death of Brooklyn in CoD: Big Red 1", "2_Subreddit": "AskReddit"}], "dwinr0b": [{"0_Comment Submission": "Good Vibes", "1_Text": "I've actually been off the oxy for a minute so 5 has me nodding stupid hard. The coke is for when my little bro and I need a pubg win this weekend lmao", "2_Subreddit": "opiates"}], "dwioozo": [{"0_Comment Submission": "How do bitcoin mixers/tumblers work? Where do mixer fees go?", "1_Text": "There's nothing wrong with it. Let's say you get popped by LE. Your lawyer can say that you paid for something via Bitcoin and that other unknown person used it to buy drugs.\n\nBy mixing coin you are creating something called probable deniability. Its to further the burden of evidence on the prosecution. If you are gonna use btc then I would still tumble. Also send from cb-> new wallet/tumbler-> tails electrum wallet -> market", "2_Subreddit": "DarkNetMarketsNoobs"}], "dwioqka": [{"0_Comment Submission": "Goddamn I miss this combo.", "1_Text": "Lucky bastard. Enjoy !", "2_Subreddit": "opiates"}], "dwip7ev": [{"0_Comment Submission": "How do bitcoin mixers/tumblers work? Where do mixer fees go?", "1_Text": "Exactly. It's mainly for money laundering with very large sums of money. But it is still possible.", "2_Subreddit": "DarkNetMarketsNoobs"}], "dwipawh": [{"0_Comment Submission": "Is this a meme page now or", "1_Text": "Make a /r/mortytown version of opiates. This sub could be for stories and dope porn while the other one could be funny shit posting, memes, and junky antics.", "2_Subreddit": "opiates"}], "dwir6ef": [{"0_Comment Submission": "Ways to get btc/monero currently since btc drop", "1_Text": "This is your best bet! In December I had used doge coin to monero lmao", "2_Subreddit": "DarkNetMarketsNoobs"}], "dwitv3l": [{"0_Comment Submission": "Military sim", "1_Text": "True American hero", "2_Subreddit": "FunnyandSad"}], "dwlhjz0": [{"0_Comment Submission": "Ways to get btc/monero currently since btc drop", "1_Text": "I would agree but ya never know which way any crypto is gonna go. Thanks for sharing!", "2_Subreddit": "DarkNetMarketsNoobs"}], "dwmuly0": [{"0_Comment Submission": "the progress pic to end all progress pics", "1_Text": "No Rick from pawnstars?", "2_Subreddit": "pics"}], "dwnpgrk": [{"0_Comment Submission": "Easter colors !!! 😂 60mg Oxy in the blue, 90mg Morphine in the pink.... Happy Easter Nods my friends 🤙🏻", "1_Text": "And we come full circle to blue light posts from when I was in middle school trying to figure out if I could trip off benadryl", "2_Subreddit": "opiates"}], "dwtora7": [{"0_Comment Submission": "Bandit Buff", "1_Text": "I like to think of it as a shit post ;)", "2_Subreddit": "Rainbow6"}]}], "1_submissions": [{"2amkc9": [{"0_Title": "Gene The Southern Child + Parallel Thought -- Smackman", "1_Text": "Wow this racked my brain. Personally I would change it", "2_Subreddit": "hiphopheads"}], "3b8wdn": [{"0_Title": "Reddit, in your opinion, what is the worst way to die?", "1_Text": "Wow this racked my brain. Personally I would change it", "2_Subreddit": "AskReddit"}], "65hiy4": [{"0_Title": "Bropiates how do you guys feel about tramadol?", "1_Text": "Wow this racked my brain. Personally I would change it", "2_Subreddit": "opiates"}], "65nxmu": [{"0_Title": "Is there a strictly NSFW opiate or needle/shooting themed sub?", "1_Text": "Wow this racked my brain. Personally I would change it", "2_Subreddit": "opiates"}], "677fxx": [{"0_Title": "OG Stash Spot", "1_Text": "Wow this racked my brain. Personally I would change it", "2_Subreddit": "opiates"}], "6cla29": [{"0_Title": "Mid-West Xanax with possible fent", "1_Text": "Wow this racked my brain. Personally I would change it", "2_Subreddit": "opiates"}], "6tglt0": [{"0_Title": "Disappointed by this sub", "1_Text": "Wow this racked my brain. Personally I would change it", "2_Subreddit": "LateStageCapitalism"}], "7dxvzv": [{"0_Title": "What drugs do you guys do? Also I love this sub!", "1_Text": "Wow this racked my brain. Personally I would change it", "2_Subreddit": "opiates"}], "7e1rna": [{"0_Title": "Will you spank her?", "1_Text": "Wow this racked my brain. Personally I would change it", "2_Subreddit": "ass"}], "7e1s34": [{"0_Title": "Big and soft", "1_Text": "Wow this racked my brain. Personally I would change it", "2_Subreddit": "Boobies"}], "7f1i7s": [{"0_Title": "Happy Thanksgiving to everybody here who celebrates it! What are you guys thankful for?", "1_Text": "Wow this racked my brain. Personally I would change it", "2_Subreddit": "opiates"}], "7lfw80": [{"0_Title": "[question]Avoiding congested networks and shape shifting", "1_Text": "Wow this racked my brain. Personally I would change it", "2_Subreddit": "Monero"}], "7o8r14": [{"0_Title": "I was actually sick I swear!", "1_Text": "Wow this racked my brain. Personally I would change it", "2_Subreddit": "opiates"}], "7o8xyi": [{"0_Title": "Why does my PS4 remote lose charge while it is active while my tv remote does?", "1_Text": "Wow this racked my brain. Personally I would change it", "2_Subreddit": "NoStupidQuestions"}], "7olg1r": [{"0_Title": "[QUESTION]Problems with Monero GUI", "1_Text": "Wow this racked my brain. Personally I would change it", "2_Subreddit": "Monero"}], "7omzuo": [{"0_Title": "What have you guys been listening too?", "1_Text": "Wow this racked my brain. Personally I would change it", "2_Subreddit": "opiates"}], "8884k5": [{"0_Title": "Good Vibes", "1_Text": "Wow this racked my brain. Personally I would change it", "2_Subreddit": "opiates"}], "88eyg2": [{"0_Title": "Cheers to you drunkards", "1_Text": "Wow this racked my brain. Personally I would change it", "2_Subreddit": "drunk"}], "89u1oh": [{"0_Title": "Bandit Buff", "1_Text": "Wow this racked my brain. Personally I would change it", "2_Subreddit": "Rainbow6"}]}]}]}