{"Gregpyo": [{"0_comments": [{"d8ojcnf": [{"0_Comment Submission": "Zika virus", "1_Text": "Ayyy I'm from the 860. Bout time I seen someone close by", "2_Subreddit": "opiates"}], "d8qid8r": [{"0_Comment Submission": "Used dog urine for UA, passed but showed positive for Subs? Lol?", "1_Text": "I can say with 100% certainty that the dog could not have ingested any Subs lol. Must have just been a false positive. I thought it was so great because not only did it allow me to pass but also I needed subs to show up for full authenticity and miraculously they did. Lol.", "2_Subreddit": "opiates"}], "d8qxtsr": [{"0_Comment Submission": "Used dog urine for UA, passed but showed positive for Subs? Lol?", "1_Text": "It's a male dog, St. Bernard / Burmese mountain dog cross. When it pees all I have to do is put the cup under. As simple as possible really. Didn't have to do any funny business or anything questionable/violating lmao", "2_Subreddit": "opiates"}], "d8rbwfd": [{"0_Comment Submission": "Used dog urine for UA, passed but showed positive for Subs? Lol?", "1_Text": "Why would anyone dose a dog w sub intentionally? Probably very difficult too. In any case I would have hoped you guys would give me the benefit of the doubt and maybe Occam's razor too. The sub showing up being a result of a false positive? Lol", "2_Subreddit": "opiates"}], "d8wimot": [{"0_Comment Submission": "CT fent bags. Be careful, avoid if you see.", "1_Text": "Awesome a fellow CTer. I had gotten fent ones a while ago that were Snow White with an Uncle Sam stencil stamp, this was at the highest point in my use so 1-2 bags just got me nice n high. But I gave my boy just one (very low tolerance so he was excited). Did the bag in one line , within 3 minutes he's out not breathing. I posted about the event and how jarring it was actually when it happened, few months ago.", "2_Subreddit": "opiates"}], "d8yap9y": [{"0_Comment Submission": "When patience pays off (sorry for weird angle, only front side camera works) combo of k9s and A215s", "1_Text": "By chance are you talking about Vernon, CT? Asking because I live in ct and I know this sounds dumb but for some reason I always get that excited \"no way you too?\" Feeling.", "2_Subreddit": "opiates"}], "d9c11qy": [{"0_Comment Submission": "Happy Friday everyone!", "1_Text": "Those are proper fat , niceee", "2_Subreddit": "opiates"}], "ddxv7hy": [{"0_Comment Submission": "It's high time to get high!", "1_Text": "Are you from CT? I get those exact bags more often then any other. I know it's not like they're only available here but just curious.", "2_Subreddit": "opiates"}], "ddyfn11": [{"0_Comment Submission": "•Connecticut-February", "1_Text": "860 hmu please m8s!", "2_Subreddit": "Stimsrollcall"}], "dwt8n38": [{"0_Comment Submission": "Did Anyone Get Their Tax Refund Money yet? I did at 4 Am. At 4:05 i called the dboy. Didnt spend a lot, trying to cut down and save $", "1_Text": "I fucking love hard more than the smack , the soft, or anything else really. Especially since I've started to shoot it.. yeesh is all I can think to say.... I used to think shooting coke was as good as it got, the proverbial Pandora's abox of pure unadulterated bliss, a feeling that actually makes you stop and think for a second.. were mere mortals supposed to experience this.. this... Feeling of unfathomable euphoria.\n\nForgive me, but it's a feeling just short of beyond description. However, in being so close to inexplicable the feeling sometimes escapes definition by me. If i have it setup so as to get some hard w my boy when picking up; the hard is the only thing on my mind. even if I'm kinda sick. And on the rare occasion that there is no hard (they wait till we're face to face and innocently tell me whatever shpeil they've come up with) it comes dangerously close to ruining the whole day... Which results in me doing a mega shot to compensate for the disappointment yada yada yada.\n\nTimes especially like those make me wish I didn't need to buy the smack so I could buy more base... Alas I know better, for I need the boy to come down from the hard. at least a small bit for when I inevitably run outta the rock otherwise I will go insane. \n\nMy buddy will turn into a straight up carpet farming, shadow person seeing, incapable of answering/saying a word to you crack head. I on the other hand remain calm and collected (UNLESS I don't have dope and no way of getting any), then I go straight up Mr. Hyde like my boy lol.", "2_Subreddit": "opiates"}], "dwt8sdm": [{"0_Comment Submission": "Did Anyone Get Their Tax Refund Money yet? I did at 4 Am. At 4:05 i called the dboy. Didnt spend a lot, trying to cut down and save $", "1_Text": "Holy shit, sorry for the novel of a comment. Ive been shooting that wonderful rock if it wasn't obvious. There was some kind of point to it though, sadly I've forgotten .. the world will never know.", "2_Subreddit": "opiates"}], "dwtayju": [{"0_Comment Submission": "Oh boy... I've seriously done it now...", "1_Text": "Well surprise surprise! He calls my dad instead, who works about 5 minutes or so away. It gets better, apparently after shooting a nice bell ringer of some rock and a good shot of dope I just no fucks given left the resultant mess of bags and all manner of other paraphernalia all over the bathroom counter and floor etc", "2_Subreddit": "opiates"}], "dwtbp6i": [{"0_Comment Submission": "Oh boy... I've seriously done it now...", "1_Text": "So my father ends up calling the ambulance because I'm still not fully there if you know what I mean. It takes a good 20 min or so at least before you fully recover your mental faculties. I get wicked pissed about this because... Well fuck all that noise.\n\nI'm also mad because I had a good amount of crack left but being the retarded I am, left it sitting on the bathroom counter I presume. Needless to say that's a lost cause. Anyway, I run for it. Give up. Cops just talk to me, somehow can't arrest me. Basically left with a Sophie's Choice and have to take ye olde amberlamps ride of shame. Oh yeah I somehow snuck a crack pipe in my back pocket after being searched pretty well at least twice. And almost managed to save my 4 remaining bags of dope, but the stupid cop said I should take off my jacket before I lay on the gurney thing. I crossed my fingers but as I took it off the bags that I had up my sleeve sadly took a tumble into the cold , undeserving hands of officer friendly. \n\nSkip to now. Went on a bender after AMA from hospital before they finished running all these tests to see if I have endocarditis or something similar. Took the keys to my truck and a couple things to pawn and here I am now. Probation officer is probably pissed, parents are definitely pissed and almost certainly scared/worried. \n\nI just had almost 5 months sober but relapsed on New year's day this year.... Like what the fuck man now look at me, right back to square one except now with added bonus of potential jail time baby! Idk what I'm looking for here, but if by some miracle you made it this far thank you so much for reading and please give me some advice or just chat.me up.", "2_Subreddit": "opiates"}]}], "1_submissions": [{"57b78r": [{"0_Title": "Used dog urine for UA, passed but showed positive for Subs? Lol?", "1_Text": "Ayyy I'm from the 860. Bout time I seen someone close by", "2_Subreddit": "opiates"}], "89t3go": [{"0_Title": "Oh boy... I've seriously done it now...", "1_Text": "Ayyy I'm from the 860. Bout time I seen someone close by", "2_Subreddit": "opiates"}]}]}]}