{"GreatNebulaInOrion": [{"0_comments": [{"dwe5e6n": [{"0_Comment Submission": "What's your favorite low-tech solution to a high-tech problem?", "1_Text": "IE was always different and weird but IE6 took it to another level, you pretty much needed to develop everything once normally and then once for IE6.", "2_Subreddit": "AskReddit"}], "dwfnu71": [{"0_Comment Submission": "Should we ban marijuana drug testing in the workplace?", "1_Text": "I have coded well on every substance under the sun. Really the only one that was bad is when you are fucking blacked out drunk. I have coded while high af on shrooms and the text was morphing and shifting around on the screen.", "2_Subreddit": "politics"}], "dwink80": [{"0_Comment Submission": "Adderrall and Withdrawals", "1_Text": "I used to take vyvanse at the tail end of withdrawals.  If your dependency is smallish it will basically cut the wd.  Basically, when you feel down and low energy, you will immediately feel fine.  And once the vyvanse worse off I would generally be okay. So ya it works.\n\nHowever taking it deep in WD is not going to be fun.  It is something you can take in the tail end.  It is going to amplify a lot of the worst physical WD symptoms.", "2_Subreddit": "quittingkratom"}], "dwjkj3s": [{"0_Comment Submission": "In an extremely tough spot, any help is extremely appreciated", "1_Text": "Suboxone is very likely to be an amazing short term anti-depressant. First most opioids are very good at fixing depression in the short term, but tend to leave you in a worse spot long term. However, suboxone also is a kappa antagonist. Selective kappa antagonists are being developed as anti-depressants.", "2_Subreddit": "quittingkratom"}], "dwk24h7": [{"0_Comment Submission": "Day 24 CT Update", "1_Text": "Naltrexone can cause insomnia.", "2_Subreddit": "quittingkratom"}], "dwk3e1j": [{"0_Comment Submission": "Am I back at square one ?", "1_Text": "It really depends on how much you used. If you used once per day, let it wear off then redosed then you could be okay-ish. However, I doubt that since otherwise you would likely already know the answer. 2 solid use days is enough to reinstate mild WDs, so 6 days is pretty much a guarantee.", "2_Subreddit": "quittingkratom"}], "dwk3h94": [{"0_Comment Submission": "Day 24 CT Update", "1_Text": "Ya, I found it lessened especially on the downward trend in concentration.", "2_Subreddit": "quittingkratom"}], "dwk8wa3": [{"0_Comment Submission": "I'm a forensic toxicology researcher investigating kratom", "1_Text": "It is mostly from respiratory depression I would imagine, since O-DSMT is an actual real full-agonist opioid drug. It is weirdly legal since it is an analogue of tramadol which is Schedule IV and the analogue act doesn't apply to that.  Arguably, tramadol only works as a pro-drug for O-DSMT, kind of like codeine and morphine.", "2_Subreddit": "kratom"}], "dwk8ysj": [{"0_Comment Submission": "I'm a forensic toxicology researcher investigating kratom", "1_Text": "https://en.wikipedia.org/wiki/Myoclonus ?", "2_Subreddit": "kratom"}], "dwkav80": [{"0_Comment Submission": "Any reason I'm not experiencing withdrawals?", "1_Text": "He is referencing O-desmethyltramadol which is legal but stupid to put in since people can die and then you go to jail.", "2_Subreddit": "quittingkratom"}], "dwkfhah": [{"0_Comment Submission": "Man dies from too much lope", "1_Text": "It is because lope is actually crazy powerful. It was designed by the same company who designed fentanyl while they were fucking around looking for other drugs. You just have to take enough for it to start passing the BBB. The high is very uneuphoric, it is like fent in that you have to take a lot to feel anything, but you are actually high during that time. It is best to think of it as a fentanyl methadone(in terms of length of action). I am pretty sure loperamide has a stronger binding affinity than morphine, so it is just going to block it.  It may be the worst opioid to come off. It has a biphasic half life and it can take weeks to come off. Read the mad Margaret blog for more info.", "2_Subreddit": "opiates"}], "dwlp1jn": [{"0_Comment Submission": "First time poster. Im begging for some advice/insight.", "1_Text": "You need to switch to subs like asap. Lope arguably has one of i not the worst withdrawal of all opioids. It has an incredible half life (it is biphasic with one following normal half life and then one long drawn out one).  It is also crazy strong. \n\nI would almost argue the cost benefit of going on subs early and risking precipitated withdrawal is probably worth it to you. \n\nLet's not mince words here, you will likely die if you continue. In the name of immediate harm reduction go get on subs asap.", "2_Subreddit": "OpiatesRecovery"}], "dwlpned": [{"0_Comment Submission": "First time poster. Im begging for some advice/insight.", "1_Text": "Good point on probably avoiding methadone.", "2_Subreddit": "OpiatesRecovery"}], "dwqqdii": [{"0_Comment Submission": "Quick vent about how /kratom subreddit drives me crazy", "1_Text": "Why do you say that?", "2_Subreddit": "quittingkratom"}], "dwqutnj": [{"0_Comment Submission": "Kratom Withdrawal", "1_Text": "Zofran", "2_Subreddit": "quittingkratom"}], "dwqv707": [{"0_Comment Submission": "Boyfriend just came clean. Next steps?", "1_Text": "He can go to rehab under FMLA and if his job has short term disability he can actually be paid during that time. The whole thing is covered via HIPPA so no one put his doctor and an HR rep needs to know anything. He can basically get 3 months to heal.", "2_Subreddit": "OpiatesRecovery"}], "dwrznwq": [{"0_Comment Submission": "Mentally, I just cannot handle withdrawal or sobriety...", "1_Text": "I assume you are talking about tia. Anyway, I would seriously consider medically assisted treatment. I would at least think about suboxone or vivitrol.   You may find subs easier to quit given a slow taper.", "2_Subreddit": "OpiatesRecovery"}], "dwvl4t2": [{"0_Comment Submission": "Naltrexone", "1_Text": "Unlikely. You may be able to feel something but it will be strongly blunted.", "2_Subreddit": "opiates"}], "dwxhiic": [{"0_Comment Submission": "What is the most geographically diverse state?", "1_Text": "Washington is very unique geographically. The West side has temperate rainforests. We have the cascades with multiple volcanos and also the huge volcano of Mt. Rainer. The east side is basically a desert and has a real river, the Columbia. The east side is also unique in the world because of the scablands. This is the fact that the land is carved from the great ice age floods which swept through the region. It has a huge dry waterfall, which would have been one of the largest waterfalls in the world. It also sits on 3 separate plates. One is very old and comes up from the tropics and has very old rock. There is also a huge amount of basalt floods, due to the trap volcanos from like 10ish million years ago. Some parts are under multiple miles of basalt. \n\nThere is more but Washington is very interesting geographically.", "2_Subreddit": "AskAnAmerican"}], "dwxst38": [{"0_Comment Submission": "Teen turns down plea deal for 25 years in prison, gets 65 years instead", "1_Text": "Yep, that mistake is definitely worth his whole life in prison and also worth our taxpayer money to punish him.  Also, laughing is a defense mechanism. Just because he doesn't show proper decorum doesn't mean he should be punished more (or less).", "2_Subreddit": "news"}], "dwy048t": [{"0_Comment Submission": "Teen turns down plea deal for 25 years in prison, gets 65 years instead", "1_Text": "So no chance for redemption or rehabilitation? Also, you are willing to lock someone up for life after a short video clip?", "2_Subreddit": "news"}], "dwy1qmo": [{"0_Comment Submission": "LAOP thinks other subreddit will agree with him that r/legaladvice doesn't know what they are talking about. (from r/kratom)", "1_Text": "Ya it is a sign of dilution. Creatine is often used as a control that it is not diluted. Hence people will take a shit ton to make sure even when diluted, it is still in range. The niacin thing I think is just a myth where people think it helps them flush things out quicker. Normally people use b vitamins to color their diluted pee yellow.", "2_Subreddit": "bestoflegaladvice"}], "dwy1zrf": [{"0_Comment Submission": "LAOP thinks other subreddit will agree with him that r/legaladvice doesn't know what they are talking about. (from r/kratom)", "1_Text": "Kratom, specifically mitragynine has biased agonism of the mu opioid recptor. This means it can activate the euphoric and anesthetic properties with little respiratory depression. It is also a partial agonist. It may be actually impossible to overdose if not adulterated with things like o-desmethyltramadol.", "2_Subreddit": "bestoflegaladvice"}], "dwy2d2w": [{"0_Comment Submission": "Teen turns down plea deal for 25 years in prison, gets 65 years instead", "1_Text": "Why not just kill him then if he is beyond hope? I honestly don't give a shit what he did, I believe people deserve the possibility of rehabilitation or redemption. Just because he isnt ready to humble himself in front of the court doesn't mean he won't be able to feel remorse later.  There is no justice in \"an eye for an eye\" type punishments.", "2_Subreddit": "news"}], "dwy46wy": [{"0_Comment Submission": "I have never done any opiates. I've been browsing this sub for ~2 hours now.", "1_Text": "Most people who like opiates don't get tired or foggy from them. They act like psychostimulants. It is similar thing for alcohol. It means you have a strong dopamingeric  response to them.", "2_Subreddit": "opiates"}]}], "1_submissions": [{"7caopm": [{"0_Title": "Day 7 clean and Day 12 after start of rapid taper after 70g habit. Feeling 95%", "1_Text": "IE was always different and weird but IE6 took it to another level, you pretty much needed to develop everything once normally and then once for IE6.", "2_Subreddit": "quittingkratom"}], "7ce84i": [{"0_Title": "Does naltrexone make anyone else feel weird?", "1_Text": "IE was always different and weird but IE6 took it to another level, you pretty much needed to develop everything once normally and then once for IE6.", "2_Subreddit": "OpiatesRecovery"}], "7d9dho": [{"0_Title": "Scientific studies should be crowd sourced", "1_Text": "IE was always different and weird but IE6 took it to another level, you pretty much needed to develop everything once normally and then once for IE6.", "2_Subreddit": "kratom"}], "7gsy07": [{"0_Title": "Another report that Kratom seems to be a good opiate maintenance med", "1_Text": "IE was always different and weird but IE6 took it to another level, you pretty much needed to develop everything once normally and then once for IE6.", "2_Subreddit": "kratom"}], "7j7x7a": [{"0_Title": "Vivitrol side effects", "1_Text": "IE was always different and weird but IE6 took it to another level, you pretty much needed to develop everything once normally and then once for IE6.", "2_Subreddit": "OpiatesRecovery"}], "88fcdy": [{"0_Title": "Kappa Opioid Receptor and you", "1_Text": "IE was always different and weird but IE6 took it to another level, you pretty much needed to develop everything once normally and then once for IE6.", "2_Subreddit": "quittingkratom"}], "88hibj": [{"0_Title": "Found this on the alcoholic sub", "1_Text": "IE was always different and weird but IE6 took it to another level, you pretty much needed to develop everything once normally and then once for IE6.", "2_Subreddit": "opiates"}]}]}]}