{"CrookedWatermelon": [{"0_comments": [{"duwkfiq": [{"0_Comment Submission": "Men with higher levels of testosterone tend to devote more energy to keeping their romantic partners faithful and in a relationship with them. The study, published in the journal Physiology & Behavior, examined what is known as mate retention behavior.", "1_Text": "Since I’m too lazy to read the article, does it specify whether or not “devoting more energy to keeping their partner faithful” is done by being loving, supportive, and trusting. Or is it referring to them being overly jealous, possessive, and abusive? I feel like that’s a very important distinction to show if that’s a good thing or not.", "2_Subreddit": "science"}], "duwkodq": [{"0_Comment Submission": "A parking lot that requires your neighbor to move their car in order for you to get to yours.", "1_Text": "I’ve parked in parking garages like this before since there’s a ton of them in Cleveland OH. They do it in kind of a valet style where, if you’re blocking someone, you have to leave your keys there so they can move your car in case the person you’re blocking comes to leave. The only problem with this is that the people that work there are constantly taking smoke breaks so they’re never around when you need them to move a car so you can get out. I fucking hate these places.", "2_Subreddit": "assholedesign"}], "duwnik6": [{"0_Comment Submission": "Under The Bridge", "1_Text": "Highly recommend checking out Pat the Bunny. Songs like Never Coming Home, From Here To Utopia, Free And Alone, Urine Speaks Louder Than Words, and My Idea Of Fun. The first 2 songs are from Live The Dream by Ramshackle Glory and the others are from Wingnut Dishwashers Union. His first band, Johnny Hobo and The Freight Trains was great too.", "2_Subreddit": "opiates"}], "dv7lr4m": [{"0_Comment Submission": "Someone was excited for Jordan Peele’s Oscar win last night.", "1_Text": "I like that his shows that they’re hopefully still good friends. Even before the show they did a bunch of really great stuff together. It would be super awesome if they worked on something together in the near future. I assume a lot of people are with me when I say how much I miss the show.", "2_Subreddit": "pics"}], "dv7lwq6": [{"0_Comment Submission": "A Thai businessman caught poaching a rare black leopard plans to build a highway through a pristine forest in Myanmar that is home to endangered leopards and connects two tiger sanctuaries. Conservationists, residents, and an armed ethnic group have all expressed concerns about the project.", "1_Text": "This is seriously some shit you would see on a Saturday morning cartoon in the 80’s or 90’s. Where the fuck are the Planeteers when you need them?", "2_Subreddit": "worldnews"}], "dv7qwdu": [{"0_Comment Submission": "Joe playing the box in the 80s", "1_Text": "No idea why, but the phrase “playing a box” annoys the shit out of me lol.", "2_Subreddit": "punkshots"}], "dv7vsh6": [{"0_Comment Submission": "What profession seems to be entirely staffed by assholes?", "1_Text": "That, and the fact that they like to act like they have a lot more authority than they actually have. It seems that, if they’re having a slow day, they’ll just confiscate shit at random just because. That, or they’ll see something they want so they’ll just steal it under the guise of confiscation. Granted, all of that is pretty rare and I’m sure they don’t always get away with that shit. One thing they do always do is, if they do actually have to pat you down, they’re so unnecessarily rough with it. It’s seems as if they’re trying really hard to break/crush whatever might be in your pocket or hidden in your pants. Fuck the TSA.", "2_Subreddit": "AskReddit"}], "dv9lnqv": [{"0_Comment Submission": "Beautiful seals", "1_Text": "Was totally expecting dickbutt but then I saw what sub I was in and remembered that it’s not 2014 anymore lol", "2_Subreddit": "oddlysatisfying"}], "dvsqqgc": [{"0_Comment Submission": "I handcut this then framed it for a friends birthday. (Idea found on Pinterest).", "1_Text": "That is so awesome! You’ve got some mad talent!", "2_Subreddit": "harrypotter"}], "dvt3iwl": [{"0_Comment Submission": "Black Panther sequel", "1_Text": "That’s the most adorable “hey bub” I’ve ever seen!", "2_Subreddit": "gifs"}], "dvt4023": [{"0_Comment Submission": "The way Facebook tries to convince you to post every fucking photo you take", "1_Text": "Same with “boosting” posts. If you run a page for your band or something, it will seriously ask you to pay at least $5 to “boost” your post even if it’s pointless nonsense. The most annoying thing is that the minimum $5 boost only makes it so that your post will actually show up on the timeline of everyone who follows your band. If you’re not paying Facebook, only about 10% of your followers will see your posts (which is a pain in the ass if you’re trying to promote a show). Alternatively you could pay a bunch of money and have your posts show up on random people’s timeline. It’s why everyone is suddenly seeing these videos by this Hobo Johnson dude. Apparently he’s got some pretty deep pockets for boosting posts.", "2_Subreddit": "assholedesign"}], "dvt4v9u": [{"0_Comment Submission": "Stencilled my first jacket today. Pleased with how it turned out.", "1_Text": "The stencil came out great dude! Sorry to hear about your nana though it is nice you have the jacket to remind you of her.", "2_Subreddit": "BattleJackets"}], "dvt4xsy": [{"0_Comment Submission": "ELI5: Why do soft baked goods go hard when they get stale, and hard baked goods go soft when they're stale?", "1_Text": "Fuckin’ science my guy lol.", "2_Subreddit": "explainlikeimfive"}], "dvzaunn": [{"0_Comment Submission": "I don't necessarily support the bad habit, but I'd like to thank the smokers who do this.", "1_Text": "I do this to everyone not just children. I’m sure it’s annoying to nonsmokers to have smoke blown in their faces considering that it annoys people who do smoke. It’s just common courtesy to not smack people in the face with carcinogens lol. It is nice to finally have someone acknowledge it.", "2_Subreddit": "AdviceAnimals"}], "dwjx5z7": [{"0_Comment Submission": "What's the WORST concert you have ever been to?", "1_Text": "Clutch... aren’t they that stoner band that sings about riding elephants and churning butter?", "2_Subreddit": "AskReddit"}], "dwkianj": [{"0_Comment Submission": "What was the dumbest thing a teacher has ever said to you?", "1_Text": "My fifth grade substitute history teacher didn’t know how to pronounce the word “militia” so she sounded it out and pronounced it “mill-i-tee-yuh”. The worst part was that, when a student inevitably corrected her, she yelled at him. Fuck you Mrs. Abrams, you stupid asshole.", "2_Subreddit": "AskReddit"}], "dwkiktv": [{"0_Comment Submission": "awakebutstillinbed // \"life\" // BRUNCH TUNES", "1_Text": "Wow, that was just fantastic!", "2_Subreddit": "Emo"}], "dwkils0": [{"0_Comment Submission": "PRAISE JJ! Can’t even believe it HA!", "1_Text": "lol you lucky fuck! Hahaha", "2_Subreddit": "opiates"}], "dwkj3us": [{"0_Comment Submission": "Steven Colbert and Dana Carvey in Skinheads From Maine (Dana Carvey Show)", "1_Text": "Ugh, ok this needs to be made abundantly clear: SKINHEADS ARE NOT NAZIS. The whole skinhead thing came about for literally the complete opposite reason. Hell, they organize using the term SHARP’s all the time which stands for SkinHeads Against Racial Prejudice. Yes, Nazis stole the skinhead aesthetic but no one calls them skinheads, they’re called boneheads. The skinhead thing was born out of the old school mod/ska scenes, especially the 2-tone ska scene. 2-tone got its name from the fact that it was white people and black people making music together and almost all of the bands were totally diverse. If you go to any major city with a decent skinhead scene, you’d notice that half of them are people of color. Fuckin’ American History X putting a spotlight on a small group of morons and helping to make sure that everyone gets the complete wrong idea about an actually very positive scene.", "2_Subreddit": "television"}], "dwkjf5u": [{"0_Comment Submission": "What one product screams \"I'm trashy\" more than anything?", "1_Text": "I can’t stand people who think smoking weed is the same thing as having a personality.", "2_Subreddit": "AskReddit"}], "dwkjj73": [{"0_Comment Submission": "11 months, 161 lost, no surgery. Life is good.", "1_Text": "Congrats dude! You’re knocking it out of the fuckin’ park man!", "2_Subreddit": "pics"}], "dwp5x25": [{"0_Comment Submission": "My great grandpa looking cool in 1920", "1_Text": "Baller as fuck", "2_Subreddit": "OldSchoolCool"}], "dwrvc8e": [{"0_Comment Submission": "Channel Awesome's Response to recent allegations", "1_Text": "Yea, it’s pretty ridiculous. It’s also pretty apparent that Mike Michaud is a total piece of shit and has absolutely no remorse for anything he’s done. I’m still trying to figure out how much blame I can put on Doug and Rob though. Obviously the guys aren’t saints or anything but given that Michaud owns CA and NC, I feel like they’re both in a position where there’s not much they can do about any of it. Based on the way some of this read, I wouldn’t be surprised if they did try but got shut down because Mike can put them on the chopping block just as easily as anyone else. Yea, the Walkers have done their share of shady shit, but Michaud takes it to an entirely different level", "2_Subreddit": "ChannelAwesome"}], "dwspfvk": [{"0_Comment Submission": "It generally makes me sad knowing a website that gave me so much inspection may be coming to an unfortunate end becuase of poor management and treatment of their talent.", "1_Text": "It just bums me out that all of this has tarnished my favorite show. I don’t know if I can bring myself to completely stop watching NC because I really do love that show. The only excuse I have for it is that I’m choosing to not put as much blame on Doug and Rob as a lot of other people are because of the fact that Mike basically owns them so they really don’t have anymore power than the other producers to put a stop to his behavior. That being said, I’ve definitely lost respect for them due to some of their actions outside of the shit Mike does. The only thing I really just can’t understand about any of this is why in the fuck would Doug give that piece of shit the Nostalgia Critic IP? I understand letting someone buy the majority of the company of CA, but to give up the actual IP of their flagship program/character is so incredibly stupid to me. If Doug could somehow get back full ownership of NC and completely cut Mike out of the picture, he might be able to salvage whatever good will he has left. It really sucks to have to sit here and watch them be forced to ride a sinking ship and have their reputations destroyed mostly due to someone else (though their own actions aren’t doing much to help them in that regard either). I do think Doug and Rob can build their reputations back up if they can separate themselves from Michaud. I’m really hoping they can manage to get themselves away from him and still be able to make NC episodes. Move to YouTube, just call the channel Nostalgia Critic, disassociate from Channel Awesome, and just leave Mike Michaud standing alone over the burning wreckage that was Channel Awesome.", "2_Subreddit": "ChannelAwesome"}], "dwxery6": [{"0_Comment Submission": "I have never done any opiates. I've been browsing this sub for ~2 hours now.", "1_Text": "Good. Being a heroin addict can be a living hell at times. Don’t put yourself in that situation.", "2_Subreddit": "opiates"}]}], "1_submissions": [{"53hnzb": [{"0_Title": "So I listened to your \"record\"", "1_Text": "Since I’m too lazy to read the article, does it specify whether or not “devoting more energy to keeping their partner faithful” is done by being loving, supportive, and trusting. Or is it referring to them being overly jealous, possessive, and abusive? I feel like that’s a very important distinction to show if that’s a good thing or not.", "2_Subreddit": "offmychest"}], "5e6i73": [{"0_Title": "Fuck these days", "1_Text": "Since I’m too lazy to read the article, does it specify whether or not “devoting more energy to keeping their partner faithful” is done by being loving, supportive, and trusting. Or is it referring to them being overly jealous, possessive, and abusive? I feel like that’s a very important distinction to show if that’s a good thing or not.", "2_Subreddit": "opiates"}], "5eqlax": [{"0_Title": "Happy Thanksgiving!", "1_Text": "Since I’m too lazy to read the article, does it specify whether or not “devoting more energy to keeping their partner faithful” is done by being loving, supportive, and trusting. Or is it referring to them being overly jealous, possessive, and abusive? I feel like that’s a very important distinction to show if that’s a good thing or not.", "2_Subreddit": "opiates"}], "5hcdzy": [{"0_Title": "Looks like I'll be having a pretty decent breakfast tomorrow morning!", "1_Text": "Since I’m too lazy to read the article, does it specify whether or not “devoting more energy to keeping their partner faithful” is done by being loving, supportive, and trusting. Or is it referring to them being overly jealous, possessive, and abusive? I feel like that’s a very important distinction to show if that’s a good thing or not.", "2_Subreddit": "opiates"}], "5ixqw5": [{"0_Title": "About to have a decent Saturday night", "1_Text": "Since I’m too lazy to read the article, does it specify whether or not “devoting more energy to keeping their partner faithful” is done by being loving, supportive, and trusting. Or is it referring to them being overly jealous, possessive, and abusive? I feel like that’s a very important distinction to show if that’s a good thing or not.", "2_Subreddit": "opiates"}], "5ubjlt": [{"0_Title": "Waiting again", "1_Text": "Since I’m too lazy to read the article, does it specify whether or not “devoting more energy to keeping their partner faithful” is done by being loving, supportive, and trusting. Or is it referring to them being overly jealous, possessive, and abusive? I feel like that’s a very important distinction to show if that’s a good thing or not.", "2_Subreddit": "opiates"}], "5ucojy": [{"0_Title": "The Wait Is Over!", "1_Text": "Since I’m too lazy to read the article, does it specify whether or not “devoting more energy to keeping their partner faithful” is done by being loving, supportive, and trusting. Or is it referring to them being overly jealous, possessive, and abusive? I feel like that’s a very important distinction to show if that’s a good thing or not.", "2_Subreddit": "opiates"}], "5ufalq": [{"0_Title": "Can't think of a good title", "1_Text": "Since I’m too lazy to read the article, does it specify whether or not “devoting more energy to keeping their partner faithful” is done by being loving, supportive, and trusting. Or is it referring to them being overly jealous, possessive, and abusive? I feel like that’s a very important distinction to show if that’s a good thing or not.", "2_Subreddit": "roosterteeth"}], "6ak07l": [{"0_Title": "Good morning everyone! Might not look like it but the rush on this shit is gnarly. Here's hoping everyone else's morning goes as well as mine has!", "1_Text": "Since I’m too lazy to read the article, does it specify whether or not “devoting more energy to keeping their partner faithful” is done by being loving, supportive, and trusting. Or is it referring to them being overly jealous, possessive, and abusive? I feel like that’s a very important distinction to show if that’s a good thing or not.", "2_Subreddit": "opiates"}], "6czy1j": [{"0_Title": "Its been a good Tuesday night!", "1_Text": "Since I’m too lazy to read the article, does it specify whether or not “devoting more energy to keeping their partner faithful” is done by being loving, supportive, and trusting. Or is it referring to them being overly jealous, possessive, and abusive? I feel like that’s a very important distinction to show if that’s a good thing or not.", "2_Subreddit": "opiates"}], "6gsxwp": [{"0_Title": "I though of a fun/harmless way to mess with people on Facebook. Figured I'd post it here to see if anyone else thought it was kind of funny.", "1_Text": "Since I’m too lazy to read the article, does it specify whether or not “devoting more energy to keeping their partner faithful” is done by being loving, supportive, and trusting. Or is it referring to them being overly jealous, possessive, and abusive? I feel like that’s a very important distinction to show if that’s a good thing or not.", "2_Subreddit": "funny"}], "6ir4d7": [{"0_Title": "Mmmm breakfast of champions! Ok maybe not \"champions\" but still, I'm looking forward to a pretty good morning. Here's hoping everyone else's is just as good!", "1_Text": "Since I’m too lazy to read the article, does it specify whether or not “devoting more energy to keeping their partner faithful” is done by being loving, supportive, and trusting. Or is it referring to them being overly jealous, possessive, and abusive? I feel like that’s a very important distinction to show if that’s a good thing or not.", "2_Subreddit": "opiates"}], "6k8ymv": [{"0_Title": "Uh, fuck opiate blockers (actually not but..)", "1_Text": "Since I’m too lazy to read the article, does it specify whether or not “devoting more energy to keeping their partner faithful” is done by being loving, supportive, and trusting. Or is it referring to them being overly jealous, possessive, and abusive? I feel like that’s a very important distinction to show if that’s a good thing or not.", "2_Subreddit": "opiates"}], "6kvgdo": [{"0_Title": "Fuck, I want a shot so bad!", "1_Text": "Since I’m too lazy to read the article, does it specify whether or not “devoting more energy to keeping their partner faithful” is done by being loving, supportive, and trusting. Or is it referring to them being overly jealous, possessive, and abusive? I feel like that’s a very important distinction to show if that’s a good thing or not.", "2_Subreddit": "opiates"}], "6lf6jw": [{"0_Title": "Just random thoughts [Shitpost]", "1_Text": "Since I’m too lazy to read the article, does it specify whether or not “devoting more energy to keeping their partner faithful” is done by being loving, supportive, and trusting. Or is it referring to them being overly jealous, possessive, and abusive? I feel like that’s a very important distinction to show if that’s a good thing or not.", "2_Subreddit": "opiates"}], "6onez9": [{"0_Title": "Good morning, happy Friday, and happy nods fellow fiends!", "1_Text": "Since I’m too lazy to read the article, does it specify whether or not “devoting more energy to keeping their partner faithful” is done by being loving, supportive, and trusting. Or is it referring to them being overly jealous, possessive, and abusive? I feel like that’s a very important distinction to show if that’s a good thing or not.", "2_Subreddit": "opiates"}], "6phqoz": [{"0_Title": "Ugh fuck today and my idiot dboy", "1_Text": "Since I’m too lazy to read the article, does it specify whether or not “devoting more energy to keeping their partner faithful” is done by being loving, supportive, and trusting. Or is it referring to them being overly jealous, possessive, and abusive? I feel like that’s a very important distinction to show if that’s a good thing or not.", "2_Subreddit": "opiates"}], "6pknfc": [{"0_Title": "Finally got my shit!", "1_Text": "Since I’m too lazy to read the article, does it specify whether or not “devoting more energy to keeping their partner faithful” is done by being loving, supportive, and trusting. Or is it referring to them being overly jealous, possessive, and abusive? I feel like that’s a very important distinction to show if that’s a good thing or not.", "2_Subreddit": "opiates"}], "6rqust": [{"0_Title": "Late Night/Early Morning Shot! Happy Nods Everyone", "1_Text": "Since I’m too lazy to read the article, does it specify whether or not “devoting more energy to keeping their partner faithful” is done by being loving, supportive, and trusting. Or is it referring to them being overly jealous, possessive, and abusive? I feel like that’s a very important distinction to show if that’s a good thing or not.", "2_Subreddit": "opiates"}], "6xhi1s": [{"0_Title": "About to be a good Friday night! Here's hoping the rest of yours go just as well!", "1_Text": "Since I’m too lazy to read the article, does it specify whether or not “devoting more energy to keeping their partner faithful” is done by being loving, supportive, and trusting. Or is it referring to them being overly jealous, possessive, and abusive? I feel like that’s a very important distinction to show if that’s a good thing or not.", "2_Subreddit": "opiates"}], "706311": [{"0_Title": "His & Her's", "1_Text": "Since I’m too lazy to read the article, does it specify whether or not “devoting more energy to keeping their partner faithful” is done by being loving, supportive, and trusting. Or is it referring to them being overly jealous, possessive, and abusive? I feel like that’s a very important distinction to show if that’s a good thing or not.", "2_Subreddit": "opiates"}], "7i8byq": [{"0_Title": "Issa lil’ one but it’ll get me well well enough! Happy Nodds Errbodi!", "1_Text": "Since I’m too lazy to read the article, does it specify whether or not “devoting more energy to keeping their partner faithful” is done by being loving, supportive, and trusting. Or is it referring to them being overly jealous, possessive, and abusive? I feel like that’s a very important distinction to show if that’s a good thing or not.", "2_Subreddit": "opiates"}], "7jubs8": [{"0_Title": "Dboy accidentally gave me his whole stash for $80 lol", "1_Text": "Since I’m too lazy to read the article, does it specify whether or not “devoting more energy to keeping their partner faithful” is done by being loving, supportive, and trusting. Or is it referring to them being overly jealous, possessive, and abusive? I feel like that’s a very important distinction to show if that’s a good thing or not.", "2_Subreddit": "opiates"}], "7jvr1z": [{"0_Title": "ECP & BTH. About to be a good fuckin’ night! Happy nods y’all!", "1_Text": "Since I’m too lazy to read the article, does it specify whether or not “devoting more energy to keeping their partner faithful” is done by being loving, supportive, and trusting. Or is it referring to them being overly jealous, possessive, and abusive? I feel like that’s a very important distinction to show if that’s a good thing or not.", "2_Subreddit": "opiates"}], "7rg5au": [{"0_Title": "About time for bed, but gotta get right first lol", "1_Text": "Since I’m too lazy to read the article, does it specify whether or not “devoting more energy to keeping their partner faithful” is done by being loving, supportive, and trusting. Or is it referring to them being overly jealous, possessive, and abusive? I feel like that’s a very important distinction to show if that’s a good thing or not.", "2_Subreddit": "opiates"}]}]}]}