{"donttouchmy_tray": [{"0_comments": [{"dv8ojrf": [{"0_Comment Submission": "went for a massage", "1_Text": "Who has extra money for shit like this. Lez b honest.", "2_Subreddit": "opiates"}], "dvudgfb": [{"0_Comment Submission": "You can’t reach me space coupe like E.T", "1_Text": "I’ve seen so many posts lately of pills in containers like this one.", "2_Subreddit": "opiates"}], "dvudj5n": [{"0_Comment Submission": "I have never had tar before?", "1_Text": "I’m rediculously addicted to smoking tar. I’ve shot it, sniffed it any way possible, but I can’t stop smoking it. It’s the only way I use.", "2_Subreddit": "opiates"}], "dwcv1ss": [{"0_Comment Submission": "Chasing the dragon Technique", "1_Text": "Until you get good enough to just turn the piece of foil around, just pull the piece off the foil and move it over to fresh lane on the foil.", "2_Subreddit": "opiates"}], "dwf8878": [{"0_Comment Submission": "Holy fucking shit", "1_Text": "I’ve been up for 48+ fam. Quit yer bitchin.", "2_Subreddit": "opiates"}], "dwfyin3": [{"0_Comment Submission": "Holy fucking shit", "1_Text": "I haven’t slept since Saturday. Or maybe Sunday I got a few hours? I couldn’t tell you. I’m out of it.", "2_Subreddit": "opiates"}], "dwg8niy": [{"0_Comment Submission": "Holy fucking shit", "1_Text": "Feels. Hopefully you aren’t at work sick like me. Finally got some cash. Got a hold of the plug. Make plans and tell them I work in 2 hours..yeah to I got you. Then they never say come through and hit you 15 before you work like you blowing me off again? Da fuq ? How is this my fault ha. Fucking hate shit plugs in shits markets withshot dope and shit prices.", "2_Subreddit": "opiates"}], "dwjejh4": [{"0_Comment Submission": "Holy fucking shit", "1_Text": "I don’t have the flu I’m just a broke ass bitch. Sickest I’d been in a long time. Thank god today is payday. So I can blow my whole check for two days of getting high haha. #repeatcycle", "2_Subreddit": "opiates"}], "dwl2ntz": [{"0_Comment Submission": "Can someone please explain what this powdery residue is left in my tooter after smoking? I've only had this happen with very high quality tar. Anyone experience this?", "1_Text": "This in my opinion has always been a sign as to quality tar. Some ppl try to tell me it’s the lactose they cut it with, but I don’t think so. It’s not just from gunpowder. I had rocks yesterday that do the same\nThing. They leave a light greyish watercolor esque trail.", "2_Subreddit": "opiates"}], "dwm9pi8": [{"0_Comment Submission": "Just boofed for the first time.", "1_Text": "Same dude. It’s possible. Only ever done 2 shots and they weren’t even that great. Rather smoke and make monkey water with my bth.", "2_Subreddit": "opiates"}], "dwma2s6": [{"0_Comment Submission": "Man I’m just having good day after good day! Love serving!", "1_Text": "Bruh come on...burn your Brillo before you put it in the pipe..", "2_Subreddit": "opiates"}], "dwoyn6s": [{"0_Comment Submission": "Just boofed for the first time.", "1_Text": "I LOVE smoking it. I’m hello hooked on the smoking aspect. I do the monkey water justvto add legs.", "2_Subreddit": "opiates"}], "dwpubli": [{"0_Comment Submission": "Gummy worms", "1_Text": "Those trails look primo.", "2_Subreddit": "opiates"}], "dwr9me6": [{"0_Comment Submission": "Waiting on my guy after the wat u need text.", "1_Text": "Bruh this shit pisses me off so fucking bad every time. If you have the time or focus/mindset to text me asking what I need..fucking text me back and either a)tell me where to go\nB)tell me how long it will be \nC)tell me to fuck off your busy \nFor the love of good don’t get my hopes up by asking what I need.", "2_Subreddit": "opiates"}], "dwtzufd": [{"0_Comment Submission": "Standard", "1_Text": "Yeah blood. Small town problems. It’s really only 160 miles away but there are no high way or free ways. Only two way roads with speed limits of 45-55. Shits wack. Especially the dope where I’m at. $20 points of garbage bth. I’d rather drive the 4 hours for some legit dope especially since I just got fired. I’m on a Fuck everything tip. More than usual.", "2_Subreddit": "opiates"}], "dwu3tai": [{"0_Comment Submission": "Standard", "1_Text": "Yup. I left at 4pm and I’ll be back around 12 probably. Give or take food/pee/smoke breaks. Thank god this dgirl has been on point af. Waited zero minutes. We pulled in at the same time. That she never happens. And double thank god the gear is 🔥 I hate where I live and the ‘game’", "2_Subreddit": "opiates"}], "dwue6sb": [{"0_Comment Submission": "Standard", "1_Text": "Literally nothing. Corporate dominos has a sign with rules and shit posted in each store. It says in regards to name tags that they are optional. Granted my store is not a corporate store, so I guess the dick head that bought into dominos can make up his own rules. \n\nAnyway I have my name tag on the front part of my hat, like above the bill. he saw it and told me it was There so it’s visible. I guess since I didn’t have it I’m the ‘correct’ spot above my heart or some shit it was in issue. I bite my tounge and move it from My hat to my stomach area real quick.\n\n I was in the middle of taking pizzas out of the oven cutting them blah blah and at the same time doing side cleaning work. He stops dead in his tracks stares and makes a smart ass comment to me about the placement. \n\nI couldn’t bite my tounge anymore. This mother fucker is so nit picky and arrogant and on a high horse it makes me go insanse. He has been on my case for the past year about my gauges in my ears. They are a size 1/2 inch I believe? Not big at all. I have white silicone see through plugs in. No big deal right? Huge deal to him. Anyways I could go on and on about this taint sniffer. \n\nWhat happened was I called him out on his shit and said, “why do you always single me out? Dead ass. I’m the only person you ever go out of your way to complain about. There are numerous other people in here without their name tags, Atleast mine is on!” And I didn’t yell or cuss or raise my voice. I’ve had zero warnings in the past and always do my job. \n\nI turn around and go back to work and he barks,”do you want to go home?” I do not reply and keep working. \n\nTen seconds later he tells me to pack up and leave. \n\nHe then has the audacity to tell me to have a good day as I’m walking out when he didn’t have the balls nor did the gm have the balls to tell me I was actaully fired. Fuck that place and fuck them. Complete bull Shit. \n\nI’m sorry if this doesn’t make complete sense I’m fucked up lol.", "2_Subreddit": "opiates"}], "dwusjl6": [{"0_Comment Submission": "Standard", "1_Text": "I would love to Fuck with this clown, but I’m\nPoor af.", "2_Subreddit": "opiates"}], "dwut1y1": [{"0_Comment Submission": "Around 200 pressed busses, just woke up from a long blackout", "1_Text": "Bars are like $10+ a pop where I’m at. And I can’t even find those ones that are $10..", "2_Subreddit": "opiates"}], "dwutkk9": [{"0_Comment Submission": "This restaurant near my house uses concrete sewer pipes for outdoor seating", "1_Text": "Saw some Chinese or Japanese developers wanting to\nDo the same thing buT with apartments.", "2_Subreddit": "mildlyinteresting"}], "dwutvme": [{"0_Comment Submission": "16 F looking for opinions", "1_Text": "Besutiful. Most deff would stumble and fumble even saying hello.", "2_Subreddit": "amiugly"}], "dwutwr8": [{"0_Comment Submission": "[16F] am i ugly?", "1_Text": "Gorg. Smile is 💯💯", "2_Subreddit": "amiugly"}], "dwv8x77": [{"0_Comment Submission": "Around 200 pressed busses, just woke up from a long blackout", "1_Text": "I don’t need hundreds and it’s not worth setting up and get btc for 10 bars", "2_Subreddit": "opiates"}], "dww9p0i": [{"0_Comment Submission": "Standard", "1_Text": "That’s total travel,stops everything. It’s not bad at all. Drive though some nice pretty mountains. There is even a casino on the way. Oh and legal weed.", "2_Subreddit": "opiates"}], "dwwa05n": [{"0_Comment Submission": "Anyone ever think about going on a drug holiday in SE Asia?", "1_Text": "Hell yeah . Pm let’s goo.", "2_Subreddit": "opiates"}]}], "1_submissions": [{"593qq5": [{"0_Title": "Worst luck ever/shit post", "1_Text": "Who has extra money for shit like this. Lez b honest.", "2_Subreddit": "opiates"}], "5itaok": [{"0_Title": "Change in bth...", "1_Text": "Who has extra money for shit like this. Lez b honest.", "2_Subreddit": "opiates"}], "5jj6mv": [{"0_Title": "Every holiday never fails..", "1_Text": "Who has extra money for shit like this. Lez b honest.", "2_Subreddit": "opiates"}], "5mar36": [{"0_Title": "Central Oregon what's gucci", "1_Text": "Who has extra money for shit like this. Lez b honest.", "2_Subreddit": "opiates"}], "6clojw": [{"0_Title": "(Shit post) Finally fucking done", "1_Text": "Who has extra money for shit like this. Lez b honest.", "2_Subreddit": "opiates"}], "7kec9p": [{"0_Title": "Shit post SUPREME needle shirt", "1_Text": "Who has extra money for shit like this. Lez b honest.", "2_Subreddit": "opiates"}], "7oub8j": [{"0_Title": "Need help", "1_Text": "Who has extra money for shit like this. Lez b honest.", "2_Subreddit": "opiates"}], "7pfak6": [{"0_Title": "LITERALLY THE WORST", "1_Text": "Who has extra money for shit like this. Lez b honest.", "2_Subreddit": "opiates"}], "7t9a6i": [{"0_Title": "GIRLS", "1_Text": "Who has extra money for shit like this. Lez b honest.", "2_Subreddit": "opiates"}], "86p33v": [{"0_Title": "How to use and abuse Mallinckrodt 50 mcg/hr fent patch", "1_Text": "Who has extra money for shit like this. Lez b honest.", "2_Subreddit": "opiates"}], "89vm31": [{"0_Title": "Standard", "1_Text": "Who has extra money for shit like this. Lez b honest.", "2_Subreddit": "opiates"}]}]}]}