{"Isp89": [{"0_comments": [{"dwrb5pw": [{"0_Comment Submission": "First time hydrocodone.", "1_Text": "I figured it was a joke but I try to be serious with first timers", "2_Subreddit": "Drugs"}], "dwrbcpi": [{"0_Comment Submission": "What are you on today?", "1_Text": "Ha I like it. I have a bit of a Xanax problem that I gotta work on but this combo either puts me to sleep or I can do some light work that needs to get done.", "2_Subreddit": "Drugs"}], "dwrbf3f": [{"0_Comment Submission": "This sign at my gym", "1_Text": "Can confirm. Work at a janky ass gym", "2_Subreddit": "funny"}], "dwrbjau": [{"0_Comment Submission": "This sign at my gym", "1_Text": "I should get a few of these. I’m a scrawny white boy that cleans a gym. Sure it’s a free workout but I don’t want to be moving around heavy weights and benches all the time", "2_Subreddit": "funny"}], "dwrbz50": [{"0_Comment Submission": "What are you on today?", "1_Text": "I would say start with 1mg and only do another 1 mg max. I have a naturally high benzo tolerance but my friends seem to enjoy that dose range.\nI only recommend Xanax as an occasional thing or if you seriously need it. Taking Xanax because you can’t smoke could lead down a nasty path.", "2_Subreddit": "Drugs"}], "dwrfgyd": [{"0_Comment Submission": "Whats the biggerst ripoff you've ever seen a dealer try to pull.", "1_Text": "In my fantasy, 5 dollars is fair. Commonly\nin my area 10 a tab is the going price. A couple of my resellers at the time only occasionally got away with selling for 15 because they didn’t like the person. \n\nIn the states, I haven’t seen anything below 10 a hit but in the rural areas,  I see it going for 15", "2_Subreddit": "Drugs"}], "dwseyqy": [{"0_Comment Submission": "When you're high, you think everybody knows it although no one does, and when you're drunk you think no one knows it although everybody does.", "1_Text": "I can do both and nobody knows unless it’s a Saturday night. I’ve gone to work fucked up as all hell and nobody noticed(yes I know it’s dumb and I regret it)", "2_Subreddit": "Showerthoughts"}], "dwtnj3s": [{"0_Comment Submission": "Fear and Loathing in Las Vegas", "1_Text": "Pretty much all of them except amyls and ether. The funny thing is, I was on a recent road trip consuming similar drugs that involved Vegas. Pretty much a fear and loathing part two", "2_Subreddit": "Drugs"}], "dwtobt2": [{"0_Comment Submission": "Caffeine makes me extremely anxious. Is it worth to try different stimulants?", "1_Text": "Yeah I would suggest trying other ones. I think caffeine is shit but I enjoy other stims. Adderall doesn’t make me all anxious", "2_Subreddit": "Drugs"}], "dwtopjz": [{"0_Comment Submission": "My experience using a Ouija board on drugs", "1_Text": "Oh god I’ve had some great memories with lsd+ouija boards. \nNot really creepy but one night, our buddy started to lose control and tried undressing in front of everyone. The ouija board was so funny I started balling because I was laughing so hard(that happened a few other times too) and I’ve never got that. Eventually another one of our friends threw it into a bonfire because he thought the spirits would get us. We were kinda irritated but we all joke about it now", "2_Subreddit": "Drugs"}], "dwtslex": [{"0_Comment Submission": "Whats the biggerst ripoff you've ever seen a dealer try to pull.", "1_Text": "That’s why I strictly deal with the onions. I’ve been sold blank tabs once(got my money back) and underdosed tabs another time but that’s been over the course of a few years. Every other purchase has been solid. I’ve tried street E and L for the first time in the past 6 months and both were bs", "2_Subreddit": "Drugs"}], "dwtwpry": [{"0_Comment Submission": "I don’t like people who take drugs...", "1_Text": "Border patrol took my drugs. Fuck em", "2_Subreddit": "Jokes"}], "dwtzfxg": [{"0_Comment Submission": "I don’t like people who take drugs...", "1_Text": "I’m a hippie looking guy so they put me\ninto secondary. Even though when I crossed back into the US(just with some meds from Mexican pharmacies, I was just fine lol). \n\nThey took all my favorite pieces, 20 grams of good Cali weed and a entire bottle of sleeping pills, supplements, adderall, tramadol, mdma and lyrica. \n\nI was halfway honest with them about the weed and lyrica so they let me off the hook for some odd reason. Luckily I had bikes strapped to the back of my car with a lock so they couldn’t get in. I had about 10ft of mescaline cacti, lsd and a\nbox of paraphernalia.\n\nThey were pretty clueless. I was breaking down laughing as they were searching our sex toys and the look they gave me\nwhen they found 7k(legal) in the same\nbag as my drugs. As my gf was crying\n because we thought I was going to jail(I would take the fall for her)\n\nSorry for the book but they just made\nme throw everything in a dumpster. That hurt to say the least. But hey maybe one of them went back at night and grabbed some of it haha \n\nEdit: my phone fucked up formatting", "2_Subreddit": "Jokes"}], "dwtzuja": [{"0_Comment Submission": "My day so far", "1_Text": "How does the dxm add to the dph? I like dxm but I’m interested in trying dph once. Dxm makes my lsd trips more\nenjoyable so maybe this could apply to dph", "2_Subreddit": "Drugs"}], "dwu04i9": [{"0_Comment Submission": "any experiences with clonazolam?", "1_Text": "Seriously don’t do it. I have a natural tolerance to benzodiazepines and while I may get stupid, I’ve never gone full bartard mode even with crazy doses/combos.\n\nC-lam is different. I went from 0 to instant blackout and I caused all sorts of issues. I’m seriously lucky I didn’t injure anybody/myself, end up in jail or lose\nmy job. Luckily I had my wisdom teeth pulled so they knew I was on pain meds\nso they didn’t bother.\n\nThis is one of a handful of drugs that I warn everyone to stay the fuck away from", "2_Subreddit": "Drugs"}], "dwwvfmw": [{"0_Comment Submission": "What is the happiest, most euphoric high you've ever had?", "1_Text": "I scored some super potent mdma(this had been around my 10th time or so) and  it’s was my gfs second time and all of my friends first time. I think we all agree that it was the most euphoric high we ever had. I did 120mg at first and then kind of\nOverdid it through the night but it was pure bliss", "2_Subreddit": "Drugs"}], "dwwvjdj": [{"0_Comment Submission": "How do you find people who sell xanax", "1_Text": "Word of mouth. I had 1-2 people interested at first and now they buy me out as soon as I get it", "2_Subreddit": "Drugs"}], "dwxn753": [{"0_Comment Submission": "First time cocaine", "1_Text": "Adderall and basketball is fun. I imagine doing coke would be pretty fun if we took breaks every 20 minutes lol", "2_Subreddit": "Drugs"}], "dwxneso": [{"0_Comment Submission": "why do dealers prefer gift cards over cash in aus?", "1_Text": "Because Aus is a strange place for drugs. I’ve heard of the occasional story in the states but that’s it", "2_Subreddit": "Drugs"}], "dwxql3u": [{"0_Comment Submission": "Question as a dealer", "1_Text": "I had this situation before but with lsd. The bitch texted saying she didn’t feel shit. I ask a few questions and no response. Later I found out it worked. If something obviously works on 99% of people, you can fuck right off with your bs.", "2_Subreddit": "Drugs"}], "dwxqre2": [{"0_Comment Submission": "Are there certain regular cartoons that are mad for tripping?", "1_Text": "I’m not one to watch tv while tripping but King Of The Hill tops them all for me. It’s halfway serious but joking at the same time. I was in tears.", "2_Subreddit": "Drugs"}], "dwxqw4y": [{"0_Comment Submission": "First time being first hand finessed...", "1_Text": "I’m anti snitch but I’m lenient when people pull shit like that.", "2_Subreddit": "Drugs"}], "dwxqzwl": [{"0_Comment Submission": "Wellbutrin High?", "1_Text": "I didn’t snort but I crushed up a few pills and mixed it with yogurt. One of the most disgusting tastes and my heart rate was through the roof for the next 3 days. Thought for sure I was going to die", "2_Subreddit": "Drugs"}], "dwzbxgk": [{"0_Comment Submission": "MDMA and chilling", "1_Text": "I’ve had some minor house parties but chilling on mdma is just as great as partying imo. Summer nights+bonfire+mdma=heaven", "2_Subreddit": "Drugs"}], "dwzcqh7": [{"0_Comment Submission": "Do any countries have OTC ritalin/dexedrine/adderall?", "1_Text": "I hear Mexico has Ritalin otc. I never asked though", "2_Subreddit": "Drugs"}]}], "1_submissions": [{"4u5g3x": [{"0_Title": "How's your summer going so far?", "1_Text": "I figured it was a joke but I try to be serious with first timers", "2_Subreddit": "Drugs"}], "6rhzia": [{"0_Title": "Question about genetics and tripping", "1_Text": "I figured it was a joke but I try to be serious with first timers", "2_Subreddit": "Drugs"}], "75smbr": [{"0_Title": "My city hates shrooms", "1_Text": "I figured it was a joke but I try to be serious with first timers", "2_Subreddit": "Drugs"}], "7arxdo": [{"0_Title": "Older people love 2c-b", "1_Text": "I figured it was a joke but I try to be serious with first timers", "2_Subreddit": "Drugs"}], "7qt6c8": [{"0_Title": "What do you think is going to be the main drug in 2018?", "1_Text": "I figured it was a joke but I try to be serious with first timers", "2_Subreddit": "Drugs"}], "804k5q": [{"0_Title": "Chilling with the meth heads", "1_Text": "I figured it was a joke but I try to be serious with first timers", "2_Subreddit": "Drugs"}], "85oyle": [{"0_Title": "Bicycle Day is coming up. Drop some Lucy and ride your damn bike", "1_Text": "I figured it was a joke but I try to be serious with first timers", "2_Subreddit": "Drugs"}]}]}]}