{"Pistolpre": [{"0_comments": [{"d8v5555": [{"0_Comment Submission": "Remember the crab catcher in Japan? Here's the lobster catcher in Florida", "1_Text": "Remove", "2_Subreddit": "ImagesOfJapan"}], "d8v55zl": [{"0_Comment Submission": "Remember the crab catcher in Japan? Here's the lobster catcher in Florida", "1_Text": "False positive", "2_Subreddit": "ImagesOfJapan"}], "dpr931c": [{"0_Comment Submission": "Shooting pills?", "1_Text": "The Opana IRs are great to bang and if you want to do some quick 5 min prep on the ERs they are fucking amazing", "2_Subreddit": "opiates"}], "dpra4oz": [{"0_Comment Submission": "Shooting pills?", "1_Text": "Yea I got real lucky my girlfriend at the time was prescribed 90 IRs and 90 ERs a month. They would last a week then back to dope. Really fucked up our tolerance tho", "2_Subreddit": "opiates"}], "dq5s39n": [{"0_Comment Submission": "Lil white and brown", "1_Text": "The white for sure. Found this in an old bag -praise the lord- that came up north with me from Florida. Florida dope is shit for the most part and dumb expensive on top of that. So nice to be in the northeast again and getting buns for a 1/3 of the price you'd pay down there. Too bad the coke is twice as expensive up here. \nLooks like I was just doing lines but ended up banging that and got real nice. Once I got it in the spoon and drew it up in my rig no way was I waiting to take another pic lol.", "2_Subreddit": "opiates"}], "dq5z84z": [{"0_Comment Submission": "Sleepy doggy snuggling with his toy", "1_Text": "Still can't believe how lucky I got at the humane society with this little guy", "2_Subreddit": "aww"}], "dq625lk": [{"0_Comment Submission": "Lil white and brown", "1_Text": "It went into a spoon then my arm I was just measure it out there first", "2_Subreddit": "opiates"}], "dqbkik7": [{"0_Comment Submission": "What's the longest you've ever held onto dope for?", "1_Text": "Consciously- Until I am starting to feel sick lol. \nObviously misplaced bags while messed up and found them at all different time lengths later on.", "2_Subreddit": "opiates"}], "dqg8emn": [{"0_Comment Submission": "Kurt Russell accidentally destroys an antique 1870 Martin acoustic guitar in The Hateful Eight. They were supposed to switch it out for a double. That didn’t happen. The actress here knows it’s the antique and her reaction is genuine.", "1_Text": "I just watched this movie for the first time over the weekend so it is still fresh in my head. When the guitar is smashed her reaction is so out of character compared to how she acted in the rest of the movie that it really stands out. I couldn't put my finger on it at the time but now knowing this it makes perfect sense the huge discrepancy of her behavior prior to this scene and then during the scene itself.", "2_Subreddit": "videos"}], "dqrdlfs": [{"0_Comment Submission": "Toddlers play more creatively when they have fewer toys at their disposal", "1_Text": "This is a \"no shit Sherlock\". Furthermore they are most creative when they have zero toys to play with.", "2_Subreddit": "science"}], "dqvhy83": [{"0_Comment Submission": "Rigs?", "1_Text": "I see your user name so just assuming. When I lived in Tampa I would have to go to st Pete to get rigs. I don't think I can say exact addresses so I'll try to be as specific yet vague as I can There was a publix right across the street from a hospital that would sell rigs as long as you bought a sharps container or had a receipt for one. Other publix wouldn't sell tho just that one. If you look up hospitals and look to see for a publix across the street it's the only one. This was a few months ago tho I moved back up north so not sure if they still are selling them.", "2_Subreddit": "opiates"}], "dr0utcm": [{"0_Comment Submission": "You died a week ago", "1_Text": "Thanks I appreciate it. Still trying to make sense of it all. Unfortunately this isn't the first person I was in a relationship with who OD and died but for some reason it's really hitting me fucking hard. I guess cus she was trying to get sober for real and I'm still here banging anything that I can get in a rig. One slip up and she's gone.", "2_Subreddit": "opiates"}], "dr0v2vf": [{"0_Comment Submission": "You died a week ago", "1_Text": "Thank you I appreciate it. I wish I could take my own advice and not use alone but hopefully someone will and have the chance to be saved.", "2_Subreddit": "opiates"}], "dukjubg": [{"0_Comment Submission": "Single use methadone for IV heroin withdrawal", "1_Text": "I’ve been to a shit ton of detoxes. Everytime I’ve been to one that gives methadone it’s been the same exact protocol regardless of where it’s at.\nDay 1- 25 mg\nDay 2- 20mg\n3- 15mg\n4- 10mg\n5- 5mg\n6- discharged", "2_Subreddit": "opiates"}], "dvwujyt": [{"0_Comment Submission": "How to pass a UA test for heroin?", "1_Text": "Certo or surejell has always worked for me", "2_Subreddit": "heroin"}], "dw48a4x": [{"0_Comment Submission": "Passing a drug test?", "1_Text": "If you can’t get fake piss then Certo/sure-jell has always worked for me and multiple people I know. Throw a packet of it in a 32oz Gatorade 2-3 hours before you have the test then drink a bunch of water after it. I prefer the liquid packets over the powder ones bc they don’t clump up. Was doing this for months while I was in transitional housing", "2_Subreddit": "opiates"}], "dwtyyee": [{"0_Comment Submission": "Hello everyone! I really need some advice on how to tell my parents I need to go to rehab again", "1_Text": "From my experience if you wait until shit hits the fan and they find out without you telling them you fucked up yet again they are going to be angry but if you bring it up and say you need help yes they will be disappointed but will be much more receptive to helping you. It’s going to suck either way but if you bring it up then you can control the conversation. Or you can say fuck responsibility and go live under the off ramp to the 59th street bridge.", "2_Subreddit": "opiates"}]}], "1_submissions": [{"57uncl": [{"0_Title": "Remember the crab catcher in Japan? Here's the lobster catcher in Florida", "1_Text": "Remove", "2_Subreddit": "pics"}], "7cotqe": [{"0_Title": "Murphy", "1_Text": "Remove", "2_Subreddit": "aww"}], "7el9kj": [{"0_Title": "Lil white and brown", "1_Text": "Remove", "2_Subreddit": "opiates"}], "7emb1x": [{"0_Title": "Sleepy doggy snuggling with his toy", "1_Text": "Remove", "2_Subreddit": "aww"}], "7eva9v": [{"0_Title": "Do what you love and you'll never work another day in your life.", "1_Text": "Remove", "2_Subreddit": "opiates"}], "7h167l": [{"0_Title": "203 friend", "1_Text": "Remove", "2_Subreddit": "0piates"}], "7ird8s": [{"0_Title": "You died a week ago", "1_Text": "Remove", "2_Subreddit": "opiates"}], "88fq11": [{"0_Title": "Man dies from too much lope", "1_Text": "Remove", "2_Subreddit": "opiates"}]}]}]}