{"Enkeladus": [{"0_comments": [{"di0bxew": [{"0_Comment Submission": "18 days off opiates (:", "1_Text": "I'm sort of just copying and pasting this from a comment I just made in a thread before this as it took a half hour to type out. Please don't view this as disingenuous simply because it's not curtailed entirely to your unique situation. I'm trying to help the best I can by simply explaining the process of what is all going down from my bio-psychology based perspective.  \nAddiction is considered a brain disease. This is because you start out using out of boredom, curiosity, pain, pleasure whatever. The disease of addiction doesn't solidify itself then, but simply plants the seed. It is a process that builds once you start incorporating the choice to use into your daily life. Say you start off only using randomly, then once a month, then every other weekend, then three days a week and finally every day. Now the frequency is important, but it's also what you do while you are making those decisions to use. Say you use every time you go to the mall with friends, every time before you eat a big meal, every time you see your. SO, family dinners, before getting a haircut, going to the library, to class, to the bar to become more social, on rainy days, sunny days etc. Each one of those circumstances required you yo make the intial decision of using before/after or during. Once you do it once, the seed of habit is planted and just since we are creatures of habit we will often use a 2nd, 3rd, 4th time during those events ad infinity. What I'm saying is you start to reprogram your brain to associate all these activities with using with every new decision that you choose to use in. And by repeating them you condition yourself, much like Pavlov's dogs mouths watering when the bell is rung indicating food. This process specifically occurs in the amygdala (emotional center of the brain) and hippocampus (memory center of the brain). So think about it, you are telling your brain with every choice over the years of your growing addiction that every time we do X( is the activity, even if it's just sitting in your room - it's an association), and Y(is the drug of choice). Your emotional center of the brain and memory center are becoming reprogrammed with every new use further strengthening the addictive process. It's an insidious thing that is almost impossible to be aware of as it happens over such a period of time. The science shows it. We can see differences, physically and chemically in an addicts vs. a non-addicts brain. The good news however is that the brain is quite neuroplastic, meaning you can reverse the habit or coding you have implemented via your choices. The thing is though, it is a long and arduous process. This is the journey of a thousand miles, beginning with a single step. You, once the initial shitty feeling of withdrawal is over, really really have to force yourself to do new things. Anything that breaks the code should help fight the constant bombardment of cravings your addicted brain will send out. You have to actively and in real time, re-teach your brain to live without the drug. This can best be done by exercise (fighting things chemically as you will create your own endorphins to satiate the brain for a time being). But more importantly the long term solution is tackled by doing new things that help form a cycle, a new habit to follow. A habit purely based off sobriety. You will need to start associating X, the activity, with a new variable that is no longer Y, the drug. Now I don't know what the new variable(s) will be for you but I do know that forcing yourself towards a end goal is the answer. Time can be your enemy and your friend. Combat it by doing or creating anything meaningful to fill all the new free time you will have. Re-teach the brain to form dopamine based on sober activities and refuse it of the instant gratification via drug that it was taught beforehand by yourself. You are both the marble and sculptor of this new sculpture of sobriety to be made. You as you have already seen will fail a lot I'm sure, but this is the only way to do it. You are truly in control, the science backs it up. The question is though, can you hold on for one more day, can you chip away the pieces of the addicted brain and smooth over the rough marble edges with your new and quite heavy tool - sobriety based will?\n\ntl;dr - Doing things will help you feel decent quicker. Sitting around will not recondition your natural chemicals as quickly. Forcing yourself to accomplish goals is an effective method to reestablish a healthy reward system.", "2_Subreddit": "OpiatesRecovery"}], "di0d2ez": [{"0_Comment Submission": "Day 55.", "1_Text": "If you want things to work out you should have just said this stuff to her. Show her this post, be openly transparent and communicate everything. Trust and love can only go so far without proper communication. If she gets mad at you while reading this then she cares more about her ego than the big picture. If she gets sad upon viewing this post than it means she just wants things to work, but doesn't know the solution. Once you can both admit your relationship and overall health are more important than either one individual such as you or her then you can finally let your guards down. Maybe just mutually agree that ya'll are both messes and are equally shitty, even if that's not true. Possibly concede in order to make the other feel better, help them so that they can help you. Because take it from me, I would have killed to have my ex-gf with me during my recovery. Instead I fought it alone and I think that severely damaged me. I really can't answer if staying with her would be more toxic than being alone or not. But, if you are fighting about petty things other than staying sober, then I suggest moving on. You should be a solid team that is unshakeable. Don't take shit out on eachother, just forget about your egotism, who cares who is right or wrong, why you are fighting, this and that. Debate to solve the problem not to win the argument because the problem can, if left unintended, develop into something much worse than a bruised ego. \n\nThis is life or death here in a sense when it comes to sobriety. Remind her of that, remind yourself of that too even if you already know.", "2_Subreddit": "OpiatesRecovery"}], "di0dmrm": [{"0_Comment Submission": "Worried how I'm going to get through work tonight.", "1_Text": "You're welcome again. And dam yeah 4mg to .5 is a huge jump. Suboxone is insanely strong so no wonder you are feeling like shit haha. \n\nAnd yep same here with the using, started doing it before anything fun and then it became just doing it during boring times, then depressing and that's a wrap. Bingo everyday usage addict mode acquired lol. \n\nAll I got to say is just keep on moving along, you are a stronger person than most if you can work while going through such withdrawal. And I'm not just saying that. Sure we did it to ourselves and get no pity, but put a normal person in your position and they would be crying on the floor eating the pizza you were supposed to deliver to such crippling depression and the weight of the box they could no longer hold. \nI truly wish you all the best man. Do yourself a favor a continue to hang around here. I need more people who I can send super long comments too haha. Rambling to strangers on the internet about how addiction works might be my new addiction. Haha life is truly a beautiful an ironic thing. Eitherwayyy  \n\nTake care my friend.", "2_Subreddit": "OpiatesRecovery"}], "di0i0vp": [{"0_Comment Submission": "18 days off opiates (:", "1_Text": "I'll try and help you out the best I can. I'm still new here and I'm reading your post now. Trying to get a feel of what type of person you are like. I really believe that part of recovery is almost like suit sizing. It has to be uniquely tailored to your preferences in order for it to work the best.", "2_Subreddit": "OpiatesRecovery"}], "di0ji4l": [{"0_Comment Submission": "85 days and struggling", "1_Text": "So I'm probably going to be crucified for saying this and hell I would even agree I deserve such punishment if the science disagrees and my lack of research is propagating false knowledge, but idk, I would like to think one could become addicted to a substance, become unaddicted- to an extent and eventually use recreationally again. HOWEVER. I do not believe this can be achieved for any normal person. One would have to have an obscene amount of discipline built up prior from the original addiction, loving family and friends would be an absolute must as psychology shows connections and their counterpart loneliness affect health in a tremendous beneficial and negative way. Also, use would almost have to be regulated by someone else who is impervious to the lulls of addictive substances. The thing is though that none of this seems possible, it's too idealistic, too many things could go wrong and until we as a species overcome the more basal mind regarding emotional decision making we will not be rational and just use in recreation. Especially after the brain has already been predisposed to such a extended period of conditioning in where it always craves drugs for nearly any activity we partake in. We are responsible for creating the disease of addiction. \nThis disease doesn't happen immediately, the brain physically changes overtime, the reward system learns that this is all there is and that I no longer have to produce natural dopamine because when I do a hit of this or a shot of that I satiate more than what was needed. Everything has an equal and or opposite reaction. You think the initial withdrawal is the opposite reaction of using, but it isn't. It's the cravings that last for eons that are the real opposite reaction, this is what you are experiencing now so I don't think Kratom usage would be a good idea at this point. Time is the thing that will erode all your grand statements and declarations about recovery away. Just forget about using for now.\nNow when I think about someone at nearly the 3 month marker drug free I think goddamm, first pat yourself on the back for getting this far. So many people struggle with just a few days or a week. The naltrexone is a good idea but it's a shame it's giving you side effects. Is it the implant version, because with that you can have all the cravings you want but the simple fact is that opiate blocker is under your skin and you can't use to get high even if you wanted to. I don't think that's a permanent solution though. I think some part of addictive thinking stems from a more philosophical basis. See for me personally I started using to make fun situations more fun, and then my discipline dwindled over the course of months and then I started using when waking up and just bored, and eventually I was using when facing absolute despair. The thing that helped me, believe it or not was a mix of getting in trouble with the law (probation for a few months) and more so picking up reading again. See, sometimes I think people use because when you really look yourself in the mirror and ask what is the purpose of life you really can't answer that question with a concrete answer. So this uncertainty sometimes can eat away at you as you can create all these meaningful ideas to pursue but when you are feeling down you are just going to say, well, \"wtf if it's so purposeful than why is it fading so easily\". And that's that thing, an existential crisis can really be a crutch, for me at least it was in the recovery process. I simply couldn't believe that there was any real point to life and so I resorted to hedonism (point of life is to get as much pleasure as possible). The thing is though that this philosophy of pleasure seeking is not sustainable. And here's why. The brain simply works through one of Newton's 3rd law I swear. An equal action has a equal and opposite blah blah you know. You can't bombard your brain with 5-20 times the natural amount of dopamine it receives during a opiate use intake and expect no repercussions. It just doesn't work that way. The brain will say \"fuck this I'm not wasting energy producing natural endorphins when they are just given to me.\" That's why you experience something called anhedonia (inability to feel pleasure) after long term opiate usage. And yeah, this anhedonia can last for a real long time. So that may be what you are experiencing right now. The last stages of withdrawal are the end cravings and realization that \"okay I've been clean for months now and nothing is as good as getting high flooding my brain with 20 times it's natural dopamine production\". Well, give your brain a break, it's been doing it's best. \nOk I've been incessantly rambling, the real point I want to make to you is this. You have to give it more time, the brain is neuroplastic but can only recover so fast. Who are you to say that you are feeling normal yet. You might think that you are 90% back to how you were before opiate use but who knows, you might still have quite a ways to go. It truly depends on your unique situation and how fast you naturally recover. Now I don't necessarily agree with everyone else here saying that Kratom will reset your receptors back. But, I do agree it could be a slippery slope decision. If you are going to use Kratom just a little crutch, than blow up your spot. Self help yourself by possibly self destructing your former addictive mind by telling people in your immediate life like friends/family that know you already use that you are going to use again. Hopefully one of them understands addiction enough to say \"ok he/she's been clean this long so let's just treat this as a treat\". Guess that's a little too idealistic as well but idk it's 2am and I'm trying to think of any ideas that would help you. \nOh, also. I highly recommend reading some literature and any research articles you can on the subject on addiction. (I can link you some articles if you want) And actually, not just pertaining to addiction but in addition to reading books on buddhistic philosophy if you find that interesting. It's all about resisting the temptation and doing things in moderation. Of course any drug is not allowed but hey, I take the lessons I want from various philosophies in an eclectic way. I highly recommend the book Siddhartha by Herman Hesse. Seriously, after reading that book I was clean for 3 months straight. That's how powerful of a message it had. Mainly though your recovery success is going to be based off of the everyday decision. I really suggest picking up some new hobbies to keep your mind occupied off of the cravings. This shit is very brain based so it's really you (your consciousness) vs. the chemical balances you have each day vs. time. Some days you will feel like shit and others you will feel alright. The days you feel like shit you need to stay busy because simply reminding yourself that you will feel better maybe after you eat or get more sleep is great and all. But sometimes the negatives get overwhelming and not everyone can just sheer force of will themselves into happiness on command. I mean yeah it's important to know every mood will fade but come on, this is a life or death situation in a sense as relapse can lead to. Better to just pick up some hobbies to help create some meaning in your life. Force feed yourself meaningful opportunities. Combat the addiction by re teaching your brain that you can have fun doing normal things. Fuckin join a yoga class, meet some girls (if you are a guy), join a dancing class routine and grind on some qt's, if you have any money saved up say fuck it and go travel. Do something new! Nuke your old addictive wanting opiate receptors craving the attention of a drug with a barrage of new experiences. Show your stupid primordial brain that you control whatever the fuck you want. Re-establish dominance over yourself. hit the gym, create some endorphins get ripped, go the the beach this summer. Basically look forward to learning something new everyday even if you don't feel it. It's really like Nike, just fucking do it, ignore the feelings of motivation because your brain already has a comprised reward system. Don't listen to how you feel, listen to what you know it the right path.  Time is always going to be your friend and enemy. Don't just sit on reddit and read this shit. Start making a schedule, stick to that motherfucker like a dope fiend on dope. There is really so much to do in life it is almost crippling. So much to do you can't even begin to decide. The world is your damn oyster, open that bitch up and grab the pearls. The anhedonia you are experiencing and lack of pleasure in life is just addiction based, it will passs although PAWS last for a really long time. Don't decide to quit sobriety based off doubt. Just constantly, and make it your mantra that this shit will soon pass. You have to reprogram your brain by showing it that you an have fun and create albeit 1/10 the endorphins via natural high when compared to a opiate high, but like I said before that's the way it has to be. The brain has evolved over hundreds of thousands of years and it doesn't function properly with artificial shit added to it everyday. It takes time to rebalance itself and the only way to do that is to stay in motion. Don't let you feelings take ahold, look to the long term, the best days are still ahead of you I promise, I'm living proof of that. Keep on trucking my friend, 85 days is no joke. And that's it, this has been my rant tailored to you personally\n\nTl;dr - Be like Newton's first law of motion. An object at rest stays at rest unless an outside force acts upon it. You are that force, you have the control whether you want to continue moving forward or stop and start again.\n\nAlso, look at me, it's 3 am and I have to be up for work in 4 hours but I got out of bed and typed all of this up for you because that's how confident I am in knowing your perseverance will pay off :)", "2_Subreddit": "OpiatesRecovery"}], "di0miin": [{"0_Comment Submission": "85 days and struggling", "1_Text": "Im def going to respond to your further inquiries when I get home from work in the afternoon. I think I have some answers, but even more so some questions for you haha. I have some interesting studies done on addiction too saved on my laptop I can share with you. I'll message you then", "2_Subreddit": "OpiatesRecovery"}], "di0mu6k": [{"0_Comment Submission": "85 days and struggling", "1_Text": "Before I go to bed, I want to say that you not taking the naltrexone for the past 3 days is in my guess 100% why you are craving shit so badly. Look up the half life of naltrexone, it leaves the body quickly so you are probably really withdrawing from it. Sure, it ain't an opiate or drug that gets you high. Still has side effects though, and naltrexone is used to really combat cravings. So there you go, that little chemical imbalance is why your brain is burning for opiates right now. I would honestly bet like a grand(that I wish I had) that's what's mainly causing your severe cravings right now. See how sensitive our stupid brains are. Our brains be like, \"Oh HURR DURR I'm not getting enough drugs so Ill just cause my co-pilot(you)(consciousness) to have a mental breakdown and relapse at 85 days HURRR DURR NOT A BIG DEAL OR ANYTHING WHO CARES IF HE GOES INTO RELAPSE AND DIES. The brain is fucking stupid man let me tell you. Like it evolved for hundreds of thousands of years but then lets such destructive and even suicidal thoughts in at times. Yeah such a brilliant organ my ass. Brains be dumb af. But alright haha, Ill address the rest of your points tmrw. Try and get back on the naltrexone if you can, as long as the side effects are unbearable, maybe try a lower dosage because Im pretty sure it's been proven to calm cravings. I'm not doctor though so maybe do some research first before you take my word but Im 90% sure that's why you are experiencing such an increase in cravings. These fuckin drugs and their withdrawals lol. Got to link you the study on chocolate withdrawals later. We are so fragile when you think about it. Like come on! If chocolate can cause mood swings what hope do we have!?", "2_Subreddit": "OpiatesRecovery"}], "di17ra1": [{"0_Comment Submission": "18 days off opiates (:", "1_Text": "I'm not in the field but I closely follow the research. I have read dozens of articles, books and listened to many talks on the subject as well with gathering quite a bit of anecdotal evidence stemming from my journey and others I've talked too . Still, I mainly look to science to explain how addiction works. I think by understanding it the best you can gives you an edge  during recovery. By knowing the black and white details you can say what has to be done with no doubt in your mind. Knowing the numbers especially can be quite illuminating. The whole fiasco becomes much more simplified.  To know that recovery requires rewiring of the brain through time means that you only have one option. To actively rewrite your reward system through activities completely dissociated with using. It's all about developing good habits. I plan to make a master post on here on the topic with all the latest research but it's going to take me a decent amount of time to organize. I want people to understand what they are fighting and why, inside and out.", "2_Subreddit": "OpiatesRecovery"}], "di19ehc": [{"0_Comment Submission": "Where's the motivation & energy?", "1_Text": "Yep what Rake said. Forcing it is absolutely essential. Once you start moving you will produce some dopamine so things will become easier. You will gain momentum like a ball rolling down a hill. Go to the gym and run on the treadmill. It will suck like a whore at first but after 15 minutes the brain will start churning out endorphins and it will slowly become easier. Then once you are done running don't stop. Try to keep moving and staying focused, just do anything to stay busy and moving. Don't go insane and stress yourself out, but stay busy until you are ready for bed. Then just do it all again the next day. This will reinforce your reward system by teaching it to look forward to starting your day. For now things must be forced, just the way it is. Try to focus less on how you feel and more on the hard based logic that your brain won't release dopamine unless you first accomplish something. Listen to Nike and \"Just do it\".", "2_Subreddit": "OpiatesRecovery"}], "di1auqf": [{"0_Comment Submission": "Short post. stressed out", "1_Text": "Go to r/Opiatesrecovery and read some of the posts there. I put down some comments if you want to check them out. It's overall an inspiring place.", "2_Subreddit": "opiates"}], "di3lr7l": [{"0_Comment Submission": "Where's the motivation & energy?", "1_Text": "It will becomes where you no longer have to force it and you will just do it. However, it can take many months for this to start happening. Just be the ball and keep moving and I promise you things will return to normal given enough time. Speed of recovery= distance moved/time passing.", "2_Subreddit": "OpiatesRecovery"}], "di3lrpn": [{"0_Comment Submission": "85 days and struggling", "1_Text": "Ugh been so busy. Still have your response in mind.", "2_Subreddit": "OpiatesRecovery"}], "dn18isf": [{"0_Comment Submission": "shitpost", "1_Text": "I'm gonna do some shitposting to your shitpost. Ya know just feeling bad for myself, but yeah, I feel ya man, I truly do. I lost a beautiful girl as well almost 3 years ago now due to this shit. Since then I've been clean for a few months, but gained a shit load of weight and lost a great job. Dropped out of school and even though I'm clean now and doing better overall I always ask myself. What's the point? I'm in my late twenties now and I know I will never get an 18 year old cutie again. Even if I put all my effort into school or a career Ill still most likely be thinking of the past. As you get older you are forced to be more responsible and sure it has it has its perks but I honestly feel like I'm just tricking myself into thinking life is better. I have money now and time to do things but nothing gives me pleasure like young love. I mean come on, what beats being 21 again, laying with your young petite beautiful love on a hammock just watching the sun set while being high as shit? Then just waking up beside her the next day, having magical sex and then sneaking to the bathroom to do a few bumps. Sure she didn't know and it was selfish on my part but fuck, it was the only time in my life everything felt right in the world. I just realistically don't see myself ever getting back to that point no matter how hard I try. I fucked it up, she's moved on and most girls I know now are already getting engaged/have kids. I'm still holding on, and frankly I don't even care about getting high that much because it just makes me feel like shit afterword. Idk, maybe life's like a movie in a way. It starts off really great, the first act is just amazing but then you are watching/living it and the second act starts to become shit and at that point you are debating if you should even stick around for the third. I know I have/have had it better than so many others and I should be appreciate but in a way that just makes me feel like shit even more. Idk, I suppose you and I need to find or create some other meaning in our lives but I question why did all that seem so natural then and this seems so forced. Life isn't suppose to be easy, especially when you look at evolution and the history of humankind. But hell, when you realize there is no point to anything other than what you give it, you got to ask, why not just live a hedonistic life and just die? Why care about others at all when every-time you look at the universe you just see it void of purpose. Why continue towards the future if all you want and think about is a past you can never get back?", "2_Subreddit": "opiates"}], "dn18m7r": [{"0_Comment Submission": "shitpost", "1_Text": "Still, after all these thoughts. I'm going to give it more time, first you have to get clean, then you gotta stay clean if you want any semblance of that life back. Sure it won't be the same, but you might be able to get another beautiful girl, perhaps she will be marvelous in another way besides what we most look for - their looks. I figure I have to keep striving for better until I simply know I have given my all. I don't know when I'll get to that point, but I'm gonna try until I simply can't do it anymore.", "2_Subreddit": "opiates"}], "dnu7j1e": [{"0_Comment Submission": "Texting on iPhones while nodding. mmmmmmmmmmmm", "1_Text": "I know exactly what your sayinmmmmmmmmmmmmmmmmmm", "2_Subreddit": "opiates"}], "dok0s6p": [{"0_Comment Submission": "Galaxy rework by me (Brookelyn Kelly) at Permanent Record in Provo, Utah", "1_Text": "I know this is a bot but goddam, can't it at least through a compliment for so an eloquently designed piece before lambasting the man for some bullshit. Or idk, maybe I'm just really out of line and should shut my mouth as I am observing this post edit I'm sure.", "2_Subreddit": "tattoos"}], "dok1kau": [{"0_Comment Submission": "More Pokémon Pill Porn! (Now with added Valium) Hope everyone is having an awesome day.", "1_Text": "Youse are a lucky individual my amigo, enjoy yourself and be safe. Drink some white grsthfruit juicr to enhance all those johns, trust me it makes a difference. Or better yet go to the store and get two or three white grapefruits and tagamet, that shit will synergize and excellently.", "2_Subreddit": "opiates"}], "dqnferi": [{"0_Comment Submission": "What's the most expensive thing you've ever touched?", "1_Text": "Heroin", "2_Subreddit": "AskReddit"}], "dr0gik6": [{"0_Comment Submission": "Questions for Michael Vsauce here for h3 podcast (Friday Dec. 15th!)", "1_Text": "A lot of these questions can be answered by watching Micheals Ted Talk.", "2_Subreddit": "h3h3productions"}], "dr0qx5s": [{"0_Comment Submission": "Muscle memory", "1_Text": "Dam the body is truly amazing", "2_Subreddit": "bodybuilding"}], "dr0r76z": [{"0_Comment Submission": "Frank Zane winning the 1968 Mr Universe, age 26", "1_Text": "Nice. Im about to turn 26 and just got back into lifting after a half decade... fuck what have I been doing with my life.", "2_Subreddit": "bodybuilding"}], "dtcsrra": [{"0_Comment Submission": "Cross Eyed While Nodding", "1_Text": "I think it has to do with reduced blood pressure and so the muscle itself is weakened due to that and thus leading to the general droopiness and challenge in focusing on something.", "2_Subreddit": "opiates"}], "dwkkoc5": [{"0_Comment Submission": "Remarkable Discovery", "1_Text": "So much for keeping it short lol. Sorry Im just excited about my discovery, felt I should share it for at-least I can say this shit is amazing for withdrawal/post acute withdrawal. Please be careful either way, people have died from this stuff, now I can kind of see why cuz when it works it works.", "2_Subreddit": "opiates"}], "dwklif5": [{"0_Comment Submission": "152 days.", "1_Text": "Ill give you practical advice that worked for me. Start exercising. I mean seriously start doing either hardcore cardio, or very heavy lifting. It releases beta endorphins (they best mimic opiates) and its one of the best ways to reduce the incessant cravings. Ive had clean time for almost 14 months before. I recently relapsed and it was because I stopped exercising. I had intense cravings for 4 months and then I started intense cardio. Cut my cravings down like 75%, it was bearable, it stopped my insane drug dreams too, controlled the overall cravings way more than the fucking vivitrol shot. Also in case you are working at a physical labor job, that doesn’t necessarily cut it for a few reason. From my research it seems these endorphins are only released during super intense exercise. At 152 days you should be able to handle it. Seriously man, please try it for your own good. If you dont know how to lift do as long as you can on the ellpitcal/treadmill. Planet fitness memberships are dirt cheap. https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4631114/ Read this if you want the numbers on how effective it is, it’s an article on exercise as a dopamine agonist therapy. If the exercise doesn’t work don’t give up. Try WellButrin, it’s a very unique and mild antidepressant, dont be turned off by the label, it works on dopamine instead of serotonin like 95% of all other (SSRI). Your brain is craving dopamine and this shit can really help you get through the PAWS phase. It’s kind of surprising how little doctors even recommend it to recovering opiate addicts. If you’re wondering how to get prescribed it just go to your doctor and say you want to quit smoking, thats the most common reason its given out. Ive been on it before and it does cut cravings unlike naltrexone (imo). Still exercise was more effective for me, and for others as the study I linked will show when it comes to the longterm.", "2_Subreddit": "opiates"}], "dwm12pi": [{"0_Comment Submission": "Remarkable Discovery", "1_Text": "Sorry. I see what you’re saying, it being cardio toxic and all. Still, I cant help but think it seems 100 times safer than whats on the streets nowadays. Ive had 4 friends die in the past two years just from fentanyl. Id honestly rather have them be doing immodium because only a handful have died from it in the past decade. Ill probably continue to use lope every once in a while keeping my dose below 50mg. From my research the heart stuff seems to be mainly genetic and due to outrageously high doses. Either way, Ill delete this post as I suppose Im just giving people ideas. Should have thought before publishing this, my brains still so screwed up.", "2_Subreddit": "opiates"}]}], "1_submissions": [{"7iiq45": [{"0_Title": "Does anyone know if they drug test before vivitrol?", "1_Text": "I'm sort of just copying and pasting this from a comment I just made in a thread before this as it took a half hour to type out. Please don't view this as disingenuous simply because it's not curtailed entirely to your unique situation. I'm trying to help the best I can by simply explaining the process of what is all going down from my bio-psychology based perspective.  \nAddiction is considered a brain disease. This is because you start out using out of boredom, curiosity, pain, pleasure whatever. The disease of addiction doesn't solidify itself then, but simply plants the seed. It is a process that builds once you start incorporating the choice to use into your daily life. Say you start off only using randomly, then once a month, then every other weekend, then three days a week and finally every day. Now the frequency is important, but it's also what you do while you are making those decisions to use. Say you use every time you go to the mall with friends, every time before you eat a big meal, every time you see your. SO, family dinners, before getting a haircut, going to the library, to class, to the bar to become more social, on rainy days, sunny days etc. Each one of those circumstances required you yo make the intial decision of using before/after or during. Once you do it once, the seed of habit is planted and just since we are creatures of habit we will often use a 2nd, 3rd, 4th time during those events ad infinity. What I'm saying is you start to reprogram your brain to associate all these activities with using with every new decision that you choose to use in. And by repeating them you condition yourself, much like Pavlov's dogs mouths watering when the bell is rung indicating food. This process specifically occurs in the amygdala (emotional center of the brain) and hippocampus (memory center of the brain). So think about it, you are telling your brain with every choice over the years of your growing addiction that every time we do X( is the activity, even if it's just sitting in your room - it's an association), and Y(is the drug of choice). Your emotional center of the brain and memory center are becoming reprogrammed with every new use further strengthening the addictive process. It's an insidious thing that is almost impossible to be aware of as it happens over such a period of time. The science shows it. We can see differences, physically and chemically in an addicts vs. a non-addicts brain. The good news however is that the brain is quite neuroplastic, meaning you can reverse the habit or coding you have implemented via your choices. The thing is though, it is a long and arduous process. This is the journey of a thousand miles, beginning with a single step. You, once the initial shitty feeling of withdrawal is over, really really have to force yourself to do new things. Anything that breaks the code should help fight the constant bombardment of cravings your addicted brain will send out. You have to actively and in real time, re-teach your brain to live without the drug. This can best be done by exercise (fighting things chemically as you will create your own endorphins to satiate the brain for a time being). But more importantly the long term solution is tackled by doing new things that help form a cycle, a new habit to follow. A habit purely based off sobriety. You will need to start associating X, the activity, with a new variable that is no longer Y, the drug. Now I don't know what the new variable(s) will be for you but I do know that forcing yourself towards a end goal is the answer. Time can be your enemy and your friend. Combat it by doing or creating anything meaningful to fill all the new free time you will have. Re-teach the brain to form dopamine based on sober activities and refuse it of the instant gratification via drug that it was taught beforehand by yourself. You are both the marble and sculptor of this new sculpture of sobriety to be made. You as you have already seen will fail a lot I'm sure, but this is the only way to do it. You are truly in control, the science backs it up. The question is though, can you hold on for one more day, can you chip away the pieces of the addicted brain and smooth over the rough marble edges with your new and quite heavy tool - sobriety based will?\n\ntl;dr - Doing things will help you feel decent quicker. Sitting around will not recondition your natural chemicals as quickly. Forcing yourself to accomplish goals is an effective method to reestablish a healthy reward system.", "2_Subreddit": "opiates"}], "7ir2r2": [{"0_Title": "Lifting over the course of a few hours? Bad, good, who cares?", "1_Text": "I'm sort of just copying and pasting this from a comment I just made in a thread before this as it took a half hour to type out. Please don't view this as disingenuous simply because it's not curtailed entirely to your unique situation. I'm trying to help the best I can by simply explaining the process of what is all going down from my bio-psychology based perspective.  \nAddiction is considered a brain disease. This is because you start out using out of boredom, curiosity, pain, pleasure whatever. The disease of addiction doesn't solidify itself then, but simply plants the seed. It is a process that builds once you start incorporating the choice to use into your daily life. Say you start off only using randomly, then once a month, then every other weekend, then three days a week and finally every day. Now the frequency is important, but it's also what you do while you are making those decisions to use. Say you use every time you go to the mall with friends, every time before you eat a big meal, every time you see your. SO, family dinners, before getting a haircut, going to the library, to class, to the bar to become more social, on rainy days, sunny days etc. Each one of those circumstances required you yo make the intial decision of using before/after or during. Once you do it once, the seed of habit is planted and just since we are creatures of habit we will often use a 2nd, 3rd, 4th time during those events ad infinity. What I'm saying is you start to reprogram your brain to associate all these activities with using with every new decision that you choose to use in. And by repeating them you condition yourself, much like Pavlov's dogs mouths watering when the bell is rung indicating food. This process specifically occurs in the amygdala (emotional center of the brain) and hippocampus (memory center of the brain). So think about it, you are telling your brain with every choice over the years of your growing addiction that every time we do X( is the activity, even if it's just sitting in your room - it's an association), and Y(is the drug of choice). Your emotional center of the brain and memory center are becoming reprogrammed with every new use further strengthening the addictive process. It's an insidious thing that is almost impossible to be aware of as it happens over such a period of time. The science shows it. We can see differences, physically and chemically in an addicts vs. a non-addicts brain. The good news however is that the brain is quite neuroplastic, meaning you can reverse the habit or coding you have implemented via your choices. The thing is though, it is a long and arduous process. This is the journey of a thousand miles, beginning with a single step. You, once the initial shitty feeling of withdrawal is over, really really have to force yourself to do new things. Anything that breaks the code should help fight the constant bombardment of cravings your addicted brain will send out. You have to actively and in real time, re-teach your brain to live without the drug. This can best be done by exercise (fighting things chemically as you will create your own endorphins to satiate the brain for a time being). But more importantly the long term solution is tackled by doing new things that help form a cycle, a new habit to follow. A habit purely based off sobriety. You will need to start associating X, the activity, with a new variable that is no longer Y, the drug. Now I don't know what the new variable(s) will be for you but I do know that forcing yourself towards a end goal is the answer. Time can be your enemy and your friend. Combat it by doing or creating anything meaningful to fill all the new free time you will have. Re-teach the brain to form dopamine based on sober activities and refuse it of the instant gratification via drug that it was taught beforehand by yourself. You are both the marble and sculptor of this new sculpture of sobriety to be made. You as you have already seen will fail a lot I'm sure, but this is the only way to do it. You are truly in control, the science backs it up. The question is though, can you hold on for one more day, can you chip away the pieces of the addicted brain and smooth over the rough marble edges with your new and quite heavy tool - sobriety based will?\n\ntl;dr - Doing things will help you feel decent quicker. Sitting around will not recondition your natural chemicals as quickly. Forcing yourself to accomplish goals is an effective method to reestablish a healthy reward system.", "2_Subreddit": "bodybuilding"}]}]}]}