{"AverageGuyinWD": [{"0_comments": [{"dwr5tso": [{"0_Comment Submission": "Drug Review: 2-Methyl Carfentanil (presumed and labeled as such)", "1_Text": "Thanks for the review. Hopefully at higher dosages it has some good effects. Doesn't sound too good now though. Keep us updated", "2_Subreddit": "Drugs"}], "dwr7zev": [{"0_Comment Submission": "Novel Fentanyl N-(1-methylpiperidin-4-yl)-N-phenylpropanamide experience report", "1_Text": "Can you compare the 1-nmf with the 2-mcf? Is the 2-mcf better?", "2_Subreddit": "Drugs"}], "dwttccl": [{"0_Comment Submission": "Drug Review: 2-Methyl Carfentanil (presumed and labeled as such)", "1_Text": "Update on higher dosage effects?", "2_Subreddit": "fentanyl"}], "dwttgsi": [{"0_Comment Submission": "Novel Fentanyl N-(1-methylpiperidin-4-yl)-N-phenylpropanamide experience report", "1_Text": "no sourcing!", "2_Subreddit": "Drugs"}], "dwttjp9": [{"0_Comment Submission": "Drug Review: 2-Methyl Carfentanil (presumed and labeled as such)", "1_Text": "update on higher dosages?", "2_Subreddit": "Drugs"}], "dwtuedy": [{"0_Comment Submission": "The ultimate Fentanyl and Analog thread", "1_Text": "BRO YOU CANT NAME SOURCES!!!!!!!!Ok nevermind you edited it thanks :)", "2_Subreddit": "fentanyl"}], "dwtvjtn": [{"0_Comment Submission": "Ppf experience (variant of paf)", "1_Text": "Thanks for the info, and you managed not to mention sources once (amazing!).\n\n First question: What is your \"normal opiate tolerance\"? Like how much oxycodone for you to get a good nod? Trying to get some perspective on comparing dosages of different opiates/fent analogues. \n\nHave you ever tried making a nasal spray? Thats def gonna be a safer method of dosing. My preferred ROA is smoking/vaping off foil though so I know how it is with your preferred Route of administration. \n\nThe only bad thing about this \"ppf\" it sounds like is the itching! I would not be able to handle that. \n\n2-3 hours seems really short to me. For me pure MAF would keep me nodding for literally 5-6 hours with no need felt to redose for at least 8 hours.\nI had good MAF, and one weird thing that I noticed with it was it didnt cause constipation at all, even though its super strong and I was using it all day every day for weeks...I dunno maybe I was just eating a lot of fiber.", "2_Subreddit": "fentanyl"}], "dwtvp5j": [{"0_Comment Submission": "Ppf experience (variant of paf)", "1_Text": "i think where you say \"sourcing it.......\" should probably be edited out just to be safe as the no sourcing rule is super strict now.", "2_Subreddit": "fentanyl"}], "dwtwc66": [{"0_Comment Submission": "The ultimate Fentanyl and Analog thread", "1_Text": "So you say \"U4 is very caustic\", what are you exactly referring to? I'm not familiar with \"U4\". There is U47, U48, U49, and they are massively different substances. U47700 has many years of history and A LOT of people love it (including me) and in no way is it \"very caustic\". I think you might be referring to \"U49900\"?", "2_Subreddit": "fentanyl"}], "dwtwl9k": [{"0_Comment Submission": "The ultimate Fentanyl and Analog thread", "1_Text": "I think \"what is your favorite analogue\" and \"what is the best around\" are two very separate questions. Most peoples favorite analogues are almost entirely unavailable now after being banned in China.", "2_Subreddit": "fentanyl"}], "dwtxp09": [{"0_Comment Submission": "i’ve got a bunch of tramadol...", "1_Text": "I'm similar to you in tolerance and I have a backup supply of Tramadol for when I don't have any other opiates and I go into withdrawal and I dont want to suffer 24 hours of WD to start onto Suboxone. I've tried taking like 1000mg tramadol at once trying to get some kind of high but it just is not going to happen, ESPECIALLY WITH A FENT TOLERANCE!, and now i look back at how stupid I was and how i'm super lucky I didn't die from a seizure, as Tramadol seriously will cause seizures. I found that going from Fent/good BTH into withdrawls, I can take 350mg tramadol and all my withdrawals will go away. Tramadol also has some crazy anti-depressant properties which I was surprised to learn after taking 350mg for a few days. Definitely save the Tramadol for when your in bad withdrawals, it will make you well, but its just not going to get you high, and taking more and more wont help, and actually might kill you or cause permanent damage from seizure.", "2_Subreddit": "opiates"}], "dwu075q": [{"0_Comment Submission": "Would you have switched to heroin if oxys were still everywhere?", "1_Text": "Well i think the first question is, what was the opiate situation like BEFORE the OC80's and Oxy30's started being so easily available suddenly. I literally knew NOT ONE PERSON who was addicted to opiates. It was the flood of those (at first) relatively cheap pills that got the whole epidemic started. The maker of OC80 got fined 600million by the FDA for false advertising these pills as \"less addictive\" than other opiates and \"sustained release\" which was just completely obviously false to anyone who got high off these pills. The fact that they only got fined only $600m when they made 20+BILLION in profit just of OC shows you how corrupt the FDA is. But yes, after everyone was addicted to easy to get cheap oxy, like my whole school was addicted to oxy in high school, then they switched to the \"OP version\" of OC80 and the price of an \"original oc80\" went from $40 to $80 like overnight. Within a couple months, black tar heroin from mexico started flooding the streets and basically 100% of everyone addicted to oxy switched to \"brown\"/Black tar or \"PURE\" as it was called at first, as opposed to \"gunpowder\"/weak heroin. Only the rich kids or those who went into crime/drug dealing themselves stayed able to sustain their expensive oxy habit. I'm pretty sure NOBODY wanted to switch to black tar at first, and yes i know a lot of people who quit opiates once their only sustainable option was to switch to heroin. But for anyone who got decent mexican black tar heroin for a decent price, and you smoked it for the first time you realized this stuff is really strong and my \"price per dose\" is going to way cheaper than oxy. Of course then you do it all the time, then tolerance builds up, then a lot of people switched to injecting so they can feel the high more, then the tolerance builds more and now you hear about fent. You try fent and realize that the \"price per dose\" of fent is only like $1 to get high, as opposed to like $10 per dose with black tar, and so you have now arrived at the present situation in the USA. I'm currently of the opinion that there is no easy fix to this because millions of regular people are now addicted to opiates, and dont really care if they are more dangerous, they need opiates now just to feel normal and function in society. I think making oxy and heroin harder to get and therefore more expensive will only lead to an increase in fentanyl use, and that is obviously exactly what is happening right now. So the govt says they want to give fent dealers the death penalty, i guaruntee that is not going to do a damn thing to help the situation. I think the answer is making safer/weaker opiates CHEAP or FREE to currently addicted users so that there is no incentive to switch to the cheaper and more dangerous fentanyl. This is what has proven to work in Switzerland and England, giving people prescription of pure heroin for free (who are already addicted and cant stop). Obviously though we have basically created a giant problem that like keeps getting worse. And I think you need to look at the history of the Chinese governments programs in the past to get their population off opium to see any kind of similar situation with which to compare the USA/Canada's current situation (millions of 20-30 somethings addicted to heroin/fentanyl) which makes the supply of opiates much more easily obtainable for kids. So like now you see some high schools where 80% of the boys in 9th grade are smoking or shooting black tar in some towns. I have to say that \"the mexicans\" can be blamed to some extant, but they were just responding to a new market demand, and then the production exploded, and price went down, availablity went up and now the next generation is going to go through the whole same situation but instead of starting on OXY they go straight to heroin/fent. I think our \"free country/democracies\" here in north america are going to be dealing with a very specific opiate plague that will not affect similar countries in western europe. As far as i'm aware this opiate crisis is only considered a crisis in two countries Canada and USA (with the added drug war in Mexico combining for a giant disaster). I don't think our societies are as strong as in Europe and this could be like a plague that effects the next generation and the next generation until theres some drastic action taken similar to how the Chinese forced their people to get off opium. Will wait and see. I think the makers of suboxone are going to be making tens of billions, and treatment centers are going to be only successful businesses in alot of small towns. Having such a high percentage of the population addicted to powerful opiates is indeed a crisis. WHAT IS THE ANSWER? Time will tell.", "2_Subreddit": "opiates"}], "dwu4nge": [{"0_Comment Submission": "The ultimate Fentanyl and Analog thread", "1_Text": "google u47 reviews. There are hundreds of positive reviews, show me where they talk about how caustic it is. Just because you got \"u47\" and it was poison, doesnt therefore mean \"all u47 is poison\" EDIT:.ok now im reading about it and you may be right!", "2_Subreddit": "fentanyl"}], "dwu5eth": [{"0_Comment Submission": "Ppf experience (variant of paf)", "1_Text": "shooting fent is so sketchy to me. But i guess i almost died smoking maf which i didnt even think was possible. Thats crazy to hear u didnt get constipated from maf either. that was like one of the things that made me love it. Wish it was still around.", "2_Subreddit": "fentanyl"}], "dwu6lfl": [{"0_Comment Submission": "Ppf experience (variant of paf)", "1_Text": "no kidding? I had heard one or two people say the same thing about this paf variant", "2_Subreddit": "fentanyl"}], "dwu6o1f": [{"0_Comment Submission": "The ultimate Fentanyl and Analog thread", "1_Text": "interesting. I was not aware of that. I knew about that isou47 being caustic but didnt know about regular u47 causing bleeding damn well i guess good thing its gone haha", "2_Subreddit": "fentanyl"}], "dwu70q0": [{"0_Comment Submission": "The ultimate Fentanyl and Analog thread", "1_Text": "i think just saying that its available on DNM is technically against sourcing rules...or can you say that?", "2_Subreddit": "fentanyl"}], "dwu778q": [{"0_Comment Submission": "The ultimate Fentanyl and Analog thread", "1_Text": "Fav analogue: MAF definitely, and the fact i could use it every day and have zero constipation was like some form of amazing discovery for me. Seriously i hadn't pooped that comfortably in like 15 years on opiates. Any experts want to explain why MAF had that unique property?", "2_Subreddit": "fentanyl"}], "dwu7a6j": [{"0_Comment Submission": "I get like 2250$ a month take home pay. Methadone", "1_Text": "the big question: how early do you have to be in line at the clinic every morning?", "2_Subreddit": "opiates"}], "dwu7f1q": [{"0_Comment Submission": "Tried smoking ECP", "1_Text": "ECP: emergency contraceptive pill? \nSorry i'm pretty experienced with all kinds of opiates and never heard ECP before, what exactly is it?", "2_Subreddit": "opiates"}], "dwu7pl7": [{"0_Comment Submission": "Prolong the life of a user", "1_Text": "I think opiates are by far the hardest type of drug to try to not eventually use every day. I used only 1 day a week at first, then 2 days a week, then 3 days a week, then all of a sudden after 3 days in a row i had the most horrible feeling i'd ever experienced, and nobody had ever informed me about: withdrawals. Opiate withdrawals are basically the only reason we are all here. That and the fact that opiates when you are using them making you feel great (well at least for a while). Just imagine the worst flu combined with an anxiety attack, where you cant eat or sleep and time moves so slow you literally just want to die. That is what happens once you become dependent. You may think you can manage it, that you are really smart and have strong self control. I am telling you opiates are much stronger, and it will basically ruin your life because then it's not about feeling good or getting high, your taking the drug just to feel normal. And that process can happen extremely fast, literally use OC80 or heroin for 3-4 days in a row and its gonna be your first taste of real hell. Then you will be like: oh now i understand why all those people were telling me not to even consider it. NOT TO MENTION THE CONSTIPATION! its like shitting rocks or wood logs", "2_Subreddit": "opiates"}], "dwu7s6z": [{"0_Comment Submission": "Kind of annoyed", "1_Text": "Fent problems", "2_Subreddit": "opiates"}], "dwvfjk1": [{"0_Comment Submission": "I get like 2250$ a month take home pay. Methadone", "1_Text": "oh thats cool, i've heard of people waiting in huge lines. My question is do you have to show up at a certain time in the morning? Like do you have to get up super early to be there by 8am? or can you just show up whenever?", "2_Subreddit": "opiates"}], "dwvfkbm": [{"0_Comment Submission": "Tried smoking ECP", "1_Text": "Ah thank you, i learned something new", "2_Subreddit": "opiates"}], "dwwg5dx": [{"0_Comment Submission": "The ultimate Fentanyl and Analog thread", "1_Text": "Great post, thank you for the info. I'm very intrigued by your comments on preventing over saturation of opiate receptors and increasing tolerance. You mentioned low dose naloxone, can you please elaborate on exactly how naloxone could be used to keep tolerance down and prevent over saturation? I recently obtained 2 nasal doses of naloxone as they are over the counter in my state now, but its very very expensive as insurance doesn't cover it/lower price at all. So i dont think it would be feasible/economical to use that unless your talking about really small doses? Maybe watering down one of those nasal spray doses to turn from 1 dose to 100 doses or something? (is it ok to talk about sourcing naloxone?)", "2_Subreddit": "fentanyl"}]}], "1_submissions": [{}]}]}