{"meowruffruffmeow": [{"0_comments": [{"dvh00q2": [{"0_Comment Submission": "I went to a safe injection site for the first time yesterday", "1_Text": "I think I remember GWBush saying he would seriously be pissed when this was first talked about. To the point that it would seriously disrupt border relations.\nSo glad it didn’t stop you guys. I really wish Canada didn’t hate me so much. I’m afraid I’ve had nothing but trouble in good ol’ Blaine, Washington. No fun being whisked away to a room and men with mp5s stand around while they check you out further.  \nI am officially banned from canadia😪", "2_Subreddit": "opiates"}], "dvhu0db": [{"0_Comment Submission": "I went to a safe injection site for the first time yesterday", "1_Text": "Yes unfortunately forever. This was before the dui deal started but I heard about that. I guess you can’t blame them. I have pals across the magic line that say it’s the same for them. I have to admit it feels weird that there’s a large portion of earth I can’t go to...", "2_Subreddit": "opiates"}], "dwpv4cy": [{"0_Comment Submission": "You can never go wrong with a good ol’ speedball", "1_Text": "The first time I did one was a send off as I was going away for a spell and it was a little more “blast off” than I expected and I spent the  following hour pacing around a hospital thinking I was dead for sure! Haha! It’s funny to me now but when it happened.. oh boy was I scared to death!", "2_Subreddit": "opiates"}], "dwpvp2r": [{"0_Comment Submission": "Question about overdose information I found in article + question about snorting heroin <3", "1_Text": "I don’t think this can be answered so black and white. I feel like there’s a difference between lethal dose and overdose though. I mean if your talking about finding out the hard/bad way that you copped something way better than your used to and simply can’t handle it then your probably going out right then. However I have personally overdosed (collapased and out for the count) some time after initial use. This situation even more so if you use different drugs with varying “legs” on them.  Benzos and opiates especially.", "2_Subreddit": "opiates"}], "dwpw1ae": [{"0_Comment Submission": "so i actually died", "1_Text": "Damn that was a close one! Good luck in whatever you decide to do. As far as using or not I mean. \nOne thing I have always kinda had a personal problem with though, why do you call it selfish? I dont mean any disrespect by any means, really. But is it the same way people refer to suicide as selfish?  Because I don’t see that at all. Maybe it’s just me. And maybe this is an inappropriate question but whatever I’m curious either way", "2_Subreddit": "opiates"}], "dwpw4c0": [{"0_Comment Submission": "/r/Opiates can be a depressing place, but after a lot of research and thought I have determined that this user is the best user of /r/Opiates and possibly the best person on Reddit too!", "1_Text": "I have found I’m only depressed when I dont have them .", "2_Subreddit": "opiates"}]}], "1_submissions": [{}]}]}