{"barondicklo": [{"0_comments": [{"dw7hbec": [{"0_Comment Submission": "Cambridge Analytica moving \"boxes\" out of their office before the search warrant", "1_Text": "Would be a shame if they somehow got leaked by \"hackers\" or maybe some disgruntled exemployee", "2_Subreddit": "pics"}], "dw86ol2": [{"0_Comment Submission": "Bless up.🙏🏿", "1_Text": ">mini-McMansion\n\nLol so a regular house?", "2_Subreddit": "BlackPeopleTwitter"}], "dw8716n": [{"0_Comment Submission": "Bless up.🙏🏿", "1_Text": "Not really both of those are not mc mansions. Ones a big house and the other is just a bigger house. Houses have different styles, doesnt make them mc mansions lol. Quit hating. Like seriously that dude who called the first house a mini mcmansion is just hating lol theres no such thing.", "2_Subreddit": "BlackPeopleTwitter"}], "dw87m8g": [{"0_Comment Submission": "Bless up.🙏🏿", "1_Text": "Lol really it is wrong and pretentious the author just sits there and makes fun of the most petty pointless stuff. There are some beautiful homes listed but for whatever reason the author just picks and chooses the smallest most annoying things to pick apart. In one house they had a wine cellar and he just wrote in paint all over the picture making fun of them calling alcoholics. Dudes got a weird chil on his shoulder making fun of people who worked hard for their stuff, its kind of a sad way to live your life.", "2_Subreddit": "BlackPeopleTwitter"}], "dw88rbb": [{"0_Comment Submission": "Bless up.🙏🏿", "1_Text": "Yeah. Idk i only looked at one of the links on his certified dank page where he makes fun of peoples houses. He also said something about how snobbery intensifies in the wine cellar pic. And im just like why? Youre calling them snobs and alcoholics because they like wine and put somewhere to store their wine in their house? The only person who is being snobby is the author. But yeah like I said I could only stomach going through one of his links before getting angry. I just dont like the thought of putting people down and judging them, especially since most people have to work so hard to put themselves and their family in such a beautiful home, only to be mocked and judged by some prick on the Internet who begs people to pay him.through patreon' sorry just doesnt sit right with me. Thanks for your reply I enjoy a conversation where people dont cuss each other out for having different opinions.", "2_Subreddit": "BlackPeopleTwitter"}], "dw8aaxd": [{"0_Comment Submission": "Sick haircut", "1_Text": "Lol most kitchens are staffed by people who have been to jail or prison. Its a job that doesnt care or judge about your past, has allot of upward mobility as long as you put in the work. I started as a dishwasher and moved up to prep work and a line cook, chef was pulling me aside all the time to teach me new things. I left and started my own business as a freight broker but the kitchen is where i learned I was still worth something when i stopped getting locked up.", "2_Subreddit": "Justfuckmyshitup"}], "dw8alyi": [{"0_Comment Submission": "Sick haircut", "1_Text": "That depends on how you market yourself, when I was locked up I worked in the animal shelter and the kitchen. I put down the my kitchen work as experience when I got out and it got me a job in the kitchen on the outside... I could have done the same with my time working at the animal shelter allot of dog grooming places or dog daycares or anywhere that deals with animals requires you to have experience working with animals and at the animal shelter we had to deal with all kinds of aggressive dogs, injured dogs, we assisted in giving them temperment tests, had to help the techs assess them or even put them down. Point being is if you make use of your time and market it is a positive learning experience you will catch a break eventually, once you get your foot in the door it gets easier, I promise bro.", "2_Subreddit": "Justfuckmyshitup"}], "dw9auxi": [{"0_Comment Submission": "Ahh, the nostalgia of VHS tapes. Let's try this tape I found in a thrift shop....", "1_Text": "Other people who the nobel prize that year\n\n>Other winners at this years awards include:\n\n>Patricia Yang (Georgia Institute of Technology, US) for testing the biological principle that nearly all mammals empty their bladders in about 21 seconds;\n\n>Mark Dingemanse (Max Planck Institute for Psycholinguistics, The Netherlands), for discovering that the word \"huh?\" (or its equivalent) seems to exist in every human language;\n\n>Elisabeth Oberzaucher and Karl Grammer (University of Vienna, Austria) for trying to use mathematical techniques to determine whether and how Moulay Ismael the Bloodthirsty, the Sharifian Emperor of Morocco, managed, during the years from 1697 through 1727, to father 888 children;\n\n>Bruno Grossi (University of Chile) and colleagues, for observing that when you attach a weighted stick to the rear end of a chicken, the chicken then walks in a manner similar to that in which dinosaurs are thought to have walked.\n\n\n\nLol", "2_Subreddit": "gifs"}], "dw9mzpk": [{"0_Comment Submission": "Ahh, the nostalgia of VHS tapes. Let's try this tape I found in a thrift shop....", "1_Text": "That makes so much more sense. Thanks for clearing that up", "2_Subreddit": "gifs"}], "dwbfnxc": [{"0_Comment Submission": "Employees of IKEA, what are some of the worst family meltdowns you have seen?", "1_Text": "Lol I read this in Michelles voice from.full house. It has got to he at least 15 years since I watched the show, neat, thanks?", "2_Subreddit": "AskReddit"}], "dwblmjl": [{"0_Comment Submission": "[Serious] What is the creepiest Reddit post you've read?", "1_Text": "Have seen the one with the guy who shot off his penis because god told him to and he ate it. He asked reddit the best way to cut the rest of it off or kill himself i cant remember. It was actually super sad and people where telling him to get help, idk what happened\n\nThis guy, https://www.reddit.com/user/worthless319\n\nPretty sure he killed himself", "2_Subreddit": "AskReddit"}], "dwgmfgp": [{"0_Comment Submission": "We can't see a face but the camera not moving at the end perfectly describes the pain inside", "1_Text": "Dude thats what pets are for. I just call my dog over and hell lick the floor clean same difference here just with a bearded dragon lol", "2_Subreddit": "WatchPeopleDieInside"}], "dwmsnii": [{"0_Comment Submission": "Paediatricians, what’s the strangest behaviour you’ve seen in a kid?", "1_Text": "Yeah, coke Is never supposed to burn", "2_Subreddit": "AskReddit"}], "dwrkz1k": [{"0_Comment Submission": "When your co worker comes to you with 2mg dillies and asks if you know anyone that can sell them so you get them for half the price for yourself 👌🏾 #DontKnoHeDaPlug", "1_Text": "Erub libnani =P", "2_Subreddit": "opiates"}], "dwtwtxk": [{"0_Comment Submission": "Over 2 grand right here", "1_Text": "How many do you get? And how much do you think one of them go for?", "2_Subreddit": "opiates"}], "dwtxt3z": [{"0_Comment Submission": "Over 2 grand right here", "1_Text": "That's fair. Shit I was thinking there was typical script numbers in there like 90 or 180 at the most. You bang? Lol wait opana or oxy?", "2_Subreddit": "opiates"}], "dwtzgb1": [{"0_Comment Submission": "I'm Eric Hafner, I'm running for U.S. Congress in Portland, Oregon (OR-3). I want to legalize all drugs, including opiates, but offer ibogaine therapy too, and free drugs for addicts via prescription.", "1_Text": "Lol America will collapse before banks become nationalized. I'm sorry dude I like you but you know damn well some of the things you are promissing will never happen in this country. It makes it kind of hard to take you seriously.", "2_Subreddit": "opiates"}], "dwtztf7": [{"0_Comment Submission": "I'm Eric Hafner, I'm running for U.S. Congress in Portland, Oregon (OR-3). I want to legalize all drugs, including opiates, but offer ibogaine therapy too, and free drugs for addicts via prescription.", "1_Text": "Dude that's apples to oranges. Who is president is peanuts compared to fucking with the fed.... You and I both know that.", "2_Subreddit": "opiates"}], "dwvdu4p": [{"0_Comment Submission": "What’re your other vices?", "1_Text": "Never heard anyone around call it anything but pop oher than that people just say sprite Pepsi or coke. Would definitely think you're a weirdo for calling it soda lol. Also why can't it be warmer fuck this", "2_Subreddit": "opiates"}], "dww0xeq": [{"0_Comment Submission": "What is the most unreasonable thing you've been asked to do at work?", "1_Text": "Lol dude forget H, get them hooked on meth. Not only will they make themselves useful by speed cleaning your house when they are high, they never eat any food in your fridge and they turn into sex demons.\n\n\n\n\nFunny where reddit draws the line on what's ok to laugh at. Why are you -7, with some retard asking if you're serious lol. WTF?", "2_Subreddit": "AskReddit"}], "dwwq578": [{"0_Comment Submission": "Not seeing a lot of upside to getting my Firearm Security License", "1_Text": "LMFAOOOOOO ok Im just a random dude checking out this subject but I cant hold it in any longer lol. ABORT ABORT, holy shit dude I can't believe he said any of that. When you said he was exactly what you make fun of here, I was wondering what that was. Then he made that last comment lol. Jesus Christ what a douche.", "2_Subreddit": "securityguards"}], "dwy5a0k": [{"0_Comment Submission": "[CA, USA] Group of homeless people living 6' away from our window. They keep trying to force themselves onto our side.", "1_Text": "Stink bombs the fuck out of them", "2_Subreddit": "legaladvice"}], "dwy5cq8": [{"0_Comment Submission": "[CA, USA] Group of homeless people living 6' away from our window. They keep trying to force themselves onto our side.", "1_Text": "Lol you could just stick your arm out the window and spray oc spray or bear spray downwind in the direction of their camp... will still irritate the fuck out of their eyes and noses and throats.", "2_Subreddit": "legaladvice"}], "dwy5jyj": [{"0_Comment Submission": "Ktown Homeless Encampment/Chop Shop Update -- they caught me recording and threw something at me/my window", "1_Text": "You should just start stink bombing the fuck out of their camp from your window, buy a couple cans of bear spray and let that shit run wild all in their shit. Fuck it you wanna throw things at my window? OK.", "2_Subreddit": "LosAngeles"}], "dwy9bae": [{"0_Comment Submission": "Maybe he should just stop being poor!", "1_Text": "Ummmm, pharmacy tech or pharmacist??? Being a pharmacy tech as a side hustle makes sense. Going through all of pharmacy school and doing all the schooling to become a teacher as well for you to only work as a pharmacist part time makes no sense. Teachers get paid shit, pharmacists get paid well. Both get treated like shit don't get me wrong, ones dealing with the general public in a retail setting the other is dealing with their shitty children. It's just something isn't adding up about your post, I must be miss understanding someth ing.", "2_Subreddit": "LateStageCapitalism"}]}], "1_submissions": [{"65z4rz": [{"0_Title": "Anyone withdrawing and needing a laughs, heres bizarres take on \"It Was A Good Day\" lmfao", "1_Text": "Would be a shame if they somehow got leaked by \"hackers\" or maybe some disgruntled exemployee", "2_Subreddit": "WNOD"}], "6604nl": [{"0_Title": "From soil to syringe", "1_Text": "Would be a shame if they somehow got leaked by \"hackers\" or maybe some disgruntled exemployee", "2_Subreddit": "opiates"}], "69u7dy": [{"0_Title": "Woman Arrested After Trying To Smuggle $45,000 Worth Of Heroin Taped To Her Butt Into The U.s.", "1_Text": "Would be a shame if they somehow got leaked by \"hackers\" or maybe some disgruntled exemployee", "2_Subreddit": "opiates"}], "6jxy6g": [{"0_Title": "Made a sub for me about my dead GF", "1_Text": "Would be a shame if they somehow got leaked by \"hackers\" or maybe some disgruntled exemployee", "2_Subreddit": "modhelp"}], "6jy24k": [{"0_Title": "Need help dead gf memorial", "1_Text": "Would be a shame if they somehow got leaked by \"hackers\" or maybe some disgruntled exemployee", "2_Subreddit": "redditrequest"}], "6m22q1": [{"0_Title": "Burned the fuck out of my fingers nodding", "1_Text": "Would be a shame if they somehow got leaked by \"hackers\" or maybe some disgruntled exemployee", "2_Subreddit": "opiates"}], "6xnsv0": [{"0_Title": "Fresh outta jail", "1_Text": "Would be a shame if they somehow got leaked by \"hackers\" or maybe some disgruntled exemployee", "2_Subreddit": "opiates"}], "74zyrb": [{"0_Title": "Finally! Got blessed!!!", "1_Text": "Would be a shame if they somehow got leaked by \"hackers\" or maybe some disgruntled exemployee", "2_Subreddit": "opiates"}], "78x2v1": [{"0_Title": "Gift card advice for yall", "1_Text": "Would be a shame if they somehow got leaked by \"hackers\" or maybe some disgruntled exemployee", "2_Subreddit": "opiates"}], "79zk7b": [{"0_Title": "Happy Halloween", "1_Text": "Would be a shame if they somehow got leaked by \"hackers\" or maybe some disgruntled exemployee", "2_Subreddit": "opiates"}], "7d0ui1": [{"0_Title": "Emotional roller coaster.", "1_Text": "Would be a shame if they somehow got leaked by \"hackers\" or maybe some disgruntled exemployee", "2_Subreddit": "opiates"}], "7p3n2b": [{"0_Title": "Telling your dboy to shove that dope up his ass.", "1_Text": "Would be a shame if they somehow got leaked by \"hackers\" or maybe some disgruntled exemployee", "2_Subreddit": "opiates"}], "7tdn1b": [{"0_Title": "[H] $60 Amazon GC [W] 85% Google Wallet", "1_Text": "Would be a shame if they somehow got leaked by \"hackers\" or maybe some disgruntled exemployee", "2_Subreddit": "giftcardexchange"}], "7tg9l7": [{"0_Title": "[H] $120 Amazon GC [W] 85% Google Wallet", "1_Text": "Would be a shame if they somehow got leaked by \"hackers\" or maybe some disgruntled exemployee", "2_Subreddit": "giftcardexchange"}], "7tmbkm": [{"0_Title": "[H] $75 Amazon GC [W] 85% Google Wallet", "1_Text": "Would be a shame if they somehow got leaked by \"hackers\" or maybe some disgruntled exemployee", "2_Subreddit": "giftcardexchange"}], "7tuef3": [{"0_Title": "[H] $90 Amazon GC [W] 85% Google Wallet", "1_Text": "Would be a shame if they somehow got leaked by \"hackers\" or maybe some disgruntled exemployee", "2_Subreddit": "giftcardexchange"}]}]}]}