{"Native_Nod": [{"0_comments": [{"dwlaxsh": [{"0_Comment Submission": "10 minutes, papi", "1_Text": "oof", "2_Subreddit": "opiates"}], "dwndrpc": [{"0_Comment Submission": "Policy Change regarding human consumption", "1_Text": "Like the dark net subs? Or were these just drug related subs?? Do you have a link to the banned list?\n\nThis is super concerning", "2_Subreddit": "opiates"}], "dwndv4i": [{"0_Comment Submission": "Policy Change regarding human consumption", "1_Text": "Imo we should all stay here but make sure everyone knows the contingency plan if things go to hell\n\nWhich is pretty much guaranteed with these new rules\n\nThis is so fucked", "2_Subreddit": "opiates"}], "dwndyt0": [{"0_Comment Submission": "Policy Change regarding human consumption", "1_Text": "Exactly, there's no \"legal action\" problem at all as long as a sub isn't facilitating illegal transactions. Like what, you won't be able to talk about crimes you commited on reddit either? Ex cons can't tell their stories? It doesn't make any fucking sense \n\n\"Human consumption\" lmao. I can't believe this shit", "2_Subreddit": "opiates"}], "dwne1bb": [{"0_Comment Submission": "Policy Change regarding human consumption", "1_Text": "my dog **jeff**", "2_Subreddit": "opiates"}], "dwne5jc": [{"0_Comment Submission": "Policy Change regarding human consumption", "1_Text": "THIS IS SO FUCKED", "2_Subreddit": "opiates"}], "dwnf363": [{"0_Comment Submission": "Policy Change regarding human consumption", "1_Text": "I feel like it's a purposely impossible restriction just so they can boot the drug subs eventually. They're worried about advertisers and money im sure. No one is coming after drug sites with legal action unless they're facilitating sales.\n\nIs there a way to autofilter certain words in posts like on 4chan? Like 'I' automatically changes to \"My friend\", \"my\" to \"his\", etc? That's the only way I could see this working.\n\nGod forbid we all really start using SWIM lmao. This isn't drugs-forum\n2006\n\nAlso, I've been saying this for years, but I really, really think it's about time we had an /r/opiates contingency plan, just in case this place does get banned. So at least everyone knows where to regroup afterwards", "2_Subreddit": "opiates"}], "dwnqy6k": [{"0_Comment Submission": "Policy Change regarding human consumption", "1_Text": "Actually yeah now that I think about it you're probably right.\n\nI mean enforcing \"swim\", there's noo way", "2_Subreddit": "opiates"}], "dwnr045": [{"0_Comment Submission": "Happy April Fool's, guys.", "1_Text": "Y'all got me good", "2_Subreddit": "opiates"}], "dwp5576": [{"0_Comment Submission": "LiL PEEP - LiL Kennedy [prod Nedarb]", "1_Text": "live forever is def tops", "2_Subreddit": "hiphopheads"}], "dwr8s6n": [{"0_Comment Submission": "Found in /trashy. While y'all striking out on Whisper this chick letting the drugs find her.", "1_Text": "STORY TIME STORY TIME", "2_Subreddit": "opiates"}], "dwr8xzm": [{"0_Comment Submission": "An oldie but a goodie", "1_Text": "i love mac demarco now", "2_Subreddit": "opiates"}], "dwrdkh4": [{"0_Comment Submission": "IV use is not for everyone", "1_Text": "Similar situation here. \n\nUsed everyday for 4 years, been clean 4 months now. But only shot up 4 times or so the entire time. I liked it but managed to stop myself before getting too deep into it. And it def wasn't worth it at the beginning. I'm sure I would have gotten better at it tho\n\nThat being said tho that is not at all typical and I've seen dozens of ppl stronger than me start using the needle and never look back so tread carefully", "2_Subreddit": "opiates"}], "dwt9h0c": [{"0_Comment Submission": "What common product has a feature you’re not sure everyone is aware of?", "1_Text": "its completely made up lol", "2_Subreddit": "AskReddit"}], "dwt9ifq": [{"0_Comment Submission": "What common product has a feature you’re not sure everyone is aware of?", "1_Text": "oof", "2_Subreddit": "AskReddit"}], "dwtgdn7": [{"0_Comment Submission": "Why does dope have such a bad stigma?", "1_Text": "Not stupid.\n\nFor me it was the beginning of a bigger addiction because pills are expensive, dope is cheap. So I was able to use more.i saved a lot of money at first until my tolerance doubled and then tripled and then quadrupled until I was spending twice the money on dope than I was on pills in the first place\n\nAnd suddenly shooting up doesn't seem so bad because you switched to heroin and you don't feel any different.. it can't be that bad. So you start and repeat the same cycle again.\n\nBy that time the withdrawals are way worse because your tolerance is so high so quitting feels like it's out of the question.\n\nAnd I went through all this with Tar, before fent was as big as it is now. So this doesn't even take into account the massive increased risk of overdose with all the fent cut dope around now days.\n\nSo yeah, switching to dope is some serious shit, or at least has the potential to be. It's just one of those gradual, eventual stepping stones down into the abyss of rock bottom addiction we all take", "2_Subreddit": "opiates"}], "dwtm3dl": [{"0_Comment Submission": "Kinda Planning a Relapse.. But Im on Subs. Practical Advice Please", "1_Text": "Honestly thinking like that kinda helps me stay clean. \n\nLike if I really wanna get High I just think \"not today, it's not a good day for it. Maybe next week\". And I just keep doing that lol.\n\nIt's the same reason I don't keep track of my exact clean date. It drives me insane knowing exactly how long I've gone without dope", "2_Subreddit": "opiates"}], "dwtmhjj": [{"0_Comment Submission": "Kinda Planning a Relapse.. But Im on Subs. Practical Advice Please", "1_Text": "5 to 7 days?? I know some people tht say at least 3 but 5 to 7, holy shit. \n\nI mean I've done this before and it didn't take that long, I think it was twoish days after 2 months or so on sub. But at the time I didn't have a job to deal with and appearances to keep. My buddy always waits 2 and he's been on them for a couple years. He slams and I don't tho so who knows.\n\n I'm just trying to figure out how to do this and not be in withdrawal hell at work for half the week. So I'm mostly wondering when it's safe to take subs after I use", "2_Subreddit": "opiates"}], "dwtmm44": [{"0_Comment Submission": "Kinda Planning a Relapse.. But Im on Subs. Practical Advice Please", "1_Text": "I will mate, thanks for the warning. I smoke tar not slam so OD shouldn't be too big of a concern \n\nSo taking my usual dose the day after I use should be fine? Should I wait till I feel sick after using? Or does it not matter", "2_Subreddit": "opiates"}], "dwtmnl6": [{"0_Comment Submission": "Kinda Planning a Relapse.. But Im on Subs. Practical Advice Please", "1_Text": "Thanks bud, I'm gonna do some research on this", "2_Subreddit": "opiates"}], "dwtmvz0": [{"0_Comment Submission": "Kinda Planning a Relapse.. But Im on Subs. Practical Advice Please", "1_Text": "That's exactly where I was last year. It's great for a while, you get the best of both worlds. People pat you on the back while you get High af. Lost literally everything when everyone found out though and I'm starting from scratch again now. \n\nAt least I have my youth, I guess", "2_Subreddit": "opiates"}], "dwtmxsm": [{"0_Comment Submission": "Kinda Planning a Relapse.. But Im on Subs. Practical Advice Please", "1_Text": "Wait so do you know how long he has to wait to use? And how long after he uses does he take his sub? And is he sick for a lot of the inbetween time?", "2_Subreddit": "opiates"}], "dwvbmoo": [{"0_Comment Submission": "Kinda Planning a Relapse.. But Im on Subs. Practical Advice Please", "1_Text": "Nah it was very informative man. Thanks for the response, it doesn't seem like its worth it tbh", "2_Subreddit": "opiates"}], "dwvdhol": [{"0_Comment Submission": "Mark Zuckerberg refuses to step down or fire staff over Facebook 'mistakes'", "1_Text": "> People have developed some sick mental dependence on social media over the last decade.\n\nbut you just contradicted your point in the second sentence of your post. this is about all those people that have that sick dependence, not everyone else", "2_Subreddit": "worldnews"}], "dww2xke": [{"0_Comment Submission": "if only it was true...", "1_Text": "Try actually learning about addiction and then come back and comment\n\nnobody wants to be a drug addict", "2_Subreddit": "opiates"}]}], "1_submissions": [{"3xalij": [{"0_Title": "Fuck dude", "1_Text": "oof", "2_Subreddit": "opiates"}], "4mraf8": [{"0_Title": "Oops", "1_Text": "oof", "2_Subreddit": "WTF"}], "4tv1qi": [{"0_Title": "Hey yall, first time IV here, could really use some advice..", "1_Text": "oof", "2_Subreddit": "opiates"}], "4zfuge": [{"0_Title": "Saw this, thought of you guys", "1_Text": "oof", "2_Subreddit": "opiates"}], "50sd92": [{"0_Title": "What is the best flavor of Ice Cream and why is it Butter Pecan?", "1_Text": "oof", "2_Subreddit": "opiates"}], "550bmg": [{"0_Title": "Lost my Best Friend", "1_Text": "oof", "2_Subreddit": "opiates"}], "5imauu": [{"0_Title": "Its been a good ~yr run. My taper begins tomorrow. Wish me luck. Here's one more nod to getting healthy. I'm gonna miss all you beautiful fuckers", "1_Text": "oof", "2_Subreddit": "opiates"}], "5vnvdv": [{"0_Title": "30 days clean today. Just wanted to let you guys know I'm not dead and you can do it if you really want to", "1_Text": "oof", "2_Subreddit": "opiates"}], "61kpfn": [{"0_Title": "Relapse:( Week long binge after 30 days clean.. Going to stop it before it spirals out of control. Thoughts?", "1_Text": "oof", "2_Subreddit": "opiates"}], "62jqm6": [{"0_Title": "Any Joanna Newsom fans here? One of my fav albums of all time. Followup Q: What's ur fav album for jus kicking back after getting high?", "1_Text": "oof", "2_Subreddit": "opiates"}], "6fzxs4": [{"0_Title": "Do they do this shit just to fuck with us????? This was literally all he sent.", "1_Text": "oof", "2_Subreddit": "opiates"}], "6j6nix": [{"0_Title": "Any Podcast fans out there?", "1_Text": "oof", "2_Subreddit": "opiates"}], "6km0rn": [{"0_Title": "/r/opiates? Apshhh... Today it's been more like...", "1_Text": "oof", "2_Subreddit": "opiates"}], "6oq58q": [{"0_Title": "My girlfriend went to stay with family in the South this summer. This giant housefly was stuck in the porch stickytrap this morning. Is this normal for the South?? As a California resident this is completely \"WTF\" worthy", "1_Text": "oof", "2_Subreddit": "WTF"}], "6ybefo": [{"0_Title": "Guys... I think I may be on to something.", "1_Text": "oof", "2_Subreddit": "Petscop"}], "6ydbte": [{"0_Title": "The Paleskowitz Connection", "1_Text": "oof", "2_Subreddit": "Petscop"}], "78ejm7": [{"0_Title": "What unexplainable experience have you never told anyone about, for fear of sounding completely crazy?", "1_Text": "oof", "2_Subreddit": "AskReddit"}], "78i5ig": [{"0_Title": "[Serious] What strange/unexplainable experience have you never shared with anyone, for fear of sounding completely insane?", "1_Text": "oof", "2_Subreddit": "AskReddit"}], "7ia2hb": [{"0_Title": "Lil Peep; Clones & Copycats", "1_Text": "oof", "2_Subreddit": "GothBoiClique"}], "7k1qp8": [{"0_Title": "Whichever mod added the cute little \"floating text\" blurbs when you upvote a post...", "1_Text": "oof", "2_Subreddit": "opiates"}], "7pup7a": [{"0_Title": "For those here with MASSIVE tolerances...", "1_Text": "oof", "2_Subreddit": "fentanyl"}], "7tvghc": [{"0_Title": "*ATTENTION ALL FUCCBOIS AND FUCCGIRLS*", "1_Text": "oof", "2_Subreddit": "opiates"}], "83zpuh": [{"0_Title": "Anybody wanna cop me some shit from the Sus Boy drop? Ima be out of town", "1_Text": "oof", "2_Subreddit": "GothBoiClique"}], "83zwbb": [{"0_Title": "Wanna crowd-source catching earons with me? Keep an eye out for a China Set like this!", "1_Text": "oof", "2_Subreddit": "EARONS"}], "89u1uk": [{"0_Title": "Kinda Planning a Relapse.. But Im on Subs. Practical Advice Please", "1_Text": "oof", "2_Subreddit": "opiates"}]}]}]}