{"KKoz88": [{"0_comments": [{"dswiad3": [{"0_Comment Submission": "I always wonder ?", "1_Text": "Call the Dboy have him drive out to your house,or you and a friend who wants to cop go together lol", "2_Subreddit": "opiates"}], "dswijlm": [{"0_Comment Submission": "I always wonder ?", "1_Text": "Just say your going to a friends to\"PAY THEM BACK FOR MONEY YOU BORROWED\" or something like that", "2_Subreddit": "opiates"}], "dswiog2": [{"0_Comment Submission": "I always wonder ?", "1_Text": "In all honesty its not there business. imo Lol", "2_Subreddit": "opiates"}], "dswiqxm": [{"0_Comment Submission": "Movie time!!", "1_Text": "The Justice League!!", "2_Subreddit": "opiates"}], "dswlknq": [{"0_Comment Submission": "Movie time!!", "1_Text": "Ok well did you find something to watch yet?", "2_Subreddit": "opiates"}], "dsz0ewb": [{"0_Comment Submission": "Soma guys. No one told me", "1_Text": "Ive read that theirs a mix called the holy trinity or something like that Mixing \"Soma\" \"oxy\" and a Bezo or Soma, hydro and a benzo is supposed to be \"HEAVENLY\" lol so you had 2 of the three but the reports say the combo is deadly more so than just 1 or 2 of the combo.....Be safe ☺", "2_Subreddit": "opiates"}], "dtgpvig": [{"0_Comment Submission": "When I don't have heroin...", "1_Text": "All the time", "2_Subreddit": "opiates"}], "dtyvyi5": [{"0_Comment Submission": "Found in a Goodwill parking lot", "1_Text": "Atleast theh were using protection because we dont want people that have no shame in throwing that out in public procreating lol", "2_Subreddit": "trashy"}], "dubcowy": [{"0_Comment Submission": "How much codeine do I need to take to test positive for a 50ng/ml test?", "1_Text": "As Far as i know they cant test for mg etc just for the drug to show up in your system", "2_Subreddit": "opiates"}], "duwah7q": [{"0_Comment Submission": "This tweaker from my hometown", "1_Text": "I think that dress costs more than the trailer Lol", "2_Subreddit": "trashy"}], "duwb6jo": [{"0_Comment Submission": "Sometimes I see things on here that remind me I grew up trashy, and am not anymore. Anyone else? Can we start a thread about the things we've seen that remind us of our trashy past/upbringing or is that too off topic?", "1_Text": "Oh i know!! I was raised trashy. my mom used to come to my school in her zebra pj pants hair messy she did it so often other kids knew when she was walking up to the school my mom became the zebra pants lady!!! and my uncle would show up with dirty holy shirts on big ol beer belly hanging out. He used to work nights and constantly fell asleep during the day while smoking and had all sorts of cigarette burns on his clothes omg sooo embarrassing.also they my mom is one if those people who get all rude and bitchy towards people for the smallest things lol.It gets better my mom married a man who was in prison for Rape while he was in prison and he finally got out after 15 years moved in and at the time my husdand and i with our 5 year old were living with her to save up for a place and he moved in had her loose her house and made us homless because life has to be about him and everything about him with my mom hes a real piece of work i could go on and on.", "2_Subreddit": "trashy"}], "duyfmm5": [{"0_Comment Submission": "I thought you were being sarcastic.", "1_Text": "u/Moravinn", "2_Subreddit": "ImGoingToHellForThis"}], "dv48rw6": [{"0_Comment Submission": "Someone tried to scam me today", "1_Text": "Who the hell would give a shit about a 15$ itunes card that much that there blowing up your phone! People these days SMDH lol", "2_Subreddit": "opiates"}], "dv4945j": [{"0_Comment Submission": "Desperate help", "1_Text": "Drink lots of water and take otc anti diarrhea meds even if you dont have diarrhea!force yourself to eat even things like yogurt or applesauce or even pudding. I know its hard.Best of luck to you!!!", "2_Subreddit": "opiates"}], "dv49coe": [{"0_Comment Submission": "First attempt kicking heroin using subutex.", "1_Text": "You break it up first into 4 quarters then go from their down 1 quarter would be 2mg thats how i do it i went by that scale or something similar to it i broke the pills up though into quarters after that", "2_Subreddit": "opiates"}], "dv7060y": [{"0_Comment Submission": "Nurse Jackie", "1_Text": "Love it watched every season twice so far", "2_Subreddit": "opiates"}], "dvu15vg": [{"0_Comment Submission": "Problems with minor demon", "1_Text": "Salt across your door way make it clear NOTHING is welcome", "2_Subreddit": "Paranormal"}], "dvu2201": [{"0_Comment Submission": "My friend just did a big shot and had a seizure, now he can’t talk", "1_Text": "Thankfully he went in after seizures its crucial for treament.PLEASE update on what they say!!!", "2_Subreddit": "opiates"}], "dvu3zj0": [{"0_Comment Submission": "Problems with minor demon", "1_Text": "Absolutely!!! Burning sage is a good one too!", "2_Subreddit": "Paranormal"}], "dvu49um": [{"0_Comment Submission": "How to track down an apparition’s name?", "1_Text": "Did you google the name with the word obituaries? maybe try that?", "2_Subreddit": "Paranormal"}], "dvvepwk": [{"0_Comment Submission": "First time oxycontin, any tips?", "1_Text": "If this is your first time id swallow like maybe half to a quarter and then see how you feel,go from their ad a quarter etc its what you feel comfortable with aswell BE SAFE ofcourse", "2_Subreddit": "opiates"}], "dw0dmj0": [{"0_Comment Submission": "New some advice cause I'm a piece of shit.", "1_Text": "5 days should be enough time to detox", "2_Subreddit": "opiates"}], "dwfajqa": [{"0_Comment Submission": "Crazy shit my roommate says volume 3 : hardcore edition", "1_Text": "Omg sounds like my friends sister, she would insist that eminem was her husband and he had to come get her she waa always mumbling things and then out if nowhere she would yell MARSHALL you better come pick me up lol", "2_Subreddit": "opiates"}], "dwghesh": [{"0_Comment Submission": "Non-user here, I have tramadol questions!", "1_Text": "They will be fine. but i did read the potency will decrease idk how true it is though.still ok to take but idk how strong they will be by then", "2_Subreddit": "opiates"}], "dwxximf": [{"0_Comment Submission": "Question on Naltrexone", "1_Text": "30 hours or more should be okay thats how i do it.", "2_Subreddit": "opiates"}]}], "1_submissions": [{"7mj0me": [{"0_Title": "Child hood Repressed Memory", "1_Text": "Call the Dboy have him drive out to your house,or you and a friend who wants to cop go together lol", "2_Subreddit": "Paranormal"}], "7mrpnp": [{"0_Title": "Suboxone", "1_Text": "Call the Dboy have him drive out to your house,or you and a friend who wants to cop go together lol", "2_Subreddit": "opiates"}], "7r0gh6": [{"0_Title": "This is funny as hell to me hope you guys enjoy this too", "1_Text": "Call the Dboy have him drive out to your house,or you and a friend who wants to cop go together lol", "2_Subreddit": "opiates"}]}]}]}