{"GoLakersGo": [{"0_comments": [{"dpoqwi5": [{"0_Comment Submission": "Boyfriend robbed pharmacy today.....", "1_Text": "Hmmmm like I said, I am NOT a lawyer and have NO IDEA, but my thoughts would be he does have a lot of things that will help....the most IMPORTANT being no priors. That is going to help tremendously considering he is 37 and has NEVER been in trouble. Thats actually REALLY lucky. \n\nThe fact that he has people that will speak positivley about his charecter also helps a lot, especially if the employees at the walgreens themselves are willing to make a statement, and say something like he wasnt threatining. In CA (thats where I lived most of my life) he would have MORE than likely been sent to some drug diversion program. I know the sout/Alabama is a hole new ball game....I dont know much about the state, but I would THINK there would be a small chance he doesnt see prison. But like I said I no nothing about Bama. \n\nBut yea like almost everyone is saying here, lawyer up! Im so sorry you are going through this, you sound like a good gal. I can only imagin\n\nI can only imagine how scary this is, but know like all things, in time, things will be fine! Take care girl and good luck! \n\n*edit - I didnt want to sound racist, but I think its proven (through statistics at least) that him being clean cut and white will help. I would think (i know its stereotyping) an Alabama Judge would be more lenient on a white family man then they would be on someone of color. So yea sorry to anyone if I sounded racist there.", "2_Subreddit": "opiates"}], "dpp8qj6": [{"0_Comment Submission": "I owe you guys an apology.", "1_Text": "Its ok. We were all young high schoolers at one point who thought the weed was the answer to everything when we first started smoking it.", "2_Subreddit": "opiates"}], "dpp8t3p": [{"0_Comment Submission": "Not sure if JJ or just a legit LEO", "1_Text": "Are you in Cali? With prop 47 (maybe 49) all drug possesion charges are just misdemeanors and a lot of times its not worth the cops time.", "2_Subreddit": "opiates"}], "dpqsd7c": [{"0_Comment Submission": "From a successful quitter, my thoughts on how to quit", "1_Text": "Dont be a dick he's trying to help.", "2_Subreddit": "opiates"}], "ds3elco": [{"0_Comment Submission": "Copping off Craigslist?", "1_Text": "I have copped off CL several times in the past. Be careful! Depending on what city/state your in you will most likely run into scammers rather than police. Here’s what I did. For the 1st time just get a small amount...$20-$40 worth. That way if you get burned your only out that. If they give some bullshit like $80 minimum be weary. Explain your afraid of getting burned and you want to keep it small the 1st time. Talk to the person if possible. You can tell a lot just by how someone sounds. Don’t meet in like a back alley or super secluded spot where you can get robbed/beat. If it sounds to good to be true it is! If they offer every drug under the sun be weary! There’s a lot of good threads in this sub with great advice! Do a search! I met my best plug off CL and never had any problems. I only did it 3 times meeting 3 diff people. 1 of my buddies got a gun put to his head his 1st time but succeeded the 2nd! Just be smart, be careful, and good luck!\n\nAlso wanted to add, be sure to check the stuff out! Sit with the bro in his or your car for a min before even getting to business. DONT ever let your $ walk. MAke sure the guy is clear on all this. Most will let you try some before you hand over cash. Also know CL dealers are like spiders, they are more afraid of you then you are of them! They are def running more of a risk dealing!\n\nAnother update: with one of the guys I met I sent a pic of the money I had with my phone number on a piece of paper so he knew I didn’t just get a pic online. He then sent a pic of the dope weighed out doing the same. Not everyone will be willing to do this though.", "2_Subreddit": "opiates"}], "ds5ydnk": [{"0_Comment Submission": "Looks like my days of opiates are over", "1_Text": "Sounds good! Get out while you still can! There are a ton of us on this sub who wish we never got introduced to H! Stay strong! DONT even fucking think about making the jump! You will come across pills again in your lifetime I can guarantee that! Don’t make the leap brother! Bite the bullet and play the waiting game, even if it’s years until you see another perk or Roxie! Are you currently an addict? If not all is good!", "2_Subreddit": "opiates"}], "ds6j6vq": [{"0_Comment Submission": "(non opiate user) I’m a Pharmacy Technician and I thought this was pretty funny", "1_Text": "Yeah it’s probably fake but this scenario I guarantee has played out before. I hate the archaic drug laws in this nation, especially the ones in my new state! Yeah it’s against the law, but it shouldn’t be. A felony is no fucking joke! People get sick and make terrible decisions like this. It’s very sad. Don’t just shrug this off, it’s a travesty stuff like this happens. There will be a chapter in history looking back on how fucked up drug laws and drug addicts have been treated. Sorry, end of my morning rant!", "2_Subreddit": "opiates"}], "ds8afuj": [{"0_Comment Submission": "Oxycodone (30mg blues) addiction is getting out of hand.", "1_Text": "Yeah you are still at a small dose which is GREAT! However withdrawals will still suck! It’s all about perspective. I thought the withdrawals from a few points of smoking H a day for a couple months was bad! That’s because at the time that was my perspective, then years later a couple G a day IV H withdrawals showed me what REAL withdrawals are!\n\nAnyways to give some advice, get some comfort meds! Suboxone/methadone will do wonders! However don’t get addicted to these. Quick taper and stop! What’s nice about pills is you know exactly what your getting and the dose so a good taper schedule with your blues is possible if you have good self control.\n\nOther comfort meds that help me tremendously are benzos, clonodine, and maybe gabapentine. Never tried Keaton but I hear GREAT things about that on this sub. Then there are OTC meds such as weed, whiskey, and Imodium, that will help you as well! Be careful with Imodium in high doses it is toxic to heart!\n\nFinally my advice will he know the withdrawals won’t be forever. It can and will get so so so much worse if you continue. Stopping is easy but STAYING sober is extremely difficult! Stop before you get to deep. If you can’t stop by yourself go to your parents for help! They will be devastated but they love you (or so I assume, sorry if there bad parents). Finally when your feeling depressed and anxious, which you will for some time even after the physical symptoms stop, come by this sub and you will get a ton of support! NEVER even think about doing H! Good luck young man and know your doing the right thing! Stop now!\n\nAlso there is already a ton of great advice on this subject on this sub! Do a search!", "2_Subreddit": "opiates"}], "ds9g4qj": [{"0_Comment Submission": "Oxycodone (30mg blues) addiction is getting out of hand.", "1_Text": "\" i have been doing at least one blue a day since august\"", "2_Subreddit": "opiates"}], "dsq1enk": [{"0_Comment Submission": "What’s The Closest Brush With The Law That Ya’ll Have (Miraculously) Gotten Out Of / Avoided Major Consequences From?", "1_Text": "Its been a miracle in my 5 years of using I haven't been arrested (for a criminal matter), a FUCKING MIRACLE! \n\nFew of the close calls:\n-Search warrant served on the house I was staying at for suspicion of burgarly and drug dealing (so the warrant stated). I happened to be in the garage when the warrant was served. Long story short I was in handcuffs for 2 hours while they did the search. 4/5 people in the house got arrested. 3 of us in the garage got off. Only thing in the garage was a little dope, a scale, paraphernalia etc. they didnt find somehow. \n\n-Shop lifiting at walmart with a crew. I go to the car to drop off some goods as the police arrive/loss prevention catch the rest of the crew. I somehow make my way out of the parking lot while being searched for. As Im about off the property I get spotlighted, luckily I had changed out of my distinct jacked, put on a hat and glasses. He drives away. BOLO issued for me and the vehicle. I let the cops leave. They snatch up the other 2 of the crew. I sneak back to the car and make it home. That was kinda lucky cus there was 3g's of dope in the car and walking home wasnt an option. \n\n-Woken up to cops at the door staying in a diff garage. The guy who owned the place was on parole and got caught early morning breaking into cars, so cops show up to do a parole/probation search. There was a ton of shit in that garage. They ask me a few questions while im handcuffed. Im polite. They let me go.\n\n-Cant be to specific on the next 2: \n-Was working at a hotel. Would make keys to rooms while guests were away. Thefts are way up on the property...for some reason. Get caught in a room, luckily before I stole anything. Get fired, they cant prove I was responsible for rest of thefts, luckily no cameras on property. \n\n-Fraud check shit where 2/3 got arrested somehow I didnt. They both have felonies, they didnt roll/rat on me though, the girl was a good friend.\n\nNon Dope: Pulled over for expired tags. Had drankend a fith of corwn proceeding. Cop asks me questions about drinking I dont say/admit to anything. Initiates a sobriety test. Get to the 1st part with eyes following fingers. Know Im fucked. He says \"you just wasted 15minutes of both our time.\" Lets me go home with tag tickets.\n\n-Sleeping with my car. Get welfare checked. Had over an ounce of bud (big deal at the time) and a weapon. Had blazed it up recently so knew the car smelled. Cop asks to search the vehicle. \"Sir I respectfully do not consent to a search of my vehicle\"...\"Ok get out of here then.\"\n\nThere are a few more I CANNOT mention sorry. The one time I did get arrested was for expired registration on my vehicle. Got pulled over 4 times by the same cop. 1st time verbal warning, 2nd written, 3rd ticket and warning of arrest, 4th time arrested. Spent 3 hours in a cell before bailed out. Decided to spend the $60 on registration then instead of dope finally. No criminal record from that, it was just a traffic thing.", "2_Subreddit": "opiates"}], "dssrxys": [{"0_Comment Submission": "Xans aint shit", "1_Text": "Woah watch out for captain badass over here!", "2_Subreddit": "Drugs"}], "dswa6my": [{"0_Comment Submission": "Sourcing via PM", "1_Text": "Someone’s gotta help us out hahaha!", "2_Subreddit": "opiates"}], "dsziqxa": [{"0_Comment Submission": "Need connections, help a brother out", "1_Text": "Also in the same boat!", "2_Subreddit": "Midessa"}], "dt30ris": [{"0_Comment Submission": "In the car with my mom and Dad driving to rehab right now...it’s an 8 hour drive to Palm Springs, CA which is where the facility is at...I should arrive sometime between 3 PM -5 PM...I’m so scared. Please send over some good vibes to me cause I could def use some!", "1_Text": "You going to Betty Ford clinic? My buddy went there and said it’s a great (although very expensive) program! He made some of the best friends he currently has there! \n\nFrom my personal experiences with rehab being scared is completely normal. I was terrified as well. When I arrived people said “your going to be sad and not want to leave!” Bullshit I thought but it was true!\n\nYou will meet some great people there and hopefully you are honest and do what they say! I wished I would of! Instead I went on an even worse run, ended up homeless and eventually back in a 2nd rehab!\n\nDon’t be afraid brother, be excited at the opportunity you have! So many people would love to get clean and go to rehab but unfortunately many people cannot either do to price or availability! Keep your head up and please check in when you can! Good luck brother!", "2_Subreddit": "opiates"}], "dtcgcvw": [{"0_Comment Submission": "Finally there", "1_Text": "This is absolutely NO small achievement! You NEED to be super proud! Like the other people are saying congrats!!\n\nIts easy to GET clean, however STAYING clean is very difficult! We are all so happy for you!!!!\n\nFew questions: You completely clean? Smoke any weed or drink? Are you on any maintenance medication? Do you “work the program” aka the 12 steps? For me the most I was ever completely clean was like 40 days. I think weed is fine. I think drinking (at least for me) was s bad idea\n. Suboxone also helped me tons! I would go to meetings sometimes but just for the group aspect of it, I’m not a fan of the 12 steps! \n\nAnyways great job brother!", "2_Subreddit": "opiates"}], "dtjx8lv": [{"0_Comment Submission": "This is where I up and moved to after losing a 5 year relationship because of my lies and hiding my use. Minnesota to Pahoa, Big Island. Running doesn’t solve any of our problems but it does offer a lot of reflection. No running water, electricity or plumbing, I was squirting off the deck for weeks", "1_Text": "Nice brah. Got family in Volcano I visits once a year.", "2_Subreddit": "opiates"}], "dtmmsqf": [{"0_Comment Submission": "I have an important possibly fatal question", "1_Text": "Damn man that’s quitea habit! Are you 100% set on doing the blues? Hell your 16 days in man, PLEASE keep going with that! \n\nI’m not sure what a good dose would be, but remember one of the golden rules of being a junkie is you can always take more, not less!", "2_Subreddit": "opiates"}], "dv3zjkw": [{"0_Comment Submission": "This is it, guys.", "1_Text": "Very good decision man, VERY GOOD! You can do this! It WILL NOT be easy, IT WILL NOT BE FUN, but in the long run, and it may very well be a long run, I guarntee your life will IMPROVE! Of course that doesnt mean even years from now your life will be gravy! You will have rough days, weeks, or even months! TERRIBLE things will happen to you in your life (sadly thats just life, its unpredictable and sometimes sucks) that will make you want to use! Again I will repeat, this will NOT be easy!\n\nFew questions, have you been on subs before or any other MAT? How long do you plan to be on them? Whats your tolerance level with oxys now? What will be your sub dose? What other support (if any) will you be receiving while trying to remain sober? Scroll down to the stars part near the bottom to skip to the subs part!\n\nI was homeless on the streets of Lake Tahoe. It was November 16 and it was starting to get cold. The best shelter I had was an unlocked broken down box truck at the local tortilla factory I would sneak into at night, and get out of early in the morning before the workers arrived. One morning I overslept and was caught by a young worker. Fortunately he was very nice, even called me back when he saw I had left my flashlight in the back, which was perhaps my 2nd most important item I had left after my sleeping bag! \n\nI didnt even have a tent! Some nights I could sneak into this wooden 4'x5' (I am 6'4\" btw for context) shack that once housed a water heater that was removed. A few nights in my search for shelter I would be so sick and desperate I would sleep literally on the front porch/floor mats of an unoccupied vacation rental. This was because this rentals porch was out of sight from the road and was close to the ONLY 24H supermarket/store within walking distance. \n\nThat market and the employees there I will forever be grateful for! It was a place where when I was literally on the verge of hypothermia I could go to at least get warm! I would sit in the little area where people during the day would sit and eat there sandwiches and various other items purchased from the deli, it even featured a gas powered fireplace! Some times I would be so sick and desperate I would fall asleep there (A BIG NO NO) but I was never once asked to leave. I would be so tired and cold some nights I would sneak into the bathroom and sleep sitting on the toilet. Those employees were saints! I would just sit there and read. I think the employees knew this was literally the only place many of the homeless had a chance to be in a warm place. The other homeless I only saw during daytime hours there. Most of my daytime hours were spent at the library when it was open. AGAIN SO THANKFUL FOR THOSE EMPLOYEES AS WELL! \n\nI feel bad because I would steal food from this market though from time to time, mostly just (I HATE that i say \"just\" theres no \"justifying\" what I did, stealing was stealing) a loaf of bread and some cold cuts I could slip into my jacket. My ONLY possessions were a sleeping bag and the 3-4 layers of clothes I had on my back, plus my lovely flashlight, a flip phone, and a small pocket knife, and of course a couple rigs that had been used A LOT and whatever other paraphernalia I would have on me.\n\nIt was a miserable experience. The lowest point of my life. I was sick most days, but not enough days in a row to get clean, a terrible cycle to be in. Anyways Im rambling so ill get to the point. I eventually confided in a friend, my best friend, the position and situation my life was in. He told me he would pick me up after work and take me to any restaurant I wanted! Of course I let him end up choosing, and we ate Pho and talked about my situation. \n\n\"PLEASE man please! You CANNOT tell my sister or my mom whats up. I swear man Im gunna get it together by myself. Im gunna get this sorted out, Im gunna find a job, get clean, and get MYSELF out of this situation, BY MYSELF! I can do this! It will DEVASTATE them if they know Im using again, it BREAKS their hearts!\" Man I was so delusional/crazy that I actually believed I could. Little did I know they already knew I was using again, just not to what extent or what my situation was. My mom said she knew for certain when in September she hadnt heard from me in 22 days. We are very close and talk often. They knew though it had to be me to ask them for help. An addict in most cases will not get clean unless they themselves want it. They cannot be asked by others to get clean. They were ready and just waiting for me to ask for the help. \n\nA long delicious dinner ends, my buddy gives me his prized beanie from the ski resort he worked at, and we part ways. I make him PROMISE one last time not to tell my family! Anyways my buddy mulls it over and yes of course he ends up calling little sis 2 days later and explains the situation Im in. He had to, and I am so glad he did. I was not angry in the slightest he did. I think deep down inside I knew he would tell them, that this was the start of me asking for help. This was also the 2nd time he had to alert them of my using. \n\nThe 1st time was about 2 years prior when I 1st tried H and had gotten addicted and spent over 65k. Went from 200ish pounds to 155 the day I was entered into detox. Remember Im 6'4\", so this was not a healthy weight for me. From 1st trying it on October 2nd, 14 to about 6 months later. I was addicted to it within the 1st 2 weeks of that 6 months....thats another long story, so I wont tell that one now.\n\nAnyways little sis calls me a day after finding out. They had decided they needed to confront me, the waiting was over! My situation was now a close to death one. They had to act. This was perhaps the most difficult phone conversation I ever had. I admit to her my situation and confirm my best friends story is indeed true. I beg for the help she offers and cannot stop crying or apologizing to her.  That night im in a motel room she puts me up in. The plan is being made for my evacuation of my once so cherished and loved and beautiful mountain town that has becoming my nightmare. They both live on the islands in the pacific so logistics are a bit difficult. \n\nThe next day the plan is set. Mom calls and this conversation is a lot less terrible than the one with sis. She did learn A LOT from the family sessions (little sis could not attend) at my 1st in patient 30 day rehab! She is cool, calm, and collected. She doesnt berate me, she doesnt tell me how I am literally shortening her life with the stress, worry, and grief I am causing her again. She knows I know this already anyways. I am very impressed, in fact I am shocked by the conversation. How the HELL was she able to remain so calm, and NOT break down crying on the phone I will never know. Man if I knew that conversation was going to be like that I would of called and asked for the help months earlier.\n\n Mama bear will fly out in a week to get my ass out of there. She will find a detox and a rehab in LA (my hometown and where my grandma lives) before she gets there. She has the flights and rental car all arraigned. Little sis sets me up for the entire week in the hotel. Mom wires me some money to STAY well and get some food (which of course just went to more heroin) because what I was doing for money was very very very bad. Things again I probably will never forgive myself for. Fortunately I NEVER physically hurt anyone. If I would of crossed that line I dont think I could live with myself. I NEVER did any sexual stuff for money, although that was just because of the lack of opportunity, not because I was unwilling. Hell if I was sick and offered $40 to suck a dick, I can almost guarantee I would have.  and I dont think I will EVER be able to forgive myself for my actions. She decided it was safer for me to have the $ rather than to be arrested or killed before she could get to me. Of course I exaggerated the daily total needed to just stay well, thats a natural for us junkie scumbag addicts ; ). She confides in me later that was perhaps the hardest thing she had to ever do in her life. Sending her 1st born money for heroin. Her brother died from an OD at 36. She wanted me in that room until she could get to me. Were her decisions the correct one? \n\nFast forward and the reunion is about to take place. She is getting close into town and calls me. The pre-arranged meeting spot was of course, the library! She knew where that was from when she used to go herself when she would visit! Again I am stunned at her demeanor, words, and matter-of-factness about the situation. She embraces her big baby boy. Again I am amazed she doesnt break down in front of me. Perhaps she is out of tears? This was nothing like the 1st time she found out I was using where I held her in my arms as she sobbed, and shaked uncontrollably in a state of absolute shock and grief. The EXACT same way she felt in my arms when I would try and comfort her after finding her on the floor after coming home from school after we lost dad 13 years earlier.\n\nWe get in the car for the long drive back to LA. She aks if I have enough for the ride so I wont start puking and shitting and entering sickness on the way down to detox! She is familiar with the sickness. Of course the junkie scumbag addict says \"You know what, it would probably be the safest bet to get more. Im running low.\" Of course I had enough to stay well. So we make a pit stop first for what will hopefully be my final score.\n\n(FUCK 10,000 WORDS LIMIT?! DIDNT KNOW THAT! PART 2 IN MY REPLY BELOW ABOUT SUBS!)", "2_Subreddit": "opiates"}], "dv3zjz7": [{"0_Comment Submission": "This is it, guys.", "1_Text": "******ENTER SUBOXONE! This part (and im so sorry, I will keep this short!) I was familar with it already both from a recreational standpoint and from my 1st rehab. 1st time was decided for a quick taper. Heck it was my 1st rehab and I was only smoking it! QUICK TAPER FOR THE NEW BOY! \n\nThis time it is decided I will be taking it for an un yet determined amount of time. It will be used as a maintenance medication. I am open to the concept. I had a GREAT sub doctor. I am prescribed 8mg a day. For me this was a great starter dose. I attend an intensive outpatient rehab program that will last around 6-8 months back in my hometown while staying with grandma! Mom will end up staying to after we find out a month into being there, grandma has stage 4 lung cancer that has spread to her brain. We become her caregivers a long with the wonderful HOSPICE nurses who visit every other day. She is able to stay and die at home in her own bed. Sorry I got off topic there. The one thing that correlates and that I am actually very proud of myself is the suboxone helped me to stave off the cravings of STEALING grandmas meds (you know the oral morphine sulfate HOSPICE gives) even though they are of course hidden from me. They were for a time until I saw mama accidentally reveal the stash spot! Still the suboxone keeps me sane enough to make the right decisions, even though I will admit the THOUGHTS and CRAVINGS occasionally do cross my mind! But not with the intensity they would have been without the subs. Without the subs im 95% sure I would have stolen as many doses of the morphine I thought I could get away with without causing grandma pain, and not getting caught. \n\nThe difficult thing with subs, it works differently for everybody!  Some like it, some dont. Some prefer methadone. Never tired methadone for maintenance, only for recreation so couldnt tell you about that.\n\nFor some it helps cravings GREATLY! For me it was great for the cravings, but like I said, I Would still get them from time to time. Some days, weeks, and months were bad and all I thought about was slamming that great and cheap LA fire I knew was around, and could easily obtain. But heck even if I did, I would of had to plan it out. Thats also a good benefit about subs! \n\nIF you take your morning dose, and decide that afternoon you want to say FUCK IT! FUCK IT ALL! 1 MORE TIME! 1 LAST TIME THAT CHEAP LA FIRE IS 15 MIN AWAY! I NEED TO REWARD MYSELF FOR HOW GOOD I AM DOING BEING SOBER! I NEED TO REWARD MYSELF FOR TAKING CARE OF A DYING OLD WOMEN WHO I DEARLY LOVE! ITS STRESSFUL WATCHING THE ONES YOU LOVE DIE BUT THEY RELY ON YOU FOR CARE SO THERE IS NO BREAK FROM IT! EVERYONE WOULD UNDERSTAND IF YOU GOT CAUGHT! LOOK WHAT YOU ARE GOING THROUGH! FUCKING DO IT!!!!!! Is that the subs will BLOCK that HIGH in that moment you snapped! You would have to plan it out, purposefully miss a daily dose, to get high, and thats the theory, it will give you that time (at least for me) to come to your senses. \n\nAbout a year after first coming back home grandma passes and our obligations end. Mom has to get back to her husband in Hawaii who has grown feral again in her absence. My outpatient program ends, but what is to become of me? Mom offers me the shack in the back in the Volcano Forest. A Fucking lovely place. Ill get a job wherever I can, save up money, eventually get my own place. Live the island life brah. Of man THE ISLAND LIFE! I FUCKING LOVE IT! HAWAIIN SHIRTS! AHHH!!!!!!!\n\nHowever a miracle happens and I get offered a GREAT job out of state. Thats where I am at now. New state, with the BEST job (both financially, and rewarding) I have ever had. I am lying IN A BED!!!!! In a luxury ( I consider it luxury! Hardfuckingwood floors and granite countertops?!?! They have a trash valet?!) apartment.  I have furniture and possesions again? AN XBOX AND TV? WTF!!!!! \n\nI am overall happy again. I still have very rough days, weeks, months, but I still get by. I am still taking my suboxone, although I am now down to 1mg daily. That was my choice, I wasnt forced to that dose. I couldnt have done all of that without suboxone. It is an integral part of this puzzle called sobriety. \n\nI NEED to clarify though, I of course try and put effort into being clean as well. Its not like subs are the 1 and only thing you need to do. I am not a 12 stepper, but have nothing against it. But yea man, you need a plan. For me, subs have helped a lot. Sorry for the rant. Writing this out was more for me (the effort put into sobriety) than for you, but I hope this helps you. I hope you get clean. YOU CAN DO IT MY FRIEND!", "2_Subreddit": "opiates"}], "dv72fo8": [{"0_Comment Submission": "Friends taking Kratom recreationally", "1_Text": "Honestly I cannot tell you \"yes this is a bad idea!\", nor can I tell you \"yes this is a good idea!\". You seem concerned, but there is just not enough information for me to give you an answer. Lets forget about the substance. If it was beer, pot, heroin if the guys gunna do it, hes gunna do it. All you can do is express your feelings to them. Let them know your concerned. Your there friend! Talk to them and express your feelings and concerns. Be authentic about it, dont just spit anti drug DARE propaganda. But bottom line, if there going to use, there going to use.", "2_Subreddit": "opiates"}], "dvoocp0": [{"0_Comment Submission": "Serious Heroin Questions/Want Advice!", "1_Text": "Don’t do it man. I used pills recreationally for 10 years, only got addicted one time for 3 months after breaking my back. Tried H and was addicted within 2 weeks. 6 months later I had spent over 60k, lost my job, and ended up in rehab. 2.5 years later I was homeless.\n\n I would say you have a 5%-10% chance you will be successful with your plan. If pills are still enjoyable for you, stick with those man. And your dose don’t matter. Almost all the shit around these days has fent in it. If not mixed properly a dose of a couple grains of sand will fuckin kill you. Really so risky of an idea man. Don’t do it. PLEASE! \n\nTLDR: I was like you, controlled pills for 10 years, was curious, tried it, got addicted, set “rules” including no IV, Game over for me man.", "2_Subreddit": "opiates"}], "dvooj7s": [{"0_Comment Submission": "Serious Heroin Questions/Want Advice!", "1_Text": "Terrible advice.", "2_Subreddit": "opiates"}], "dvpoovp": [{"0_Comment Submission": "Opiate legalization debate, (Pros/cons)", "1_Text": "I disagree. You mentioned in a previous post you were worried about teens getting their hands on it. I’ll tell you my experience, drugs in highschool were MUCH easier to obtain alcohol. Dealers never ask for an ID. This is true for almost EVERYONE I have talked to.\n\nIf you really think the drugs being illegal are the only thing preventing people from seeking or obtaining them, statistics/facts disagree.\n\nNow I agree I don’t think opiates should be sold like alxohol is, hell I think alcohol should have stricter regulations. But if you honestly think the illegality of these drugs is what is preventing people from doing them, your just wrong.\n\nThe pros of providing addicts with these substances far outweigh the cons. I did so much damage to others having to provide for my habit. You can imagine what I did having a 60-120$ H habit and no source of income.\n\nLuckily I had health insurance through a parent, but add those costs up to for those who don’t. Add the cost of incarceration of us addicts. Yeah I was a thief, I hurt people, I’ll never forgive myself. If you haven’t experienced a sincere heroin addiction and sickness you don’t understand. We need to try a different approach!", "2_Subreddit": "opiates"}], "dwnr3mq": [{"0_Comment Submission": "I’m NOT a junkie (April Fool’s)!!! *Banging video*", "1_Text": "SWIM thinks that bathroom looks familiar........maybe its time SWIM payed a visit.", "2_Subreddit": "opiates"}], "dwp79zp": [{"0_Comment Submission": "Know how to Inject Yourself", "1_Text": "Looking back, just like everyone else Im sure, I wish I NEVER got into IV heroin use. Hell I wish I NEVER got into H in the first place. When I first started using IV, one of my running partners would hit me. She was this cute girl who was a phlebotomist! I was very lucky.\n\nShe NEVER missed, and it was almost sexy in a way having her hit me. Whats unusual was she did not IV herself, she only smoked it. One day I asked her why she was willing and she said \"I know you will just try and do it yourself anyways, this way you wont fuck your stuff up!\" She was right about that. \n\nTypical story, told myself IV use saves me money, and Ill only do it once a week, and for awhile I did only IV once a week....and a couple months later my use had increased and that was all im doing.\n\nIts a good guide KPINN but I cant imagine a lot of people are willing to read a 130+ page document haha. Maybe pick out and post the highlights for those people who just want a TLDR?", "2_Subreddit": "opiates"}]}], "1_submissions": [{"6x10mq": [{"0_Title": "HuffPost Article \"Because Of The Drug War, There Is Virtually No Heroin Without Fentanyl In Many Places\"", "1_Text": "Hmmmm like I said, I am NOT a lawyer and have NO IDEA, but my thoughts would be he does have a lot of things that will help....the most IMPORTANT being no priors. That is going to help tremendously considering he is 37 and has NEVER been in trouble. Thats actually REALLY lucky. \n\nThe fact that he has people that will speak positivley about his charecter also helps a lot, especially if the employees at the walgreens themselves are willing to make a statement, and say something like he wasnt threatining. In CA (thats where I lived most of my life) he would have MORE than likely been sent to some drug diversion program. I know the sout/Alabama is a hole new ball game....I dont know much about the state, but I would THINK there would be a small chance he doesnt see prison. But like I said I no nothing about Bama. \n\nBut yea like almost everyone is saying here, lawyer up! Im so sorry you are going through this, you sound like a good gal. I can only imagin\n\nI can only imagine how scary this is, but know like all things, in time, things will be fine! Take care girl and good luck! \n\n*edit - I didnt want to sound racist, but I think its proven (through statistics at least) that him being clean cut and white will help. I would think (i know its stereotyping) an Alabama Judge would be more lenient on a white family man then they would be on someone of color. So yea sorry to anyone if I sounded racist there.", "2_Subreddit": "opiates"}], "6x4wo3": [{"0_Title": "Who is Your Favorite \"Junkie/Opiate Using\" Historical Figure???", "1_Text": "Hmmmm like I said, I am NOT a lawyer and have NO IDEA, but my thoughts would be he does have a lot of things that will help....the most IMPORTANT being no priors. That is going to help tremendously considering he is 37 and has NEVER been in trouble. Thats actually REALLY lucky. \n\nThe fact that he has people that will speak positivley about his charecter also helps a lot, especially if the employees at the walgreens themselves are willing to make a statement, and say something like he wasnt threatining. In CA (thats where I lived most of my life) he would have MORE than likely been sent to some drug diversion program. I know the sout/Alabama is a hole new ball game....I dont know much about the state, but I would THINK there would be a small chance he doesnt see prison. But like I said I no nothing about Bama. \n\nBut yea like almost everyone is saying here, lawyer up! Im so sorry you are going through this, you sound like a good gal. I can only imagin\n\nI can only imagine how scary this is, but know like all things, in time, things will be fine! Take care girl and good luck! \n\n*edit - I didnt want to sound racist, but I think its proven (through statistics at least) that him being clean cut and white will help. I would think (i know its stereotyping) an Alabama Judge would be more lenient on a white family man then they would be on someone of color. So yea sorry to anyone if I sounded racist there.", "2_Subreddit": "opiates"}], "79b24o": [{"0_Title": "The Scene in Texas!", "1_Text": "Hmmmm like I said, I am NOT a lawyer and have NO IDEA, but my thoughts would be he does have a lot of things that will help....the most IMPORTANT being no priors. That is going to help tremendously considering he is 37 and has NEVER been in trouble. Thats actually REALLY lucky. \n\nThe fact that he has people that will speak positivley about his charecter also helps a lot, especially if the employees at the walgreens themselves are willing to make a statement, and say something like he wasnt threatining. In CA (thats where I lived most of my life) he would have MORE than likely been sent to some drug diversion program. I know the sout/Alabama is a hole new ball game....I dont know much about the state, but I would THINK there would be a small chance he doesnt see prison. But like I said I no nothing about Bama. \n\nBut yea like almost everyone is saying here, lawyer up! Im so sorry you are going through this, you sound like a good gal. I can only imagin\n\nI can only imagine how scary this is, but know like all things, in time, things will be fine! Take care girl and good luck! \n\n*edit - I didnt want to sound racist, but I think its proven (through statistics at least) that him being clean cut and white will help. I would think (i know its stereotyping) an Alabama Judge would be more lenient on a white family man then they would be on someone of color. So yea sorry to anyone if I sounded racist there.", "2_Subreddit": "opiates"}]}]}]}