{"Lotta_ins_Lotta_outs": [{"0_comments": [{"dwpoexe": [{"0_Comment Submission": "Forgot my boof kit at home so I guess I’ll do some lines in the car", "1_Text": "Hey angel been lurking the sub awhile. Just want to say you are so young and it's such a gamble using H, even just snorting. I can't completely kick myself I love opiates (30s), but I want to live a long happy life and I know I gotta give em up to do so. Enjoy the pickup but it can't last forever! Stay safe and have fun but turn around if you can. This life does not end well. Sorry to preach, enjoy all that. My opinion doesn't matter but when your so young you don't want to have something happen that there's no coming back from.", "2_Subreddit": "opiates"}], "dwpph2h": [{"0_Comment Submission": "finishing up a heroin binge then finally putting my health first + updates :)", "1_Text": "Good luck. Sounds like you've got a tough journey like so many, but opiates will only make it impossible instead of tough. Seems like you've got somd family resources. Be grateful and take advtantage. Get as much help as possible with the mental health. Those stamp bags are Russian roulette. It's sad but if you keep using one of those bags will kill you eventually. Life is great on it's own. Good luck with the BF but he isn't the end all be all. Set your goals and don't let him compromise those. This is the right decision, good luck.", "2_Subreddit": "opiates"}], "dwpqq50": [{"0_Comment Submission": "I know I relapsed the other day, but I can do this, guys!", "1_Text": "Awesome. I really respect the 12 step program. It's a great life/way of living to strive for. One thing I dislike is the emphasis on clean time. Obviously any amount is amazing and congrats on your tag. I just don't like that a relapse puts you back at the start bc in reality it doesn't if you don't let it. I'm not knocking the program AA has done so much for me and I've met the kindest people. But imo it's so much more nuanced than the big book. Either way clean time is great. Opiates are the ultimate tease. They give you everything you need but it costs you everything you have. Just isn't worth it, imo.", "2_Subreddit": "opiates"}], "dwpr16l": [{"0_Comment Submission": "Saying Hello", "1_Text": "I wish I thought of it earlier but I also got lucky not getting arrested or getting hooked up with a bad dude. I could have beat a kid for $280 no problem but I followed through on my word. We helped each other out and the good karma continues. When I took the $$ I said \"you're putting a lot of faith in a stranger\". He said ya but it's only a risk of getting robbed once. I guess 280 was throwaway $ for him.", "2_Subreddit": "opiates"}], "dwpssgl": [{"0_Comment Submission": "Variety packs are always nice 😎", "1_Text": "300mg a day. Hey, with a heavy tolerance you can get there. How do you afford it? When's the last time your dick got hard?", "2_Subreddit": "opiates"}], "dwpw5gc": [{"0_Comment Submission": "I know I relapsed the other day, but I can do this, guys!", "1_Text": "Ya I still have yets. Addiction and debts been there. Still have a clean record and fam tho. That's my motivation to stop. I've been chipping for 2 years after a 5-6 day blue then fent press habit for about 4 months. Add massive cocaine use as well.  Middle of the road for this sub. I don't want to give it all away tho I need to step away for good.", "2_Subreddit": "opiates"}], "dwpzehz": [{"0_Comment Submission": "I know I relapsed the other day, but I can do this, guys!", "1_Text": "Once you get the opiate itch I think we're all headed to the same place. Get a little disposable income and you are in trouble.", "2_Subreddit": "opiates"}], "dwrjxpc": [{"0_Comment Submission": "Variety packs are always nice 😎", "1_Text": "Man I'm in a similar boat. Only difference is the woman I love knows of my disease and keeps me under her thumb. It's not perfect but it keeps me from going off the deep end. The last year I kept it a secret I probably spent 75k on blues and coke. And I made the dick joke cuz I hadnt had a boner in months either haha. In recovery they say you gotta feel all the pain before you surrender. I'm not yet surrendered but I love my girl/life more than the drugs and it's enough to allow me to walk the line for now. But it wont last forever. True sobriety is the only long term answer for me", "2_Subreddit": "opiates"}], "dwrq317": [{"0_Comment Submission": "What is the heroin capital of the US?", "1_Text": "This sub would make me say Philly", "2_Subreddit": "opiates"}], "dwtjong": [{"0_Comment Submission": "Pin point pupils", "1_Text": "Have never figured it out.", "2_Subreddit": "opiates"}], "dwtk4ks": [{"0_Comment Submission": "Oh boy... I've seriously done it now...", "1_Text": "Sad shit man. Sounds like you could be going to jail soon depending on all your open case stuff (I'm guessing Hford btw). I really don't believe in jail unless someone is violent. But sounds like you could use some time in an inpatient rehab or institution to think some shit through.\n\nDid you straight up tell your G-pa you needed drugs? What the hell kind of story could you have come up with that would have seemed even remotely plausible?\n\nGood luck and get well man.", "2_Subreddit": "opiates"}], "dwtkcit": [{"0_Comment Submission": "Anyone else love cooking while high?", "1_Text": "I enjoy doing household chores while high. Cooking, cleaning, dishes, laundry, projects, etc. They are way better to do high plus being productive offsets the guilt of using in the first place.", "2_Subreddit": "opiates"}], "dwtw2qj": [{"0_Comment Submission": "Is anyone else sober and live with people that get high?", "1_Text": "If it was my drug of choice (ex. Opiates and opiates) I could never make it a day. Get out or relapse imo.", "2_Subreddit": "opiates"}], "dwxrw38": [{"0_Comment Submission": "Nice lil haul for today", "1_Text": "Where you been dude. Was throwing pics up like this daily. Just get sick of posting or the middle biz take a turn for the worse?", "2_Subreddit": "opiates"}], "dwxz5kj": [{"0_Comment Submission": "Nice lil haul for today", "1_Text": "You've had it going for awhile. Pretty unreal hookup, congrats.", "2_Subreddit": "opiates"}]}], "1_submissions": [{"899fkq": [{"0_Title": "Saying Hello", "1_Text": "Hey angel been lurking the sub awhile. Just want to say you are so young and it's such a gamble using H, even just snorting. I can't completely kick myself I love opiates (30s), but I want to live a long happy life and I know I gotta give em up to do so. Enjoy the pickup but it can't last forever! Stay safe and have fun but turn around if you can. This life does not end well. Sorry to preach, enjoy all that. My opinion doesn't matter but when your so young you don't want to have something happen that there's no coming back from.", "2_Subreddit": "opiates"}], "8aef74": [{"0_Title": "30s Drought", "1_Text": "Hey angel been lurking the sub awhile. Just want to say you are so young and it's such a gamble using H, even just snorting. I can't completely kick myself I love opiates (30s), but I want to live a long happy life and I know I gotta give em up to do so. Enjoy the pickup but it can't last forever! Stay safe and have fun but turn around if you can. This life does not end well. Sorry to preach, enjoy all that. My opinion doesn't matter but when your so young you don't want to have something happen that there's no coming back from.", "2_Subreddit": "opiates"}]}]}]}