{"Bj1993": [{"0_comments": [{"do5ai4m": [{"0_Comment Submission": "FEAR The Walking Dead S03E14 - El Matadero - Post Episode Discussion", "1_Text": "No. They were intoxicated", "2_Subreddit": "thewalkingdead"}], "doj11l8": [{"0_Comment Submission": "Jennifer Lawrence’s Harrowing Story Proves Hollywood Sexual Harassment Goes Beyond Harvey Weinstein", "1_Text": "Your liberal tears reek of salt. Quite salty your Demi god Hillary isn't dictator in Chief!", "2_Subreddit": "TwoXChromosomes"}], "dom8hcl": [{"0_Comment Submission": "What feels orgasmic without being sexual or doing drugs?", "1_Text": "Agreed. The first bite is always the most flavorful", "2_Subreddit": "AskReddit"}], "dom8kmh": [{"0_Comment Submission": "What feels orgasmic without being sexual or doing drugs?", "1_Text": "\"HERE'S A COLD ONE FOR YA!\" - Hank Hill", "2_Subreddit": "AskReddit"}], "dopa4wd": [{"0_Comment Submission": "Nogan and Rork Gromes", "1_Text": "Exactly. It's from the comic fools!", "2_Subreddit": "thewalkingdead"}], "dopasnm": [{"0_Comment Submission": "[COMIC][SHOW SPOILER] I can't wait to the people's reaction to it", "1_Text": "Beta is friend zoned, poor giant", "2_Subreddit": "thewalkingdead"}], "dopb5v0": [{"0_Comment Submission": "[COMIC][SHOW SPOILER] I can't wait to the people's reaction to it", "1_Text": "Agreed. The showrunners aren't going to compromise his redemption arc just for the sake of pleasing a few fans who wanna see him die. Not every bad guy has to die. I find it much more interesting when they try to break good and/or are facing a new antagonistic force. Which is why it didn't feel right when they killed off Troy on FTWD. They were headed in that direction then boom, anticlimactic death. If the show runners do the same with Negan then they are, as comic Negan would say, fucking fucked.", "2_Subreddit": "thewalkingdead"}], "dopjvx4": [{"0_Comment Submission": "Styles vs. Bálor: Tale of the Tape", "1_Text": "My favorite SpongeBob episode is Rock-a-Bye Bivalve. Controversy over implied homosexuality be dammed", "2_Subreddit": "SquaredCircle"}], "doub1fa": [{"0_Comment Submission": "[MAJOR SPOILERS] S08 mid-season finale from The Spoiling Dead Fans", "1_Text": "This will be the biggest leap in the opposite direction the show has ever taken if this is true by far. It will be very interesting if Rick spares Negan as implied by the mercy quote. I actually didn't realize that was a flash forward scene, I thought he was mourning Abraham and Glenn. Probably why the mercy quote didn't make any sense. And what does this mean for the whisperer's storyline? No Carl = No Lydia, most likely. Other than that, not much changes unless they kill off Negan too.", "2_Subreddit": "thewalkingdead"}], "doxx4ns": [{"0_Comment Submission": "If I don’t see this scene in season 8 I’m going to turn into a fucking pumpkin", "1_Text": "Negan calling Carl a skull faced fuck.", "2_Subreddit": "thewalkingdead"}], "dpdkc3x": [{"0_Comment Submission": "[NJPW Power Struggle Spoilers] Video of Switchblade reveal, match official for Wrestle Kingdom 12", "1_Text": "O'Reilly is one name, so he's KO.", "2_Subreddit": "SquaredCircle"}], "dpqpxob": [{"0_Comment Submission": "VREARONS", "1_Text": "Not impossible tho. Just take a look at the Las Vegas shooter and his brother who was busted by the authorities with child porn and threatened to kill people in the past. Still, unlikely ear and vr are the same person let alone brothers.", "2_Subreddit": "EARONS"}], "dq36j0s": [{"0_Comment Submission": "The Walking Dead S08E05 - The Big Scary U - Post Episode Discussion for [COMIC] Readers", "1_Text": "Don't read the comic thread if you're worried about spoilers..?", "2_Subreddit": "thewalkingdead"}], "dqvhuys": [{"0_Comment Submission": "Official SPOILER discussion of Issue 164", "1_Text": "Also, the side pic needs to be updated, still on 171 lol.", "2_Subreddit": "theroamingdead"}], "dr7cmxf": [{"0_Comment Submission": "They should just remake the show as an animated series like they did with batman after the nipple-suit era.", "1_Text": "Agreed. Let Todd McFarlane make it like he did spawn.", "2_Subreddit": "thewalkingdead"}], "drw1q66": [{"0_Comment Submission": "Anyone else thinks the new group's armor looks really silly?", "1_Text": "Looks like the armor from the Halo video games. The crotch armor makes it look even worse", "2_Subreddit": "theroamingdead"}], "dta3qyp": [{"0_Comment Submission": "How would Eric & Dylan have felt about inspiring Adam Lanza to commit the Sandy Hook massacre?", "1_Text": "No shit. I mean with regard to the fact that he killed first graders and shit. It makes me wonder how they'd feel knowing they partly inspired him", "2_Subreddit": "Columbine"}], "dtg0zxj": [{"0_Comment Submission": "How would Eric & Dylan have felt about inspiring Adam Lanza to commit the Sandy Hook massacre?", "1_Text": "You don't think they would have felt any disgust or guilt knowing they inspired a guy to kill a bunch of 6/7 year olds though?", "2_Subreddit": "Columbine"}], "dtqx24f": [{"0_Comment Submission": "Avarage age of site members.", "1_Text": "24, 25 in April.", "2_Subreddit": "Columbine"}], "dtqyi8g": [{"0_Comment Submission": "Warnings: stay away from any sites that has NFL content or Superbowl content this weekend starting today and possibly Monday", "1_Text": "Dude. I'm a seahawks fan, how do you think i feel. People constantly bring up the closing play from 49, as if we forgot how bad it was. Doesn't even matter that they won in dominating fashion the year before, all people care about is \"durr y u no hand off the ball?!\"", "2_Subreddit": "falcons"}], "dtrdueg": [{"0_Comment Submission": "How would Eric & Dylan have felt about inspiring Adam Lanza to commit the Sandy Hook massacre?", "1_Text": "He also derisively suggested they were homosexual lovers and that in their final moments they shared a kiss before Eric used Dylan's gun to kill him. He definitely wasn't a Columbiner.", "2_Subreddit": "Columbine"}], "dukyskp": [{"0_Comment Submission": "'Walking Dead' Star Lauren Cohan, Without Season 9 Contract, Books Lead in ABC Pilot", "1_Text": "We can always hold out hope for an animated series.", "2_Subreddit": "thewalkingdead"}], "duy9067": [{"0_Comment Submission": "Parkland Father Admits to Doctoring CNN Email", "1_Text": "Dominate the conversation at the expense of everyone else? You mean like the front page of reddit? When was the last time you saw a thread which wasn't stained with liberal undertones", "2_Subreddit": "news"}], "dvq34vt": [{"0_Comment Submission": "Officer Holes seemed to hint on the ID special that a Parabon Labs genetic composite had been generated for EARONS", "1_Text": "Fuck off", "2_Subreddit": "EARONS"}], "dwujqja": [{"0_Comment Submission": "I'm Eric Hafner, I'm running for U.S. Congress in Portland, Oregon (OR-3). I want to legalize all drugs, including opiates, but offer ibogaine therapy too, and free drugs for addicts via prescription.", "1_Text": "I would vote for you if i lived in Oregon, but i am in washington state. Best of luck, i suppose if there's any state where this has the best chance of happening it would be Oregon. I doubt it'd go over very well with the current presidential administration though", "2_Subreddit": "opiates"}]}], "1_submissions": [{"52aazt": [{"0_Title": "Henryk Siwiak, killed in Brooklyn shortly before midnight on 09-11-01. Case remains unsolved. Anybody familiar with this case?", "1_Text": "No. They were intoxicated", "2_Subreddit": "UnresolvedMysteries"}], "54irgt": [{"0_Title": "Mark Twain enjoying a book in bed. (1908)", "1_Text": "No. They were intoxicated", "2_Subreddit": "OldSchoolCool"}], "55b7hi": [{"0_Title": "[COMIC] An animated Walking Dead tv show that is a straight adaption of the comics?", "1_Text": "No. They were intoxicated", "2_Subreddit": "thewalkingdead"}], "64lyur": [{"0_Title": "Absence of automobiles post-AOW?", "1_Text": "No. They were intoxicated", "2_Subreddit": "theroamingdead"}], "65ej4r": [{"0_Title": "A Walking Dead animated television show", "1_Text": "No. They were intoxicated", "2_Subreddit": "theroamingdead"}], "67jvsr": [{"0_Title": "This should be Braun Strowman's new theme. I can picture him stomping around to this song while tipping over ambulances and chucking fools in dumpsters", "1_Text": "No. They were intoxicated", "2_Subreddit": "SquaredCircle"}], "6ah7oc": [{"0_Title": "Will previous work related to navy help improve my chances?", "1_Text": "No. They were intoxicated", "2_Subreddit": "newtothenavy"}], "6nhxp7": [{"0_Title": "Is the IWGP Junior Heavyweight Championship equivilent to the Cruiserweight championship in WWE?", "1_Text": "No. They were intoxicated", "2_Subreddit": "SquaredCircle"}], "6qzvt3": [{"0_Title": "Found a shoelace at the library. Funny how my mind immediately associates that with EARONS. Anyone else had that happen?", "1_Text": "No. They were intoxicated", "2_Subreddit": "EARONS"}], "6r0as6": [{"0_Title": "Serial killer cold case in my hometown", "1_Text": "No. They were intoxicated", "2_Subreddit": "UnresolvedMysteries"}], "6ywh1h": [{"0_Title": "Who took Richard Kuklinski's barrel containing one of his victims? [Other]", "1_Text": "No. They were intoxicated", "2_Subreddit": "UnresolvedMysteries"}], "73bk9c": [{"0_Title": "What are things about the comic you like that you think the tv show is lacking?", "1_Text": "No. They were intoxicated", "2_Subreddit": "theroamingdead"}], "74dh5v": [{"0_Title": "[SPOILERS]Predictions on what will happen in the next issue.", "1_Text": "No. They were intoxicated", "2_Subreddit": "theroamingdead"}], "78vxe2": [{"0_Title": "Playoffs Predictions", "1_Text": "No. They were intoxicated", "2_Subreddit": "Browns"}], "7t2slm": [{"0_Title": "How would Eric & Dylan have felt about inspiring Adam Lanza to commit the Sandy Hook massacre?", "1_Text": "No. They were intoxicated", "2_Subreddit": "Columbine"}]}]}]}