{"kristin3783": [{"0_comments": [{"dvvc70l": [{"0_Comment Submission": "Not to bad for a bunch of scrapies and a few old straws", "1_Text": "I'm assuming we mean the same ptown. Lately I've had better luck copping over there. Rainbow stamps seem to be the same shit for months upon months now.  Been getting red stamps Don Julio lately. Had some Gucci gang last week and that was probably the best batch I've gotten my hands on in a minute.", "2_Subreddit": "opiates"}], "dvvjkle": [{"0_Comment Submission": "headaches from kratom?", "1_Text": "Well, thanks for stating the obvious. I've only been using kratom for 2 weeks so I don't have much experience with it. I'm well aware of all the other reasons I could have a headache and after ruling those out I was left with kratom being the most likely culprit. Who better to ask them a bunch of other users that have more experience than myself?", "2_Subreddit": "kratom"}], "dvvjpf0": [{"0_Comment Submission": "headaches from kratom?", "1_Text": "Thanks guys! Maybe a little TMI but whatever, I've noticed that I have been peeing more than usual so I could definitely be dehydrated. I'll make sure to keep the water flowing!", "2_Subreddit": "kratom"}], "dvvk6uu": [{"0_Comment Submission": "Orgasm for the ladies?", "1_Text": "I don't have any advice on how to kick start your clit lol but are you able to omit kratom for a day and then see how your body reacts without it? I know kratom is not an opiate but since it does work on the same receptors maybe it does desensitized you. I know if I have opiates in my system there is like a 1% chance that I'm cumming. It sucks. Or maybe try a different color like someone said. Good luck", "2_Subreddit": "kratom"}], "dvwgcb2": [{"0_Comment Submission": "Help with withdrawal", "1_Text": "Don't take the sub until you 100% feel withdraw symptoms. Last thing you want is precipitated withdrawal.", "2_Subreddit": "opiates"}], "dvwgetk": [{"0_Comment Submission": "headaches from kratom?", "1_Text": "No I took a red bali. I know you were joking so no worries. So was i. I definitely think lack of water is the problem", "2_Subreddit": "kratom"}], "dvwgmb0": [{"0_Comment Submission": "Not to bad for a bunch of scrapies and a few old straws", "1_Text": "Lmao.. Most bricks I get it wrapped are in porn.. Pretty funny coming across an empty rapper with like a tit in corner like wtf!?! I think the Gucci one I got must have been different from the shit a few months ago. I remember seeing bad reviews on it so I was very surprised and happy when it was better than 3\\4 of the shit I've been getting. I haven't come across the red bags. Came across pink Pepto bismal Maggie's but that's was fent for sure. Could probably make one hell of an art project with all the different stamps.", "2_Subreddit": "opiates"}], "dvwgusw": [{"0_Comment Submission": "Not to bad for a bunch of scrapies and a few old straws", "1_Text": "Also I'm pretty sure the rainbow stamp people got popped back in november. My main dgirl ran for them and she switched her shit up for like 2 weeks with purple knockouts then went right back to the rainbows. It was pretty funny, 1st time I saw her after the raid before she switched to purple she gave me block buster stamps. I thought it was funny and very fitting since the block has just been busted. That was good too. i could go on about the many many stamps in our dope ridden area!", "2_Subreddit": "opiates"}], "dvwiqlp": [{"0_Comment Submission": "Can someone please tell me if this is fake?", "1_Text": "The color is off and M's don't have those dark spots. They are usually a light blue too and thick. I can't even wrap my head around all the fake pills out.", "2_Subreddit": "opiates"}], "dvwlhge": [{"0_Comment Submission": "want to avoid wds", "1_Text": "Kratom kratom and kratom!! Lol it's unreal how well it works. I've done the dance with withdrawal so many times then I finally decided to really give Kratom a try and holy shit. I literally was kicking myself in the ass for putting myself through torture so many times in the past. If you're going to order any try and plan on advance so you can order from an online vendor. It seriously will be well worth your $$.", "2_Subreddit": "opiates"}], "dvwrueu": [{"0_Comment Submission": "favorite strains for opiate withdrawal", "1_Text": "Well a little bit of both but I prefer numbing.", "2_Subreddit": "kratom"}], "dvwrzpq": [{"0_Comment Submission": "favorite strains for opiate withdrawal", "1_Text": "Man that sucks to hear about the gold bali because I just got a fresh batch in and was looking forward to trying it tomorrow. I like the need bali for sure. It has helped tremendously. I've only mixed my reds with a green maeng da  but it was using sub par kratom so i will have to try with the stuff I currently have.", "2_Subreddit": "kratom"}], "dvxd2br": [{"0_Comment Submission": "How to sleep on opiates?", "1_Text": "This happens to me too. It's a night of interrupted sleep. It's horrible. I will literally wake-up once every hour and exactly one hour later. I wish I knew how to fix it. Lurking for answers lol", "2_Subreddit": "opiates"}], "dvxdap0": [{"0_Comment Submission": "with all of this boofing talk I see on here....", "1_Text": "Sorry I changed the post but I was referring to dope", "2_Subreddit": "opiates"}], "dvxdkx9": [{"0_Comment Submission": "Last year I shot the Milky Way at 70mm and it took me 140 exposures to complete this image. I was about a 1/4 mile away from the lighthouse", "1_Text": "Beautiful!!!", "2_Subreddit": "space"}], "dvz0z9i": [{"0_Comment Submission": "Drug testing question morphine and heroin", "1_Text": "Heroin shows up as morphine on a lab urine test..", "2_Subreddit": "opiates"}], "dw0igmm": [{"0_Comment Submission": "Is this sourcing ?", "1_Text": "Lol that's pretty funny", "2_Subreddit": "opiates"}], "dw1muzi": [{"0_Comment Submission": "I don't know where else to turn", "1_Text": "Don't beat yourself up. There are always a million what if's, could haves, would have and should have. At the end of the day there isn't anything you could have done. Even if you did reach out to him there is no saying he would have listened. Keep your head up!! I know we don't know each other but if you need to talk PM  me", "2_Subreddit": "opiates"}], "dw2wack": [{"0_Comment Submission": "Hey guys, since reddit is banning so many subs, if this one gets banned where can we all meet up?", "1_Text": "Anytime they make a change and shut a bunch of subs down I get so worried that I'm going to come on here and unable to find this family. We really should make another sub and only use it if this God forbid gets shut down..", "2_Subreddit": "kratom"}], "dwfcxwc": [{"0_Comment Submission": "Thinking about using again...", "1_Text": "Hey man, I don't know you or what you have going on but I do know that you will get past this shitty time in your life. whatever you're going through isn't worth ending it over. I've been in the same boat just feeling like id be better off not waking up but I just kept telling myself I've gotten through harder times. 4 months clean is awesome, congrats!! That's not an easy thing to do and you should definitely be proud of yourself for making it this long!! If  you need to talk PM me!!", "2_Subreddit": "opiates"}], "dwqq66i": [{"0_Comment Submission": "I just can't stand kratom's taste. Help!", "1_Text": "THIS!!!", "2_Subreddit": "kratom"}], "dwuivp6": [{"0_Comment Submission": "Going to be flying with ~23 Oxy blues. Planning to just put them in a Tylenol bottle. Is it okay check that bottle with my luggage or do I need to carry it on for some reason?", "1_Text": "I'd carry it with you in your carry on. I've done it before and just put a bunch of different pills (tylenol, multi vitamin, Advil and then blues) in either one of those daily pill cases or just a an old rx bottle with no lablel. I've never had a problem.", "2_Subreddit": "opiates"}], "dwwpkp0": [{"0_Comment Submission": "Wide variety", "1_Text": "What's the yellow stuff in the little bags?", "2_Subreddit": "opiates"}], "dwwppxu": [{"0_Comment Submission": "Premade east coast stamp bags, opinions on them?", "1_Text": "Any preprints I've ever had were either fent or garbage. And they were purchased in one of the largest cities pumping this shit out.", "2_Subreddit": "opiates"}], "dwwx9rx": [{"0_Comment Submission": "Is making the jump from prescription pills to heroin really as big of a deal as it's made out to be?", "1_Text": "They are 100% spot one. I thought shit was bad when I was only using pills. I thought switching would alleviate some stress especially financially. Boy was i wrong. I'm the beginning yes I saved money but it just allowed me to buy more H and I'm turn my habit became a bigger issue than it already was. It's a fast downward spiral. If you can stick to pills then do it man!", "2_Subreddit": "opiates"}]}], "1_submissions": [{"848fl9": [{"0_Title": "favorite strains for opiate withdrawal", "1_Text": "I'm assuming we mean the same ptown. Lately I've had better luck copping over there. Rainbow stamps seem to be the same shit for months upon months now.  Been getting red stamps Don Julio lately. Had some Gucci gang last week and that was probably the best batch I've gotten my hands on in a minute.", "2_Subreddit": "kratom"}], "857tzu": [{"0_Title": "headaches from kratom?", "1_Text": "I'm assuming we mean the same ptown. Lately I've had better luck copping over there. Rainbow stamps seem to be the same shit for months upon months now.  Been getting red stamps Don Julio lately. Had some Gucci gang last week and that was probably the best batch I've gotten my hands on in a minute.", "2_Subreddit": "kratom"}], "85gv7e": [{"0_Title": "with all of this boofing talk I see on here....", "1_Text": "I'm assuming we mean the same ptown. Lately I've had better luck copping over there. Rainbow stamps seem to be the same shit for months upon months now.  Been getting red stamps Don Julio lately. Had some Gucci gang last week and that was probably the best batch I've gotten my hands on in a minute.", "2_Subreddit": "opiates"}]}]}]}