{"eyeXpatch": [{"0_comments": [{"di1940k": [{"0_Comment Submission": "How old are you and when did you start using opiates?", "1_Text": "25 now; 15 my first time.", "2_Subreddit": "opiates"}], "di1a6hi": [{"0_Comment Submission": "Could you describe your first experience with opiates ?", "1_Text": "I was 15 years old and someone in the parking lot at school offered to sell me 3 roxicodone 15mgs. Went home and snorted one later that night , pure bliss. I used heavily but not every day through high school, coupled with experimenting with other drugs. Here I am, an IV dilaudid addict maintaining with subs 10 years later.", "2_Subreddit": "opiates"}], "diae1ts": [{"0_Comment Submission": "Been sober a year now and back to doing the stuff I love. Always thought shows like Drugs Inc., Gangland, The First 48 were silly af... so I decided to make a parody.", "1_Text": "Thanks for a good laugh , this is a great parody. Nicely done mah dude. \"McChicken = Chicken sandwich \" hahaha that lifestyle slang", "2_Subreddit": "opiates"}], "diafn31": [{"0_Comment Submission": "Can we get a list of Isolation Horror?", "1_Text": "I can't remember the title but there was a movie on Netflix maybe 5 or 6 years ago about a sadistic scientist that locked about 7 people in a room with no food or water to see what they did , it was very interesting but isn't on Netflix anymore. I will respond to this post if I recall the title for you.  The Circle kind of fits this genre as well but is more thriller than horror.", "2_Subreddit": "horror"}], "diafozz": [{"0_Comment Submission": "Can we get a list of Isolation Horror?", "1_Text": "It was called Hunger I think.", "2_Subreddit": "horror"}], "diaybzp": [{"0_Comment Submission": "Who is the best idiot character in a movie or show?", "1_Text": "Spud in Trainspotting is a personal favorite of mine.", "2_Subreddit": "AskReddit"}], "ditxy3h": [{"0_Comment Submission": "Charcuterie Board with 4 meats & 3 cheeses. [OC] [4032x3024]", "1_Text": "And crackers !", "2_Subreddit": "FoodPorn"}], "dj51yov": [{"0_Comment Submission": "Wife pops husband’s \"Red spot\"", "1_Text": "I saved this one. . . For future viewing. . .", "2_Subreddit": "popping"}], "dj7z02r": [{"0_Comment Submission": "i found this on discord", "1_Text": "I think you mean \"Bwaah-huh-hwaaah!\"", "2_Subreddit": "stevenuniverse"}], "djsnja9": [{"0_Comment Submission": "Does anyone remember these 1999 23 karat Pokémon cards from BK.", "1_Text": "It looks like no one remembers them.", "2_Subreddit": "gaming"}], "dknmml6": [{"0_Comment Submission": "What is the shittiest city you've visited only once and completely refuse to return?", "1_Text": "Newark, New Jersey", "2_Subreddit": "AskReddit"}], "dncaj33": [{"0_Comment Submission": "What's a joke so bad it's good?", "1_Text": "\"My friend keeps telling me to cheer up these days. He says it could be a lot worse , I could be trapped inside an underground hole filled with water.\n\nI know he means well.\"", "2_Subreddit": "AskReddit"}], "dntwpt5": [{"0_Comment Submission": "This man took a bullet while protecting my sister from the gunfire in Vegas.", "1_Text": "Former active using IV Dilaudid addict here, best feeling in the world.", "2_Subreddit": "pics"}], "dnwvl2b": [{"0_Comment Submission": "What automatically makes you lose respect for another person?", "1_Text": "Being rude to a waiter.", "2_Subreddit": "AskReddit"}], "dopj3zc": [{"0_Comment Submission": "Aus vs US heroin strength", "1_Text": "If you're taking 8mg sub rather often and only waiting 24 hours to dose H you probably aren't getting full effects because there's still bupe on your receptors. (Edit added) it doesn't answer your question but you should be able to feel Dilaudid more as it hits the third opiate receptor (I think mu) in your brain most others don't (and bupe doesn't coat it much or at all) and breaks through better than H would.", "2_Subreddit": "opiates"}], "dqi9n4r": [{"0_Comment Submission": "Favorite opiate?", "1_Text": "Hydromorphone , purely because of the rush from IV", "2_Subreddit": "opiates"}], "dqicwe4": [{"0_Comment Submission": "You can tell the fish you’re about to get by paying attention to its shadow", "1_Text": "That's been the case in this game for years my friend, glad you're enjoying it and discovered that nifty hint ~", "2_Subreddit": "AnimalCrossing"}], "dqk7j6n": [{"0_Comment Submission": "What is the most fucked up thing you have seen in real life?", "1_Text": "I work doing odds and ends at a funeral home one day a week , mostly in the prep room , embalmings are my specialty. When someone comes in from the medical examiner post autopsy they are literally emptied of organs , ribs cut , chest plate removed , skull cut in half , etc. I'm used to it now but something very disturbing to me was seeing someone's face folded forward over the skin so the muscle and etc was showing . That was morbidly facsinating, looking at all the inner workings of a face and then touching mine. \n\nBack in college I had the sad fate of finding someone who committed suicide by jumping off the 7th floor. Actually lived two apartments down from me. They don't tell you how brains smell different then usual blood , it's kinda sour .", "2_Subreddit": "AskReddit"}], "dqlch96": [{"0_Comment Submission": "Obese Autopsy : The Post Mortem", "1_Text": "I embalmed a 450 pound woman about a month ago. I was elbow deep in her thigh trying to find the right side artery near her groin since she obviously wasn't going to be able to do it all via one shot in her neck, poor circulation and all. It was not fun. She had to go in a U-Haul because she was too heavy to ship via plane or train and her family needed her up to the location of the service asap so we didn't have much planning.", "2_Subreddit": "MorbidReality"}], "dqlihgh": [{"0_Comment Submission": "Obese Autopsy : The Post Mortem", "1_Text": "There's different laws for bodies, they are on a lot of commercial flights in cargo and most passengers are none the wiser.", "2_Subreddit": "MorbidReality"}], "dqqjiwe": [{"0_Comment Submission": "My cousin’s very sweet one-eyed, three-legged, no tailed cat named Lucky.", "1_Text": "One of my best friends has a cat with a deformed, curled up leg on her back / spine , as well as her usual 4 healthy and normally functioning legs. Her name is High Five.", "2_Subreddit": "aww"}], "dqvfq1w": [{"0_Comment Submission": "Whats your worst part of withdrawal?", "1_Text": "Once I sneeze three times in a row when I'm getting sick the WD's worsen significantly almost immediately haha", "2_Subreddit": "opiates"}], "dt94z83": [{"0_Comment Submission": "Haven't we all?", "1_Text": "When I saw this posted on a social media site yesterday they wrote it in poem form:\n\nRoses are red,\nViolets are blue,\nFlorida man tries to give himself brain damage to start Skyrim anew.", "2_Subreddit": "gaming"}], "dvf1go9": [{"0_Comment Submission": "[Gear Shot] Sharing the pax with the real homies", "1_Text": "Must be Canellllaaaa haha I'm glad someone else thought of this as well.", "2_Subreddit": "vaporents"}], "dwkw1jf": [{"0_Comment Submission": "PRAISE JJ! Can’t even believe it HA!", "1_Text": "Found half a dilaudid 8mg the other night , I already was banging a bunch of dillys so it was effectively not used as wisely as it could've been but I was surprised and happy", "2_Subreddit": "opiates"}]}], "1_submissions": [{"1owszy": [{"0_Title": "Bulgogi beef and kimchi; spicy shrimp and 'slaw. Both served on soft buns with scallions. Cinnamon sugar wonton strips to boot. This is true food truck porn [960 x 960]", "1_Text": "25 now; 15 my first time.", "2_Subreddit": "FoodPorn"}], "1p0f3z": [{"0_Title": "Beautiful shepherd's pie with rosemary garnish and a lovely variety of sides, paired with a pint of Carlsberg. Sometime in July, Dublin. [ 720 x 960 ]", "1_Text": "25 now; 15 my first time.", "2_Subreddit": "FoodPorn"}], "1zalu0": [{"0_Title": "Any other Animal Crossing ents out there?", "1_Text": "25 now; 15 my first time.", "2_Subreddit": "trees"}], "1zh3rj": [{"0_Title": "Light lunchtime snack, ingredients too [4]", "1_Text": "25 now; 15 my first time.", "2_Subreddit": "trees"}], "2rd5jd": [{"0_Title": "Homemade Prosciutto White 'Za", "1_Text": "25 now; 15 my first time.", "2_Subreddit": "Pizza"}], "3clne1": [{"0_Title": "Dopesick Vacation", "1_Text": "25 now; 15 my first time.", "2_Subreddit": "opiates"}], "3g2vcn": [{"0_Title": "The New Blackhole Under My Drivers Seat", "1_Text": "25 now; 15 my first time.", "2_Subreddit": "opiates"}], "44hf9h": [{"0_Title": "The mysteries of the combination KFC/Taco Bell and geometry as a means to order food", "1_Text": "25 now; 15 my first time.", "2_Subreddit": "funny"}], "468aux": [{"0_Title": "This may be out of the ordinary ...", "1_Text": "25 now; 15 my first time.", "2_Subreddit": "opiates"}], "4hzyvx": [{"0_Title": "This advertisement makes Glade look like a fat shot", "1_Text": "25 now; 15 my first time.", "2_Subreddit": "opiates"}], "4jxh4w": [{"0_Title": "Self Control Q's", "1_Text": "25 now; 15 my first time.", "2_Subreddit": "opiates"}], "7a6ipl": [{"0_Title": "Sub time, productive time", "1_Text": "25 now; 15 my first time.", "2_Subreddit": "opiates"}]}]}]}