{"Illenarav": [{"0_comments": [{"dw4hlcx": [{"0_Comment Submission": "This bathroom stall has a place to put your phone while you sit.", "1_Text": "I think you mean shiturbate. This phone holder allows you to have both hands free so you can wipe *and* stroke while your favorite video plays.", "2_Subreddit": "mildlyinteresting"}], "dw5jltf": [{"0_Comment Submission": "I (19M) have a crush on a good friend of mine (19F) but I am already dating a girl but plan on ending it soon because I no longer feel the spark and long distance is becoming too difficult, however my crush likes my best friend. Should I confess?", "1_Text": "Cuffing seasons almost over bro.\n\nEnd the relationship you obviously already gave up on, like yesterday. \n\nProtocol would be to ask your best friend if he's trying to smash or not. If he's goin for it he's got dibs, you cock blocked yourself stringing your girlfriend along. If not, congrats you might not have fucked this up all the way yet.\n\nEither way the beginning of hoe season is always messy, whenever the temperature starts heating up so will the drama.", "2_Subreddit": "relationships"}], "dwcim0q": [{"0_Comment Submission": "Right, because someone would actually talk to a judge like that", "1_Text": "That's what i thought when i heard gucci mane said \"bitch i might be\" to the judge after they asked what he was pleading...\n\nThen i seen the video, yeah he definitely  said that shit. Straight faced too.", "2_Subreddit": "thatHappened"}], "dwcj3so": [{"0_Comment Submission": "My [23F] Muslim husband [25M] of 4 years is destroying my own faith in Islam", "1_Text": "Yeah you're going to want to look into those custody laws. \n\nI watched a documentary about how in the united states, Hasidic jewish women almost never get to keep the children. The faith basically requires you to stay in the community, but divorced women are basically lower then lepers so they end up leaving and then losing the children because the community crowd fund for the husbands lawyer and stuff.\n\nEdit: you can basicallu ignore all of this i forgot you were saying the whole time your faith was just waivering not that you qere leaving islam.", "2_Subreddit": "relationships"}], "dwcmmk2": [{"0_Comment Submission": "This ain't YouTube B****", "1_Text": "Well it is getting close to bar close (atleast in my county, because this county sucks). I wouldn't doubt it though, I've seen crazier shit go down in minneapolis and st. Paul during the day.\n\nThere's certain streets that have little to no traffic. Except when the dealers open up shop of course, then it's like some kinda pop-up open air black market for 30 minutes to an hour while all the people from the burbs bum rush the local dope boys with cash in hand.\n\nEither way I'd imagine that would be considered a tame response in or around houston, chicago, Indianapolis, Cleveland, detroit, baton rouge, new orleans or any other major city...", "2_Subreddit": "funny"}], "dwconrg": [{"0_Comment Submission": "My [23F] Muslim husband [25M] of 4 years is destroying my own faith in Islam", "1_Text": "Yeah it was pretty sad honestly, it was on netflix but i can't remember the name of it.\n\n Essentially the women either have to remain in the abusive relationship, live as an outcast within the community (to the point people won't speak to them or openly harass them),  or somehow beat the fathers lawyer, which is funded by the community through the synagogue (which isn't taxed of course).", "2_Subreddit": "relationships"}], "dwdofok": [{"0_Comment Submission": "People that have lost a shoe on the side of the road, how?", "1_Text": "doing a dine and dash with 4 of my friends from a family owned chinese buffet when we were in high school. I turned around to pick it up, but when i seen 2 employees bust out of the door i decided to call it a loss and leave it there.", "2_Subreddit": "AskReddit"}], "dweuub1": [{"0_Comment Submission": "Will buying music giving me *noticeably* better sound quality, compared to downloading it off youtube?", "1_Text": "The simple answer is yes because the audio files on youtube you're downloading are altered (i wanna say compressed I've been up for a long time so i don't wanna actually use google) from the originals, but it depends on what your using for sound as well. \n\nIf you're using some $15 skull candy in-ear buds from a gas station, you'd probably be better off upgrading those first and see if it makes up the difference for you.", "2_Subreddit": "Music"}], "dwewpes": [{"0_Comment Submission": "[Serious] If you thought someone was catfishing you, how would you go about finding out without ruining the relationship if you're wrong?", "1_Text": "I don't see a problem with asking them for a skype video call...or even a short vid over snapchat of them, just try to make it topical. Like if they talk about their cat ask for a photo or of them holding it or playing with it or something.", "2_Subreddit": "AskReddit"}], "dwex5kk": [{"0_Comment Submission": "American Democratic and Republican supporters, why do you feel the need to label yourselves politically and fight with each other constantly?", "1_Text": "Like most americans i support and oppose many things, but not syrongly enough to pick up a pen.\n\nPlus i like to argue, to the point I'll play devils advocate for shits and gigs.", "2_Subreddit": "AskReddit"}], "dwfbbjb": [{"0_Comment Submission": "On My Block, the most overlooked Netflix original of the year so far?", "1_Text": "I guess i know what I'm binging today", "2_Subreddit": "television"}], "dwg7ewj": [{"0_Comment Submission": "Rehabilitated alcoholics of reddit. Why is life so boring with out alcohol? How did you handle the boredom?", "1_Text": "Can confirm as a former alcoholic.\n\nCurrently on hour 29 without sleep, only like 14 hours are due to cocaine to be real vecause i work 12 hour shifts.\n\nSurprisingly as terrible as that sounds my life is much more in control since i stopped drinking. Hell i even go to the gym now in my free time, I'm down roughly 30 lbs bringing me halfway to my goal of 15% body fat.", "2_Subreddit": "AskReddit"}], "dwg7tnh": [{"0_Comment Submission": "White people of Reddit, what is something that a black person may not understand?", "1_Text": "The sun is dangerous", "2_Subreddit": "AskReddit"}], "dwg81j8": [{"0_Comment Submission": "Rehabilitated alcoholics of reddit. Why is life so boring with out alcohol? How did you handle the boredom?", "1_Text": "Oh i feel that, i was heavily addicted to opiates before i switched to alcohol. Completely destroyed my life then rebuilt it by forcing myself to join the army. Then i realized how much i hated the army and started drinking.\n\nHopefully when i reach my target weight I'll be fine just being a gym rat and getting tattoos like my tattoo artist. It helps to have positive people in your life, which is why he doesn't know about the other stuff i do. I think it would alienate the only positive influence i currently have.", "2_Subreddit": "AskReddit"}], "dwhxzn1": [{"0_Comment Submission": "What's the cheapest site to buy things from China?", "1_Text": "Bumping this, i used it a cpuple different times and was not disappointed.\n\nMy friend ordered some kinda dab rig off it that was like $200. It was a knock off of some brand thats $2k minimum because of some copyrighted \"honeycomb\" percolator or something, i dunno. Long story short he used it over his other pieces ranging from 400-1k so they definitely have some decent vendors.", "2_Subreddit": "AskReddit"}], "dwjra25": [{"0_Comment Submission": "What is your experience with urinalysis and old prescriptions to explain positive results?", "1_Text": "1. Expired script = you don't have a script, 100% chance that's an automatic fail\n\n2. If dude for some reason overlooked #1, (which i can't imagine happening without some kind of mouth to cock action) they definitely would be able to tell your levels don't match what your \"script\" says if they send it to a lab and it's not an instant test. I would assume it's not an instant test unless it's done on the jobsite.\n\n3. How long anything stays in your system depends on so many factors that are unkown (your weight, usage, metabolism) it's just safer to say you probably should just use fake piss. It don't sound like your really planning to stay clean long enough to pass a piss test anyway, right?", "2_Subreddit": "opiates"}], "dwp1xnt": [{"0_Comment Submission": "My first boyfriend (M26) gave me (F23) herpes. I am afraid that I will stay single forever now.", "1_Text": "According to the CDC 1 in 6 people ages 14-49 have hsv type 2 (that's genital herpes).\n\nThat's 20% of people. I'd put money on any guy you meet that has had sex with more than 5 people has either already contracted it, or came in contact with it and didn't even know.\n\nYou can continue to let that one flare up ruin your life, or you can move on. I'd suggest doing some research about viral shedding and the transmission of hsv2 and how you can minimize the risk of transmission.\n\nI believe there's even pills you can take now to limit the risk, although having 1 flare up *ever* doesn't sound like that's necessary at all. Good luck.", "2_Subreddit": "relationships"}], "dwp2wdm": [{"0_Comment Submission": "ELI5: how is that people who do Parkour don’t compete in the Olympics in long jump, high jump and floor gymnastics? Are they not actually jumping that high or far?", "1_Text": "Alot of those people are actually gymnasts...\n\nbut you're talking about comparing world class athletes, some that have been training in a very controlled environment since childhood for a highly specific event, with athletic people that like to \"free run/climb\" as a hobby.\n\nIt's like saying \"why isn't every buff guy at my local gym trying for mr. Universe?\" While they may have the ability to compete on some kind of level, the people at that stage are in a completely different category.", "2_Subreddit": "explainlikeimfive"}], "dwp3drf": [{"0_Comment Submission": "Was the acting in Full Metal Jacket supposed to be bad? Or were people just different then?", "1_Text": "You're gonna have to be more specific.\n\nI mean the drill sgt was literally a former drill sgt in the marines and he won a golden hlobe for best supporting actor so...", "2_Subreddit": "AskReddit"}], "dwp3lfc": [{"0_Comment Submission": "Was there a time you were fooling around with someone and almost got caught but didn’t? NSFW", "1_Text": "This one time in my room, me and my girlfriend were about to have the sex, then my mom came home. I told her \"mom, go away we're studying for health class!\" And then she did. Then we did it.\n\nShe didn't know we were really studying sex class lol.", "2_Subreddit": "AskReddit"}], "dwpbviv": [{"0_Comment Submission": "What do you do when you get bored of scrolling through Reddit, besides waiting 5 minutes and going back on Reddit?", "1_Text": "Another line", "2_Subreddit": "AskReddit"}], "dwpp814": [{"0_Comment Submission": "This clock labled with birds.", "1_Text": "Ugh...my mom did too, I *hated* it.", "2_Subreddit": "mildlyinteresting"}], "dwu8xfk": [{"0_Comment Submission": "Am I doing this right?", "1_Text": "Yes, we should consider ourselves lucky to have such a selfless man in the oval office. Everyday I wake knowing trump gave up so much and is only thinking of me, the common man.\n\nUnlike his predecessors, these policy decisions and people he's appointed to top positions within our government were clearly made *without* any kind of ulterior motives or conflicts of interest. I mean seriously, do we really need to mention his stellar history of always looking out for the next man? Through his tough, but fair negotiation and business practices he's already shown how much he cares for small business and the working class! Thank you trump daddy! I rest easier knowing you really are taking care of people like me. \n\n/s on all of this", "2_Subreddit": "Tinder"}], "dwu937d": [{"0_Comment Submission": "What's the most disgusting food combination that you eat on purpose (and enjoy)?", "1_Text": "*Please* tell me you atleast throw some gravy on there, or have some kinda seasonings in the potatoes?\n\nthere's a joke in here somewhere about this being to spicy for white people...i know it.", "2_Subreddit": "AskReddit"}], "dwwh8b6": [{"0_Comment Submission": "How typical is it for guys to fuck hoes off of Backpage?", "1_Text": "Wasn't that the craigslist personals?\n\nProbably both actually seeing as that new law would hold them both accountable for what people put on there...", "2_Subreddit": "AskReddit"}]}], "1_submissions": [{"7eg64u": [{"0_Title": "Buckfast ...Does it get you fucked fast?", "1_Text": "I think you mean shiturbate. This phone holder allows you to have both hands free so you can wipe *and* stroke while your favorite video plays.", "2_Subreddit": "cripplingalcoholism"}], "7kx5wq": [{"0_Title": "Is there a \"group finder\" website/discord you know about?", "1_Text": "I think you mean shiturbate. This phone holder allows you to have both hands free so you can wipe *and* stroke while your favorite video plays.", "2_Subreddit": "leagueoflegends"}]}]}]}