{"o-o-o-link-o-o-o": [{"0_comments": [{"dvyi3r6": [{"0_Comment Submission": "Ok so ami tweaking or are these colorations all slightly different? It isnt the lighting kr the photo. I saear i see it with my own eyes. But cant quite tell forsure. Wierd part is, theyre all from the same pickup. Took 1/3 of one and it was tasteless but imquite certain i feel the effects.", "1_Text": "Zolpidem is ambien.", "2_Subreddit": "benzodiazepines"}], "dw7cg9t": [{"0_Comment Submission": "/r/druggardeningmarket banned.", "1_Text": "As a beginner this really bites... I'm already having trouble sourcing various seeds and cuttings. Tips appreciated", "2_Subreddit": "druggardening"}], "dw7cght": [{"0_Comment Submission": "/r/druggardeningmarket banned.", "1_Text": "As a beginner this really bites... I'm already having trouble sourcing various seeds and cuttings. Tips appreciated", "2_Subreddit": "druggardening"}], "dw9vc9q": [{"0_Comment Submission": "Testing Gel tabs", "1_Text": "Well, you got the color. \n\nI would say upon ingestion if they're bitter they're no good. If you taste nothing but gelatin and absolutely no adulterant you should be in the clear.", "2_Subreddit": "LSD"}], "dw9vwpk": [{"0_Comment Submission": "WARNING: do NOT make serious purchases when high.", "1_Text": "A small lie might not hurt in a situation like this. \n\n\"My grandmother unexpectedly passed away and her wake is that weekend.\" \n\nSomething like that should help.", "2_Subreddit": "Drugs"}], "dw9w4bh": [{"0_Comment Submission": "70mg for first time to breakthrough?", "1_Text": "Yes. I did about the same amount my first time. Instead of a glass pipe I used a dab water pipe. Fumed up nicely when I dropped the carb cap onto the nail and I was gone.", "2_Subreddit": "DMT"}], "dwiolil": [{"0_Comment Submission": "How can I get silver nitrate without having to use nitric acid? (And without buying silver nitrate directly)", "1_Text": "At the same time, what if OP is doing something completely legal and harmless? \n\n....Whose to say?", "2_Subreddit": "chemistry"}], "dwioxd5": [{"0_Comment Submission": "I made this canvas myself.", "1_Text": "That's deep.", "2_Subreddit": "opiates"}], "dwkjuvw": [{"0_Comment Submission": "Need some help", "1_Text": "3 separate 100ug doses through ought a day isn't microdosing. 100ug is a standard street tab which will make you trip. Microdosing would be taking an even more minicule amount of LSD. (i.e. 30ug-35ug", "2_Subreddit": "Drugs"}], "dwlc9zi": [{"0_Comment Submission": "Need some help", "1_Text": "We're all different, I've noticed subtle effects at 30ug barely any besides audio enhancement around 20ug in a liquid solution. \nBut you are right, typically you'd shoot for around the threshold but I've experimented plenty with micro and that's just my spot on the scale!", "2_Subreddit": "Drugs"}], "dwlkfg9": [{"0_Comment Submission": "When would I know that it’s at the right temp to dab?", "1_Text": "I used to heat for about 10-15 seconds, wait about 25-30 seconds then drop spice in, carb cap and the smoke should cloud up nice and thick. (Quartz banger)", "2_Subreddit": "DMT"}], "dwlmg3w": [{"0_Comment Submission": "When would I know that it’s at the right temp to dab?", "1_Text": "No problem! \n\nAny questions ask away! I'm very familiar with both extraction and consumption.", "2_Subreddit": "DMT"}], "dwlmm4d": [{"0_Comment Submission": "Cwe", "1_Text": "Logistically any way listed will get the job done in the end.", "2_Subreddit": "Drugs"}], "dwlmvcp": [{"0_Comment Submission": "Started a GoFundMe to be the first guy to get high in space", "1_Text": "You gotta totally make like a sealed gravity room for an antigravity environment for inside the space ship. Then you just go to space hop in your room which you probably made billions making and selling to the space toking ents and get high. \n\nProblem solved plus you're rich.", "2_Subreddit": "trees"}], "dwn58qa": [{"0_Comment Submission": "amphetamine or mDMA?", "1_Text": "If abused everyday in the same fashion? \n\nThe one that's more neurotoxic than the other.", "2_Subreddit": "Stims"}], "dwn60fo": [{"0_Comment Submission": "amphetamine or mDMA?", "1_Text": "My guess would because of the way people use the two and how differently they do when they do. \n\nWith amphetamines theirs a dark cloud of stigma surrounding the topic of use and abuse. A lot of people get out of hand with them and can't stop using them deeming them a \"crackhead\" to society. \n\nWith MDMA you seem to see a lot more 'respect' givin to the substance. People tend to follow more rules/guidelines for harm reduction. They (some, not all) don't over indulge and binge for days on end. They have a fun night, recover, then do it again so they don't \"lose the magic.\" \n\nOnes more of a \"party drug\" versus a drug doctors give little kids because their teachers can't handle them.", "2_Subreddit": "Stims"}], "dwodsyt": [{"0_Comment Submission": "I got way too leaned out at my parents house, ashamed of myself", "1_Text": "Give N/A a shot. It can't hurt. Maybe you going to a meeting like that will give you a different mentality.\nMaybe you'll think \"nah, I shouldn't pour up my sponsor wouldn't want me to do that.\"\nHell, maybe you won't. It wouldn't hurt to try though. \n\nYou could also attend AL-ANON meetings with your parents perhaps? That way they see you're really dedicated to not only helping yourself but them as well as you strive to better yourself. \n\nAnd if these types of support can't help then maybe rehab is the only option for you! But you gotta want it! Which it seems like you do. The only downside to rehab, as mentioned before, is it can be costly. \n\nI wish you luck on your journey to better yourself!", "2_Subreddit": "Drugs"}], "dwodw85": [{"0_Comment Submission": "your girl wants to try hexen..where to start?", "1_Text": "Savage", "2_Subreddit": "Stims"}], "dwqklwu": [{"0_Comment Submission": "So I’m going to do shrooms for the first time. I weigh 275 lbs, how much should I take?", "1_Text": "An eighth", "2_Subreddit": "shrooms"}], "dwv92tc": [{"0_Comment Submission": "First time taking LSD (what should I expect)", "1_Text": "Do whatever you feel is right in the moment. Don't fight what the substance is doing to you, just let go, vibe out, and have a good time. Music is going to be better than you've ever heard it before, everything will be visually stunning as well. \n\nJust dose and let the trip do the work, you'll know what I'm talking about once you feel what it's like.", "2_Subreddit": "LSD"}], "dwvdce1": [{"0_Comment Submission": "First time taking LSD (what should I expect)", "1_Text": "What kind of music are you into? DM me if you're having trouble finding neat music to listen to! \n\nPersonally I like to stay away from movies as they tend to make me think a lot and then I end up thinking about everything, music is great though. And nature is as well.", "2_Subreddit": "LSD"}], "dwwg1vc": [{"0_Comment Submission": "Flubromazolam solution dilution", "1_Text": "That it is. Strongest rc benzo I've researched in my experience.", "2_Subreddit": "researchchemicals"}], "dwwgikh": [{"0_Comment Submission": "Does this look like shroom powder?", "1_Text": "How does it taste?? Smell??", "2_Subreddit": "shrooms"}], "dwxd2it": [{"0_Comment Submission": "Smoking sub strips", "1_Text": "Following for science", "2_Subreddit": "opiates"}], "dwxdaxg": [{"0_Comment Submission": "My collection of bunk pills over the last few months. Why do people even do this? What do people gain from this? (Besides like 60 bucks)", "1_Text": "What's wrong with them? Have you tested them?", "2_Subreddit": "MDMA"}]}], "1_submissions": [{}]}]}