{"mergerr": [{"0_comments": [{"dwlkv4h": [{"0_Comment Submission": "[FIGHT THREAD] ANTHONY JOSHUA VS JOSEPH PARKER, ALEXANDER POVETKIN VS DAVID PRICE, RYAN BURNETT VS YONFREZ PAREJO, JOSH KELLY VS CARLOS MOLINA, ANTHONY CROLLA VS EDSON RAMIREZ & MORE + LIVE ROUND BY ROUND COVERAGE", "1_Text": "Idk this isn't a good game plan by parker.", "2_Subreddit": "Boxing"}], "dwlmh95": [{"0_Comment Submission": "[FIGHT THREAD] ANTHONY JOSHUA VS JOSEPH PARKER, ALEXANDER POVETKIN VS DAVID PRICE, RYAN BURNETT VS YONFREZ PAREJO, JOSH KELLY VS CARLOS MOLINA, ANTHONY CROLLA VS EDSON RAMIREZ & MORE + LIVE ROUND BY ROUND COVERAGE", "1_Text": "Holy fuck what a sham. From the undercard to the ref. I'm kinda pissed I wasted my morning and afternoon on that bullshit.", "2_Subreddit": "Boxing"}], "dwlmo9d": [{"0_Comment Submission": "[FIGHT THREAD] ANTHONY JOSHUA VS JOSEPH PARKER, ALEXANDER POVETKIN VS DAVID PRICE, RYAN BURNETT VS YONFREZ PAREJO, JOSH KELLY VS CARLOS MOLINA, ANTHONY CROLLA VS EDSON RAMIREZ & MORE + LIVE ROUND BY ROUND COVERAGE", "1_Text": "119-109\n\nLol british boxing should have its own sub.", "2_Subreddit": "Boxing"}], "dwlngl3": [{"0_Comment Submission": "[FIGHT THREAD] ANTHONY JOSHUA VS JOSEPH PARKER, ALEXANDER POVETKIN VS DAVID PRICE, RYAN BURNETT VS YONFREZ PAREJO, JOSH KELLY VS CARLOS MOLINA, ANTHONY CROLLA VS EDSON RAMIREZ & MORE + LIVE ROUND BY ROUND COVERAGE", "1_Text": "Yes, walking around in fog all day is the tits m8", "2_Subreddit": "Boxing"}], "dwlobkm": [{"0_Comment Submission": "Anthony Joshua vs. Joseph Parker", "1_Text": "Broke them up sooner than bernie supporters break up their freshly scored dime-bag.\n\nAm I doing this right? Idk.. w/e", "2_Subreddit": "Boxing"}], "dwls1ps": [{"0_Comment Submission": "Anthony Joshua vs. Joseph Parker", "1_Text": "Do ppl not break up their bud anymore haha", "2_Subreddit": "Boxing"}], "dwmxxdd": [{"0_Comment Submission": "People get stressed out because of me and i don't get why", "1_Text": "Alot of people say my tone is condescending even when I don't mean it to be. I think it's classic ENTP.", "2_Subreddit": "entp"}], "dwnfbv1": [{"0_Comment Submission": "BBC: What next for Anthony Joshua?", "1_Text": "As a fan i am upset with his situation but honestly if I was him i would ride this wonderful situation he's in. Fuck it I'd sell out stadiums in the UK for the next couple years fighting 5-20 ranked guys and invest the money. He could make some serious acute money fighting wilder but it is a huge risk because if he gets KO'D hid stocks will plummet. He's only 28. He should milk it for everything it's worth. He has the refs and judges on his side so his risk is minimal", "2_Subreddit": "Boxing"}], "dwngrmv": [{"0_Comment Submission": "BBC: What next for Anthony Joshua?", "1_Text": "Possible, do u think that wilder is down for a rematch tho? He's smart enough to realize if he beats AJ there's a possibility he can lose in a rematch. Idk. These guys are about money. Both will prolly keep it that way.", "2_Subreddit": "Boxing"}], "dwootcl": [{"0_Comment Submission": "Best heavyweight match ups other than AJ wilder", "1_Text": "Glad someone mentioned kownacki. Think he could possibly KO some of the top 5 ranked.", "2_Subreddit": "Boxing"}], "dwop4bh": [{"0_Comment Submission": "Fake Personalities in Boxing", "1_Text": "I'm 100% certain the charlos are not really the shit bags they try to lead you on to believe that they are. It's all an act the whole thing. They are probably super chill behind closed doors.", "2_Subreddit": "Boxing"}], "dwox5hp": [{"0_Comment Submission": "What is the silliest name you've ever heard of for a person?", "1_Text": "British last names are hilarious.\n\nCheeseman\n\nSexton\n\nCornish\n \nJust some recent ones I heard.", "2_Subreddit": "AskReddit"}], "dws377i": [{"0_Comment Submission": "Golden Boy Prez Hopes To Have Canelo Fight By The Summer", "1_Text": "Interesting you don't think they would work something out for even 75% of the value? I guess he could try to do this again in 2019 but there is no guarantee ggg or Canelo won't sustain any sort of injury. Kind of a bird in one hand 2 birds in a bush type. Idk tomorrow isn't promised and even a good fraction is still a lot of $$$$ in this situation.", "2_Subreddit": "Boxing"}], "dwsy03x": [{"0_Comment Submission": "Julian Williams' Coach Gives Lara Edge Over Hurd, Talks Gallimore", "1_Text": "Think hurd has slicker skills than he leads us on to believe of late. The fans who dont seem to be very high on him are the ones who have only watched the harrison and trout fight. Galarza and the fights after, he demonstrated some pretty slick movement and countering.\n\nBut yeah there is a possibility he just gets completely outclassed and loses a decision... a real risk for anyone fighting lara.", "2_Subreddit": "Boxing"}], "dwt0ofy": [{"0_Comment Submission": "Man Koed while returning stolen/lost phone", "1_Text": "Straight up I found an iphone x brand new in the box last week in a bag on a sidewalk outside a house. The good person somewhere in me wanted to find the owner directly and return his phone, but then shit like this comes to mind and just turned it into the police instead.", "2_Subreddit": "StreetFights"}], "dwu2owq": [{"0_Comment Submission": "When you watch a boxing match, what is it that you watch and look out for in the fighters? And what do you base your scoring on as the rounds progress?", "1_Text": "Mines kind of obscure but I just look for who looks to be the most frustrated fighter, like who is getting bothered the most by the other man. This is why I have scored fights a certain way. Lara vs canelo is a good example. Canelo was doing what he could but he looked visibly annoyed during the fight and in my books had lara edge it for that reason. Also why I felt canelo/jacobs bothered ggg so I had those ones close or them edging them over ggg.", "2_Subreddit": "Boxing"}], "dwubgvu": [{"0_Comment Submission": "When you watch a boxing match, what is it that you watch and look out for in the fighters? And what do you base your scoring on as the rounds progress?", "1_Text": "Idk I saw it differently granted I watched it only live but felt that ggg was getting frustrated and he lost points on my scorecard cuz of it. Maybe if I rewatch I'd feel differently.", "2_Subreddit": "Boxing"}], "dww6pjf": [{"0_Comment Submission": "Mexican president to Trump: Direct your frustrations at Congress, not Mexicans", "1_Text": "Lol by your logic nowhere in the world is a failed state either.", "2_Subreddit": "worldnews"}], "dww7ajw": [{"0_Comment Submission": "Mexican president to Trump: Direct your frustrations at Congress, not Mexicans", "1_Text": "Idk Mexican squirrels are thieves and rapists so....", "2_Subreddit": "worldnews"}], "dww7v2l": [{"0_Comment Submission": "Mexican president to Trump: Direct your frustrations at Congress, not Mexicans", "1_Text": "I'd say so but to use \"*where I'm at* its good\" is a terrible argument. Someone from literally any place in the world can use that, and to sustain an argument that the governing body of Mexico is somehow more democratic or even more sufficient than the U.S. is utterly absurd.", "2_Subreddit": "worldnews"}], "dww9qml": [{"0_Comment Submission": "Mexican president to Trump: Direct your frustrations at Congress, not Mexicans", "1_Text": "I mean there's problems *everywhere* the US is no exception. If you think Mexico has a better democratic state than the US tho, ur an idiot and are not worth arguing with.", "2_Subreddit": "worldnews"}], "dwwa96h": [{"0_Comment Submission": "Mexican president to Trump: Direct your frustrations at Congress, not Mexicans", "1_Text": "Yes, I've never left my mother's basement in syria.", "2_Subreddit": "worldnews"}], "dwx5kue": [{"0_Comment Submission": "Mexican president to Trump: Direct your frustrations at Congress, not Mexicans", "1_Text": "... If they were on equal levels, millions of mexicos citizens wouldn't flee to the other, risking everything they have in order to try to live in a *better life* in the US. It's not the other way around. Don't let your bias cloud your judgement here.", "2_Subreddit": "worldnews"}], "dwx704b": [{"0_Comment Submission": "Young Britons have never been unhappier, research suggests - Young people’s happiness across every single area of their lives has never been lower, research by the Prince’s Trust has found.", "1_Text": "Movies are the same. Hollywood is only banking on political unrest.", "2_Subreddit": "worldnews"}], "dwxcuzd": [{"0_Comment Submission": "I have never done any opiates. I've been browsing this sub for ~2 hours now.", "1_Text": "At what point is it considered out of hand? I've been abusing norcos/tramadols off and on for 5 years. I haven't gone to the street looking for them or anything, really only get em when my uncle throws me like 20 of them at a time every few months. I read stories here and it makes me paranoid that like it's 100% certain in only a couple more months I'll be at a point Im nodding out after shooting up. \n\nNever the less, does seem like it could be a slippery slope. The best feeling I have ever had off of any drug period was 40 minutes after taking 20mg of oxycodone 6 years ago. I'll never forget that.", "2_Subreddit": "opiates"}]}], "1_submissions": [{"7s6nmo": [{"0_Title": "How important is commute time to you?", "1_Text": "Idk this isn't a good game plan by parker.", "2_Subreddit": "personalfinance"}], "7so3i0": [{"0_Title": "CMV: If you enjoy playing MMORPG games, you are a capitalist at heart.", "1_Text": "Idk this isn't a good game plan by parker.", "2_Subreddit": "changemyview"}], "7v43ac": [{"0_Title": "What is your \"fake it til' you make it\" career story?", "1_Text": "Idk this isn't a good game plan by parker.", "2_Subreddit": "AskMen"}], "7vr467": [{"0_Title": "Those of you who have switched from your smart phone back to the classic flip or basic cellphone, how has your life improved or declined?", "1_Text": "Idk this isn't a good game plan by parker.", "2_Subreddit": "AskMen"}], "7wawl1": [{"0_Title": "What is the dumbest thing you've ever asked or stated?", "1_Text": "Idk this isn't a good game plan by parker.", "2_Subreddit": "AskMen"}], "7wqkx7": [{"0_Title": "Fantasy Match Up: Miguel Berchelt vs Mikey Garcia at super featherweight.", "1_Text": "Idk this isn't a good game plan by parker.", "2_Subreddit": "Boxing"}], "7ww6a9": [{"0_Title": "CMV: If you're under 25 years old, you should be able to serve the military in lieu of criminal incarceration sentences from sentences under 12 months.", "1_Text": "Idk this isn't a good game plan by parker.", "2_Subreddit": "changemyview"}], "7xbe17": [{"0_Title": "(Request) someone who works in the boxing industry not as a trainer or boxer.", "1_Text": "Idk this isn't a good game plan by parker.", "2_Subreddit": "AMA"}], "7xbv0i": [{"0_Title": "Military veteran here with first full-time job offer. Questions about salary negotiation, what your opinions are on how this would work for me.", "1_Text": "Idk this isn't a good game plan by parker.", "2_Subreddit": "personalfinance"}], "7y1hxu": [{"0_Title": "CMV: Child support rates should be flat based on the local COL, with only additional payments due when the child has special needs.", "1_Text": "Idk this isn't a good game plan by parker.", "2_Subreddit": "changemyview"}], "7zbxzu": [{"0_Title": "Those who have no college degree, what do you do and how much do you make? Do you feel you are paid fairly?", "1_Text": "Idk this isn't a good game plan by parker.", "2_Subreddit": "AskMen"}], "7zced5": [{"0_Title": "CMV: The people who believe that ring-girls should be banned from boxing events to combat objectification, should also advocate a strict dress code for women at nightclubs and bars.", "1_Text": "Idk this isn't a good game plan by parker.", "2_Subreddit": "changemyview"}], "801yg0": [{"0_Title": "Trying to help out an old friend who discharged under honorable conditions (general)", "1_Text": "Idk this isn't a good game plan by parker.", "2_Subreddit": "Veterans"}], "80gf7e": [{"0_Title": "[Boxing] Scott Westgarth passes away after a tough win in his boxing match this last weekend. Future boxing bets in UK discussion.", "1_Text": "Idk this isn't a good game plan by parker.", "2_Subreddit": "sportsbook"}], "80z880": [{"0_Title": "CMV: In light of Scott Westgarth's death, there has been a public call to ban the sport of boxing, particularly in the UK. I believe banning anything where all parties are consenting is immoral.", "1_Text": "Idk this isn't a good game plan by parker.", "2_Subreddit": "changemyview"}], "813el5": [{"0_Title": "What is your craziest \"small world\" story?", "1_Text": "Idk this isn't a good game plan by parker.", "2_Subreddit": "AskMen"}], "82axie": [{"0_Title": "Starting next Monday as a Sr. Maintenance Mechanic for a Biolab Pharmaceutical company. This will be my very first real civilian employee position. Any last minute advice from you guys?", "1_Text": "Idk this isn't a good game plan by parker.", "2_Subreddit": "IndustrialMaintenance"}], "82kziq": [{"0_Title": "Pay 100 a month for verizon phone. What is the go to switch in order to keep a smartphone with data?", "1_Text": "Idk this isn't a good game plan by parker.", "2_Subreddit": "Frugal"}], "834hj8": [{"0_Title": "Boxing: 3/9/2018 Discussion", "1_Text": "Idk this isn't a good game plan by parker.", "2_Subreddit": "sportsbook"}], "8381wr": [{"0_Title": "Someone please make a ratemynco.com", "1_Text": "Idk this isn't a good game plan by parker.", "2_Subreddit": "army"}], "841jo3": [{"0_Title": "Help, i'm losing faith in new releases.", "1_Text": "Idk this isn't a good game plan by parker.", "2_Subreddit": "movies"}], "848j00": [{"0_Title": "What is the most common delusion you come across that people have?", "1_Text": "Idk this isn't a good game plan by parker.", "2_Subreddit": "AskMen"}], "849p5w": [{"0_Title": "Daily usage and dosage", "1_Text": "Idk this isn't a good game plan by parker.", "2_Subreddit": "ambien"}], "87va9y": [{"0_Title": "Found a bag with weed and a brand new iPhone x in the box, what to do?", "1_Text": "Idk this isn't a good game plan by parker.", "2_Subreddit": "AskMen"}], "88dqlk": [{"0_Title": "What would you say the average seller is willing to negotiate down to?", "1_Text": "Idk this isn't a good game plan by parker.", "2_Subreddit": "Flipping"}]}]}]}