{"cendana287": [{"0_comments": [{"du8ct0f": [{"0_Comment Submission": "Thank you Bitcoin Cash Community! 99% of our customers paid in BCH and we received payment within seconds. We've shipped to 32 countries and 5 different continents. A truly borderless transaction!", "1_Text": "Shithead Shawny: here's a bit of education for a newbie like you. I made a transaction with BCH several hours ago to pay for a VPN service. The fee was... 1 cent. And it went through in the following block.\n\nOf course, I could also have used DigiByte or Navcoin, and the fee would have been less than 0.25 cent.\n\nGo get a basic education first, Shithead. Or you will keep exposing yourself as a clueless retard here LOL!", "2_Subreddit": "btc"}], "du8e5ju": [{"0_Comment Submission": "Wallet for INK?", "1_Text": "I don't have INK but I do have QTUM. Plus the latter's android wallet. I only use it to store QTUM and nothing else and am not clear about its other features including smart contracts. Maybe you should try ask at the QTUM subreddit about your problem here. Sorry I can't be of more help.", "2_Subreddit": "InkLabsFoundation"}], "du9jqao": [{"0_Comment Submission": "Coinbase Commerce officially launched today, with full BCH support", "1_Text": "Yeah, some people limit themselves unnecessarily. If it's cryptos, you simply MUST ALSO have BCH, ETH, LTC.", "2_Subreddit": "btc"}], "du9kcjx": [{"0_Comment Submission": "DigiByte Pulling Ahead", "1_Text": "DGB is ready here and now for daily use. As it is, without any Lightning Network sort of addition.\n\nBy the way, I'm puzzled as to why Binance hasn't listed it (yet?). Without DigiByte, an exchange just isn't complete.", "2_Subreddit": "Digibyte"}], "dua6epq": [{"0_Comment Submission": "Guys, bitcoin is $9k+!!!", "1_Text": "It feels like around late July 2017 again, after that sharp decline earlier. This time around $10k will be the psychological resistance. It might need a few attempts before it gets broken again. But it will - this is a level which BTC had gone past before.\n\nThe period after the Chinese New Year tomorrow will be interesting. This time around I have the feeling it will be like Sept-Oct 2017: investor attention will be on BTC and a few major coins. After the recent sharp fall, investors will be more selective with the cryptos they buy.", "2_Subreddit": "Bitcoin"}], "duh21cg": [{"0_Comment Submission": "Rick Falkvinge on the Lightning Network: Requirement to have private keys online, routing doesn't work, legal liability for nodes, and reactive mesh security doesn't work", "1_Text": "This channel is clearly a few cuts ahead of most other crypto channels. Very thoughtful videos here including this one. I’m wondering how Rick will be able to keep on producing this kind of quality.", "2_Subreddit": "btc"}], "duhd6qg": [{"0_Comment Submission": "Yahoo Finance: Bitcoin Is Not A Scam", "1_Text": "Had thought we are now well beyond that phase of “It’s a scam!” Not everyone has BTC or other cryptos. But anyone who does just basic research will not make a statement like that. Best to just ignore those who still claim that it is. Admittedly it might also be fun to ask him to show why it is so (and smiling while hearing the purported ‘evidence’ of “ponzi, pyramid, greater fool, governments banning it” and such).\n\nI feel the much bigger concern now relates to scammers using Bitcoin and cryptos as bait for various schemes. Plus in many crypto users not appreciating the importance of keeping their cryptos in wallets they have full control over. And not at exchanges, despite the fee to transfer.", "2_Subreddit": "Bitcoin"}], "dv24d9a": [{"0_Comment Submission": "BTCP fork illustrates massive weakness in cryptocurrency in general", "1_Text": "Exchanges also do their best to discourage people from withdrawing to their own wallets (and resulting in the former having less assets to roll). Bitcoin withdrawal is 0.001 BTC at Bittrex...even though they’d squeeze an individual’s withdrawal address with other addresses into one transaction, and pocket the excess fees collected.\n\n It’s not much different with other coins and tokens, and practically all other exchanges. Binance’s fees for ERC20 tokens are exorbitant. Ironically the much-lambasted Bitfinex (mostly due to its connection to Tether) offers the lowest withdrawal fee among exchanges.\n\nMore reasonable withdrawal fee at exchanges - I’m hoping for this to happen soon.", "2_Subreddit": "ZClassic"}], "dv24op2": [{"0_Comment Submission": "BTCP fork illustrates massive weakness in cryptocurrency in general", "1_Text": "This holding at exchanges - the most recent incident was Bitgrail. Some people got caught up in the “Raiblocks is the next big thing” hype and they simply must get in. Even though withdrawal of XRB from Bitgrail was suspended. That was yet another lesson about never buying anything one doesn’t have exclusive control over.", "2_Subreddit": "ZClassic"}], "dv922qk": [{"0_Comment Submission": "[Main Spoilers] How Characters Have Changed Over the Seasons", "1_Text": "He was one of the characters I hated. But I started to see him a bit differently when he saved Brienne from being raped. Then the incident where his hand was chopped off, and he became helpless. The turning point was when he turned back to save Brienne from the bear pit. \n\nJaime will play a major in Season 8. Especially in coming up with a strategy to face the Night King's massive army.", "2_Subreddit": "gameofthrones"}], "dv93h0u": [{"0_Comment Submission": "Do people realize that ETC has growing 100k transactions / day ? 5x more than Bitcoin Cash, 3x more than Litecoin. Price of ETC must be corrected !", "1_Text": "ETC is one of the crypto heavyweights that should also be in a crypto speculator's portfolio. That's because we don't know how things will play out in the future. Too many variables at work. Therefore it's prudent to hedge by having several big-name cryptos and not just one or two. The key is in deciding the percentage of each heavyweight as per our capital, and then averaging the price. \n\nI'm going overweight with ETC and BTC, at the expense of Bitcoin Cash and Litecoin. With ETC, its very fast and cheap transactions are an attraction. The post-CLO airdrop has resulted in a price correction and it makes sense to add some at this level.", "2_Subreddit": "EthereumClassic"}], "dv95hc3": [{"0_Comment Submission": "Do people realize that ETC has growing 100k transactions / day ? 5x more than Bitcoin Cash, 3x more than Litecoin. Price of ETC must be corrected !", "1_Text": "NAV - I believe this is a dark horse that's off most people's radar. I have a certain percentage in this coin too. Compared to some others, NAV looks undervalued. The Valence Platform it's working on is intriguing and worth noting. \n\nAs I had mentioned in another comment, there are too many variables at work. NAV and Valence might not be any sort of factor in the future. Or they just might, thanks to a confluence of events. We will know, eventually.", "2_Subreddit": "EthereumClassic"}], "dvh93qf": [{"0_Comment Submission": "US Senate deliberating bill to Audit the Federal Reserve", "1_Text": "While they’re at it, audit the gold at Fort Knox too. Amazing that various presidents over the decades had not insisted on this. Unless they know something shocking, and it’s in their narrow interest not to have the world know what the exact situation is.", "2_Subreddit": "Bitcoin"}], "dvhi91a": [{"0_Comment Submission": "A full explanation of how Keys & Addresses work. (see comment)", "1_Text": "Sometimes I’d find crypto posts at Reddit rather tiresome. Especially those repetitive “My preferred coin is the real deal, unlike your shitcoin.” And then I’d come across informative posts like this, which justify the time spent trawling through the site. Thanks.", "2_Subreddit": "Bitcoin"}], "dw3b5e7": [{"0_Comment Submission": "Suppoman talking to lead dev of Monero, without realizing who he is. Stop giving your money to this guy.", "1_Text": "It says a lot about those people who follow him. Their life, their choice. But with me and many others, he’s nothing special at all. After watching a few of his videos, it’s obvious he doesn’t have much substance.", "2_Subreddit": "CryptoCurrency"}], "dw3bb30": [{"0_Comment Submission": "/r/DarkNetMarkets shut down by Reddit", "1_Text": "Digg... whatever has happened to it? \nI’m going to check and see how it is. Must have been at least 7 years since I was there.", "2_Subreddit": "btc"}], "dw5hkpw": [{"0_Comment Submission": "What is happening, does anyone have an explanation that makes sense", "1_Text": "68 cents right now. \nSo much for “stable” coin. Now the remaining options are Tether and TrueUSD.", "2_Subreddit": "NuBits"}], "dw8o2sx": [{"0_Comment Submission": "Daily Discussion, March 24, 2018", "1_Text": "become compacts", "2_Subreddit": "Bitcoin"}], "dwje8a3": [{"0_Comment Submission": "What this sub has turned into:", "1_Text": "Averaging works. Buy at different price levels. We simply won't know what the highest and lowest are, until after the fact.\n\nHaving said that, must average with selling too. It's always a good thing to lock in profits when they come. This way we will always have cash in hand to take up the opportunity to buy again when the price dips. Like now.", "2_Subreddit": "litecoin"}], "dwjegxx": [{"0_Comment Submission": "Not Fazed At All", "1_Text": "There's a lesson here. Next time around, must not forget to also sell some during an uptrend. It's always a good thing to lock in some profit. So that we will have cash in hand to buy during the downtrend.", "2_Subreddit": "Digibyte"}], "dwjf7ks": [{"0_Comment Submission": "I want to run all my internet usage through my VPN by setting it up on my router, what is a good router recommendation to accomplish this?", "1_Text": "Thanks for the feedback. I was thinking about getting this Asus router to replace a lower end Asus which doesn't do OpenVPN. But I'm now hesitant after knowing about yours being limited to 10 mbit. \n\nRight now I'm getting 50 Mbit from the provider. Less on my laptop because of the Wi-Fi and AirVPN overhead.", "2_Subreddit": "VPN"}], "dwjg23l": [{"0_Comment Submission": "Digibyte Android Wallet works perfectly!!!", "1_Text": "digibyte.co... I thought the website is digibyte.io?", "2_Subreddit": "Digibyte"}], "dwjgjuk": [{"0_Comment Submission": "I’m getting my kids back, just gonna use this one last time", "1_Text": "The battered wife :-(", "2_Subreddit": "opiates"}], "dwjhfpv": [{"0_Comment Submission": "My prediction for Bitcoin. Based on only facts.", "1_Text": "Best laugh I've had at Reddit in the last couple of hours.", "2_Subreddit": "Bitcoin"}], "dwjhkf7": [{"0_Comment Submission": "Bitcoin is clearly dead ...", "1_Text": "$7,900", "2_Subreddit": "Bitcoin"}]}], "1_submissions": [{"7767wl": [{"0_Title": "Bittrex disabled my account! Lesson learned - \"Keep coins/tokens in *my* wallets\"", "1_Text": "Shithead Shawny: here's a bit of education for a newbie like you. I made a transaction with BCH several hours ago to pay for a VPN service. The fee was... 1 cent. And it went through in the following block.\n\nOf course, I could also have used DigiByte or Navcoin, and the fee would have been less than 0.25 cent.\n\nGo get a basic education first, Shithead. Or you will keep exposing yourself as a clueless retard here LOL!", "2_Subreddit": "CryptoCurrency"}], "7eiu42": [{"0_Title": "Slimy HitBTC most likely `borrowed' clients' BTG. And made MILLIONS selling at peak.", "1_Text": "Shithead Shawny: here's a bit of education for a newbie like you. I made a transaction with BCH several hours ago to pay for a VPN service. The fee was... 1 cent. And it went through in the following block.\n\nOf course, I could also have used DigiByte or Navcoin, and the fee would have been less than 0.25 cent.\n\nGo get a basic education first, Shithead. Or you will keep exposing yourself as a clueless retard here LOL!", "2_Subreddit": "hitbtc"}], "7ktg84": [{"0_Title": "Myriad's # of coins not showing up at Worldcoinindex.com", "1_Text": "Shithead Shawny: here's a bit of education for a newbie like you. I made a transaction with BCH several hours ago to pay for a VPN service. The fee was... 1 cent. And it went through in the following block.\n\nOf course, I could also have used DigiByte or Navcoin, and the fee would have been less than 0.25 cent.\n\nGo get a basic education first, Shithead. Or you will keep exposing yourself as a clueless retard here LOL!", "2_Subreddit": "myriadcoin"}], "7ofzy": [{"0_Title": "Gaza: How many of the people got there in the first place", "1_Text": "Shithead Shawny: here's a bit of education for a newbie like you. I made a transaction with BCH several hours ago to pay for a VPN service. The fee was... 1 cent. And it went through in the following block.\n\nOf course, I could also have used DigiByte or Navcoin, and the fee would have been less than 0.25 cent.\n\nGo get a basic education first, Shithead. Or you will keep exposing yourself as a clueless retard here LOL!", "2_Subreddit": "reddit.com"}], "7qyhx5": [{"0_Title": "Coinomi Update at Google Play (with Navcoin fix)", "1_Text": "Shithead Shawny: here's a bit of education for a newbie like you. I made a transaction with BCH several hours ago to pay for a VPN service. The fee was... 1 cent. And it went through in the following block.\n\nOf course, I could also have used DigiByte or Navcoin, and the fee would have been less than 0.25 cent.\n\nGo get a basic education first, Shithead. Or you will keep exposing yourself as a clueless retard here LOL!", "2_Subreddit": "NavCoin"}], "8bxkb": [{"0_Title": "Malaysia: Selangor Club shocker | Malay Mail Online", "1_Text": "Shithead Shawny: here's a bit of education for a newbie like you. I made a transaction with BCH several hours ago to pay for a VPN service. The fee was... 1 cent. And it went through in the following block.\n\nOf course, I could also have used DigiByte or Navcoin, and the fee would have been less than 0.25 cent.\n\nGo get a basic education first, Shithead. Or you will keep exposing yourself as a clueless retard here LOL!", "2_Subreddit": "reddit.com"}], "bjeyk": [{"0_Title": "Drug killers of Ciudad Juárez say they're not a gang but `a union'.", "1_Text": "Shithead Shawny: here's a bit of education for a newbie like you. I made a transaction with BCH several hours ago to pay for a VPN service. The fee was... 1 cent. And it went through in the following block.\n\nOf course, I could also have used DigiByte or Navcoin, and the fee would have been less than 0.25 cent.\n\nGo get a basic education first, Shithead. Or you will keep exposing yourself as a clueless retard here LOL!", "2_Subreddit": "worldnews"}], "cu9qm": [{"0_Title": "Keplar Project Discovers 140 Earth-Like Planets", "1_Text": "Shithead Shawny: here's a bit of education for a newbie like you. I made a transaction with BCH several hours ago to pay for a VPN service. The fee was... 1 cent. And it went through in the following block.\n\nOf course, I could also have used DigiByte or Navcoin, and the fee would have been less than 0.25 cent.\n\nGo get a basic education first, Shithead. Or you will keep exposing yourself as a clueless retard here LOL!", "2_Subreddit": "reddit.com"}], "d4ck4": [{"0_Title": "Sultan of Brunei's Ex-Wife Blocks Bestseller", "1_Text": "Shithead Shawny: here's a bit of education for a newbie like you. I made a transaction with BCH several hours ago to pay for a VPN service. The fee was... 1 cent. And it went through in the following block.\n\nOf course, I could also have used DigiByte or Navcoin, and the fee would have been less than 0.25 cent.\n\nGo get a basic education first, Shithead. Or you will keep exposing yourself as a clueless retard here LOL!", "2_Subreddit": "reddit.com"}]}]}]}