{"NinoBrown1980": [{"0_comments": [{"dwpqrq1": [{"0_Comment Submission": "President Trump’s Opioid Initiative will crack down on international and domestic illicit drug supply chains devastating American communities.", "1_Text": "Make \nLegally obtained opiate available to patients...a script for 180 30 mg oxys right now is useless to me...Walgreens won't touch it..CVS  wants no part of it... Walmart...yea right...so guess ill call the cartel... They seem to put the patient first... there was a time when I went to a Dr..then Walgreens ...spent 88$ and was set for the month..then fast forward a lil bit...doctor is paranoid... Walgreens distribution warehouse is missing all kinds of shit..DEA says Walgreens  your shit outta luck till u find out wtf happened to all these pills..so they cut the entire supply chain for affordable medicine...welcome independent pharmacy's...8 times the price..no insurance..cash only...now I'm paying 1400...doesn't take a genius to figure out what wemt wrong...my drug problem is that I cannot access my medicine I had become dependent on without  spending some real cash...now u gotta sell half your shit.. cause who can afford 1500 month pills...enter....Heroin...now add a little fent to kick it up a notch and Waaalaaaa", "2_Subreddit": "trump"}], "dwptjwl": [{"0_Comment Submission": "Girlfriend wants to take psychedelic drugs alone with two other guys", "1_Text": "My girl used to pill that shit to get mad...well we were on a  bowling team with my mom and dad...last game and it's time to get things Poppin..so or take the sweet breath container from my pocket.\nDrop 5 hits of liquid LSD on it...here comes my girl...well ex-girl..but love is strong\n\nSo she says\n Give me in Spanish..Dame Dame..I'm like what? U want the red one baby? Si she says...I oblige.tell her to be careful and that I love her.32;min later her friend is blowing my phone up...talking crazy like Wtf did u do? Uh...Not a damn thing...oh so now she needs me? Have her tell me she needs me amd I'm on way...what a low point in my life...firsr time.5 drops..then the shit coming outta nowhere... if your reading this Tonta...I'm sorry for what I did.... truly", "2_Subreddit": "Drugs"}], "dwpu13w": [{"0_Comment Submission": "Girlfriend wants to take psychedelic drugs alone with two other guys", "1_Text": "Bunch of Fuck Boyz coming up..sensitive sucka shit happening on lames girl...now she fell for the application...she gonna end up at the Tryouts\nAmd she gonna become star of the show....seen it a time or two..maybe more..can't deny the need to feel wanted...special...and Part of a team...girl outta pocket but she obviously the one running the show", "2_Subreddit": "Drugs"}], "dwpujls": [{"0_Comment Submission": "is it safe to take fenty?????", "1_Text": "Life is about taking chances... but as lil insurance\n\nLet your buddy go.first.  if all is well in 45 Min boof away and away", "2_Subreddit": "drugscirclejerk"}], "dwpuyra": [{"0_Comment Submission": "Today I admitted to federal offenses like trafficking drugs through the mail but the FBI let me go because I was chillin on my front porch with them:) they told me they “didn’t care, just admit it.” It feels good telling the truth.", "1_Text": "LMAO..Leo gonna fuck u in the ass bro..don't tell them Boyz shit...why u doing their job? Let them investigate... Give em your name and keep your mouth shut...damn new generation put their whole team on blast flexing their shit...or telling how much of a Hitta or shoota they is...Gang Gang shit..the Feds gotta be laughing their ass off..they got the best in the game locked away for ever... u ain't got a chance...when they need a quick bust..or information...u my friend will be  Leo 's first stop..chat away\n.. u will find once good info runs out.. then they pull your card..now u got nothing..u a fuckboy", "2_Subreddit": "drugscirclejerk"}], "dwpvdc9": [{"0_Comment Submission": "Girlfriend wants to take psychedelic drugs alone with two other guys", "1_Text": "Don't underestimate the competition.\n\nAnd u thought letting guys know girl\nIs spoken for is insecurities showing themselves..I disagree..it's only fair these guys know the situation.my bitch is a  constant target.. not insecure\n..I'm the one banging the bitch ..I know what I'm about.. but I'm sorry..maybe not you..but someone like u let your girl come explore with me...amd I'm Sorry..hahah", "2_Subreddit": "Drugs"}], "dwpvx1a": [{"0_Comment Submission": "I read Erowid every now and then - AMA", "1_Text": "The one who really knows this is no longer here...", "2_Subreddit": "drugscirclejerk"}], "dwpw4ss": [{"0_Comment Submission": "The ULTIMATE and COMPREHENSIVE guide to selling Crack", "1_Text": "Sounds right to me\n....forgot to constantly tell the world your gang affiliated so they can really put the fuckin to u at sentencing", "2_Subreddit": "drugscirclejerk"}], "dwpwh6f": [{"0_Comment Submission": "Is my daughter using opioids?", "1_Text": "No no..she is abusing opiods..it's different...so. shit will start disappearing and reappearing at local pawn shop..or a situation where a female needs something some guy is always willing to help out...but this comes at a cost..but that H will have her.doimg shit she never would have done if she was in control... I feel sorry for her...get her in a rehab asap.. hopefully she hasn't already sold her soul and few other things to scratch that itch..but most likely it's too late..", "2_Subreddit": "drugscirclejerk"}], "dwr7ww2": [{"0_Comment Submission": "Girlfriend wants to take psychedelic drugs alone with two other guys", "1_Text": "Being called insecure by someone who uses the name GGlock....haha...you need quit looking in the mirror when u reply to things Glock boy....I should call my self... Bigbossmossbergrichgang...that should have em shook as fuck...lol...your funny Glock... anyways...cops carry Glock boy... Mossberg pistol grip  pump at arms length....fuck the bullshit...", "2_Subreddit": "Drugs"}], "dwr92wo": [{"0_Comment Submission": "Parents found out I sell drugs, advice ?", "1_Text": "Yea get the fuckin cash outta your room...how the fuck u gonna explain 20 racks to the cops...trust me that shit getting seized... good luck getting that back... go get 20 -1000 dollar money orders..or go get casino chips... something that doesn't look like a bunch of drug cash..small denominations where 20 racks can fill a damn plastic grocery bag...u need to get that as small as possible...and hide it....don't put it in bank... better yet find a reputable..(lol) lawyer and give it to him..get a receipt...but this will never be needed..these guys know what time it is and it's pretty much how the game is played...u will get caught eventually.. that's the one downside...get caught with that order your using as an example and your 20 racks is gone...think of drug dealing as high stakes gambling...that can cost your life, love, and for some their manginity when they get a taste of prison.....if your gonna last in the game ..u need to seperate yourself from the end user...by 1 person who not only u trust..but they trust that when shit is going down...your there with bail and your 20 racks retainer is for rainy days like this...and the Reddit post were on right now can and will be used against u in court...best of luck bro...", "2_Subreddit": "Drugs"}], "dwr9v2r": [{"0_Comment Submission": "I think I snorted a half gram of crystal meth by accident. What am I in for?", "1_Text": "Being awake...meth sucks...I been iv'ng past two nights...work during the day..but do a shot around 5 am just to make sure I'm awake at work... it really gives me no rush.. just takes my breath away with this throat thing it does.. kinda has a lil rolling type feeling like mdma but way way less intense.. and i got big crystals..and my drug test at my suboxane doctor confirms it's metamphetamine..but  I'v coke blows the fuck outta meth..what's funny is for25 years i always thought if I mess with meth I'm gonna be up for days..lose my teeth...suck dick for more...then I did it outta boredom..must say...its reputation is nothing like the actual experience...it is not all that great... I do a shot and go about my day..", "2_Subreddit": "Drugs"}], "dwrawm3": [{"0_Comment Submission": "I know what my problem is-- I want to use heroin forever.", "1_Text": "Yea we all do... but shit costs to be that boss...400$ day habit isn't crazy\n...once your full blown I'v user for years..the shit just makes u normal...no euphoria.. no warm hug\n. just a big ... wait for it... Nothin.. just feel well enough to get more money for next shot... fuck it..I truly finally feel after 15 years Im done with the shit... I'm Done..not being forced by anyone..just been getting 90 subs a month\n.only take pieces here and there as needed.\n.not trying to trade one for the other...just Wanna smoke my weed...And  rebuild all that was lost...", "2_Subreddit": "Drugs"}], "dwrbosp": [{"0_Comment Submission": "Shooting up Meth can make you orgasm! Just imagine how powerful and addictive this drug is ?!", "1_Text": "Who has actually I'v Ed the shit? I have done 6 shots since Sunday night...bout to finally sleep now... big crystals...not even close to that feeling...shit ain't really impressive at all...waste of time and veins if u want my opinion...I'm really doin it...not spreading crazy talk...cum in my pants...haha\n\nThat's a good one ...orgasm is intensified...but it's not something that is happening once one pushes the plunger.rotflmao...", "2_Subreddit": "Drugs"}], "dwrd149": [{"0_Comment Submission": "What’s the max amount of pills you have taken in 1 day (Oxycodone/Xanax)", "1_Text": "50 or more 0xy 30' in a day...uh...on a mission to colorado ...23 bars I'n a night...woke up 3 days later on that one...mom said then and still sticks by her story.\n.3 days...she thought be I was dead..or  dying..but she said I was  breathing so she just let me sleep ..\nShe knew it was a fucked up night..she was the one who saved me from a situation...not proud of this moment...but u wanted it... funny how sometimes one can be In a place where that actually happens... And is just another day in the life of  someone who needs help...h\n\n.", "2_Subreddit": "Drugs"}], "dwreenz": [{"0_Comment Submission": "Been listening to too much Young Dolph and now all I want to do is quit my job and become a trapstar - Help!", "1_Text": "I'm on some Peeway Longway shit this second...I fuk with Dolph..Keyglock raw as fuck. All he do is trap. Dracos with the titties on it...(double  round 50 round mags/) YouTube Keyglock $$All I do is Trap... But I fuck with all them real ass dides got something to say..but most shit now is on some actor type shit.. I mean me and my girl been fuckin around watching YouTube videos.. getting in on all the gang gang shit\n.shootings.. it's like a whole damn character to be in the rap game..all these guys in AT L  be drug dealers who have access to a studio and free time..me and my girl be coming up with shit on par and if I dare say some of my shit is pretty fuckin smooth..been studying these fools forever...I'm bout to go to trenches and find K&R Inc.'s  first artist WaterdaWhippa..most gangsta fukin scary ass gang gang 21 Savage ass I can find and see of he wants to be a star..ill teach him all the real prices of shit..not these bullshit number rappers talking.. give him the whole mixtape..let him record it.. and with the outlets available now... sky is the limit.. Biggie taught us that..My street story paint a pretty picture of what goin on.. Finessing the game...Water daWhippa but my artist strictly dealt straight drop when he was involved in all those long nights... servin and protectin...damn heroin had me thinking checkers..not chess....watch out... I can do what these guys are doing...2 million cash in the hotel room..wtf.. Blac Youngsta is so flagrant on YouTube with cash...  They all are..and for the product they providing..I'm more than capable..it's done..just need the \" look\" and he gonna  make me rich..", "2_Subreddit": "Drugs"}], "dwrfeev": [{"0_Comment Submission": "xanax withdrawal", "1_Text": "That's not withdrawal.. that's reality.. insomnia, restless legs... depression..yea thats why u do the drugs  remember...your brain is having a temper tantrum cause it's hungry for More\n\n. xanax ...withdrawal with that small amount for a week..it's mostly in your head man...do something to occupy your attention and just do anything.. it's about tricking yourself until something else fills that spot...smoke mAn you'll find it's accepted...and comes with less price to ones self", "2_Subreddit": "Drugs"}], "dwrgkpw": [{"0_Comment Submission": "One in 10 teens are wrongly denied emergency contraception as pharmacists tell them they need a prescription, study finds. The drug is legally available without a prescription for consumers of all ages.", "1_Text": "Pharmacists.are.all.jokes\n\nThe others.are all drug dealers. legally sellin\n\nme something's that's cash only.. no insurance allowed..at 15 times the cost of Walgreens old Price's...something is going on\n.some shady shit went on for a while...now these fucks that used to beat me up on price cause they knew I would pay..now these same fucks ain't giving out the plan B...ain't selling needles to people...cherry picking custys they wanna serve...man there is a conspiracy goin on... they are\nNot into selling condoms either...contraception shit...needles medication should be free... The benefits o no nof access to clean rigs .less.. worrysome sex..and my meds for the cherry on top... Is a no brainier..lil scooter just rapped he has every drug..he is dealing heavily in the streets .. coke boy..he got everything off a drug deal...when does  all reality just become fantasy amd vice versa..I been telling my girl...\" It is what ever I say it is.\" Cause who gonna question it? I have insulin dependemt on license..to get rigs..and when u pass out and wake up in emergency room..it's not' he is on drugs\" fukin piece of shit\" it's oh...he's diabetic..his blood sugar is All outta wack..its not cause I been eating crack and eggs for 3 days", "2_Subreddit": "TwoXChromosomes"}], "dwrhzjs": [{"0_Comment Submission": "I am a former drug mule for the Mexican drug cartel. AMA", "1_Text": "We're all drug mules for the cartel..until it's consumed. Oh he was a narc\n\n.oh...now that s interesting... how shitty did u feel when it was long long prison sentence or go to work for the Feds...I know that pressure was ON...damn...bet u felt powerless...now u Workin for the other team.. crossing the cartel..do u go on bestgore..they removed a guy's face with a boxcutter while he was alive and fully conscious...I ain't saying a fuckin word...when u have nothing left to offer daddy they gonna deliver u right to the guys u giving them...once they move above u..your purpose is served...now it's time to go..I'm sure if I was in such a situation that I could jerl the Feds around long enough to get a load or two in\n.earn some paperwork... enjoy the short time I have left..and check out on my terms..not that boxcutter...", "2_Subreddit": "IAmA"}], "dwrjc5d": [{"0_Comment Submission": "methadone low dose?", "1_Text": "Liquid handcuffs .. please take my advice..if u ever plan on getting outta there one day.. stabilizing..maintaining...then tapering down..and then skip a day..then go\n\nSlow slow slow.. don't rush\n..think about being dependent on 200 mg of methadone..u will never escape...now that said\nI had to get to 70 my until I could tough out 24 hours. It improves daily... Now daily dose of methadone stretches my fish outta water timer to 24 hours..\nNow I can have a job and function in society..they will let you go high as u want..but ask  a decrease and watch them threaten medical discharge on ya..from 200 to Bye Felicia in 3 days.. remember they daddy for a while... don't give em any more leverage", "2_Subreddit": "opiates"}], "dwrk4og": [{"0_Comment Submission": "How to cut my dope", "1_Text": "Fucking amateurs....be wantin to know bout that whip game..water whip 28 to 56... fuckin piece of shit dealers...but people buy it...to take away straight drop and introduce water whip was a sad day for crackheads... ghost busters and people who don't mind the glass dick..go to your local head shop..they got everything u need to stretch the bullshit u probably got sold..so keep stepping on it\n..at least rerock it back up so other amateurs think they got fishscale..when I'm reality it's coconut flake's..Return room deodorizer supposedly.. but it shine in the light..lol..and mannitol.20 grams of fake cut to 8 clean..\nSounds right", "2_Subreddit": "opiates"}], "dwrmiru": [{"0_Comment Submission": "weed made me gay?", "1_Text": "No.. suckin abother dudes dick makes u gay..but how it got the..who knows...who cares..do u bro....", "2_Subreddit": "Drugs"}], "dwruhg5": [{"0_Comment Submission": "methadone low dose?", "1_Text": "Haha...it's a serious problem... when u get to the clinic.\n.. your not a rookie...so u think clinic is going to help u with getting off shit...they talk about getting off this...that..only one drug is never ever mentioned...is methadone\n.I wemt there for opiates... they're like u gotta have a clean UA in two weeks or its   medical detox for u...I'm like I have been positive for all things u test for for a year..and I got two weeks? Lickily I was only on 20 mg...cause I know the game...they got quite an operation goin...but I can't cosign that shit...I being me had been paying counselors to let me sleep to front of line.. pouring other urine in my cup cause counselor said we need to at least remove 1 drug off UA\n.I said instead of random.tell me when I gotta piss and it's not a problem\n\nWin win...so those type games is what I was doing..so I had few things to get off my chest if my counselor didn't let me go down on dose", "2_Subreddit": "opiates"}], "dws4y06": [{"0_Comment Submission": "methadone low dose?", "1_Text": "Skip to front of line cause i have to be to work by 7am... it open s at 5 am.. people \nstart around 330 am to get spot in line...so If computers were down...any reason ...I knew the cost was 10  each$ so 20 bucks for me and my girlfriend.... it's just good to have options.. I always end up doing something Thats bends the rules toward  my favorite.. just gotta feel out who is gonna allow it", "2_Subreddit": "opiates"}], "dwtpc4v": [{"0_Comment Submission": "Single father, jerking off, and drugs", "1_Text": "Sounds like a good time..but sometimes having someone else do the jerkin is cool too.. i would settle with once a year and save up for an escort from opppso of front...page...(and really blow the wad.\n) This is where i have found Tru bliss... it's highly addictive...I've heard", "2_Subreddit": "Drugs"}]}], "1_submissions": [{}]}]}