{"gritNgrime": [{"0_comments": [{"du4xj81": [{"0_Comment Submission": "Question about Pain Management", "1_Text": "I plan on going in with ample documentation and giving the doctor a truthful description of my pain and letting them take the reigns from there. I won't be demanding and will probably jump through some hoops if necessary, but with the paranoia around prescribing opiates I hope I'm not wasting my time. That or they won't consider my conditions \"severe enough\" even though I am in terrible pain. Lucky you found a good doctor.", "2_Subreddit": "opiates"}], "du4xp5f": [{"0_Comment Submission": "Question about Pain Management", "1_Text": "One doctor gave me flexeril and it didn't do much. I'd take some soma, but all these pharmaceuticals with any reported recreational value are being scrutinized like crazy. Sucks you were cut off. My sympathies.", "2_Subreddit": "opiates"}], "du4xu6c": [{"0_Comment Submission": "Question about Pain Management", "1_Text": "Yeah, times are tough. That's why I'm hesitant to even try. Unless I get lucky, I have a strong suspicion I'll be wasting time and money.", "2_Subreddit": "opiates"}], "du502r7": [{"0_Comment Submission": "Question about Pain Management", "1_Text": "I'm trying to address my pain. I want opiates because they legit help in my experience and I've tried just about everything else with my neurologist and various foot doctors (I could list treatments, but it would be a long list). I feel I would be wasting my time at this point if I didn't get the meds that actually help me.", "2_Subreddit": "opiates"}], "du505vm": [{"0_Comment Submission": "Question about Pain Management", "1_Text": "Thanks. Too bad just being prepared isn't enough these days. Hoping for the best.", "2_Subreddit": "opiates"}], "du50anv": [{"0_Comment Submission": "Question about Pain Management", "1_Text": "Tried baclofen once from someone else's prescription. It did help somewhat gaba agonists do help because they calm down my nervous system and decrease my anxiety, which worsens my headaches.", "2_Subreddit": "opiates"}], "du50f08": [{"0_Comment Submission": "Question about Pain Management", "1_Text": "Glad for you! What pain issues do you have? Is there anything I can do to locate a good clinic like ask what treatments they offer (or is this sketch)? How'd you find yours? Also, you aiming for a higher dose?", "2_Subreddit": "opiates"}], "du51gh3": [{"0_Comment Submission": "Question about Pain Management", "1_Text": "Been seeing a neurologist for headaches and after one more medication (a calcium channel blocker), which I will try, he told me we'll pretty much be at the end of the road. If I see a PM doctor, hopefully he will take mercy on me between these two severe chronic pain issues. I wouldn't even mind a limited script. I already deal with these issues on my own. However, it would help to know I have some relief if I need it. If it was just the headaches I doubt I'd get anything. Thanks for your suggestions and honesty!", "2_Subreddit": "opiates"}], "du51ry1": [{"0_Comment Submission": "Question about Pain Management", "1_Text": "Lyrica is currently too expensive (waiting for it to go generic). I've been on high doses of gabapentin (up to 2400mg) and it didn't do too much for either issue. Thanks for the recreational tip though :) How much baclofen do you take? At this point I'd appreciate a script for anything that helps, but would prefer opiates.", "2_Subreddit": "opiates"}], "du51yhy": [{"0_Comment Submission": "Question about Pain Management", "1_Text": "Taken zanaflex. It's more sedating than flexeril in my opinion. Decreased my anxiety somewhat and got some nice naps from it. Nice fun fact about Europe and another appreciated recreational tip!", "2_Subreddit": "opiates"}], "du5265l": [{"0_Comment Submission": "Question about Pain Management", "1_Text": "Never heard of reglan. This is for headaches? Not expecting oxy immediately, but hopefully after a few visits. Will bring documents and won't even mention narcotics in any way as I know this is a big red flag. Will let them take the reigns and hoping for the best. I have been asking clinics what treatments they offer (which I think is a normal question). Only reached one that sounded promising. Said they prescribe opiates, but because of my age (28) they need my parents to come in and sign some forms.", "2_Subreddit": "opiates"}], "du53fek": [{"0_Comment Submission": "Question about Pain Management", "1_Text": "Combo could be a good idea. Thanks for the methadone suggestion and the info on the lyrica savings card. Where do you get this? Taken methadone many times while using. Like the long legs and actually enjoyed the high from it as well.", "2_Subreddit": "opiates"}], "du54kar": [{"0_Comment Submission": "I was robbed at gun point on my birthday", "1_Text": "Hate when this happens to anyone (especially on your bday). I've been burned more times than I care to admit. A few of those times I got my ass beat. Had a broken jaw, two pairs of glasses broken, and just general pain from some of these incidents. Though I didn't lose my money on some of these occasions, in retrospect I ended up paying more than if I'd just given it up (visit to the ER and new pairs of glasses). I kind of kept my pride intact knowing I didn't lose my money, but that knowledge didn't help much. Was burned a few weeks ago and even though I saw it happening before my eyes I just handed over the money because I know what some people will do and the last thing I needed was a broken nose, bruises, broken glasses, or even to be robbed of my other shit, like my phone (which has happened to me as well when I turned people down and they decided to up the ante). Dude could have pistol whipped you and broken some bones. As much as I would have liked to hear that you shot him because I love hearing stories where these fuckers get what they deserve, you made the right choice in my book. Hope this post gave you some perspective, that you score some opes to ease the pain, and that this dude gets what's coming to him x1000!", "2_Subreddit": "opiates"}], "du54pgl": [{"0_Comment Submission": "Question about Pain Management", "1_Text": "Looking into this now because I have a script for lyrica on file at the pharmacy. You're the man!", "2_Subreddit": "opiates"}], "du5tja0": [{"0_Comment Submission": "Question about Pain Management", "1_Text": "Thanks for the info. Already have a tremor naturally, so that would annoy me.", "2_Subreddit": "opiates"}], "du5tk33": [{"0_Comment Submission": "Question about Pain Management", "1_Text": "THANK YOU EVERYONE FOR YOUR THOUGHTFUL INPUT!", "2_Subreddit": "opiates"}], "du6e5u3": [{"0_Comment Submission": "Anyone else catch yourself....", "1_Text": "I call it the gibberish zone (county in the land of nod)", "2_Subreddit": "opiates"}], "dv3cnk6": [{"0_Comment Submission": "Is it safe to IV use black tar heroin at my tolerance?", "1_Text": "Personally, I think you'll be alright. If smoking the gram each day hasn't made you feel dangerously high then a tiny amount shot should be alright. Just REALLY abide by that old adage you can always do more, not less. This can be hard to follow when excited (I've fucked up when I was overly excited), but really do a tiny amount to start.\n\nIs it really strong dope? How faded has smoking been getting you? Is there a chance it is cut with fent? Also, parking by a hospital won't guarantee you'll be saved if you fall out in your car (they may not see/find you or assume you're sleeping). You'd be better off doing the shot then going to hang out with your friends who could call 911 if you fall out. I assume they don't know you use, since if they did you might just do it at their place, but even if they don't they could still call 911 if you happen to fall out. That would suck, but let's assume if you do this right this won't be the case.", "2_Subreddit": "opiates"}], "dvsojn2": [{"0_Comment Submission": "What do opiates sound like? Music to describe the feeling.", "1_Text": "Band: Lotus, Song: Colorado\n\nI have other songs in mind, but most have lyrics. If you need other suggestions let me know. I can probably think of a few more instrumental tracks.", "2_Subreddit": "opiates"}], "dvw481h": [{"0_Comment Submission": "Repost: just found on my local...", "1_Text": "The fact that he lists that he has all the different brands is sketch to me. However, I have resorted to sketch things during desperate times, so I could see myself feeling this out if I was in the area.", "2_Subreddit": "opiates"}], "dwf8ycp": [{"0_Comment Submission": "Look OP homies , NO more walking after tricken n copN 😂", "1_Text": "This is one of those comments I just had to let someone know I appreciated. Made me laugh my ass off. Total blast from the past. Thanks.", "2_Subreddit": "opiates"}], "dwfdm5v": [{"0_Comment Submission": "What is the most valuable prescription one could POSSIBLY obtain", "1_Text": "Thinking opana (from what I've heard, though unfortunately the only thing I haven't had the chance to try). However, if I'm thinking outside the box maybe prescription H or powdered dilaudid.", "2_Subreddit": "opiates"}], "dwszb02": [{"0_Comment Submission": "dope porn sunrise [nsfw]", "1_Text": "You look hot as hell (sure you hear that all the time). Fantasizing about getting high together and giving you a foot massage. Appreciate the pic. I happened to be feeling horny when I came across this. Hope you're having a nice day.", "2_Subreddit": "opiates"}], "dwtd02e": [{"0_Comment Submission": "Would you have switched to heroin if oxys were still everywhere?", "1_Text": "I would have because I'm the kind of addict who wants to do it all. Why do just one type of opiate when I can do all of them. However, I may not have done as much heroin because there were times when I was more in the mood for pills, but got H instead because it was more bang for my buck.", "2_Subreddit": "opiates"}], "dwu220i": [{"0_Comment Submission": "dope porn sunrise [nsfw]", "1_Text": "Cringe? Can't tell if you're being serious or sarcastic. I'm Just being honest and offering a compliment to this lovely woman, but you're entitled to your feelings.", "2_Subreddit": "opiates"}]}], "1_submissions": [{"7qva8f": [{"0_Title": "Smell as indicator of quality/strength?", "1_Text": "I plan on going in with ample documentation and giving the doctor a truthful description of my pain and letting them take the reigns from there. I won't be demanding and will probably jump through some hoops if necessary, but with the paranoia around prescribing opiates I hope I'm not wasting my time. That or they won't consider my conditions \"severe enough\" even though I am in terrible pain. Lucky you found a good doctor.", "2_Subreddit": "opiates"}], "7x1k1c": [{"0_Title": "Question about Pain Management", "1_Text": "I plan on going in with ample documentation and giving the doctor a truthful description of my pain and letting them take the reigns from there. I won't be demanding and will probably jump through some hoops if necessary, but with the paranoia around prescribing opiates I hope I'm not wasting my time. That or they won't consider my conditions \"severe enough\" even though I am in terrible pain. Lucky you found a good doctor.", "2_Subreddit": "opiates"}]}]}]}