{"Ch0plol": [{"0_comments": [{"dsv2iwv": [{"0_Comment Submission": "Youtube is broken. Anyone know how to fix?", "1_Text": "I've got this same problem. Driving me fucking crazy.", "2_Subreddit": "chrome"}], "dt9jc1q": [{"0_Comment Submission": "Students asking basic pointers for a hackathon (beginner level)", "1_Text": "I mean, they tried to be clear about it twice and was told otherwise. Then, on the third and final attempt to lay it out for people who apparently can't understand what's being said unless it's laid completely bare, they are downvoted. I swear, it reads exactly like something that the \"I'm so smart and this guy is clearly wrong\" coworkers of mine would write. The funny thing is, they've sequestered themselves away in their little bubble of extremely specific knowledge to the point that they can't even grasp basic human communication and need people like me to translate basic speech into \"socially-retarded-security researcher\" dialect for them.\n\nIt's an industry with a lot of people on the spectrum for certain.\n\nIt was blatantly obvious that beangay meant the term hackathon was being used \"incorrectly\" per the usual definition for an amateur student event with the actual substance of the event revolving around his line of questioning.\n\nIs is so difficult to just answer the asked question, and not attempt to deny that the question is even valid in the first place? I can sense you're of the type who is so caught up in being technically right, and thinking that you posses some sort of unique arcane knowledge that is only revealed upon chanting the correct divination in binary, that they don't even know wtf they're arguing about. The whole field is carbon copies of the same personality. None of you are god's gift to IT security, you're actually a dime in a dozen. You just all FEEL like you're the \"Chosen One of Security\".\n\nBe glad you guys have people like me to ease the uncomfortableness other employees feel by explaining away the awkward chuckling to yourself that you types tend to do. It would be high school all over again without people like me keeping your old bullies at bay so that you can do your work alone.", "2_Subreddit": "AskNetsec"}], "dt9jo4a": [{"0_Comment Submission": "3,500 Occult Manuscripts Will Be Digitized & Made Freely Available Online, Thanks to Da Vinci Code Author Dan Brown", "1_Text": "Glad someone mentioned John Dee.\n\nHere's my slightly customized Monas Heiroglyphica tattoo.\n\nhttps://i.imgur.com/V137k8s.jpg\n\nI used to try to explain that it's an esoteric symbol by the occultist and mystic John Dee and that \"what does it mean\" is covered by a large primer translated from a centuries old encoded language AND that the expanded meaning behind it is still unknown, but learned that it's much easier these days to just say \"oh, it's a devil guy\". Saves me time and confused looks.\n\nFor anyone interested, here is the known translated theorems for the glyph http://www.esotericarchives.com/dee/monad.htm#theorem1\n\n~Here the vulgar eye will see nothing but Obscurity and will despair considerably.~", "2_Subreddit": "books"}], "dtau57p": [{"0_Comment Submission": "What is the most NSFW thing a stranger has told you ?", "1_Text": "Isn't the ability to leave those comments kind of 50% of the point of the user submitted porn boards though? Like, if those comments weren't there, what else would even be posted? It's not like you ask a chick shoving one nine inches deep up her ass what kind of poptarts she likes. It's meant to leave lewd comments to lewd pictures and then beat off to said pictures. The comments aren't really meant for anyone other than the person who decided to post them. I find the people who reply to them with something like \"wow that's creepy dude\" or the like are the ones behaving strangely. The only thing I can come up with is it's some hail mary effort to attract Anonymous Internet OP Girl by weakly defending them from comments that they invited by their own actions.", "2_Subreddit": "AskReddit"}], "dtau9rn": [{"0_Comment Submission": "Students asking basic pointers for a hackathon (beginner level)", "1_Text": "The breakdown reply and the effort you put into it is a shining example of an on the spectrum security researcher. It's so damn perfect lmao.\n\nYou have to be right no matter how petty it is. That's such a massive character defect.", "2_Subreddit": "AskNetsec"}], "dtw8eeu": [{"0_Comment Submission": "Yes, Steam, this game is relevant to me, that's why I filtered out the whole genre", "1_Text": "Just thinking about anime causes me to start to go into a rage. I honestly don't think I have a stronger hatred for anything on Earth than anime. Just look at the societal damage it's done alone by its mere existence. So many regular kids from school slowly warped into slovenly, socially retarded creatures. Then you go on to college and witness adult weebs, where they project a 100 foot circle around them (even more if they're having an imaginary anime battle and yelling japanese words or swinging around cardboard swords) that causes second-hand embarrassment for anyone who dares to venture close. You're basically fucked if you get one in one of your classes, because they'll either stink and act strange as fuck, or they're the kind that doesn't shut up  with what they see as some astute input on a subject, but is usually outright wrong or causes everyone in class to glance around making sure someone else feels as embarrassed for the weeb as they do.\n\nYou can't even find an escape from these fuckers online. If you play any multiplayer game there will be some weeb trash. Trying to raid in any MMO? Yeah, good luck if you don't just auto-mute voicechat because your brains will be all over your wall if you listen to their shit. Even on youtube you can be guaranteed that the worst of the worst comments will have an anime avatar associated with the person posting them. You can't even listen to some underground rap about shooting heroin or whatever without finding it innudated with these trash people. It's like, dawg, you've never even seen heroin let alone been strung out on it. Who are you trying to fool here? You can't even begin to relate to the lyrics no matter how hard you claim you do.\n\nAlso, \"she's not actually 6, she's a 9000 year old demon so it's ok\" or \"It's not pedophilia, it's drawings. Don't pay attention to the fact that its portrayal of an underage person is why I consume it.\" All those little excuses for the bottom of the quickly traveled slippery slope that begins with the \"acceptable\" anime. There's no such thing as acceptable.\n\nFuck I'm so angry over anime now why did I fucking click this. Seriously it needs to be purged from Earth for the betterment of humankind. I don't know why more people can't see what it's doing to multiple generations of young men.", "2_Subreddit": "Steam"}], "dvwvabe": [{"0_Comment Submission": "Katy Perry is a bit of a bad person", "1_Text": "Was she supposed to know he was some awkward aspie who wouldn't be totally stoked on what she did? Let's not pretend like there isn't double standards for a very real reason. I can't think of a single guy I've ever known who wouldn't have been over the moon if this had been them and I find the guy having a negative reaction to it to be odd as hell, and I'm sure she's just as dumbfounded. I also find the people in this thread finding it to be a big issue to be disingenuous, and I believe that reversing the sexes creates an entirely different scenario with different dynamics involved - it isn't fair to judge them equally because they AREN'T equal. Katy just had shit luck apparently and picked the one guy there who still has his mom tuck him into bed at night. I highly doubt the sincerity of anybody arguing from the standpoint of this making her a \"bad person\" or even that most guys wouldn't have any issue with this. Like holy shit man, how will this kid ever recover from the trauma of getting his first kiss from a famous sex symbol?\n\nSociety has double standards, and it has them for a reason. To ask me to treat everything equally where the sexes are concerned is asking me to ignore how society actually works - and I don't want to live in a society in which everyone gets all up in arms over something that was 100% harmless just for the sake of equality.\n\nTo preemptively shut down the inevitable counter argument - no, this is not comparable to male minors who are found to have been having sex with their female teachers only to have it viewed much lighter than if the sexes were reversed (although, I also hold the opinion that this is another situation in which most of the male participants are totally stoked about and not traumatized by).\n\nTo even consider either this kiss or the ass grab from her to either of these guys as abusive is just laughable, sorry. If I could give the guy some advice from another guy, it would be \"holy shit, if you don't suck it up and try to be less weird then that was the first and last kiss you'll get in life.\"", "2_Subreddit": "TumblrInAction"}], "dvwwigt": [{"0_Comment Submission": "Katy Perry is a bit of a bad person", "1_Text": "That's not the same logic at all.", "2_Subreddit": "TumblrInAction"}], "dvwwy5y": [{"0_Comment Submission": "Katy Perry is a bit of a bad person", "1_Text": "Who is this \"us\" and who suffered here? I'm a guy who sees, and accepts that there's a double standard for the sexes, and understands that that double standard exists for a reason. I find that the men arguing that this kiss was somehow an assault, or that male minors who have sex with older women are being abused are either outright lying about truly feel that way or grew up sheltered or something. I know that I, and every single other guy I knew as a friend or even an acquaintance I rarely interacted with through my entire teenage years would have given our left nut to fuck an older woman. Shit, we were basically oozing jizz out of every pore as it was, and sex was on the top of my list of what I desired and what I was attempting to get at every waking moment.\n\nThese aren't stereotypes (and even if they were, stereotypes are based in reality), nobody is suffering, and where exactly are we being \"pulled back down\" to? Attempting to argue that we as men are somehow suffering and are being injured by being kissed and given pussy is the only thing bringing us down. I don't desire to be a fragile individual who is a \"victim\" due to having a woman come onto me strongly or that is \"suffering\" due to people viewing what would legally be statutory rape differently for males and females - it all smacks of some skinny, overly emotional nu-male hipster who was probably raised by a single mother. I fully accept that it is different and that arguing otherwise is more likely to do with personal issues, a sheltered upbringing, or past trauma that would only apply to a small minority of men.", "2_Subreddit": "TumblrInAction"}], "dvwxtga": [{"0_Comment Submission": "Katy Perry is a bit of a bad person", "1_Text": "Just so you know, the only guy who would truly feel insulted by any sexist jokes or being \"objectified\" by women probably has some deeper problems going on. I can't imagine the type of guy who would find issue with either, and it would be so odd to witness that I'd need to make sure I wasn't just misunderstanding things before I called him a fag or nailed him in the arm with a solid punch or something similar.\n\nA lot of guys on reddit seem to equate the act of busting a male friend's balls as mean spirited though, going as far as to tell the person who brought it up to get new friends since those guys insulting them are clearly not true friends (this of course isn't true in the least - crafting a soul shattering insult that cuts your friend to their very core is just a back and forth game). I'm not trying to say I'm some type of stereotypical manly man who radiates masculinity, but some of the reactions guys are having here are honestly just pathetically weak and they need to stop being such whiny pussies about shit.", "2_Subreddit": "TumblrInAction"}], "dvwyach": [{"0_Comment Submission": "Katy Perry is a bit of a bad person", "1_Text": "I've noticed that many guys on reddit don't understand the concept of ball busting and how it's a friendly game. Even after it's explained to them, they'll still insist that those people can't possibly be your friends since \"real friends wouldn't say things like that\". I have to wonder if they grew up without fathers, or as the only male with five sisters or something.", "2_Subreddit": "TumblrInAction"}], "dvwyexm": [{"0_Comment Submission": "Katy Perry is a bit of a bad person", "1_Text": "Even with my mental maturity at that age I would have been totally into having sex with an older woman, and it wouldn't have caused any trauma to me in the least - quite the opposite really. And we aren't ever \"fooled\" by our hormones, they just create strong desires for us that we wished we could have fulfilled. I don't think it's an issue of maturity anyway - I see the double standard existing due to the power dynamic when it comes to the typical roles in sex, and the difference of being fully on board or being manipulated into the act.\n\nI'm now 30 and while I'd beat a hypothetical male teacher to a bloody mess for having sex with a daughter, I'd be hard pressed to find much of an issue if it involved a son with a female teacher.  I just don't find the scenarios of a man having sex with an underage girl to be comparable to a woman having sex with an underage male. I view one as something only a real piece of shit would do, while seeing the other as some kid being lucky as hell.\n\nI can only base that on my own experience as a male, but I know that 14 year old me would have immensely enjoyed having sex with an older woman. Both from the mindset I had AT that age, and with the mindset I have now. I can't even find issue with it unless some other type of abuse was taking place since I'd hardly consider a woman letting teenage me fuck her to be abuse.", "2_Subreddit": "TumblrInAction"}], "dvwzkoj": [{"0_Comment Submission": "Katy Perry is a bit of a bad person", "1_Text": "You laughed about it because it was funny, and it wasn't worth thinking twice about it being a date rape joke. Also, it WASN'T the other way around which is the important part. Nobody had an issue so it wasn't an issue - and attempting to find an issue with it is a pointless exercise.\n\nAlso, if you don't want to fuck this chick then man the fuck up and be assertive and make her stop dude. Either that or throw some dick in her to shut her up. You sure don't sound like a grown ass man when you can't deal with a sexually aggressive woman. You're the one with the power, so either use it to make it clear that you're not ever going to fuck her, or just fuck her since it's just sex and doesn't have to carry any deeper meaning beyond you getting your nut.\n\nSeriously what the fuck is up with all these timid, overly sensitive guys coming out of the woodwork these days? They're viewed as sad individuals by both men and women alike and it seems they're trying to make their personal issues into something beyond what any regular dude can see is just them being an absolute pussy. The indecisiveness, weakness, and overly emotional nature of these guys is really not a good look - thankfully they're in the minority. A generation of punishing regular male behavior in children and not embracing the existence and the reasons for the existence of a double standard between the sexes is what creates guys like this. I see it with the kids who were never allowed to have a little harmless fist fight between each other, and were taught that other completely normal male childhood things were negative. It makes adult men who are unsure of who they even are, are uncomfortable in their own skin, and who have been conditioned to believe that \"masculinity\" is negative.", "2_Subreddit": "TumblrInAction"}], "dvx0po4": [{"0_Comment Submission": "Katy Perry is a bit of a bad person", "1_Text": "Oh man, how will he ever recover from the life-shattering trauma of being made to feel momentarily uncomfortable?", "2_Subreddit": "TumblrInAction"}], "dvx1xdy": [{"0_Comment Submission": "Katy Perry is a bit of a bad person", "1_Text": "But the sexes aren't reversed. The double standard exists for a reason, and trying to eliminate it by judging everything equally is just misguided at best and retarded as fuck at worst. I don't want my daughter going out alone past midnight at 16 but I'm fine with my son doing so because there's certain dangers that a female would face that a male wouldn't in that situation. For me to enforce that equally upon my son would be me denying reality for the sake of being equal. I've only heard arguments against the double standard by SJW types, or in the times before SJWs, by hardline feminists - both groups that have desires which fly in the face of reality and human nature.\n\nI could be \"fair\" and let my daughter go out late at night too, but I'd be compromising her safety just for the sake of equality. If I reversed it and made my son stay in late at night, I'd be compromising his socialization for the sake of equality. Both of those are negative outcomes - but the double standard allows me to both protect my daughter from very real dangers, and allow my son his independence with no downsides anywhere. Enforcing equality just to meet some type of ideal doesn't jive with how things currently are in reality.", "2_Subreddit": "TumblrInAction"}], "dvx37pd": [{"0_Comment Submission": "Katy Perry is a bit of a bad person", "1_Text": "I personally don't view heading in that direction as progress.", "2_Subreddit": "TumblrInAction"}], "dvx3fxt": [{"0_Comment Submission": "Katy Perry is a bit of a bad person", "1_Text": "But then there's those of us who don't view the double standard as negative, and think it's quite logical. Men and women possess different characteristics and fill different roles in society, so trying to compare the reaction to a woman doing this to a man doing it doesn't mean much. It ignores WHY they're viewed differently and why the reactions would be different. Arguing that they should be treated the same way would mean willfully ignoring these innate differences, and nobody would benefit from doing so - and the guys vilifying Katy Perry in this circumstance just because women vilify men for doing the same thing are guilty of the exact same behavior they claim to be so against.", "2_Subreddit": "TumblrInAction"}], "dvxae7c": [{"0_Comment Submission": "Katy Perry is a bit of a bad person", "1_Text": "While you may have no illusions over what equal treatment really means, I have strong doubts that many of the women wanting to be treated equal to men want any part of what that entails.", "2_Subreddit": "TumblrInAction"}], "dvxazls": [{"0_Comment Submission": "Katy Perry is a bit of a bad person", "1_Text": "I'm having trouble finding any study that shows that most male students that are \"raped\" (statutorily - I'd not view any of these instances with the usual lens that rape is viewed with) are traumatized. In fact, in the few occurrences I remember from the news, the boys involved were indifferent to positive about the sex. I'm also unable to find anything explaining the typical reasoning of a \"victim\" such as the fear they will receive a failing grade.\n\nAs far as sexual maturity, I remember being only near the beginning of puberty and enjoying masturbation and looking at porn. I would have absolutely enjoyed some real sex as well. One of the things women will not and cannot even begin to understand is how often men think of sex and the types of things we think about. If a woman claims to get it - they don't get it.\n\nAs far as \"demonizing\" her for a kiss and it making her a \"terrible person\"? Come on stop getting carried away it's ridiculous. It's a goddamn kiss, she didn't start deepthroating him on stage. Did we suddenly become a puritanical society? Since when is a kiss even risque in the slightest? It was a fucking peck on the lips of a 19 year old - who, if he honestly was saving his first kiss for \"something special\" and was unsettled by Katy Perry kissing him then he's either on the spectrum or has another problem because that's highly unusual behavior and definitely not the norm.", "2_Subreddit": "TumblrInAction"}], "dvxei9q": [{"0_Comment Submission": "Katy Perry is a bit of a bad person", "1_Text": "The claim was that most boys \"raped\" by teachers were traumatized by it, not what you changed it to. I was looking for evidence of what was claimed, not for something that was never said. Also, I find it unlikely that Reddit suddenly cares about protecting the sensibilities of sheltered, religious people.\n\n\n\"Also, guess what! Women like sex too! That's absolutely a thing women think about. Not everyone had the same sex drive, but I promise that there are women who have just as high- even higher- than you do, or did as a pubescent boy.\" \n\nYeah sorry but you have no idea. Women who say things like this have no idea. It's something that just isn't understandable to women and similar claims can only be met with a chuckle and eye roll. A guy may agree just to escape an argument on something that only they know the real  depth of, but it doesn't mean you're actually correct. To even let a woman know the most average guy is thinking about would have them trying to lock him away. \n\nI just think that this and the topic of this thread isn't up to a woman to decide how men feel about it. You don't know how men think, so you can hardly speak for them. Just the same as I can't speak for women's feelings on similar things. I have no frame of reference and my thought process as well as what I desire are different.", "2_Subreddit": "TumblrInAction"}], "dvxf83k": [{"0_Comment Submission": "Christina Sommers was born in le right generation", "1_Text": "The First Lady's interest group hardly speaks to the effort or desires of a generation.", "2_Subreddit": "quityourbullshit"}], "dvxgtgg": [{"0_Comment Submission": "Retroactively applying new driver referral bonus before completing any rides?", "1_Text": "My application also sat unfinished for probably 3 months before I was serious enough about the idea to upload my documentation. I hope if there's some sort of issue I can just have them close my account and open another one. If not, I fail to see any reason to drive for them if they aren't able to help with this set of circumstances.", "2_Subreddit": "Lyft"}], "dvxjw7i": [{"0_Comment Submission": "Retroactively applying new driver referral bonus before completing any rides?", "1_Text": "What a stupid fucking system. I'm going to call in tomorrow, but I have a feeling you're right. If it turns out being the case, they can get fucked if they expect to earn a dime off me providing rides under their name.", "2_Subreddit": "Lyft"}], "dwijtzu": [{"0_Comment Submission": "Sorry people who risk life and limb to defend liberty, you’ll never be as brave as Zoê getting zher first buzzcut", "1_Text": "When I spent a few seasons working as a deckhand for a sport fishing fleet in Mexico we had hit the bar with some guys from another boat. One of their old timers was telling us that the reason he wound up leaving his hometown of San Diego to live in Mexico was that after a night of drinking and doing drugs with what he thought was a woman, the pants finally came off and it was a pre-op tranny with a dick. He said he got enraged especially since he had been making out with them and they were rubbing his cock previous,  so he ended up beating them so badly that he figured he had killed them, so he quickly grabbed what he could, crossed into Mexico on the same night, and started his new life never to go back... Fun guy to party with though.", "2_Subreddit": "TumblrInAction"}], "dwlzkqg": [{"0_Comment Submission": "Found this on the alcoholic sub", "1_Text": "See... I'm not 100% on board with dope withdrawals not being able to end in death. I've had some 5+ day insanity where I literally either vomit bile or dry heave every single minute. I've thought after that I'm certain I would have been dead if nobody was around to bring me water and force me to get some of it down here and there. I would have just shut down from dehydration I think.", "2_Subreddit": "opiates"}]}], "1_submissions": [{"85elm0": [{"0_Title": "Retroactively applying new driver referral bonus before completing any rides?", "1_Text": "I've got this same problem. Driving me fucking crazy.", "2_Subreddit": "Lyft"}]}]}]}