{"dopeconsciousness": [{"0_comments": [{"dkd22os": [{"0_Comment Submission": "First shot after 2 days dry and dopesick. Fuck I needed this.", "1_Text": "Haha nope, it's my Toyota Tundra.", "2_Subreddit": "opiates"}], "dkd2bh6": [{"0_Comment Submission": "First shot after 2 days dry and dopesick. Fuck I needed this.", "1_Text": "It's a junkie car if you're a junkie in fucking Texas lmao.", "2_Subreddit": "opiates"}], "dmzbbtu": [{"0_Comment Submission": "Has the jury of my (junkie) peers reached a verdict?", "1_Text": "Love this. Reminds me of another heroin addiction spoken word piece by my favorite skramz band Old Gray. \"Show Me How You Self Destruct\". Check it out. \n\nhttps://youtu.be/dk11NVwpai4", "2_Subreddit": "opiates"}], "dnapyft": [{"0_Comment Submission": "Some days the healing power of showerbeer isn't quite enough... Bulleit Rye to the rescue", "1_Text": "You think it's a joke, but I legitimately made that transition. I used to cook up a shot, then inject it in the shower all the time. Thankfully I'm 60 days clean now, but shower heroin was fun while it lasted.", "2_Subreddit": "showerbeer"}], "dnijvm3": [{"0_Comment Submission": "Ramshackle Glory die the nightmare", "1_Text": "What rehab in Texas? I got out of Starlite about a month ago, and now I'm stuck living in a shitty sober home for one more month. I can't wait to get out of this place, and back to my hometown. To be honest, i can't wait to shoot up again. It's fucked up and stupid but sobriety isn't for me right now.", "2_Subreddit": "opiates"}], "dnijyud": [{"0_Comment Submission": "Ramshackle Glory die the nightmare", "1_Text": "Idk if it's my favorite of all genres, but it's definitely my favorite folk punk album. So uplifting and hopeful, really helps me out on the worst days. Like today. I lost my job, and all I want to do is get high but I can't because I'm living in a shitty sober home. Just 1 more month and I'm out of here, and back to the tar.", "2_Subreddit": "opiates"}], "dnik606": [{"0_Comment Submission": "Ramshackle Glory die the nightmare", "1_Text": "I go through constant mood swings of wanting to be on or off them. I can never make up my mind honestly. I'm getting some Kratom in the mail tomorrow so hopefully that will help curb all the cravings.", "2_Subreddit": "opiates"}], "dnik9sn": [{"0_Comment Submission": "Ramshackle Glory die the nightmare", "1_Text": "Thanks. I appreciate it man. Stay safe out there. Love ya dude.", "2_Subreddit": "opiates"}], "dnlzzlb": [{"0_Comment Submission": "Do people get high on these??", "1_Text": "I'm on a nice combo of gaba and Kratom right now. Take 1 or 2 of those every 45 minutes, until you're up to around 3000 mg total. About two hours after your first dose you should be feeling pretty damn good.", "2_Subreddit": "opiates"}], "dnm00gs": [{"0_Comment Submission": "Do people get high on these??", "1_Text": "Gaba naps are wonderful. They get really blissful for some reason. I love the stuff.", "2_Subreddit": "opiates"}], "dnpj7px": [{"0_Comment Submission": "ODB's infamous drunken musical shit post. The Taxpayers- I love you like an alcoholic.", "1_Text": "Goddamn, I'm seeing this a few days late but you have fantastic taste odb. I love the Taxpayers and I'd been listening to this album on repeat today. Folk punk for life man, we would probably be friends/running buddies if I knew you irl. Stay safe dude, sending junkie love your way.", "2_Subreddit": "drunk"}], "dnpjkm3": [{"0_Comment Submission": "ODB's ODB Musical shitpost", "1_Text": "lol have you considered not being a grumpy douche? If it bothers you that much just filter his posts.", "2_Subreddit": "opiates"}], "dry49eh": [{"0_Comment Submission": "Gin & juice, Black Mirror Season 4, and tasty rails of some fire fishscale. I couldn't ask for a better payday.", "1_Text": "Shit, I definitely had fun lmao. It was the best blow I've ever bought without a doubt. To make a long story short, tonight turned into a Hunter S Thompson type of ordeal. At one point I was on cocaine, alcohol, meth, hydrocodone, deschloroketamine, and bud. And all this while I was already sleep deprived from smoking meth all last night. Shit got out of hand very fast, and I think I accepted death. But I'm down now and just chilling. Still have about half a g left but after the experience I just had I'm gonna put the drugs on hold for a minute. I need sleep and food lol.", "2_Subreddit": "cocaine"}], "dvcon4e": [{"0_Comment Submission": "I guess I relapsed today. Fuck it. I missed you guys.", "1_Text": "Thank you for the reassurance. It was definitely a stumble but I know I can get back on track, I can't let this take over my life again.", "2_Subreddit": "opiates"}], "dvcq56u": [{"0_Comment Submission": "I guess I relapsed today. Fuck it. I missed you guys.", "1_Text": "7 and a half months. I bought a half gram and I've used about half of it so far. And I've never heard of the 8 8 rule, what would that be?", "2_Subreddit": "opiates"}], "dvdt4o7": [{"0_Comment Submission": "The best part of waking up...", "1_Text": "I only relapsed yesterday, if it was any darker I would have fallen out.", "2_Subreddit": "opiates"}], "dveuv5f": [{"0_Comment Submission": "The best part of waking up...", "1_Text": "Yeah, I'm gonna go ahead and finish this g tonight then call it quits on this run. I just refilled my script for 180 300mg gabapentin so that should get me through any mild withdrawals like a breeze.", "2_Subreddit": "opiates"}], "dvev70g": [{"0_Comment Submission": "I guess I relapsed today. Fuck it. I missed you guys.", "1_Text": "Yeah, I was in rehab back in June/August, but the urge to use never really went away. I just didn't find any until yesterday, and as soon as I did I was putting a needle in my arm again. I'm honestly kinda grateful that heroin is so rare in my area, otherwise I would have a way worse problem than I do right now.", "2_Subreddit": "opiates"}], "dvizslu": [{"0_Comment Submission": "\"Can't remember if I promised today would be the last. If so I lied...\"", "1_Text": "Nah I'm gonna BANG THAT SHIT. It's hard to see the needle but if you zoom in you'll see that it's definitely there.", "2_Subreddit": "opiates"}], "dwrwd5y": [{"0_Comment Submission": "SWIM LOVES getting presents", "1_Text": "You don't have to say SWIM here homie.", "2_Subreddit": "opiates"}], "dwrwges": [{"0_Comment Submission": "Take an antihistamine an hour before using.", "1_Text": "I always take 75 mg of Benadryl and sometimes some unisom when I use. It helps the itch, and makes me nod way harder. I love taking antihistamines with my opiates.", "2_Subreddit": "opiates"}], "dwryegb": [{"0_Comment Submission": "Finally got my fix after 3 days of nasty withdrawals. A gram of the best tar I've ever had, courtesy of the darknet. Happy nods y'all. ❤️", "1_Text": "I don't know my way around the deep web at all unfortunately, my buddy is the one who orders this shit, we just split the cost.", "2_Subreddit": "opiates"}], "dwsdtpc": [{"0_Comment Submission": "Take an antihistamine an hour before using.", "1_Text": "Damn, IV unisom is a thing? That's fucking insane, sounds like a nightmare for your veins. I'll just stick to shooting my heroin and eating my unisom.", "2_Subreddit": "opiates"}], "dwsgjkr": [{"0_Comment Submission": "Finally got my fix after 3 days of nasty withdrawals. A gram of the best tar I've ever had, courtesy of the darknet. Happy nods y'all. ❤️", "1_Text": "Oxy is pretty fantastic and definitely work trying. That's a pretty good price but I would be wary. There's a good chance they may be fent presses instead of real oxycodone.", "2_Subreddit": "opiates"}], "dwso5j7": [{"0_Comment Submission": "Finally got my fix after 3 days of nasty withdrawals. A gram of the best tar I've ever had, courtesy of the darknet. Happy nods y'all. ❤️", "1_Text": "Oh fuck yeah, definitely go for it then", "2_Subreddit": "opiates"}]}], "1_submissions": [{"6hpuo8": [{"0_Title": "First Post - The Limbo of Waiting", "1_Text": "Haha nope, it's my Toyota Tundra.", "2_Subreddit": "opiates"}], "6htmd2": [{"0_Title": "Ramblings of a dopesick, hungover depressed person", "1_Text": "Haha nope, it's my Toyota Tundra.", "2_Subreddit": "opiates"}], "6kimq5": [{"0_Title": "First dope porn. Just copped a gram and a half of some fire mexican tar. Definitely the best dope I've ever had.", "1_Text": "Haha nope, it's my Toyota Tundra.", "2_Subreddit": "opiates"}], "6lpuk9": [{"0_Title": "FUUUUCK. Nothing worse than spilling a tasty shot.", "1_Text": "Haha nope, it's my Toyota Tundra.", "2_Subreddit": "opiates"}], "6m4aco": [{"0_Title": "My only shot for the day. Better than nothing I suppose. Happy nods y'all.", "1_Text": "Haha nope, it's my Toyota Tundra.", "2_Subreddit": "opiates"}], "6mzpz6": [{"0_Title": "Saving a shot for the morning", "1_Text": "Haha nope, it's my Toyota Tundra.", "2_Subreddit": "opiates"}], "6npfrp": [{"0_Title": "First shot after 2 days dry and dopesick. Fuck I needed this.", "1_Text": "Haha nope, it's my Toyota Tundra.", "2_Subreddit": "opiates"}], "6ockkv": [{"0_Title": "Another day, another tasty tar shot", "1_Text": "Haha nope, it's my Toyota Tundra.", "2_Subreddit": "opiates"}], "6p3u7h": [{"0_Title": "One last fat shot before heading to rehab for a month. I'll miss you guys, wish me luck.", "1_Text": "Haha nope, it's my Toyota Tundra.", "2_Subreddit": "opiates"}], "7mylg4": [{"0_Title": "Gin & juice, Black Mirror Season 4, and tasty rails of some fire fishscale. I couldn't ask for a better payday.", "1_Text": "Haha nope, it's my Toyota Tundra.", "2_Subreddit": "cocaine"}], "82tc6i": [{"0_Title": "I guess I relapsed today. Fuck it. I missed you guys.", "1_Text": "Haha nope, it's my Toyota Tundra.", "2_Subreddit": "opiates"}], "82ynox": [{"0_Title": "The best part of waking up...", "1_Text": "Haha nope, it's my Toyota Tundra.", "2_Subreddit": "opiates"}], "83jakg": [{"0_Title": "\"Can't remember if I promised today would be the last. If so I lied...\"", "1_Text": "Haha nope, it's my Toyota Tundra.", "2_Subreddit": "opiates"}], "89m18o": [{"0_Title": "Finally got my fix after 3 days of nasty withdrawals. A gram of the best tar I've ever had, courtesy of the darknet. Happy nods y'all. ❤️", "1_Text": "Haha nope, it's my Toyota Tundra.", "2_Subreddit": "opiates"}]}]}]}