{"Im_Not_Crazy_I_Swear": [{"0_comments": [{"dw0nsrn": [{"0_Comment Submission": "My crybaby tattoo :)", "1_Text": "be nice bruh", "2_Subreddit": "LilPeep"}], "dw3yoxd": [{"0_Comment Submission": "Selling Plasma Lil Peep Forever Lighter", "1_Text": "agree. go away", "2_Subreddit": "GothBoiClique"}], "dw3z2dz": [{"0_Comment Submission": "Selling Plasma Lil Peep Forever Lighter", "1_Text": "go away, scammer", "2_Subreddit": "LilPeep"}], "dw3z42e": [{"0_Comment Submission": "Anyone who didnt get a forever lil peep lighter pm me", "1_Text": "this dude will rip you off. stay away from him", "2_Subreddit": "LilPeep"}], "dw3z93b": [{"0_Comment Submission": "Selling Plasma Lil Peep Forever Lighter", "1_Text": "thought you got 2 on accident? wow you are a pos. check and downvote all this dude's posts.", "2_Subreddit": "GothBoiClique"}], "dw4441e": [{"0_Comment Submission": "Daddy Issues?", "1_Text": "he was actually a very sweet person that was self medicating with drugs, like a lot of Americans right now. I thought he looked crazy at first too, but then saw how good of a person he really was. please be nice, you never know what people have gone through.", "2_Subreddit": "trashy"}], "dw445mf": [{"0_Comment Submission": "Daddy Issues?", "1_Text": "miss this dude so much. such a sweet, kind heart.", "2_Subreddit": "trashy"}], "dw47q08": [{"0_Comment Submission": "Daddy Issues?", "1_Text": "there is a special place for you my friend. continue to spread hate, I will not. good bye.", "2_Subreddit": "trashy"}], "dw4cy9s": [{"0_Comment Submission": "Daddy Issues?", "1_Text": "you are totally right. I didn't know him.", "2_Subreddit": "trashy"}], "dw4e9uw": [{"0_Comment Submission": "Daddy Issues?", "1_Text": "Joe rogan has a ton of tatoos and is a great person that helps a lot of people.I think that you have never had a family member or friend that has chemical addictions. of course I didn't know him, but some of what he talked/sing about helped a lot of people. some of us have been through crazy childhoods and could relate to someone like him. you have already made up you mind about \"people who looked this crazy\".", "2_Subreddit": "trashy"}], "dw4gzk2": [{"0_Comment Submission": "Daddy Issues?", "1_Text": "my whole point was that you are basing your opinion of someone on how they look only. I'm not arguing at all.", "2_Subreddit": "trashy"}], "dw6391f": [{"0_Comment Submission": "The story of Lil Peep and me (Vent)", "1_Text": "so well put. thats exactly how I found him too. I also thought the same thing about how he looked. it taught me a very important lesson once again in my life. some of us have been through a lot, and we use chemicals to feel better. hang in there too man. you seriously just told my story. rip peeps", "2_Subreddit": "LilPeep"}], "dw65dfk": [{"0_Comment Submission": "Tried paying this on r/goddesses but they didn't like it very much, maybe you guys will appreciate it more", "1_Text": "chair lady!", "2_Subreddit": "DunderMifflin"}], "dw7tdzy": [{"0_Comment Submission": "Anyone planning to sell the limited forever plasma lighter?", "1_Text": "he buys them up and then sells them for a ridiculously high price to people that are desperate. it's quite sad actually.", "2_Subreddit": "LilPeep"}], "dw9dyma": [{"0_Comment Submission": "Does ANYONE know if this was actually ever recorded in a studio? I absolutely would love this song to drop at some point", "1_Text": "it has to be recorded. I thought the same thing and then realized that he sings over it like he usually does during his concerts with other songs. it must me recorded!", "2_Subreddit": "LilPeep"}], "dw9hmr9": [{"0_Comment Submission": "Anyone planning to sell the limited forever plasma lighter?", "1_Text": "a form of scamming or even scalping. it's just kind of a crappy thing to do morally.", "2_Subreddit": "LilPeep"}], "dw9vmff": [{"0_Comment Submission": "Can't watch The Brightside video without crying", "1_Text": "no you aren't. he was a special person that just resonated so much with us for various reasons. that video is tough because of his smile in some of those shots. miss you man...", "2_Subreddit": "GothBoiClique"}], "dwb8gjh": [{"0_Comment Submission": "RIP PEEP 💕", "1_Text": "take this shit down please", "2_Subreddit": "LilPeep"}], "dwihrqr": [{"0_Comment Submission": "Hopefully my last shot of dope. Armed with blue dream, 90 xans, some OTC comfort meds, and a dream of a better future, I think this is the kick that sticks. I deserve better than this and I'm going after it with everything I've got. Much love to everyone reading 💖", "1_Text": "good luck! we all really wish you the best man. you can do this!!", "2_Subreddit": "opiates"}], "dwoukap": [{"0_Comment Submission": "My brother always has my back. He was a meth and heroin addict for 25 years and he’s been clean for almost four years now.", "1_Text": "That is so beautiful man. People like us  understand how much that means to have family support like that in a family of addicts. You can do it, hang in there bud.", "2_Subreddit": "opiates"}], "dwta0jf": [{"0_Comment Submission": "Can we get this guy off Spotify? Listen to this trash lmao", "1_Text": "come on man. I mean, this is trash. it's a disgrace to peep. \"none of my bitches over lil redd\" get the fuck out at here.", "2_Subreddit": "LilPeep"}], "dwtafh7": [{"0_Comment Submission": "Castles", "1_Text": "so sick", "2_Subreddit": "GothBoiClique"}], "dwtanhc": [{"0_Comment Submission": "Lil Lotus & Cold Hart (Live in LA, 3/22/18)", "1_Text": "really like the song, but he didn't really sing at all.", "2_Subreddit": "GothBoiClique"}], "dwvaxl5": [{"0_Comment Submission": "Anyone got that video of peep doing cocaine on his lap", "1_Text": "it's a periscope video. he has long hair in it  not sure of the timestamp though, sorry man I don't have the time right now. lol\n\nhttps://youtu.be/_m2M5f7vN44", "2_Subreddit": "GothBoiClique"}], "dwy14tz": [{"0_Comment Submission": "Lil Peep - WHEN WE WALK UP (feat. iLoveMakonnen) [Instagram Live Snippet]", "1_Text": "ok lighter scam guy.", "2_Subreddit": "LilPeep"}]}], "1_submissions": [{"85zbaq": [{"0_Title": "ilovemakonnen dancing for lil peep deleted from YouTube", "1_Text": "be nice bruh", "2_Subreddit": "LilPeep"}]}]}]}