{"dukeovprunes": [{"0_comments": [{"ds5vga0": [{"0_Comment Submission": "To the opiate curious", "1_Text": "Good thing I know I'm in the 1%!", "2_Subreddit": "opiates"}], "dt93qxz": [{"0_Comment Submission": "Please don't do this.", "1_Text": "Wait you mean roughneckjunky or something? What happened to that guy anyway spins post got me interested", "2_Subreddit": "opiates"}], "dteskj2": [{"0_Comment Submission": "How do you start your day before copping?", "1_Text": "Figure out how the fuck I'm gonna get the money I need for the day", "2_Subreddit": "opiates"}], "dticxxa": [{"0_Comment Submission": "I Was a Bank Robber Until I Read Kant - The one thing that criminals and philosophers share is a sense of being an outsider", "1_Text": "He might have been asking what some of those funnest times were which is something I'm also interested in. There's something undeniably thrilling about those sort of activities/people/lifestyles.", "2_Subreddit": "philosophy"}], "du15djh": [{"0_Comment Submission": "Addicts trying to get opiates", "1_Text": "LMAO this isn't even that funny but I'm cracking up over here holy shit hahaha. I think it's the **bold**", "2_Subreddit": "opiates"}], "du15qch": [{"0_Comment Submission": "Just got robbed", "1_Text": "Damn I was gonna share a story about how my dumb ass got robbed in my own goddamn apartment but those dickheads in your story did some of the scummiest shit I've ever heard on this subreddit and out. I'm really sorry that had to happen to you man that blows hope some blessings come your way soon", "2_Subreddit": "opiates"}], "dukk3q5": [{"0_Comment Submission": "Eating while high", "1_Text": "I fucking LOVE eating while high I don't think it affects the high itself it might actually make me enjoy it more cuz I actually get some nutrition and sustenance.", "2_Subreddit": "opiates"}], "dv42218": [{"0_Comment Submission": "[FRESH] Gucci Mane - Solitaire (feat. Migos & Lil Yachty)", "1_Text": "i thini he meant whoie meaning out of migos not the album", "2_Subreddit": "hiphopheads"}], "dv7b0kf": [{"0_Comment Submission": "Sorted my snorting/smoking straws/pens", "1_Text": "nice why do you have so many? i always throw mine away cuz im like well this is my last time lmao", "2_Subreddit": "opiates"}], "dv7eop7": [{"0_Comment Submission": "What was the cringiest thing you did in your first relationship?", "1_Text": "omg are you nick andopolis\n\nmore sincerely i'm sorry to hear that man it'll take time but you will find your peace with it eventually AND someone with whom things were meant to be", "2_Subreddit": "AskReddit"}], "dv7ezdo": [{"0_Comment Submission": "Sorted my snorting/smoking straws/pens", "1_Text": "tampon applicators make great tooters also!", "2_Subreddit": "opiates"}], "dv7gdhm": [{"0_Comment Submission": "Sup y’all just checking in!", "1_Text": "oh shit dude i've been lurking here heavy for years now and it feels like forever since i've seen your name! welcome back :) congrats are in order ofc being clean is a real accomplishment and can feel absolutely amazing which was a real shock for me haha. what you doing in the weight room these days?", "2_Subreddit": "opiates"}], "dvb2223": [{"0_Comment Submission": "Favorite books about drugs and heroin?", "1_Text": "I wanna hear about Lou reeds biography", "2_Subreddit": "opiates"}], "dve2npb": [{"0_Comment Submission": "Favorite books about drugs and heroin?", "1_Text": "damn you sold me!\n\ni love the velvet underground they might be my favorite band of all time and lou reed of course is such an interesting character. i haven't read too much about him as a person except for what was in please kill me (there's a brief mention of his electroshock therapy in there, also i absolutely LOVE this book i've read it cover to cover about 6 times and would recommend it to any fan of ny punk/proto punk it's an oral history beginning with the velvets and goes into the stooges, mc5, new york dolls, dead boys, the ramones) and a book about the velvet underground. the last two sentences of your first paragraph really make me wanna read it. fortunately it's available in some nearby libraries!", "2_Subreddit": "opiates"}], "dvemwdp": [{"0_Comment Submission": "The ol Craigslist dilemma", "1_Text": "I've met up with 9 people through craigslist as a last resort for either tar or ice and all of them have been legit (although product is usually crap, two of them were actually some of the best I've ever had). But I'm also in an area where it's extremely common there's at least 5 new posts for roofing tar every day.", "2_Subreddit": "opiates"}], "dven9dg": [{"0_Comment Submission": "Sup y’all just checking in!", "1_Text": "still better than me! Although I've always been skinny as hell and my habit cuts into my workout schedule pretty severely. It's hard to progress when you're using especially cuz I eat even less than usual. Do you overhead press it's such an athletic lift and hoisting a weight overhead especially after you've cleaned it off the floor feels badass haha. Do you follow a program", "2_Subreddit": "opiates"}], "dvh0crs": [{"0_Comment Submission": "The ol Craigslist dilemma", "1_Text": "law enforcement yeah", "2_Subreddit": "opiates"}], "dvh0eri": [{"0_Comment Submission": "The ol Craigslist dilemma", "1_Text": "yeah it can be pretty obvious lol...standard prices, selling \"gallons\", mention of delivery, \"no bs\" etc", "2_Subreddit": "opiates"}], "dvirb1z": [{"0_Comment Submission": "Favorite books about drugs and heroin?", "1_Text": "oh shit i completely forgot to reply to this! and yup it's called please kill me by legs mcneil. man every time i read this book it feels like i become involved in the punk scene i connect with the characters the music the happenings the atmosphere i always feel so empty when i finish it's like a nostalgia for a time i didn't even experience haha. plus there's a lot of mention of heroin :P you can get it here by clicking on the picture of the book: http://gen.lib.rus.ec/book/index.php?md5=A725240825CC6F638FFCD3520FC04268 library genesis is a great resource for ebooks if you haven't heard of it you can find a looot of books on there even though i hate reading ebooks, especially if they're fiction, on my phone or my computer", "2_Subreddit": "opiates"}], "dvmae7e": [{"0_Comment Submission": "6ix9ine is attempting to steal someone's music", "1_Text": "damn respect for that mature response", "2_Subreddit": "hiphopheads"}], "dvmaofe": [{"0_Comment Submission": "Migos Sued for Allegedly Inciting Riot", "1_Text": "are you saying if someone wants to hurt you with a knife it's faster to react with a knife than it is with a gun?", "2_Subreddit": "hiphopheads"}], "dvrv53w": [{"0_Comment Submission": "Chauffeuring for opiates", "1_Text": "i used to do this on occasion as well to help my dboy reup or take him to a needle exchange. a free g and sometimes some ice or bars for a 20-30 minute ride...how could i say no lol. especially if he hit me up asking and i had no money. tbh we probably shouldnt have smoked cuz hed be smoking off foil in the drivers seat and id be reaching over controlling the wheel and tell him when to brake ah well it was kinda fun", "2_Subreddit": "opiates"}], "dw5cceh": [{"0_Comment Submission": "I puke everytime I smoke raw heroin?", "1_Text": "If I don't like that usually means it's shit dope and the sooner I puke the better. Once I do a couple times I stop the rest of the night and can enjoy my high :)", "2_Subreddit": "opiates"}], "dwfd5li": [{"0_Comment Submission": "munchies on benzos?", "1_Text": "Dude I freaking love it I'm naturally underweight and waaaay undereat but on benzos.I'm constantly scouring the house for food. It's not even really that food tastes good just the act of eating feels so nice for some reason.", "2_Subreddit": "opiates"}], "dwtti6i": [{"0_Comment Submission": "Would you have switched to heroin if oxys were still everywhere?", "1_Text": "Idk if this would be relevant to your paper buy I and most of my friends/using buddies (around 6 or 7 people) went straight to h except one who did went the oc course", "2_Subreddit": "opiates"}]}], "1_submissions": [{"2mqhdv": [{"0_Title": "Storing your bth", "1_Text": "Good thing I know I'm in the 1%!", "2_Subreddit": "opiates"}], "4xk4xh": [{"0_Title": "On what days is it more important to eat?", "1_Text": "Good thing I know I'm in the 1%!", "2_Subreddit": "gainit"}], "6d1e7u": [{"0_Title": "Any drugs that make you immune to pain to the same extent that PCP does?", "1_Text": "Good thing I know I'm in the 1%!", "2_Subreddit": "Drugs"}], "6iizfi": [{"0_Title": "Incorporating Starting Strength Squat Progression (6 Day Squat Version)?", "1_Text": "Good thing I know I'm in the 1%!", "2_Subreddit": "nSuns"}], "6jak36": [{"0_Title": "Disadvantages Of High Volume or Accessory Work in Beginner LP Strength Programs?", "1_Text": "Good thing I know I'm in the 1%!", "2_Subreddit": "Fitness"}]}]}]}