{"ForealThisIsLastTime": [{"0_comments": [{"duw9f0y": [{"0_Comment Submission": "How does everyone Smoke/Vape their H?", "1_Text": "But what do you dissolve your H into?", "2_Subreddit": "opiates"}], "duw9kjz": [{"0_Comment Submission": "Current price in your area?", "1_Text": "Both cities I’ve lived in it’s been $30/blue oxy ir. Once I had a good connect that got $25per if I got a bunch at once, but that didn’t last long. Sometimes if there’s a shortage or demand is high, it can go up to $35per and people will pay, so it is what it is", "2_Subreddit": "opiates"}], "duw9wmn": [{"0_Comment Submission": "Is alprazolam only meant to be taken orally? Have any of you tried it any other way?", "1_Text": "This right here. I took 2mg last night and remember seeing the clock at 7:45, feeling super relaxed and sinking into my seat, waiting for the Olympics to start at 8. Next thing I know, it’s 12:30am and I’m waking up on the couch. Gf says she tried to wake me multiple times when the show started, and again when she went to bed, but each time I just kinda half sat up and mumbled then went back to sleep. I don’t remember anything from 7:45-12:30am. The shit’s powerful and sneaks up on you", "2_Subreddit": "opiates"}], "duwa4th": [{"0_Comment Submission": "Is alprazolam only meant to be taken orally? Have any of you tried it any other way?", "1_Text": "Agreed you get the most out of popping it orally. If you snort xans you’re sniffing 98-99% filler and binders. There’s such a small amount of alp compared to the weight of the pills. Only reason you get a good enough high is bc it drips into your throat, so it’s basically like swallowing some anyway. I tried snorting some once too and it feels/tastes like snorting chalk lol much easier to just pop a pill", "2_Subreddit": "opiates"}], "duyu4ap": [{"0_Comment Submission": "Dick’s, Major Gun Retailer, Will Stop Selling Assault-Style Rifles", "1_Text": "Wasn’t there a ruling lately that allowed a cake shop refuse to make a cake for a gay wedding? Most, if not all, businesses reserve the right to refuse service to anyone at any time.", "2_Subreddit": "news"}], "dva6qfq": [{"0_Comment Submission": "Anyone quit Instagram and notice a positive mental boost?", "1_Text": "My gf reads their “news” “articles” and she loves it", "2_Subreddit": "xxfitness"}], "dvdftrr": [{"0_Comment Submission": "[Image] Facts", "1_Text": "Also born in 92. January tho so just got kicked off parents insurance", "2_Subreddit": "GetMotivated"}], "dvj62j7": [{"0_Comment Submission": "MoviePass just immediately answered their customer service number!", "1_Text": "“They did a manual activation on my card...” so yes they solved the issue.", "2_Subreddit": "moviepass"}], "dvj6wvw": [{"0_Comment Submission": "MoviePass just immediately answered their customer service number!", "1_Text": "Ah understandable. Yeah I heard nothing but bad things but have had only good experiences with the app", "2_Subreddit": "moviepass"}], "dvjpt9d": [{"0_Comment Submission": "Working a night shift when time changes", "1_Text": "There’s still a threshold you have to be over a certain salary to be exempt.\n\nSource: worked in HR", "2_Subreddit": "gifs"}], "dvk6tml": [{"0_Comment Submission": "Lentil soup for the next 8 work lunches!", "1_Text": "Why not", "2_Subreddit": "MealPrepSunday"}], "dvkc38u": [{"0_Comment Submission": "My uncle is convinced Mountain Dew made him live to be 100. Here he is at his 100th birthday party like a badass.", "1_Text": "My college friend got sponsored by Liquid Lightning. Basically red bull on crack and he’s getting free cases to mix in our jugs of booze at parties", "2_Subreddit": "funny"}], "dvkdn12": [{"0_Comment Submission": "Florida Blow", "1_Text": "Holy shit I’m in Tampa area now and literally just picked up some fire today from my trailer park plug who says he’s got cartel connects haha I guess it’s all about connections", "2_Subreddit": "cocaine"}], "dvkdog7": [{"0_Comment Submission": "Florida Blow", "1_Text": "Def luck. I always figured most batches come from different places but what do I know", "2_Subreddit": "cocaine"}], "dvo90rl": [{"0_Comment Submission": "Adrenaline filled ride home as a very angry man shows me his gun", "1_Text": "Think about the average person. Imagine how they might speak and what kind of things they might do. Then realize that ~50% of people are below the average", "2_Subreddit": "motorcycles"}], "dvpxjpe": [{"0_Comment Submission": "You know that no matter where the soul stone ends up being...", "1_Text": "You seem like a lot of fun to discuss fan theories with....", "2_Subreddit": "marvelstudios"}], "dvs170s": [{"0_Comment Submission": "Thanks to Buzzfeed I now know this exists as a patch for the DEA.", "1_Text": "Out of ignorance but mostly curiosity, do they serve a purpose besides collection and appreciation? Is it a game or something?", "2_Subreddit": "opiates"}], "dvsnxha": [{"0_Comment Submission": "Thanks to Buzzfeed I now know this exists as a patch for the DEA.", "1_Text": "Interesting, thanks for the info!", "2_Subreddit": "opiates"}], "dw9ibht": [{"0_Comment Submission": "Tampa Bay Moviepass", "1_Text": "Ive used it at citrus park, Riverview, University city, and westshore successfully. There’s tons more accepted theaters in st pete and clearwater so I thought it was worth it even if I move to a surrounding city.", "2_Subreddit": "moviepass"}], "dwehiym": [{"0_Comment Submission": "Could you really \"stop whenever you want\"?", "1_Text": "In pretty much the same situation. Don’t do it that often but gf threw a fit when I crashed after a 2-3 day bender right before the weekend and she wanted to go out but I had to recharge for at least a day. She also didn’t know I was high. Good job on the breaks. Good luck stranger", "2_Subreddit": "cocaine"}], "dwirmwf": [{"0_Comment Submission": "What's the most legendary work meltdown you've seen?", "1_Text": "This is the way to get it done. I second this based on experience", "2_Subreddit": "AskReddit"}], "dwkp5eo": [{"0_Comment Submission": "Dog sitting and his owner has me give him half of one of these before bed LOL.", "1_Text": "My pup has crazy anxiety and he just got prescribed Fluoxetine, which is a slower acting alternative to alprazolam. But the vet did mention alp as an option. We also tried using calming lavender collars, oils, and thunder coats for about a year with no decrease in anxiety before the vet would actually prescribe anything. I’m sure you could fast-track my experience", "2_Subreddit": "opiates"}], "dwkp8cr": [{"0_Comment Submission": "Dog sitting and his owner has me give him half of one of these before bed LOL.", "1_Text": "Might depend on the size of the dog but yeah my lil guy would only need 1/4 of a bar at most to be fucked up", "2_Subreddit": "opiates"}], "dwrw52w": [{"0_Comment Submission": "JK Link to Agents of SHIELD", "1_Text": "Did IGH just happen to be working toward the same goal as Cal without knowing? I’d like to think they collabed at some point while giving people super powers by altering DNA", "2_Subreddit": "marvelstudios"}], "dwwiq81": [{"0_Comment Submission": "The best time to look for a job is when you have a job - solid evidence from the Federal Reserve", "1_Text": "LPT: Volunteering during your time off helps your resume and looks good to future interviewers. Even a few hours per week is enough to use.\n\nLPT2: Also consider joining a club/group related to your profession that meets once per week or month. For added bonus, try to get a leadership position. But even just membership can go on your resume to fill in or ‘help explain’ work gaps.\n\nWhile doing either of those, you’ll also meet like-minded people who might be able to help you get a new job. They’ll learn your work ethics and hopefully like you, then a referral can go a long way. Networking really helps in job hunting and knowing the right people can open doors.\n\nI got my last 4 jobs by knowing a current employee, who recommended me to the Manager or Director, which got me an interview set up. Then if you can interview competently you’ll normally get an offer. Companies typically like referrals from good employees because they want more good employees like that and it saves them recruiting costs.\n\nSorry for the wall of text at the end. Thought maybe my limited experience could help someone. Good luck on your search!", "2_Subreddit": "personalfinance"}]}], "1_submissions": [{"83nihh": [{"0_Title": "MoviePass just immediately answered their customer service number!", "1_Text": "But what do you dissolve your H into?", "2_Subreddit": "moviepass"}], "89kkzz": [{"0_Title": "JK Link to Agents of SHIELD", "1_Text": "But what do you dissolve your H into?", "2_Subreddit": "marvelstudios"}]}]}]}