{"feelsgoodbut": [{"0_comments": [{"dnit0vz": [{"0_Comment Submission": "In what circumstance has a random internet user impacted your life?", "1_Text": "Kinda like breastfeeding, then?", "2_Subreddit": "AskReddit"}], "dnkhfbg": [{"0_Comment Submission": "What's the dodgy est thing you've done to score meds at a pharmacy?", "1_Text": "Yeah plz inform lmao", "2_Subreddit": "opiates"}], "dofif1l": [{"0_Comment Submission": "Can I get High of off this ?", "1_Text": "Yeah your liver can handle 2000mg of paracetamol at once so if you are interested in just swallowing them 3-4 is your best option. On the other hand if you were keen on CWE'ing im sure there is a guide floating somewhere in this sub lol. Its pretty simple just involves crushing all the pills, stirring them in a glass of warm water till they dissolve, putting said glass into the freezer, and then collecting it and straining (with something like a thin towel or ideally a coffee filter) the remaining clear liquid into a glass for your consumption, leaving the thick layer of paracetamol which should be at the very bottom of the glass that you strained. May or may not have worded this confusingly im baked as fook", "2_Subreddit": "opiates"}], "dofihts": [{"0_Comment Submission": "Can I get High of off this ?", "1_Text": "If the water is really murky it means your CWE hasnt worked and is still full of paracetamol so obviously dont down that shit if thats the outcome lol. Also, the obligatory \"if your tolerance is low be careful with how much you are dosing\", codeine can still be strong for people with low tolerance.", "2_Subreddit": "opiates"}], "dolawkd": [{"0_Comment Submission": "We don't buy things with money. We buy things with hours of our life.", "1_Text": "ah microeconomics", "2_Subreddit": "Showerthoughts"}], "doo6ez3": [{"0_Comment Submission": "Why do the uneducated fail to grasp the benefits of education?", "1_Text": "i love you", "2_Subreddit": "AskReddit"}], "dsezgd2": [{"0_Comment Submission": "Hey guys. What would you value this type writer? (Ignoring the $40AUD price tag on it from thrift store)", "1_Text": "Also, ignore the pushed down keys lol, I pushed them down right before the photo so I realise that makes it look potentially faulty. I would only purchase it after ensuring it works properly.", "2_Subreddit": "typewriters"}], "dsg0i1d": [{"0_Comment Submission": "Hey guys. What would you value this type writer? (Ignoring the $40AUD price tag on it from thrift store)", "1_Text": "Great. Thanks so much for all that insight mate, youve got a lot of valuable information. Ive gotten the store to put it on hold for me and will be grabbing it tonight. Is there any particular way in which I can test that its actually functional in the store before purchase?", "2_Subreddit": "typewriters"}], "dsg0mat": [{"0_Comment Submission": "Hey guys. What would you value this type writer? (Ignoring the $40AUD price tag on it from thrift store)", "1_Text": "I completely know what you mean. Ive actually bought it with the intention of re-selling (dont shun me lol), but I’m happy if it doesnt sell ‘cos it means I can use it! I saw a post in this thread that simply typed some song lyrics with a typewriter, formated in an interesting way and it just looked attractive. Something about a typewriter as opposed to a computer can give the words such substance.", "2_Subreddit": "typewriters"}], "dsg0t0k": [{"0_Comment Submission": "Hey guys. What would you value this type writer? (Ignoring the $40AUD price tag on it from thrift store)", "1_Text": "Oh, and I had one more  question to trouble yourself with if thats okay. Is there much of a market for standard typewriters like this? I realise its a niche where there is a subculture of people, like yourselves, who are interested in them but are typewriters like this quick to sell on ebay or can they be quite difficult to sell since the market is so small.\n\nI understand you may not know the answer to this but thought I’d try my luck since you seemingly know your fair share about this. :)", "2_Subreddit": "typewriters"}], "dt7azzk": [{"0_Comment Submission": "Anyone know what these are worth? Mixed messages online.. Nike Zoom Lebron II (I think).", "1_Text": "Appreciate that feedback. The thing thats thrown me off is some of them sell for 500 on ebay but then others are selling for around 100.", "2_Subreddit": "Sneakers"}], "dt7b44k": [{"0_Comment Submission": "Anyone know what these are worth? Mixed messages online.. Nike Zoom Lebron II (I think).", "1_Text": "Oo I like the fact he wore the exact same colour as these. hopefully that helps my case lol.", "2_Subreddit": "Sneakers"}], "dt7klt7": [{"0_Comment Submission": "What do you guys think this 'Imperial 200' is worth, considering the fact the spacebar doesnt seem to be working. It also has a nice lid that you can partially see.", "1_Text": "Interesting.. I’m quite new to the typewriter scene, do you have any idea of how much a non functioning space bar would detract from the price?", "2_Subreddit": "typewriters"}], "dt7r40u": [{"0_Comment Submission": "What do you guys think this 'Imperial 200' is worth, considering the fact the spacebar doesnt seem to be working. It also has a nice lid that you can partially see.", "1_Text": "Mate. I wish I could kiss ya through the screen right now! Since I am a typewriter novice, I am not too equipped to effectively test the type writer to see if it is working properly. When I initially purchased it, the spacebar didn't seem to be working properly, and that was that. I gave up.\n\nAfter your message, I went and had a fiddle with it, pressed some things and what not. Next thing I know its working perfectly! 100% functional and its such a good looking type writer, love the colour. Anyways a big thank you to you my friend! Cheers!", "2_Subreddit": "typewriters"}], "dwkbla5": [{"0_Comment Submission": "Everybody has their time. Mine is now.", "1_Text": "This. This is so important, and I'm glad you are self-aware enough to know this and question me on it. I think as users/addicts, we all have had many 'moments' where we vow that we are legitimately done with it all, and we genuinely believe it, only to wake up in a completely different mind state the next morning. \n\n\nI too, have had many similar moments. But none like this. This is the real deal, and to be honest it's like nothing I've ever experienced. Just complete  and utter **certainty** that I am putting this life behind me, and marching forward into sobriety with 100% success. I've been abusing opiates for 3 years (successfully chipped for 5 years before that) and the longest I've gone without using is 11 days. It's quietly been breaking my heart as the repercussions have taken place in my life. But suddenly, a switch has been flicked in my mind. \n\nA big factor for this 'epiphany' if you will, was openly telling my parents for the first time (they knew I was using, they just didnt know what). I always had thought that I will sort it out on my own and don't need to burden them, but the moment I told them I realised that 1. they will keep me accountable, and 2. I now have a support network, which is crucial for recovery. \n\nI understand that I have not actually executed the sobriety yet, and to people looking in on what I'm saying, it may seem like im counting my chickens before they hatch, but nonetheless I am 100% positive that I will not be using again. I feel as though it's already happened.\n\nYes, you're 100% right in saying its only pivottal if I follow through with it, and I'll be following through with everything I've got. Thank you for wishing me luck.\n\n\nPS: Apologies for the mini-essay, I'm enjoying the expressive outlet lol.", "2_Subreddit": "opiates"}], "dwkbzbk": [{"0_Comment Submission": "Everybody has their time. Mine is now.", "1_Text": "Im definitely doing the thing. I get the sense in your writing that you're somewhat of a veteran in this lifestyle (I could be wrong), so I see a lot of value in your 2 cents and appreciate it my man. \n\n\nIt's funny, despite only being 23, I have already acknowledged and experienced the weird perception of time you noticed. It's crazy. The past 3 years of my most hardcore usage have gone in the blink of an eye. Time just flies by so fast. \n\n\nAnyways, I'm getting out and I'm getting out now. I'm not crashing this bus. Much love bro, I hope you're well and hope you achieve any goals that you may have.", "2_Subreddit": "opiates"}], "dwkcvl3": [{"0_Comment Submission": "Everybody has their time. Mine is now.", "1_Text": "Yes my brother, keep that fire burning, there's no time like the present. This is happening and its happening right now.\n\n\nAt the risk of sounding like a snoop, I just clicked on your profile and saw a comment you made a day ago. My situation is very much similar. \n\n\nWonderful middle class family. Eventually start dabbling in oxy. Go from snorting large amounts of oxy, to snorting less amounts of H, because efficiency reasons. Strictly snort, could never shoot. Have **no** friends who do the same. For 2-3 years or so I would successfully chip. Originally started leaving 7 days in between usage. Then 3 days in between. Then 2. Then 1. Then 2 days on, 1 day off. So on so forth, you know how the story goes. \n\nI'd mostly use in my room by myself, but sometimes I'd be out with other people and they wouldn't know that I was on opiates. And now it has been at the point where work is a nightmare if I don't rack 2-3 lines in the toilets throughout the day. But that life's all over now. Will be a difficult transition, but it WILL happen.\n\n\nNot 100% where I'm going with this. I guess I'm just highlighting that there is always someone struggling with addiction who has a similar situation to yours. It can happen to anyone. It's all about how you perform and what you do when you say \"enough's enough\". \n\n\nCongratulations on 5 days my man. Keep that firey motivation alight. One day at a time. You can do it. I can do it. Everyone can do it. It just comes down to whether you are going to step up to the plate and simply just fucking do it. Keep going bro.", "2_Subreddit": "opiates"}], "dwkd64v": [{"0_Comment Submission": "Everybody has their time. Mine is now.", "1_Text": "I love that you love them. I was watching a documentary on addiction, and a certain sentence resonated with me. I cant remember it word for word (must not have resonated that much, hey?), but it was basically said something like this:\n\n\nYou can have all these plans, you are going to write a book, you are going to improve at work, you are going to learn french, you are going to start exercising whilst you are getting clean. BUT, if you don't put your \"getting clean\", before EVERYTHING else. Then you will not have everything else. You will have nothing. Except the continued addiction of course. \n\nSobriety has to be number 1. And one thing I have learnt is the importance of having family as a support network. They keep you accountable, and give you a support network. It's refreshing to not feel like you are doing it alone. \n\nI will definitely check out that sub, thanks for informing me!", "2_Subreddit": "opiates"}], "dwkdbws": [{"0_Comment Submission": "Everybody has their time. Mine is now.", "1_Text": "Yes your time IS coming. And you do need to be 'ready' before you decide to get sober, or else relapse is inevitable. **HOWEVER**, something you should know is, you'll never be fully fully fully ready. \n\n\nThere comes a time when you are *close* to being ready, and even though there is a small part of your brain that isn't completely ready and willing to stop just yet, you have to say \"Fuck it, NOW is the time\", because you'll never be entirely completely 'ready' to do it, without taking a little leap.\n\nAll the best, you can do this, and remember; theres no time like the present.", "2_Subreddit": "opiates"}], "dwkde2v": [{"0_Comment Submission": "Everybody has their time. Mine is now.", "1_Text": "And I'm rooting for you whenever your time comes. Appreciate your encouragement.", "2_Subreddit": "opiates"}], "dwkdhc5": [{"0_Comment Submission": "Everybody has their time. Mine is now.", "1_Text": "Appreciate that. With people chipping in their encouraging 2 cents like yourself, I most definitely do got this.", "2_Subreddit": "opiates"}], "dwkdhui": [{"0_Comment Submission": "Everybody has their time. Mine is now.", "1_Text": "Legend", "2_Subreddit": "opiates"}], "dwkdif0": [{"0_Comment Submission": "Everybody has their time. Mine is now.", "1_Text": "My man", "2_Subreddit": "opiates"}], "dwkeayq": [{"0_Comment Submission": "Everybody has their time. Mine is now.", "1_Text": "Well, what about you? Yeah 23 years is a long, long time. And yes it would likely be the most difficult thing in your life if you were to give it all up and get completely clean. But have you given up hope of getting clean? In terms of time, hypothetically if you were to stop tomorrow and never use again, I'm sure you have plenty of years of beautiful life left that you could squeeze some sober fulfilment out of.. Thoughts?", "2_Subreddit": "opiates"}], "dwkieg4": [{"0_Comment Submission": "Everybody has their time. Mine is now.", "1_Text": "Thats sick man what genre of music?? Do you have any uploaded recordings or videos i can suss out? Musics a big part of my life. And what type of art do you do?", "2_Subreddit": "opiates"}]}], "1_submissions": [{"88acso": [{"0_Title": "Everybody has their time. Mine is now.", "1_Text": "Kinda like breastfeeding, then?", "2_Subreddit": "opiates"}]}]}]}