{"DeeboComin": [{"0_comments": [{"dvwa687": [{"0_Comment Submission": "Walgreens won't fill rx bc I bought syringes...", "1_Text": "It is such bullshit and makes zero sense. THEIR STORES were filling fake scripts... so now they’re entitled to deny people their legitimately prescribed medication based on some secret list?! Nonsense.\n\nTake care of yourself and good luck! ❤️ Fuck Walgreens!", "2_Subreddit": "opiates"}], "dvwduol": [{"0_Comment Submission": "Walgreens won't fill rx bc I bought syringes...", "1_Text": "😍 Thank you, Friday is one of my favorite movies of all time, never fails to crack me up! THAT’S MY BIKE PUNK! 🚲", "2_Subreddit": "opiates"}], "dvwg9u2": [{"0_Comment Submission": "Walgreens won't fill rx bc I bought syringes...", "1_Text": "I thought so too, I remember reading this article when it came out and being enraged! When OP mentioned Walgreens was acting ignorant I figured it might have something to do with their stupid checklist. 🙄", "2_Subreddit": "opiates"}], "dvwk2aq": [{"0_Comment Submission": "Walgreens won't fill rx bc I bought syringes...", "1_Text": "😭 Big worm, big hoe, big I don’t give a damn!", "2_Subreddit": "opiates"}], "dwghijy": [{"0_Comment Submission": "$10,000 a week for H???", "1_Text": "My work bff does the most amazing impression of Barbara. We’ll be sitting there working in silence and all of a sudden he’ll yell, “Jenelle, I saw you wit Keiffa!” or “Yaw both high! High, high, high!” 😂", "2_Subreddit": "opiates"}], "dwja9pk": [{"0_Comment Submission": "What's the WORST concert you have ever been to?", "1_Text": "Lol, right? If you go to a Dylan show expecting gratitude, you’ll probably end up disappointed.", "2_Subreddit": "AskReddit"}], "dwjahtt": [{"0_Comment Submission": "$10,000 a week for H???", "1_Text": "This comment made me lol because it is so accurate. I’ve always hated Debz OG (Farrah’s mom) more than Barb but you’re making a good case for Barb to be #1 on my most hated list.", "2_Subreddit": "opiates"}], "dwjn1ki": [{"0_Comment Submission": "$10,000 a week for H???", "1_Text": "Debz OG is dumb as hell, but you’re right, she’s not really a bad person... she just wants to make rap videos and marry her kilt-wearing boo at the weird subterranean aquarium banquet hall. Ok, you’ve convinced me! However I’ll always have a soft spot for Barb because of my friend’s hilarious impression, lol. At least once a day one of us starts a sentence to the other with “Ya know Jenelle...” in our Barb voice. Cracks me up every time.", "2_Subreddit": "opiates"}], "dwjnopv": [{"0_Comment Submission": "What's the WORST concert you have ever been to?", "1_Text": "DINGDINGDINGDING we have a winner. 😊", "2_Subreddit": "AskReddit"}], "dwleskg": [{"0_Comment Submission": "Take a look at my NA tag, and also this baby shot", "1_Text": "😍 your nails!", "2_Subreddit": "opiates"}], "dwneigh": [{"0_Comment Submission": "Russian bots are rallying behind embattled Fox News host Laura Ingraham as advertisers dump her show -- \"A website that monitors Russia's disinformation campaign found that @ingrahamangle, @davidhogg11, and @foxnews were among the top six Twitter handles that Russia-linked accounts have tweeted at\"", "1_Text": "Omg, I think I was targeted by these bots, lol! I replied to a tweet about this Dr. Laura controversy and I got tons of irrationally angry replies to a fairly unremarkable tweet.", "2_Subreddit": "worldnews"}], "dwni4ye": [{"0_Comment Submission": "Policy Change regarding human consumption", "1_Text": "SWIM is a bot.", "2_Subreddit": "opiates"}], "dwqlfs6": [{"0_Comment Submission": "IAMA Request for guitar virtuoso Buckethead", "1_Text": "Just read this article about a guy who has dinner with Buckethead and he also suggests Buckethead may not be human. https://www.vice.com/en_us/article/vdyxyx/i-had-dinner-with-buckethead", "2_Subreddit": "IAmA"}], "dwr8wze": [{"0_Comment Submission": "Flying to Pakistan shitpost", "1_Text": "Never been to Pakistan so I can’t speak to those airports, but in my personal experience when flying internationally I’ve been subjected to a lot more scrutiny when I’m flying back home to the US, not when I’m arriving from the US. Especially when flying to the US from places like Turkey and Colombia where they have good drugs that people try to smuggle out. Good luck friend, keep us updated please! \n\nEdit: I have never attempted to smuggle anything into or out of a foreign country, just sharing a general observation.", "2_Subreddit": "opiates"}], "dwrpjla": [{"0_Comment Submission": "A discussion regarding missing person cases, where the victim has disappeared into thin air, with no trace or even hint of foul play.", "1_Text": "Kortne Stouffer. Cops had been called to her house 3 times the night she disappeared because of disputes between Kortne and her downstairs neighbors. Then she was just... gone. http://www.pennlive.com/midstate/index.ssf/2012/08/kortne_stouffer_disappeared_am.html", "2_Subreddit": "UnresolvedMysteries"}], "dwrqeww": [{"0_Comment Submission": "Flying to Pakistan shitpost", "1_Text": "I think that is a great decision, they definitely don’t fuck around on the US side. Sending out good vibes for you that all goes well and that you have a great trip!", "2_Subreddit": "opiates"}], "dwtlnox": [{"0_Comment Submission": "A discussion regarding missing person cases, where the victim has disappeared into thin air, with no trace or even hint of foul play.", "1_Text": "Hello! Thanks for the reply! This is a somewhat local case for me and there are all kinds of crazy rumors surrounding it but I couldn’t agree more with every last word of your very well thought out post. I know the cops say the friend who spent the night has been cleared and he passed a lie detector test but I’m sorry, the cops need to “go back to the damn drawing board” (in the infamous words of Patsy Ramsey, lol). \n\nThe neighbors clearly didn’t get along with Kortne but their reaction was to call the cops on her, not kill her. No one with a brain is going to murder someone who lives in the same house after first calling the police. And I agree one zillion percent that the “angry” stomping around could’ve actually been the sounds of a violent incident taking place. \n\nI feel like the last time the neighbor called the cops (when they said they heard stomping, Kortne screaming, etc.,) that those sounds were very likely caused by whatever incident ended Kortne’s life. And the friend claims he just slept right through all of this...\n\nSoon afterward, the friend starts building an alibi... he goes to the store to buy a drink where he is seen on surveillance footage, sends the text, etc. \n\nPeople around here talk about her getting kidnapped and murdered and thrown in a quarry because of drug debts but I think that’s pretty far-fetched. Kortne was a kid in a hemp necklace who sold shitty weed, she wasn’t Pablo Escobar. I mean, anything is possible but I don’t think this is a likely scenario.", "2_Subreddit": "UnresolvedMysteries"}], "dwtvsnz": [{"0_Comment Submission": "How is this legal!?", "1_Text": "Supporting two NFL teams from the same division should also be illegal.", "2_Subreddit": "trashy"}], "dwtz2p4": [{"0_Comment Submission": "Funeral Etiquette", "1_Text": "Before my uncle (who was also my godfather) died, he and my aunt had been involved in the clowning... community? Is it a community? Anyway, about 15 clowns in full makeup, wigs, big shoes, etc. came to his funeral at a Catholic church. As his godchild I did one of the readings at the funeral mass and looking out at the crowd was like, crying person in black clothes, crying person in black clothes, clown, crying person in black clothes... I’m not a fan of clowns AT ALL, but it was kinda cool that his clown homies did that.", "2_Subreddit": "trashy"}], "dwvj8na": [{"0_Comment Submission": "$10,000 a week for H???", "1_Text": "Just found this and had to share 😂 https://imgur.com/a/rOlCP", "2_Subreddit": "opiates"}], "dwvs7ec": [{"0_Comment Submission": "Why My Nose?", "1_Text": "I used to do this weird arm thing too! I thought I was the only one.", "2_Subreddit": "opiates"}], "dwvt1ot": [{"0_Comment Submission": "What's the best case of instant karma that you've ever seen?", "1_Text": "Didn’t see this myself but it’s a good story of instant karma. My dad worked with a guy who was a huge asshole and he had terrible road rage and drove like a complete maniac. One day the asshole got cut off by a car on the interstate so he started tailgating, cutting them off, brake-checking, etc. The driver of the other car pulls over, asshole guy pulls over and gets out of his car ready to fight the dude. Turns out the other guy was an FBI agent. He asked for asshole’s driver’s license, looked at it, then threw it down a big embankment and got in his car and left.", "2_Subreddit": "AskReddit"}], "dwx5emg": [{"0_Comment Submission": "I have never done any opiates. I've been browsing this sub for ~2 hours now.", "1_Text": "I haven’t used in forever, I just like to come here to be around non-judgmental people, it’s a refreshing alternative to my real life, lol! Love you all. \n\nP.S. excellent choice to never do opiates, OP. They’d feel like the best thing that’s ever happened to you, but they’d actually be the worst.", "2_Subreddit": "opiates"}], "dwx6l8t": [{"0_Comment Submission": "I think Ryan is doing speedballs.", "1_Text": "Agreed!!! There’s no way in hell he could’ve done $10k of heroin per week, there aren’t enough hours in the day and he’d be unconscious (if not dead) most of the time anyway. This theory totally explains his buggy eyeballs too. Idk if it’s coke or meth but he’s def not exclusively doing heroin.", "2_Subreddit": "TeenMomOGandTeenMom2"}], "dwxuqml": [{"0_Comment Submission": "‘Self-Portrait, Smiling’ by Rembrandt van Rijn, etching, 1630.", "1_Text": "Adding to its overall awesomeness, this etching is about the size of a postage stamp.", "2_Subreddit": "Art"}]}], "1_submissions": [{"5dz220": [{"0_Title": "A white squirrel lives in my yard!", "1_Text": "It is such bullshit and makes zero sense. THEIR STORES were filling fake scripts... so now they’re entitled to deny people their legitimately prescribed medication based on some secret list?! Nonsense.\n\nTake care of yourself and good luck! ❤️ Fuck Walgreens!", "2_Subreddit": "pics"}], "5iv44w": [{"0_Title": "I found Drake's ancestors!", "1_Text": "It is such bullshit and makes zero sense. THEIR STORES were filling fake scripts... so now they’re entitled to deny people their legitimately prescribed medication based on some secret list?! Nonsense.\n\nTake care of yourself and good luck! ❤️ Fuck Walgreens!", "2_Subreddit": "funny"}], "6runs1": [{"0_Title": "Anyone else remember 'Out of This World'?", "1_Text": "It is such bullshit and makes zero sense. THEIR STORES were filling fake scripts... so now they’re entitled to deny people their legitimately prescribed medication based on some secret list?! Nonsense.\n\nTake care of yourself and good luck! ❤️ Fuck Walgreens!", "2_Subreddit": "nostalgia"}], "7rn934": [{"0_Title": "Am I the only person who watched this weird show ‘Rocky Road’? It was about some kids whose parents died (the backstory for at least 50% of 80s tv shows) and they opened an ice cream store at the beach.", "1_Text": "It is such bullshit and makes zero sense. THEIR STORES were filling fake scripts... so now they’re entitled to deny people their legitimately prescribed medication based on some secret list?! Nonsense.\n\nTake care of yourself and good luck! ❤️ Fuck Walgreens!", "2_Subreddit": "nostalgia"}], "7w8yqx": [{"0_Title": "Just found a forgotten stash of Methadone pills", "1_Text": "It is such bullshit and makes zero sense. THEIR STORES were filling fake scripts... so now they’re entitled to deny people their legitimately prescribed medication based on some secret list?! Nonsense.\n\nTake care of yourself and good luck! ❤️ Fuck Walgreens!", "2_Subreddit": "opiates"}], "83gdxn": [{"0_Title": "If anyone needs a chuckle, check out this amazing ‘Just Say No’ PSA from 1984. Nancy Reagan had all us 80s kids thinking bullies were gonna appear out of nowhere and menacingly demand that we do drugs with them.", "1_Text": "It is such bullshit and makes zero sense. THEIR STORES were filling fake scripts... so now they’re entitled to deny people their legitimately prescribed medication based on some secret list?! Nonsense.\n\nTake care of yourself and good luck! ❤️ Fuck Walgreens!", "2_Subreddit": "opiates"}], "8adq3z": [{"0_Title": "‘Self-Portrait, Smiling’ by Rembrandt van Rijn, etching, 1630.", "1_Text": "It is such bullshit and makes zero sense. THEIR STORES were filling fake scripts... so now they’re entitled to deny people their legitimately prescribed medication based on some secret list?! Nonsense.\n\nTake care of yourself and good luck! ❤️ Fuck Walgreens!", "2_Subreddit": "Art"}]}]}]}