{"highinohio": [{"0_comments": [{"dvzp859": [{"0_Comment Submission": "What have I done? Never tried a meth/heroin speedball. Holy fuck that hit the spot.", "1_Text": "Those are the exact same supplies I get from my needle exchange. Somewhere in ohio?\n\n\nEdit: Nvm i see you have tar so that wouldn't be from around here. By the way a good name for what you did is goofball haha.", "2_Subreddit": "opiates"}], "dvzphz6": [{"0_Comment Submission": "What have I done? Never tried a meth/heroin speedball. Holy fuck that hit the spot.", "1_Text": "I get ecp, #4. But yea a goofball is meth/heroin mixed lol I fucking love speedball though I just do the normal coke/heroin mix and god damn it's fucking incredible. The reason I don't prefer goofballs is because I'm not a big fan on stimulants and don't like to stay up too long. I just fucking love the rush from IV coke", "2_Subreddit": "opiates"}], "dw0ytxb": [{"0_Comment Submission": "Almost got busted today", "1_Text": "Love the velvet underground username. I was just talking with my girlfriend the other day about the lyrics to that song and how I love them", "2_Subreddit": "opiates"}], "dw4eqg7": [{"0_Comment Submission": "Where is your favorite place to do heroin?", "1_Text": "You just sounded so British there", "2_Subreddit": "opiates"}], "dw4f6md": [{"0_Comment Submission": "Light blue seem legit but still skeptical.. almost whiteish.. legit check please.", "1_Text": "The 3 is supposed to look like that. Kinda like a sideways McDonalds M if it were lowercase. But like someone posted the other day, there's no way people can tell real or fake by just looking.", "2_Subreddit": "opiates"}], "dw9hi00": [{"0_Comment Submission": "Let's hear those stories", "1_Text": "Haha hells yea, that will always be a time to look back on. Thanks for the nice story to wake up to on this early Sunday afternoon after a long night of banging speedballs.", "2_Subreddit": "opiates"}], "dwam2d7": [{"0_Comment Submission": "For all my junkie hype beasts out there", "1_Text": "I don't think that is an opium poppy. Supreme is lame and too pussy to put an actual controversial opium poppy on there", "2_Subreddit": "opiates"}], "dwam6ry": [{"0_Comment Submission": "Pretty good score for $30", "1_Text": "Nice dude. Happy for you on getting a hell of a deal. Also happy your tolerance is super low. Hope it stays that way", "2_Subreddit": "opiates"}], "dwamgwu": [{"0_Comment Submission": "For all my junkie hype beasts out there", "1_Text": "Hells yea born and raised in this opiate-infected state", "2_Subreddit": "opiates"}], "dwdplrc": [{"0_Comment Submission": "Love the refill day!!", "1_Text": "Man i wish I had some benzos period. Haven't had them since last August. Around that time, my girl had a serious injury and had to have an emergency surgery well they found opiates and benzos in her system so they took her peaches script away. Fucking bullshit.", "2_Subreddit": "opiates"}], "dwibtbi": [{"0_Comment Submission": "Hopefully my last shot of dope. Armed with blue dream, 90 xans, some OTC comfort meds, and a dream of a better future, I think this is the kick that sticks. I deserve better than this and I'm going after it with everything I've got. Much love to everyone reading 💖", "1_Text": "I like that attitude that you deserve better. Yea the motivation behind making things easier on those who care about us is great. However, when trying to quit, it's ultimately vital that we think about how we conduct ourselves. \n\n\nYou do deserve better and I believe in you 💀", "2_Subreddit": "opiates"}], "dwihgms": [{"0_Comment Submission": "Once a trip has been made into the world of IV speedballs...", "1_Text": "That's the thing, it was good coke. I was not even doing a half point of this coke every shot the first week and omg that first one was probably the best rush I ever had in my life. But I loved it so much that I was doing speedballs all day every day for over two weeks. The last 2 days got to be where i was doing almost a half g in a shot. Still got a good rush but not satisfying enough because of my tolerance. Trust me it wasn't the quality of coke. It was my tolerance.", "2_Subreddit": "opiates"}], "dwihnon": [{"0_Comment Submission": "Once a trip has been made into the world of IV speedballs...", "1_Text": "I know what you mean and how it sounds. But like I said to him, the first week I wouldn't even do half a point and would do about .2 of dope mixed with it with amazing results. Best rushes of my life. I thought I found God's own past-time. The tolerance came into play after i was doing them all day everyday for 2 weeks and had way too much money at my disposal. And now that money is all gone. Haha that's how it happens. Taking at least a week break so i can do .1 and rush like crazy again.", "2_Subreddit": "opiates"}], "dwiilk6": [{"0_Comment Submission": "Once a trip has been made into the world of IV speedballs...", "1_Text": "To clarify, i did say nearly a half g so .3 to .4\nAnd it got to be that way the last 2 days out of the 2 weeks straight i was doing them all day everyday. I started out doing .05 coke/.2 dope shots for the whole first week with great results and it seemed like the rush would last over 15 min. But it got so crazy with having tax income on top of normal pay and it just got out of hand. When I was getting a half g and doing over half of it to get a nice long rush those last two days I realized I desperately needed a break. Spent all the money anyway haha.", "2_Subreddit": "opiates"}], "dwiiypa": [{"0_Comment Submission": "Once a trip has been made into the world of IV speedballs...", "1_Text": "By the way, a spaceball sounds fun! What would that be...? Maybe like a dope/coke/ketamine shot? Or dope/coke/dmt? Haha", "2_Subreddit": "opiates"}], "dwj92q7": [{"0_Comment Submission": "Hopefully my last shot of dope. Armed with blue dream, 90 xans, some OTC comfort meds, and a dream of a better future, I think this is the kick that sticks. I deserve better than this and I'm going after it with everything I've got. Much love to everyone reading 💖", "1_Text": "Well yeah... Of course we all deserve better. But it's not everyone's time to quit right this second and I commented on your post in which you mentioned you deserve better.", "2_Subreddit": "opiates"}], "dwkulju": [{"0_Comment Submission": "finally managed to find some blues. did one earlier at a show I played tn, about to enjoy the other right now. of course now that everyone is refilling their scrips, I’m broke till Sunday :”( hopefully I can hustle up a few bucks to buy several to last me till then.", "1_Text": "Miss the days when I could nod off of a 30 and could get them for around 20. Cheapest I ever got them was for 15 but that rarely happened. Anyway, I'm happy for you. Enjoy, my sista 💀", "2_Subreddit": "opiates"}], "dwmp7gi": [{"0_Comment Submission": "Happy Easter opiates family! Be safe and catch a fuckin nod!", "1_Text": "But dude...You deserve better!!!!!\n\n\nJust fucking with you. Anyway, I've been following your situation and I feel like that's totally the way to go. Better to be well and make a good impression when you start the new job.", "2_Subreddit": "opiates"}], "dwoelrz": [{"0_Comment Submission": "Easter colors !!! 😂 60mg Oxy in the blue, 90mg Morphine in the pink.... Happy Easter Nods my friends 🤙🏻", "1_Text": "Exit only people usually turn out to be closet-gays in my experience", "2_Subreddit": "opiates"}], "dwofef5": [{"0_Comment Submission": "Easter colors !!! 😂 60mg Oxy in the blue, 90mg Morphine in the pink.... Happy Easter Nods my friends 🤙🏻", "1_Text": "No, it is a joke. Read the sticky.", "2_Subreddit": "opiates"}], "dwq5qbq": [{"0_Comment Submission": "A gram of South East Asian #4 China White", "1_Text": "I know it's not the exact same dope but this looks extremely similar to some of the best dope I've ever had and also had extremely long legs. Wish so badly that I could get more. Enjoy yours while it's around!\n\nhttps://www.reddit.com/r/opiates/comments/79s3jd/a_gram_of_some_of_the_best_dope_i_have_ever_done/?utm_source=reddit-android", "2_Subreddit": "opiates"}], "dwrafm1": [{"0_Comment Submission": "Today’s pick up", "1_Text": "Always nice to have a nice pile of dope ON TOP of some cash leftover. Nice hustle.", "2_Subreddit": "opiates"}], "dwrbc22": [{"0_Comment Submission": "An oldie but a goodie", "1_Text": "Damn I cannot say thank you enough for posting this and reminding me about this guy. I fucking love this song along with the whole album and it's really hitting the spot right now. 💀💙", "2_Subreddit": "opiates"}], "dwrcpup": [{"0_Comment Submission": "An oldie but a goodie", "1_Text": "I really do think this song is very relative to this sub considering it's all about addiction", "2_Subreddit": "opiates"}], "dwrk3q0": [{"0_Comment Submission": "An oldie but a goodie", "1_Text": "I'm sure plenty of people here can relate to \n\n\"Heading for the corner, already running dry\"\n\nAnd\n\n\"'Cause oh, honey, I'll smoke you 'til I'm dying\"", "2_Subreddit": "opiates"}]}], "1_submissions": [{"79s3jd": [{"0_Title": "A gram of some of the best dope I have ever done. Wish I could get more", "1_Text": "Those are the exact same supplies I get from my needle exchange. Somewhere in ohio?\n\n\nEdit: Nvm i see you have tar so that wouldn't be from around here. By the way a good name for what you did is goofball haha.", "2_Subreddit": "opiates"}], "79ssio": [{"0_Title": "I always kept my dope and straws in this little jewelry box not really thinking about it but then realized it goes so well with the dragons for handles", "1_Text": "Those are the exact same supplies I get from my needle exchange. Somewhere in ohio?\n\n\nEdit: Nvm i see you have tar so that wouldn't be from around here. By the way a good name for what you did is goofball haha.", "2_Subreddit": "opiates"}], "7bq2rb": [{"0_Title": "I love that calming sound", "1_Text": "Those are the exact same supplies I get from my needle exchange. Somewhere in ohio?\n\n\nEdit: Nvm i see you have tar so that wouldn't be from around here. By the way a good name for what you did is goofball haha.", "2_Subreddit": "opiates"}], "7gksxu": [{"0_Title": "Stomach flu", "1_Text": "Those are the exact same supplies I get from my needle exchange. Somewhere in ohio?\n\n\nEdit: Nvm i see you have tar so that wouldn't be from around here. By the way a good name for what you did is goofball haha.", "2_Subreddit": "opiates"}], "7wwjgn": [{"0_Title": "Can't get syringes", "1_Text": "Those are the exact same supplies I get from my needle exchange. Somewhere in ohio?\n\n\nEdit: Nvm i see you have tar so that wouldn't be from around here. By the way a good name for what you did is goofball haha.", "2_Subreddit": "u_highinohio"}], "7yauig": [{"0_Title": "Tried IV for the first time yesterday", "1_Text": "Those are the exact same supplies I get from my needle exchange. Somewhere in ohio?\n\n\nEdit: Nvm i see you have tar so that wouldn't be from around here. By the way a good name for what you did is goofball haha.", "2_Subreddit": "u_highinohio"}], "886pw4": [{"0_Title": "Once a trip has been made into the world of IV speedballs...", "1_Text": "Those are the exact same supplies I get from my needle exchange. Somewhere in ohio?\n\n\nEdit: Nvm i see you have tar so that wouldn't be from around here. By the way a good name for what you did is goofball haha.", "2_Subreddit": "opiates"}]}]}]}