{"351mike": [{"0_comments": [{"dseu7ko": [{"0_Comment Submission": "If you could only do one drugs for the rest of your life but it was free what drug would you choose", "1_Text": "Yup pure bliss", "2_Subreddit": "opiates"}], "dseubyx": [{"0_Comment Submission": "Your opinion on possible cut, weirdest rush", "1_Text": "Could be a variety of things, nesquik, brown sugar...you just don't know, with out GCMS. Possible his stash got mixed up...I'd ask him seriously, you get to a point buying dope, where your plugs are a dime a dozen. If he is being shady, Fuck him. Tell him you got another plug if SHIT ain't right.", "2_Subreddit": "opiates"}], "dseuk9q": [{"0_Comment Submission": "Why be rude to rookies?", "1_Text": "I think,its because they haven't felt the consequence of being a dope fiend. Countless rehab, homelessness and doing dope just to do dope, even though you don't get high, cuz your on MMT. When you been through the thick of it, or been using over a decade, it gets to the point where humor is all that is left, to keep,you sane.", "2_Subreddit": "opiates"}], "dseuxng": [{"0_Comment Submission": "Why be rude to rookies?", "1_Text": "Looks like I got hit with a downvote by some still getting middled, and uses in his ma's basement, oh god damn lmao...", "2_Subreddit": "opiates"}], "dsev2yq": [{"0_Comment Submission": "Your opinion on possible cut, weirdest rush", "1_Text": "Ya, still I know it hard out their, and cold as fuck, I would try and cop with the Peurto Ricans, I lived in NY/NJ and they never did me wrong. If all I had was like 30 bucks, I'd cop from 3 different dudes off 3 different blocks, time willing. As you know that SHIT changes like the wind. Tomorrow your dude might have fire. Unfortunately this is why prohibition don't work and why I went on Methadone.", "2_Subreddit": "opiates"}], "dsevcm8": [{"0_Comment Submission": "How early can you fill a sub script from your doctor?? In new york", "1_Text": "No I mean Fuck subs, for real Fuck subs. Buy subs to sell subs to buy subs again...I say god damn", "2_Subreddit": "opiates"}], "dvxd8ku": [{"0_Comment Submission": "Just want to die", "1_Text": "Hey man I lost my really good job, my car blew up, picked up using again for the umpteenth time, all after about 2 weeks of being married to,the love of my life, a woman who has never used but gets it, and understands. You know what, people were out to get me at work, we are addicts and for normal people we are incredibly hard to keep up with sober, even though we don't realize it. Ya they might be a huge factor of losing my job, but I, ME gave them reasons wether I like it or not. I,pushed back, you know what, were good at that, all of us. Years of being taken for, we don't want it again, but I am still guilty! If I kept my mouth shut and acted as I should, I'd probably still have my good job, and they would be gone. We are good at looking for sympathy, or I had it worse than you, especially if they aren't a addict. So we act like we normally wouldn't, or disclose SHIT we shouldn't, we feed the fire! Most of the time we are the fire! Ya people play a part, but only off we let them in our circle, or into our world! Once that happens it is a wrap! I lost my job months before that, I gave away it. And I gave away my kryptonite, all unknowingly, I learned something normal people realize right away. Don't trust people we don't really know, and keep,your SHIT, your. SHIT. We complicate, procrastinate, hesitate and then deligate our SHIT on some one else! Its really crazy when,you step back and look at what your part was in almost any situation. See we know that one big thing is more obvious than 20 small things, bit those 20 small things add up,and there are more reminders to people and more ammo at the end of the day. We are strange, and especially us opiate addicts, you ever notice how much we avoid the truth?!! We are programmed that it is toxic or deadly, yet we let people I, to see how bad that we had it, its nuts, I mean what disease tells you,you don't have it and feeds your head with egomaniacal thoughts and woe as me's with no regard for anyone else.", "2_Subreddit": "opiates"}], "dvxgwdr": [{"0_Comment Submission": "https://drive.google.com/file/d/1RLx0kP4l_m4Jn6n6TRy8zr85JTtsaYIT", "1_Text": "https://drive.google.com/file/d/1x05luDqr6M8EykTPxGlzg1wje-qpyZVt/view?usp=drivesdk\n\nI don't know what I am doing clearly, ah the ability to make ones self feel small,with a 5x2 piece of technology, I see why teens our upset ! Feel like smashing stuff!", "2_Subreddit": "AmISexy"}], "dvye6x9": [{"0_Comment Submission": "Friend came over for horror movie night, I had to stay late at work, he sent me this.", "1_Text": "Is she on the rag too? Not a issue at all, he'll even if most guys don't 2want to admit it, we all have!", "2_Subreddit": "Hotwife"}], "dvz8bkm": [{"0_Comment Submission": "We did it!!! Black Limba strat style!!! Schwing!!!👊🤘👊", "1_Text": "I'm usually a cheap guitar, decent amp guy, most are squire hodge podges that look horrid but sound great, I think its you that makes the sauce, and your ax just stirs the pot. But HOT DAMN ! It pulls you in! AWESOME MAN! I hope it sounds as amazing as it looks! You could hypothetically just stand on stage with that ax and DO ABSOLUTELY nada, still pull in a huge crowd!! Check out my bastirized axs at slowhandbloose on YouTube. WOW.", "2_Subreddit": "guitarporn"}], "dvzafmf": [{"0_Comment Submission": "Found this bag at work, it's meth isn't it?", "1_Text": "Couple known ways to,deduce if its m amp based substance. Take some bleach and drop a chunk in, it should dance and fizz the go to the bottom and rest at the top like a oil slick. Obviously use a clear glass. Melt it, if you do roll the go go stick melt it and see if it puddles and recrystalize... More than likely its a prank or rock salt...", "2_Subreddit": "Stims"}], "dvzbpoo": [{"0_Comment Submission": "[DISCUSSION] What commonly given guitar advice do you find to be total bullshit?", "1_Text": "I think the craziest thing, is that we are fed bull shit to fit someone's opinion or agenda. Or some arm chair Eddie Van Halen starts a rumor from when he was a teen in 79, and the internet turns into the town crier, it makes a little bit of sense at first then turns to truth after making its rounds on forums and the like. A example of the multitude of these fairy tales is that a starving, broke musician is concerned with the magnet in his pickup or if the wood on his 200 dollar, all he could afford before his deal strat, is properly dried. Then after that, a couple huge company's realize these guys buzzing over this SHIT and proof, You have a 79 pickup, with this magical fairy SHIT spread on a A8 magnet. I am almost positive being in a similar situation, in my life, that well known guy from 79 didnt give a flying fxck about a magnet, when he is taping his pedals to a.piece of wood fer gigs and scrounging for a six pack of Shlitz and maybe, just maybe a bologna sandwich. Come on wake up world! I am still a struggling musician and if it sounds good, it sounds good! It really don't matter if it came from wherever with a special sprinkling of duh on it. I know why its this way, because very few if any of the people purchasing this overpriced crap have stood next to a stack of ungodly power, screaming with the thick testosterone of our brethren before us, \nAnd realized you ain't hearing any nuances of that pick up, your just ripping your ears up everything on 10, wondering why people say you put to much treble in your sound. You are however funding that guy from 79 and getting him his Shlitz\n\n10 years go by, you have to sleep with a fan on full blast no matter the season, cuz that tinnitus is ringing louder then the last live gig you had, hey who the hell keeps putting bass on my sound! Ya a A8 magnet, smile", "2_Subreddit": "Guitar"}], "dw019le": [{"0_Comment Submission": "What do you consider a binge?", "1_Text": "For me, anything past 2 days pushin' 3 is to much, a waste of my precious and induced paranoid delusions from my PTSD. Plus I have bruxism super bad on miss tsizzle, so by day 3 at the most, my mouth is destroyed and sore from chewing my tongue; no amount of gum helps. So I keep it on the DL buzz around like a bee,have my fun then end it when my body tells me. Its not like I haven't went the distance, oh believe me I have! I just get tired of waking up in my truck bed in the woods,on day 7, because my landing gear wasn't working so I kept taking umm because you know its been like 20 mins(ah no dude more like 2 mins) and that FUCKING guy is behind me again,I wrote down his license plate and it matches with my blurred vision scribble scrabble, and definitely shouldn't be operating heavy machinery, that word beyond tweaked, sweating its 50 degrees out in fall, in the Midwest, wake up frozen in a tee shirt and shorts, god DAMN what happened to me, thank god and the Grecian gods of dope I am alive, not in jail, responsive even though slightly hypothermic, never never again, oh look a deer! Got some definite explaining to do to the wife stupid stupid me type SHIT. Ya know?!", "2_Subreddit": "Stims"}], "dw01x30": [{"0_Comment Submission": "We did it!!! Black Limba strat style!!! Schwing!!!👊🤘👊", "1_Text": "Yup, sorry! I was just taken back by that ax! You ever consider making custom guitars? Obviously you like to do it,and you have a eye which most company's design teams fall flat on, so they re has hit, over and over. Great job and you have a he'll of a talent!\n\nhttps://m.youtube.com/user/weed2man", "2_Subreddit": "guitarporn"}], "dw028sr": [{"0_Comment Submission": "We did it!!! Black Limba strat style!!! Schwing!!!👊🤘👊", "1_Text": "Oh here is something I would say is modern esque, off the cuff though, but still viable even with my screw ups. I just honestly don't really like flash playing, as I call it, but its what \"sells\" for non musicians and players too. I rather bend a note for a whole bar descend into a beautiful A aeolian lick on the neck pickup of a strat...\nhttps://m.youtube.com/watch?v=4tMERZmQV5s", "2_Subreddit": "guitarporn"}], "dw03osb": [{"0_Comment Submission": "We did it!!! Black Limba strat style!!! Schwing!!!👊🤘👊", "1_Text": "Oh ADD how i love it, one last thing great axes man!  you are a talented individual with serious taste and uniqueness in a industry that puts out the same stuff over and over! I would love to inquire about a possible instrument being made, if that is cool(ryanmusic71@yahoo.com). Here I am thinking this ax was a one off made in a basement; Pays to look at someone's page first! My stuff don't hold a candle to your beautiful guitars! That paisley HSS strat OMG! Take a look at this, I made a SHS strat out of a GWL(Washburn) neck and a squier body, who woulda thunk it would sound half way decent! \nhttps://youtu.be/O8J3TV4DK3A", "2_Subreddit": "guitarporn"}], "dw0borb": [{"0_Comment Submission": "We did it!!! Black Limba strat style!!! Schwing!!!👊🤘👊", "1_Text": "I love the down votes, don't get it,  but howdy howdy hey!", "2_Subreddit": "guitarporn"}], "dw0ewog": [{"0_Comment Submission": "How long you been in the game.", "1_Text": "I started sniffing at 14-15ish, my sister was 20 or so at the time with her older boyfriend. I was puffin herb at the time regularly had other experiences too, she said \"try this\" her BF was telling she and I \" Don't you dare, Don't do it dude etc.\" He obviously seen my drug use with herb etc was a issue, smart man. Needless to say, I railed a gagger and was off to the races. First hard drug experience, I can still see all the details, the whole room, the cig smog the dimmed lights and a movie playing on the TV, Their they sat at the table playing cards with owl eyes and clenched jaws. 15 years later, still dealing with my demons, playing that card game with the devil, bigger monkeys on my back and still hear my sister laughing, as that powder hit my nose, I coughed and hacked, and felt something I will never feel again", "2_Subreddit": "cocaine"}], "dw0itoq": [{"0_Comment Submission": "[Discussion] When on the edge of giving up, what did you do?", "1_Text": "For me when I am like that I make it more challenging. Strange right?! Say I am at a jam or at a studio session and pretty much whenever I play, I only allow myself to play a certain mode, and only say 4 notes of a scale, bending is allowed. For me its a challenge, a bet on myself and it takes away the monotony, the money situation all ax wielders deal with. Also when that engineer is asking you to \"do it his way\", on a radio jingle, that didn't even cover your gas to,get out their, you can get one over on them cuz music is your love! I find it hard too for financial reasons, you don't get paid what you should anymore, so I contemplate getting a full-time job instead of part-time and playing out/union gigs. Then I stop beating myself up and remember how much I love music. How much it has given me and how when all else fails; like Mr. Hendrix said \"That's all right, I still Got my guitar!!\"....", "2_Subreddit": "Guitar"}], "dw0jd93": [{"0_Comment Submission": "[QUESTION] Hitting a wall with my playing. Want to sound like this guy (link in post). Any suggestions?", "1_Text": "This guy above! Modes, relatives and theory will get you their. People would tell me you will lose your \"style\" and sound robotic, nope! At a jam or playing out my ear is first, if the guy/gal is doing a simple 1 4 5 etc.  Say with pentatonic runs in the key  the jam is in, not playing its realitives or comping, ill fall back", "2_Subreddit": "Guitar"}], "dw0qy3o": [{"0_Comment Submission": "[DISCUSSION]What are your favorite lead and rhythm tones?", "1_Text": "Michael Bloomfield everything, Clapton on Beano and early Cream stuff. Lots of Steely Dan studio dudes Skunk Baxter, Larry Carlton his phrasing, tone and knowledge of the fret board. King Crimson and Fripp never getting the clout they deserve legendary early fuzz tones Terry Kath everything, he had a huge handle on tone and played with very little gain and the best wah tone you will ever hear James Marshall I mean vibrato tone and his ability to make women cream with his guitar and on stage prowess Paul Kossof his rythym chord choice and vibrato that was to,never be played like that again Jerry Cantrell a real rock,n roller and brought the riff back into the spotlight his G and L and a JB c'mon shows what you really need; PRACTICE of course as a avid fan of music their is a list a mile long, Of course Page,Beck on superstious a ton more Neil Young", "2_Subreddit": "Guitar"}], "dw2g8th": [{"0_Comment Submission": "Question on effects of adulterant", "1_Text": "Baby powder has talc, talc is noxious to the lungs, and your cilia. Iving it isnt a good idea, I know it can cause Talcosis in your veins and i know a guy I was in treatment with who got endocarditis from SHIT cut dope...your guy obviously hasn't been in the biz awhile, cuz their are better options than baby powder, way better, or tell him not to slice it, that's the safest bet for everyone.", "2_Subreddit": "heroin"}], "dw2hwak": [{"0_Comment Submission": "Why are so many people posting “fake or not” photos of pills. There is no way anyone can be 100 percent sure based on sight alone what is in your pill. It’s flooding this sub and turning people away who actually need harm reduction. Please stop.", "1_Text": "Agreed, or is my dope cut with fent? and its bright purple, c mon. If you have to question something, it usually is. I heard it tons of times in the auto industry, is this a good car?!! If it is sketchy and don't seem right go with your gut. An we all purchase on the illegitimate market so there are no standards, just experience. I think that's what these people who ask, are lacking in. I have to much time invested in killing myself and my soul, so I know. I know the taste of good smack, when it hits the back of my throat. I know what it looks like and that slight golden hue, unique bitter taste in powder form. I know how tar has that grayish red hue and unique vinegar smell. All gained by destroying my life and hurting my family. I think those who take pills have that same knowledge, and experience, with size and look.", "2_Subreddit": "opiates"}], "dwk3iv5": [{"0_Comment Submission": "When will we learn from our neighbors to the North.", "1_Text": "I like how at least in my state they hold the peak and trough metabolism bull SHIT over all of my fellow Methadonians heads. I am at 105mg and have a long history of use, medically documented as well. In order for me to go up one milligram more, I have to,have a peak and trough. Why?!! Its not at a point of question, why must their be hurdles and if you don't?! Why not raise my dose then do said blood work. The EKG I totally get, however every medical journal says not to hold a stupid peak and trough over a individuals head, I'm avoiding it and yet I need to because I'm still craving fiercely. I have been pretty much clean maybe 1 screw up in the 4 months I been on track, I am white knuckling it for bull shit, plus I got to go their and play Fuck Fuck games Abdul any one knows the bull SHIT at a MMT location. Go in their at 7 take my blood, wait 2-4 hrs THEIR after I dose. Take my blood again WTF?!! Then schedule a doctors appt, get my EKG and after all those hoops finally? I see why now after all my time in and out of these hell holes why their is a issue, \"You be a good little boy/girl show me how high you will jump, then I want you to jump higher, and if you screw up, I swear if you screw up, or fart wrong its the big buh bye, don't pass go...", "2_Subreddit": "Methadone"}], "dwl17p0": [{"0_Comment Submission": "BOLO NORTHEASTERN OHIO", "1_Text": "He had shot it, I enduced vomiting as what seemed to be upper esphogal fluid building, and just as a precautionary step if he consumed other than what was around. Say he consumed a Benzo or what have u or any other pill, His heart rate was fine, but his breathing was extremely shallow and he had the \"gargles\". Plus when he came through from supplying him with oxygen and resuscitating him, he said \"puke!\" In a moaned incoherent state. Acting fast is important and it had to come up, rather than him pulling a \"John Bonham\" I had him sit a drink H20 till he vomited. Again I am not a doctor by any means, however thanks to the DOD I have medical training. A smart man once said \"Of all the things not to do, doing nothing is the same\".", "2_Subreddit": "opiates"}]}], "1_submissions": [{"72qjss": [{"0_Title": "Plagued by the power, of a crystal tower", "1_Text": "Yup pure bliss", "2_Subreddit": "Stims"}], "740dt8": [{"0_Title": "My Wake up trying to stay away from Meth with fire H. Tested at 60 percent, straight diacetylmorphine. I hate fent. It don't do it for me.", "1_Text": "Yup pure bliss", "2_Subreddit": "opiates"}], "74956v": [{"0_Title": "Feeling terrible about my recent usage...", "1_Text": "Yup pure bliss", "2_Subreddit": "opiates"}], "79qinz": [{"0_Title": "Thought this fit here...", "1_Text": "Yup pure bliss", "2_Subreddit": "WNOD"}], "7ak70i": [{"0_Title": "Why I DESPISE Fentanyl!", "1_Text": "Yup pure bliss", "2_Subreddit": "opiates"}], "7mggx4": [{"0_Title": "Chinese Rocks", "1_Text": "Yup pure bliss", "2_Subreddit": "WNOD"}], "7mgj77": [{"0_Title": "Hey Opiophiles out of Jail on Methadone...", "1_Text": "Yup pure bliss", "2_Subreddit": "opiates"}], "7mhccp": [{"0_Title": "The Bullet Borrowed and Pain", "1_Text": "Yup pure bliss", "2_Subreddit": "opiates"}], "85hdl1": [{"0_Title": "https://drive.google.com/file/d/1RLx0kP4l_m4Jn6n6TRy8zr85JTtsaYIT", "1_Text": "Yup pure bliss", "2_Subreddit": "AmISexy"}], "865uhi": [{"0_Title": "26 (M) I know I am ugly, can you help? Just got off work and I am tired.", "1_Text": "Yup pure bliss", "2_Subreddit": "amiugly"}], "8661lx": [{"0_Title": "26 (M) Where do I stand?", "1_Text": "Yup pure bliss", "2_Subreddit": "Rateme"}], "88iww8": [{"0_Title": "BOLO NORTHEASTERN OHIO", "1_Text": "Yup pure bliss", "2_Subreddit": "opiates"}]}]}]}