{"pinkfresh80": [{"0_comments": [{"dwhh0tx": [{"0_Comment Submission": "I'm Eric Hafner, a socialist Democrat running for U.S. Congress in Portland, Oregon. I want to legalize all drugs.", "1_Text": "> registered Democrat\n\nThere's your problem.", "2_Subreddit": "Drugs"}], "dwhn812": [{"0_Comment Submission": "5g MDMA for £25 realistic?", "1_Text": "Not necessarily. It seems to mostly be people misunderstanding the chemistry and thinking that MDMA can only be 100% pure. Most listings on the DNMs have 84% in the title.", "2_Subreddit": "MDMA"}], "dwhnggn": [{"0_Comment Submission": "Is this E/mdma? Any help appreciated.", "1_Text": "There is literally no way to tell by looking at it. Your options are:\n\n1. Eat it and find out. Pros: Free! Cons: Could be something that will kill you or seriously harm you.\n2. Use a test kit. Pros: You definitely won't die. Cons: It costs money and will take a few days to get to you.\n\nI'd go with option 2, but that's just me.", "2_Subreddit": "MDMA"}], "dwi4msu": [{"0_Comment Submission": "Does this look safe to use", "1_Text": "Hold on a sec lemme just put my chemical goggles on so I can see what's inside the pill real quick", "2_Subreddit": "MDMA"}], "dwi4rym": [{"0_Comment Submission": "Wait time.", "1_Text": "It'll be fine, your tolerance will be completely gone.", "2_Subreddit": "MDMA"}], "dwibcci": [{"0_Comment Submission": "Irish Drug Scene", "1_Text": "Nice post man. I'm actually surprised at how popular ordering off the darknet has become here. The amount of lads I bump into in clubs with bags full of really good euro pills off the DN is mad. It even made it into the new kneecap music video lol", "2_Subreddit": "Drugs"}], "dwizxzw": [{"0_Comment Submission": "MDMA trip", "1_Text": "The liquorice smell is actually a good sign, it's what MDMA is supposed to smell like.", "2_Subreddit": "MDMA"}], "dwjqhac": [{"0_Comment Submission": "Impure MDMA story", "1_Text": "I very much doubt that it was Ketamine. The dosage needed to give you those effects would have to be quite high, and it would have worn off in under an hour. K also doesn't really have a \"comedown\" and certainly wouldn't leave you feeling like you did after a week. I know this is anecdotal but evey every time I've ever done K I actually feel pretty great the day after. Well rested and slight mood boost.", "2_Subreddit": "MDMA"}], "dwjqr4i": [{"0_Comment Submission": "Going to the beach for my spring break with some friends and we each have 2 pills about 125mg. My first time doing m. Is it good to drink and smoke on m? And should we take both pills or take one and save the other for a redose?", "1_Text": "Alcohol and MDMA act against each other. Upper vs downer. Its unsafe and increases the neurotoxicity of MDMA, but most of all its just completely pointless. You'll be good if you have 1 or 2 drinks before MDMA but thats about it. Smoking is fine tho, since nicotine is just a light stimulant. People say smoking while rolling feels pretty great.", "2_Subreddit": "MDMA"}], "dwjt7e7": [{"0_Comment Submission": "Going to the beach for my spring break with some friends and we each have 2 pills about 125mg. My first time doing m. Is it good to drink and smoke on m? And should we take both pills or take one and save the other for a redose?", "1_Text": "Oh sorry, assumed you meant tobacco. Again, THC would probably just counteract the effects of MDMA to some extent. I'd keep it for right after you roll to ease the comedown.", "2_Subreddit": "MDMA"}], "dwk8n6h": [{"0_Comment Submission": "Black Molly with glitter? Are these legit?", "1_Text": "Don't think it's the same thing but reminded me of this lol https://katy.love/", "2_Subreddit": "MDMA"}], "dwkww2g": [{"0_Comment Submission": "Black Molly with glitter? Are these legit?", "1_Text": "No, it's a complete placebo. AVI made a video about it where he tested it very fairly, gave it multiple tries etc and felt absolutely nothing. Can't find the video on his channel anymore though", "2_Subreddit": "MDMA"}], "dwkwza5": [{"0_Comment Submission": "🤔🤔🤔", "1_Text": "What accent does this NOT rhyme for? I pronounce daft and half exactly the same.", "2_Subreddit": "MDMA"}], "dwkxbk3": [{"0_Comment Submission": "Have You Ever Taken A Psychedelic? If So, Please Take 5 Minutes To Fill Out Our Survey, So Science Can Benefit From Your Experience", "1_Text": "Just so you know, Ireland isn't listed as a country you can be born in. If you're looking for my response I live in the DPRK.", "2_Subreddit": "MDMA"}], "dwkxg61": [{"0_Comment Submission": "anyone ever try mdma in this brown black color?", "1_Text": "That doesn't make any sense. If it's \"not always\" an indication of quality, then it's NOT an indication of quality.", "2_Subreddit": "MDMA"}], "dwkyb2q": [{"0_Comment Submission": "🤔🤔🤔", "1_Text": "But you pronounce \"half\" like \"hawlf\"? Cause if you don't then it should rhyme...", "2_Subreddit": "MDMA"}], "dwkz0vp": [{"0_Comment Submission": "🤔🤔🤔", "1_Text": "It literally has nothing to do with the spelling though. It's about pronunciation. The L in half is silent and doesn't affect its pronunciation. In this case the rhyme relies on the central sound in the two words, the af sound, i.e hALF, dAFt. The first and last consonants don't matter. These aren't perfect rhymes but are still rhymes nonetheless. Listen to any rap song and basically every rhyme is like this.", "2_Subreddit": "MDMA"}], "dwkztnh": [{"0_Comment Submission": "🤔🤔🤔", "1_Text": "Spelling can be based off of pronunciation and pronunciation can be based off spelling. It's inconsistent and doesn't match up a lot of the time. Some northern English accents pronounce \"bath\" like \"baff\", which would make it rhyme with \"half\", \"calf\" etc in certain contexts. Spelling doesn't matter. \n\nAnd yeah if you over pronounce the T in \"daft\" it's going to make the vowel sound shorter. Most people aren't doing that though. Go on YouTube and look up any video of a rap song's rhyme scheme. [Here](https://youtu.be/OFBZbFGHSa8) is an example. Notice how most of the words rhyme based off their central vowel sound, not the final consonant or anything else. The rhyme in the OP is in the same vain as that. It's two words with essentially the same vowel sound used to convey a point. This isn't high class poetry, it's a slogan about taking ecstasy pills. And it does rhyme.", "2_Subreddit": "MDMA"}], "dwl0azk": [{"0_Comment Submission": "🤔🤔🤔", "1_Text": "Mate you've just completely ignored the bulk of my last point. You're being an annoying pedant for no reason. I'll repeat one last time: There are multiple types of rhymes. These aren't perfect rhymes. What's important here is the VOWEL sound. You can ignore the T because the rhyme is based on the VOWEL, the same as the vast majority of rhymes in rap songs or any song for that matter. If you still can't grasp this ask an English teacher or something, I learned this shit when I was about 13.", "2_Subreddit": "MDMA"}], "dwl0j50": [{"0_Comment Submission": "🤔🤔🤔", "1_Text": "And you've ignored my point yet again. How many more times do you want me to repeat the word vowel before you understand what I mean?", "2_Subreddit": "MDMA"}], "dwl15e3": [{"0_Comment Submission": "🤔🤔🤔", "1_Text": "I've given you clear information that demonstrates otherwise. You haven't refuted it or presented anything other than continuously restating your point. You've just chosen to ignore it. I don't see any point in continuing this if you have no interest in engaging in good faith.", "2_Subreddit": "MDMA"}], "dwl1l9h": [{"0_Comment Submission": "It’s been a month and a week", "1_Text": "You mixing the two or keeping the K for after the roll?", "2_Subreddit": "MDMA"}], "dwu35z5": [{"0_Comment Submission": "Codeine Phosphate", "1_Text": "Codeine phosphate is just codeine thats not potentiated by anything else. Im not sure of doses for prometh+codeine but if you're used to taking that then you'll need to up your dose. Codeine has a ceiling dose of about 400mg (as in anything over that won't make a difference). When I used codeine I stuck between 250-300mg.", "2_Subreddit": "opiates"}], "dww9vwn": [{"0_Comment Submission": "Losing the magic and comedowns (question)", "1_Text": "People on here like to act as though answers to these kinds of questions are black and white, but the truth is that there's a hell of  lot we don't know about MDMA and especially it's long term effects. We (as in the people that use MDMA recreationally) are the guinea pigs for future generations, and it's likely that it will be that way for a long time. MAPS is doing some fantastic work but as long as MDMA remains illegal, we're not going to be able to understand it as much as we would like to.\n\nWith the very limited knowledge that we have at the moment, it seems like your usage habits aren't the best. You use more frequently than is currently recommended and use a higher than average dosage. From what you've said though, it doesn't seem like this is having much of a negative effect on you. And who knows, maybe it never will have a negative effect on you. We can only base our guidelines off the anecdotal experiences of other recreational users. All these rules that we talk about on here are solely based off of lots of users talking to each other and comparing experiences. If your experience doesn't match up with that, your kind of on your own. It's up to you what you decide to do from here. You know the risks, I assume based off of reading or hearing the accounts of others. We can't tell you what may or may not happen to you in the future. You decide now if you want to discover what this beautiful, magical, world changing substance has in store for you.", "2_Subreddit": "MDMA"}], "dwwa8qd": [{"0_Comment Submission": "What do good quality presses have in them besides MDMA?", "1_Text": "Depends on your definition of good quality. In terms of psychoactive chemicals, there should only be MDMA. I personally wouldn't mind pills that contained caffeine, and a lot of old school pills contained some MDA, but I wouldn't consider those to be MDMA pills so they arent good quality to me and I would avoid them if possible.", "2_Subreddit": "MDMA"}]}], "1_submissions": [{"7lwvm4": [{"0_Title": "Just what the doctor ordered", "1_Text": "> registered Democrat\n\nThere's your problem.", "2_Subreddit": "MDMA"}], "7nc0zl": [{"0_Title": "Rolling in McDonalds", "1_Text": "> registered Democrat\n\nThere's your problem.", "2_Subreddit": "MDMA"}], "7ptgmm": [{"0_Title": "Effervescent codeine CWE experiment", "1_Text": "> registered Democrat\n\nThere's your problem.", "2_Subreddit": "opiates"}], "7s58jg": [{"0_Title": "Longest come up?", "1_Text": "> registered Democrat\n\nThere's your problem.", "2_Subreddit": "MDMA"}], "7vmp7j": [{"0_Title": "Purple 2-CB Presses", "1_Text": "> registered Democrat\n\nThere's your problem.", "2_Subreddit": "2cb"}], "7wdyct": [{"0_Title": "LSD Storage", "1_Text": "> registered Democrat\n\nThere's your problem.", "2_Subreddit": "LSD"}], "84xtcf": [{"0_Title": "Irish MDMA Spoken Word", "1_Text": "> registered Democrat\n\nThere's your problem.", "2_Subreddit": "MDMA"}], "877wae": [{"0_Title": "Ready for the weekend :P", "1_Text": "> registered Democrat\n\nThere's your problem.", "2_Subreddit": "MDMA"}]}]}]}