{"habscucc": [{"0_comments": [{"dsd9lz4": [{"0_Comment Submission": "Need to find the will power", "1_Text": "Ive been i. Your shoes! Best way to do it is take really small amounts of sub and keep doing dope for two days  until sub builds up! Then you dont have to wait at all and wont get sick! Best of luck . This way works i promise", "2_Subreddit": "opiates"}], "dsewiun": [{"0_Comment Submission": "I can’t make it to 24hrs so I can start Suboxone ;(", "1_Text": "Most people o  here will agree to disagree with me. What I am going to share with you is from experience and in no way meant as advice fir yourself as everyone is different.  Different DOC, different ROA, different tolerance etc.  As experience with burp dates back 6 years.  6 years ago when I discovered burp I was a heavy pill user vics/percs/ oxys/opanas, anything really I could get my hands on.  Flipping to burp  was a piece of cake and I axtually perfered burp over pills due to its long half life.  They say that the half life of burp is 72 hours whixh means that it takes 72 hours for half of a dose to leave your system.  I was exclusively on burp for the next 4 years.  After relocating 1 year ago to a different state I was not able to get into a doctor to continue my maintence program.  In addition the prescription pain killer laws changed, they tightened up and they were not readily available like they used to be.  That combined with not having the same click forced me to explore other options until I was able to get my burp.  Not knowing what I know today got me in trouble as it does everyone.  I began to dabble with the devil.   Not fully understanding burp and respecting its properties I figured onxe I found it I could do as I always did, flip right back to it.  WRONG! The first time I attempted to take it I didn't wait; I didnt think I needed to since I never had to before.  I went into percipitated withdrawl,  I didnt know there was such thing until I searched to fond out what was going on..  If you don't understand why that happens please research it to better understand why it occurs.  Also please be careful to only take away correct information.  Anyhow,  I attempted to get cleaned up atleast 5 more times all going into P/W, which including abstaining beyond 24 hrs.  After hours of research and a better understanding for burp I came across something called the Bermese Method.  Most people will judhe against it but from personal experience it absolutely work with minimal to no withdrawl.  If you abuse it I believe you can do more harm then good, so please tred lightly.   Also once you find it please taylor it for your own habit and tolerance.   What worked for me was day one I woke up took .25 mg of a strip and immediately started the day with my normal amount of gear.  That night I took another. 25mg id a strip again followed by my normal amount of gear.  Tbe second day I doubled everything.  .5mg twice a day and doubled my gear all day.  Day 3 I cut my gear in half of what I did on day 1 and kept my burp dose at .5mg still twice a day.  Day 4 I again cut my gear in half and bumped up to 1mg of burp twice aday.  Day 5 I did no gear and foubd mt correct maintenance dose of burp at 2mg of burp twice a day and have not looked back.  Please understand that worked for me and may not work foe you.  Through my journey I also learned that for the first 4 days when I took my burp I had to do gear within 10 mins after doing the burp.  Also burp is very strong and just cause your prescribed X amount tbat does not mean that is a correct maintence dose.  Burp is over prescribed and the saying less is more is absolutely true.  I am sure the critics will blast this post but at the end of the day I will sleep just fine and since I am a betting man I am sure you will to.  Good luck and please do your own research....", "2_Subreddit": "heroinaddiction"}], "dslkwfk": [{"0_Comment Submission": "Ever want to murder your dboy?", "1_Text": "Yes! Mine is same way! I motherfuck him the whole time im waiting but yet come back every time lol! Ugh the  vicious cycle!", "2_Subreddit": "opiates"}], "dslnlms": [{"0_Comment Submission": "Posted this in r/OpiatesRecovery, but I thought that it was worth posting here, too.", "1_Text": "I feel the same way! And the depression i have because of it is unbearable at times. I feel as tho i buried the love of my life...", "2_Subreddit": "opiates"}], "dtdw57z": [{"0_Comment Submission": "I really need advice", "1_Text": "Hi! Like a lot of these wonderful and intelligent family members here, i too have been a long time lurker, however this post hit home for me and I felt inclined to post. First some background... ive been using opiates for well over 10 years... first pills then heroin. I did have several successful years on only suboxone before i, like so many, went down the rabbit hole and popped up with  a heavy heroin habit. I tried  several times to clean up and switch to suboxone. Just as you, i kept telling myself  and my husband how i am only addicted because of the physical withdrawls, and was no way mentally addicted! I truly beleived this and told my husband this so many times. Promising him this would change our lives and id be kicking myself for not changing sooner \"if i could just just through the physical withdrawls, i can stop so easily .\"  So i used the Burmese Method and slowly switched to subs with little discomort! However this only lasted a week because i could not get through the mental addicition i was  torturing myself (and everyone around me) with! I could not beleive it!  I was so depressed, suicidal most times of the thr day.  Every minute i thought about going to get dope,the hustle, the drive to go get it, the anticipation of waiting for my boy to come outside , and of course doing it! I had no enjoyment of anything anymore and i didnt look forward to anything without dope.  I missed waking up at 4:00 am tooting my dope, laying next to my husband while everyone is still sleeping, binge watching Mr. Robot, or playing on my phone. I was so bored and so lonely and didnt see why i should even live if i couldnt have dope. Just coming to the realizations i was mentally addicted made me even more depressed. I felt pathetic for not being able to just \"get over it.\" I felt like a pussy.   Sorry for such a lengthy response, however, my point is simply dont underestimate how powerful your mind is and have a plan ahead of time for how you could manage your addiction mentally, even if you think you arent mentally addicted. Do you have a good support system of friends and family? Do you have some hobbies? Those two things are truly important in remaining clean. I can assure you heroin has a funny way of tricking you into beleiving that. Its best to assume that its a possibility you are! Im truly trying to be helpful and not a dick about this! And congratulations on going to university and even wanting to stop your use. Those two things are huge and you should be so proud of yourself!!!", "2_Subreddit": "opiates"}], "dtil8kv": [{"0_Comment Submission": "Shooting dope mixed with bupe", "1_Text": "Karmas a bitch and she always shows up! Maybe let \"S\" know this as well... and that plan is a terrible one as dope cures precipitated withdrawl!", "2_Subreddit": "opiates"}], "dv3efu0": [{"0_Comment Submission": "Any recovering addicts out there on long term suboxone treatment, get really bad headaches/feel like shit when you wake up?", "1_Text": "I had similar issues with suboxone and had to ask for subutext due to the migraines! Maybe ask your doctor for subutext instead! Good luck!", "2_Subreddit": "opiates"}], "dv5p6xe": [{"0_Comment Submission": "Spicy taste.", "1_Text": "Yes! Just had this happen last night actually! I really thought someone used spic to cut it or something... wild!", "2_Subreddit": "opiates"}], "dv628nu": [{"0_Comment Submission": "Spicy taste.", "1_Text": "We don't get stamps here they are just wrapped in paper, receipts or whatever is available i guess", "2_Subreddit": "opiates"}], "dv9901k": [{"0_Comment Submission": "Goodbye", "1_Text": "Please rethink this decision! Know you are loved and so many care for you! I get like this a lot too and honestly have thought the same exact thing you have many times,but know there is another option! There are so many resources to get help if you want to get clean, and if your not ready yet thats ok too! Just know you are loved and many of us have been exactly where you are right now. You are not alone although it may seem like it! I know im just am internet stranger but im here to talk if you want to pm me anytime!🖤", "2_Subreddit": "opiates"}], "dvq4lkq": [{"0_Comment Submission": "It's my CAKEDAY.", "1_Text": "I love this so much! Happy cake day!🖤", "2_Subreddit": "opiates"}], "dvrxvil": [{"0_Comment Submission": "My 2 favorite hobbies, shitting and smoking blues", "1_Text": "The famous pre-hit shit..  A MUST", "2_Subreddit": "opiates"}], "dvszvuo": [{"0_Comment Submission": "Is anyone interested in a psychedelic trip report I wrote some time ago?", "1_Text": "Please post!! Also, what is a dirty Biccys?", "2_Subreddit": "opiates"}], "dvzi7lp": [{"0_Comment Submission": "Last sack before I quit boys", "1_Text": "Congratulations on baby boy! Good luck with your detox!", "2_Subreddit": "opiates"}], "dw3sju0": [{"0_Comment Submission": "Twitter’s chief information security officer is leaving the company, following departures of execs in similar roles at Facebook and Google", "1_Text": "uu  4tvhbi5 gty u6665zzfschyte", "2_Subreddit": "news"}], "dwi95h7": [{"0_Comment Submission": "Subs anyone", "1_Text": "Having such a hard time transitioning from h to subs currently! It was so much easier from pills to subs..... 😣", "2_Subreddit": "opiates"}], "dwrnw4n": [{"0_Comment Submission": "Waiting", "1_Text": "I ove this idea and i need this app too!!", "2_Subreddit": "opiates"}], "dwt4rw1": [{"0_Comment Submission": "Subs", "1_Text": "This is incorrect.... subutext doesn't have naloxone, however, the buprenorhine is the blocker and can/will cause precipitated withdrawls just as suboxone would if you take it too soon after an opiate.", "2_Subreddit": "opiates"}]}], "1_submissions": [{}]}]}