{"nappynappy99": [{"0_comments": [{"drzjroq": [{"0_Comment Submission": "Can we all be adults here please?", "1_Text": "Ohh poor you!! Are u serious? Quit ur whining/crying/complaining bullshit. Stop being a mod if it’s soooo hard for you to do. Nobody cares about ur soft ass problems with this sub and how u have to devote so much of ur time to “drama”. \nIn the same message u say  the mods can do “very little” and also so u had to “devote a ton of time to drama” \nUr the worst, u just like to complain and whine about things huh? Ur a giant cry baby", "2_Subreddit": "opiates"}], "drzvkji": [{"0_Comment Submission": "Can we all be adults here please?", "1_Text": "Dude, I didn’t know this was an essay to be examined dude. Also dude I didn’t know the grammar nazi fashionably fake was here to comb through it. What if I only have a 70 iq? Does that make u better than me? Ok dude, dude dude", "2_Subreddit": "opiates"}], "dwnlxds": [{"0_Comment Submission": "Easter colors !!! 😂 60mg Oxy in the blue, 90mg Morphine in the pink.... Happy Easter Nods my friends 🤙🏻", "1_Text": "Jesus bro, on a post where someone was just trying to just show us his nice little stash you somehow made it all about you. You said you're \"so jelly\" but then when on to brag that you have multiple OPs, 15k in cash, an unlimited roxy connect, 80 subs, 100 C-pins and already have a friend coming to get you  and to get some soft to party.\n\nWhy would you be \"so jelly\" if you had so much money and so many connects? Why would you tear the house apart if you have all this money and connects and tons of drugs? \n\nYou're a clown man, you have none of that and you are completely full of shit. Get the fuck out of here with your bullshit", "2_Subreddit": "opiates"}], "dwnrhwm": [{"0_Comment Submission": "Easter colors !!! 😂 60mg Oxy in the blue, 90mg Morphine in the pink.... Happy Easter Nods my friends 🤙🏻", "1_Text": "Haha yea you took the posts down because you know it’s complete fabrication, a fairy tail, a myth, a total falsehood... In an attempt to appear cool and enviable you failed miserably because I sniffed your hogwash from a mile away.\n\nThanks for the pictures you lifted from google I’m not sure what the point of those were. Also, nah I don’t need to see a picture of the girl who burned you like a fool, and no I don’t want to see a picture of a random girl you got from google.", "2_Subreddit": "opiates"}]}], "1_submissions": [{}]}]}