{"jessepinkmna": [{"0_comments": [{"dtyw4b0": [{"0_Comment Submission": "i buy pills from this crazy black lady.. she always text me little things like this", "1_Text": "Working at Walmart isn’t enough to pay the bills", "2_Subreddit": "opiates"}], "dtzdi0y": [{"0_Comment Submission": "Opioid Side Effects?", "1_Text": "Why would you tell someone to mix opiates and benzos? That’s a recipe for death", "2_Subreddit": "Drugs"}], "dtzl05t": [{"0_Comment Submission": "Opioid Side Effects?", "1_Text": "There’s no point of mixing them unless you’re an addict.", "2_Subreddit": "Drugs"}], "du0xvge": [{"0_Comment Submission": "How does Kratom actually compare to opiates?", "1_Text": "As an opioid addict that has tried to use kratom to fight off withdrawals I can tell you they are not really the same. It’s really not comparable to oxycodone at all, I have no clue why it’s a thing going around here. My oxycodone tolerance must be so high that kratom has really no effect on me. It only dulls my brain for a bit, which is different from opiates that send your brain a rush of euphoria. \n\nFor someone that’s an opioid naive, kratom can be nice. It does not produce the unique effects of oxycodone like many people think, but hey. Give it a try. It’s not going to ruin your life like opioids do 🤷🏻‍♀️", "2_Subreddit": "Drugs"}], "du1id3a": [{"0_Comment Submission": "I just don't understand all the people who use benzos with their opiates", "1_Text": "There was some kid in r/drugs recommending another kid to mix both benzos and opiates, and to do it with very low doses. \n\nI told him theres no point of mixing them because opiates can give you the nods by itself. There’s no point of mixing them if you’re an opiate naive.", "2_Subreddit": "opiates"}], "du2erc2": [{"0_Comment Submission": "Best drugs for social anxiety and to be more social?", "1_Text": "Heroin. Social anxiety will be the least of your problems.", "2_Subreddit": "Drugs"}], "du54s3c": [{"0_Comment Submission": "Dealing With Dboys as a Female", "1_Text": "That happens so me too. There was one time I felt so lucky to find an oxy dealer but all he did was bring up sex. It got so uncomfortable that I had to stop buying from him. I’m traumatized so when guys try bringing up sex with me I’m done. I can’t deal with that sort of shit. \n\nMy dealer right now is actually a girl. She’s gay but she doesn’t try hitting on her customers or anything I’m so glad I have her in my life lol. She can be a difficult person sometimes but it’s better than dealing with a man honestly", "2_Subreddit": "opiates"}], "du8mt8h": [{"0_Comment Submission": "What do you do when you're high ?", "1_Text": "Not to be a weirdo but I listen to asmr. Nodding out while having your brain tingling is such an orgasmic feeling lol", "2_Subreddit": "opiates"}], "du8puk2": [{"0_Comment Submission": "am i alone?", "1_Text": "The main thing I look for in a drug is euphoria. Weed does not give you any of that. So no, you you’re not alone. Not everybody likes weed", "2_Subreddit": "opiates"}], "du8qxln": [{"0_Comment Submission": "am i alone?", "1_Text": "Only opiates. I’ve done a shitload of drugs in past.  I live in a town ridden by meth so I’ve tried almost every upper there is and I cannot stand them. If I’m high I want to be relaxed and euphoric. But I don’t alcohol or benzos because why do them if I can do opiates instead you know?", "2_Subreddit": "opiates"}], "du8ryvm": [{"0_Comment Submission": "am i alone?", "1_Text": "Opioids are downers.", "2_Subreddit": "opiates"}], "du8s1gw": [{"0_Comment Submission": "am i alone?", "1_Text": "Exactly.", "2_Subreddit": "opiates"}], "du9vh4n": [{"0_Comment Submission": "I had to quit Walmart to go to rehab. Is there any way I could get rehired again.", "1_Text": "*she", "2_Subreddit": "walmart"}], "du9zfuh": [{"0_Comment Submission": "Online Slang Terms", "1_Text": "Search tar or “roofing tar” If you live in the West", "2_Subreddit": "opiates"}], "duetjk8": [{"0_Comment Submission": "Just a few 20s for my Saturday.", "1_Text": "For snorting they suck but they seem to hit me harder than any other brand.", "2_Subreddit": "opiates"}], "dumwvjh": [{"0_Comment Submission": "I feel good and I hope everyone else does too.", "1_Text": "Go down on her. I wish my boyfriend did that to me 🙁", "2_Subreddit": "opiates"}], "dursu3x": [{"0_Comment Submission": "heroin giving me nasty head aches/ hang over feeling", "1_Text": "Fentanyl", "2_Subreddit": "Drugs"}], "dv3s62q": [{"0_Comment Submission": "So are the majority of opiate users?", "1_Text": "I’m Colombian but I’m the only opiate addict I know. It’s mostly white people that use them here in my area. I noticed that Latinos love cocaine the most.", "2_Subreddit": "opiates"}], "dv855hh": [{"0_Comment Submission": "Good morning and happy nods! S/O everyone from the pacific north west", "1_Text": "I’m also from the pacific north west. The Mecca of heroin, or at least it used to be.", "2_Subreddit": "opiates"}], "dv87bun": [{"0_Comment Submission": "Monday getting ready to see the dealer after a crack binge", "1_Text": "I once tried to give my dealer 80 dollars in pure 1 dollar bills and she told me to fuck off basically. Try changing them into bills.", "2_Subreddit": "opiates"}], "dv9w99b": [{"0_Comment Submission": "How have prescription painkillers / opioids, Benzos or kratom improved your life?", "1_Text": "They haven’t.", "2_Subreddit": "opiates"}], "dvc5t90": [{"0_Comment Submission": "Found pills. How Can I responsibly use them?", "1_Text": "NO!!! Do not sniff APAP. That is a very stupid thing to do.", "2_Subreddit": "Drugs"}], "dwd96st": [{"0_Comment Submission": "QUESTION:", "1_Text": "I go to my dealers house and I either get tar or pills from my dealer or from her mom. Either way I get what I want 🤷🏻‍♀️ \n\nIt’s not a sketchy situation for me. My dealers mom gets prescribed a whole bunch of pills because she is disabled with chronic pain. She sells her pills in order to pay rent.", "2_Subreddit": "opiates"}], "dwe1tqa": [{"0_Comment Submission": "Love the refill day!!", "1_Text": "Well then delete it.", "2_Subreddit": "opiates"}], "dwp31oz": [{"0_Comment Submission": "I Am a Beautiful Monster", "1_Text": "Such a cool picture 💙", "2_Subreddit": "opiates"}]}], "1_submissions": [{"62r1t5": [{"0_Title": "I'm a pretty small female. Can I still be in cap 2?", "1_Text": "Working at Walmart isn’t enough to pay the bills", "2_Subreddit": "walmart"}], "7prc4z": [{"0_Title": "Any tips on how to get opiates from guys on tinder?", "1_Text": "Working at Walmart isn’t enough to pay the bills", "2_Subreddit": "opiates"}], "7xgaa2": [{"0_Title": "I had to quit Walmart to go to rehab. Is there any way I could get rehired again.", "1_Text": "Working at Walmart isn’t enough to pay the bills", "2_Subreddit": "walmart"}], "89aqrk": [{"0_Title": "Jessepinkmna", "1_Text": "Working at Walmart isn’t enough to pay the bills", "2_Subreddit": "CircleofTrust"}]}]}]}