{"OTIS_IS_CLEAN_NOW": [{"0_comments": [{"dhm8glx": [{"0_Comment Submission": "Candyflipping for the first time: LSD or MDMA first?", "1_Text": "LSD first always. Nothing worse than adding MDMA to an already bad trip.....believe me. Make sure u and the LSD are alright before u add the Molly. N make sure to fuck a hot broad too. Candy flip sex easily top 5 sex I've ever had in my life I highly recommend", "2_Subreddit": "Drugs"}], "dhm9p0n": [{"0_Comment Submission": "Candyflipping for the first time: LSD or MDMA first?", "1_Text": "Your gonna wanna find some female friends ASAP bud.", "2_Subreddit": "Drugs"}], "dhmec2s": [{"0_Comment Submission": "Tom Hardy anyone? (from the movie: Legend)", "1_Text": "My favorite tom hardy is him playing Alfie solomons the crazy fucking Jewish gangster in PEAKY Blinders", "2_Subreddit": "LadyBoners"}], "dhmesr5": [{"0_Comment Submission": "LPT: If you lend someone money, put the amount after the persons name in your contacts.", "1_Text": "Came here to say this. Do not keep a readable ledger if you're a drug dealer.", "2_Subreddit": "LifeProTips"}], "dhu5cb0": [{"0_Comment Submission": "NEED ADVICE. Took some xanax with my mom, woke up to both of us naked and condoms on the floor.", "1_Text": "IS YOURE MOM ATLEAST FUCKING HOT?", "2_Subreddit": "Drugs"}], "di20kny": [{"0_Comment Submission": "My boyfriend passed away last week and I just want to die.", "1_Text": "Im sorry my friend. Losing a parent at a young age is hard. Just remember to make him proud everyday. Theyre always watching over us!", "2_Subreddit": "TwoXChromosomes"}], "dicrndd": [{"0_Comment Submission": "The New Generation", "1_Text": "Holy fuck I need to start doing drugs again.", "2_Subreddit": "4PanelCringe"}], "dics959": [{"0_Comment Submission": "Warriors 4 best players are 29, 28, 27, 27 If you want to trade 19-yr-old Markelle Fultz for a 27/28 YO guy you're out of your fucking mind", "1_Text": "If you think markell fultz is as good as any of those guys you mentions YOURE OUT OF YOURE MIND. Just because hes young doesn't make him better than already established NBA talent. Who the fuck knows what the landscape of the NBA elite will look like in the 7-10 years it could take him to develop.", "2_Subreddit": "bostonceltics"}], "dicuoc1": [{"0_Comment Submission": "What did you do with your dope when you got pulled over?", "1_Text": "Gf pussy. Swallowed it an puked it up. Hid it in my airvents. 3-3 on getting away with it!", "2_Subreddit": "opiates"}], "dicwkco": [{"0_Comment Submission": "[Homemade] Sous Vide Ribs", "1_Text": "Duddeeee we just got a sous vide at my work today I want wait to try it out! Prolly do a couple filets later!", "2_Subreddit": "food"}], "dinrqyg": [{"0_Comment Submission": "When you get interviewed by the five o'clock news on your way to go cop...", "1_Text": "I legit lol'd when I saw ur name fam. Unreal reference. I love that episode so much.", "2_Subreddit": "opiates"}], "diphooe": [{"0_Comment Submission": "Pirate Bay founder: We’ve lost the internet, it’s all about damage control now", "1_Text": "Honestly. What did you expect? It's a conversation about Internet privacy on Reddit?", "2_Subreddit": "Futurology"}], "dv566ee": [{"0_Comment Submission": "4 kilos of kratom(2 inside coffee bins), 10.5 grams of different psilocybin mushroom species, 250mg DMT(by mushrooms) phenibut, 10 hits of tested LSD(14 more in freezer), 2 ounces of different buds, 2 vials of etizolam, 1 vial of clonozolam, adderall, liquid methylphenidate, and viagra(fuck it)", "1_Text": "I didn't know they made liquid Ritalin that's fucking wild. I gotta find me some", "2_Subreddit": "DrugStashes"}], "dvia4ih": [{"0_Comment Submission": "Who’s your /r/opiates secret crush?", "1_Text": "Fashhhhhhhhh marry me plz?", "2_Subreddit": "opiates"}], "dvmjius": [{"0_Comment Submission": "u/binladen1 is in the hospital right now with a rupture in his stomach, had blood pouring from his nose and mouth earlier, and likely needs surgery...", "1_Text": "U/1binladen get well soon Holmes. my thoughts are with you as I rail this 30 on this snowy shitty morning. Get well soon fam. Dope game needs you!", "2_Subreddit": "opiates"}], "dw1ux4z": [{"0_Comment Submission": "Nice little score of G74 before the impending storm in the north east.", "1_Text": "As a fellow north east opiate guy I'm SO FUCKING JEALOUS. I haven't seen these where I'm at in atleast 3 years", "2_Subreddit": "opiates"}], "dw6zoaa": [{"0_Comment Submission": "No opiates but...JUNKY JESUS TO THE RESCUE. NEVER THOUGHT IT WOULD ACTUALLY HAPPEN TO ME!!!!", "1_Text": "Hahahahahaha I'm a chef too bro I know alllllllll about working during WD fammm", "2_Subreddit": "opiates"}], "dwaajzh": [{"0_Comment Submission": "I’ll take WD over a heartbreak anyday", "1_Text": "Preach bro. But I will say WD and heartbreak simultaneously was the closest I've ever been too suicide", "2_Subreddit": "opiates"}], "dwaapou": [{"0_Comment Submission": "I got snorted off the dick of this guy on Tinder who looked nothing like his pics....and I was a surprise!", "1_Text": "I read the OP of this story and thought \"why the fuck did I just waste my time with this...?\" But now, it's just so goddamn worth it", "2_Subreddit": "Drugs"}], "dwedxgc": [{"0_Comment Submission": "Former New York Giants linebacker and Montana State star Corey Widmer has declined his nomination to the Montana Football Hall of Fame, saying the sport ''destroyed my life.''", "1_Text": "Yup football ruined my life too. Multiple concussions lead to my early retirement my sophomore of college. Lost my scholarship soon after. Then after that I spiraled into depression and drugs (opiates in particular). Took me 6 years post playing to get my life back together. I broke my elbow twice, slipped discs in my back on top of my concussions. So every day I wake up with a sore back and a headache. I have to see a neurologist and shrink every 6 months to make sure I don't go junior seau  or Aaron Hernandez on myself.", "2_Subreddit": "sports"}], "dwkhkjv": [{"0_Comment Submission": "My grandfather got this tie for free in the 90's and wears it to every passover seder", "1_Text": "Tbh that tie is so lit. Like he must have known the founders of viagra to get that kinda company swag. I'd make sure he left it to me in his will so I can pull serious ass in the rich towns of my state.", "2_Subreddit": "pics"}], "dwkoly0": [{"0_Comment Submission": "What's your secret stash spot ?", "1_Text": "Inside one of my ceiling tiles is mine", "2_Subreddit": "opiates"}], "dwkoose": [{"0_Comment Submission": "The worst feeling", "1_Text": "Feel you fam. It's hard out hea", "2_Subreddit": "opiates"}], "dwm5d8f": [{"0_Comment Submission": "Gonna be a LIT easter. 20mg Oxy (have never had these 20s before) 20mg Adderall IR. Two CherryDog extract cartridges.", "1_Text": "Those cartridges are the tits. And nice sheets u got there too lol", "2_Subreddit": "opiates"}], "dww77ux": [{"0_Comment Submission": "Otisphere", "1_Text": "Since I am an Otis, I demand enteranceinto the .", "2_Subreddit": "CircleofTrust"}]}], "1_submissions": [{"62qotd": [{"0_Title": "My GF is da REAL MVP", "1_Text": "LSD first always. Nothing worse than adding MDMA to an already bad trip.....believe me. Make sure u and the LSD are alright before u add the Molly. N make sure to fuck a hot broad too. Candy flip sex easily top 5 sex I've ever had in my life I highly recommend", "2_Subreddit": "Drugs"}], "64b4nx": [{"0_Title": "What do I bring for drugs to the Lil Wayne concert tmrw night?", "1_Text": "LSD first always. Nothing worse than adding MDMA to an already bad trip.....believe me. Make sure u and the LSD are alright before u add the Molly. N make sure to fuck a hot broad too. Candy flip sex easily top 5 sex I've ever had in my life I highly recommend", "2_Subreddit": "Drugs"}], "64vhdy": [{"0_Title": "My giant opiate birthday weekend", "1_Text": "LSD first always. Nothing worse than adding MDMA to an already bad trip.....believe me. Make sure u and the LSD are alright before u add the Molly. N make sure to fuck a hot broad too. Candy flip sex easily top 5 sex I've ever had in my life I highly recommend", "2_Subreddit": "opiates"}], "6etky7": [{"0_Title": "I can't believe im complaining about this but im (28m) in a serious love triangle between my gf (26f), a coworker (28f), and roommate (24f)", "1_Text": "LSD first always. Nothing worse than adding MDMA to an already bad trip.....believe me. Make sure u and the LSD are alright before u add the Molly. N make sure to fuck a hot broad too. Candy flip sex easily top 5 sex I've ever had in my life I highly recommend", "2_Subreddit": "relationships"}]}]}]}