{"AstronautBisco": [{"0_comments": [{"dw9qal4": [{"0_Comment Submission": "Fake Roxicodone? I got some Roxicodone (30mg oxycodone) A 215, and I believe they are fake. Is there a way to tell? I’m afraid to try them, and I do have photos of his whole bag of them. Not sure if I’m allowed to post them here, but I’m going to try to link it and see if it goes through. Pls help!", "1_Text": "I read that in Hank Hill’s voice, haha.", "2_Subreddit": "opiates"}], "dwdheam": [{"0_Comment Submission": "Mouth swap", "1_Text": "I saw someone post about beating one by swishing water around their mouth immediately before the test. Someone else said the lady administering the test gave them water to drink right before they swabbed and beat it, too. Can’t say for sure, but the excess water should dilute the saliva.", "2_Subreddit": "opiates"}], "dwdin1r": [{"0_Comment Submission": "Kratom for withdrawal", "1_Text": "I’ve been taking Kratom for over a month now. I jumped off 150mg of Oxy with no help from subs, and have felt really good. My tolerance has gone up quickly and I take some heroic doses sometimes, but you should start low. I don’t know the quality of your leaf/ extracts, but 3-4 grams should be a good starting dose. High doses can come with a lot of dysphoria, and potentially ruin kratom for you. I broke down and scored some pills last weekend, but back on track and feeling well. Good luck, dude.", "2_Subreddit": "opiates"}], "dwe2liu": [{"0_Comment Submission": "Kratom for withdrawal", "1_Text": "I definitely don’t have the same pull towards kratom that I do with Oxy. I do take it every day, but I don’t fiend for it.  I would probably get a little anxious if I didn’t have any, but I do get a pleasant mild buzz/ energy boost. \n\nI’ll always be an addict, and have the desire to feel anything other than sobriety, but kratom has kept me well, helped me financially, and had an immense part in getting me off oxy. I’m still in the honeymoon phase with it, but so far so good.", "2_Subreddit": "opiates"}], "dwhsng8": [{"0_Comment Submission": "Any other emo dope fiends in this group?", "1_Text": "Dude, I wouldn’t call Saetia emo.  You and I, Hot Cross, Saetia...all good heavy shit. To call them emo and lump them in with the public’s perception of said genre, is pretty sad.", "2_Subreddit": "opiates"}], "dwk39qr": [{"0_Comment Submission": "Any other emo dope fiends in this group?", "1_Text": "Yeah dude, Billy is the man. If you like Saetia and You and I, check out Quantice Never Crashed. They were from New York and heavily influenced by the bands you’ve mentioned. You can still find their album on YouTube, I believe. Let me know what you think.", "2_Subreddit": "opiates"}], "dwkt9rp": [{"0_Comment Submission": "nothing is as good as having this around you ...lol", "1_Text": "That looks fucking QUALITY, my dude. Nice score.", "2_Subreddit": "opiates"}], "dwktham": [{"0_Comment Submission": "Lying to your doctor for opiates is an art, and I’m Salvador Dopi", "1_Text": "I’m sure OP knew that. That’s why he had a rig filled with 2% milk in his other pocket.", "2_Subreddit": "opiates"}], "dwla7j0": [{"0_Comment Submission": "nothing is as good as having this around you ...lol", "1_Text": "Well that’s a mighty dickish thing to do. Looks like I’m giving props to u/oldganja instead. May your pantry be filled with baking soda, my dude 😉", "2_Subreddit": "opiates"}], "dwmi8sc": [{"0_Comment Submission": "Holy shit (just was cleaning out garage and found these!!) how do I get the most use out of these?", "1_Text": "Each patch contains 16.8 mg of fent...if you cut that into 20 equal pieces with a sharp razor blade, each piece would contain .84 mg...which is probably a safe starting dose with the tolerance you’ve stated. Be careful handling these, as it can be absorbed through your skin. Can’t believe people are saying to cheek 1/4 of this...that’s 4.2 mg (a lethal dose). You should wait a while before you dose again, as these can take a while for the effects to come on. Be careful with these and throw a goodbye party for your tolerance.", "2_Subreddit": "opiates"}], "dwmj05p": [{"0_Comment Submission": "Goddamnit", "1_Text": "My ex used to do the same thing. Her pupils would be pinned as hell and she’d swear she wasn’t back on pills. After rifling through her drawers and coming up empty handed, I found 10 blues in her Midol bottle and 3 pandas in her iron supplement bottle. \n\nYes, I absolutely took that shit. Payback for lying and using money I gave her for insurance, cell phone, etc (she wasn’t working) and her penance for stealing all my weed. I’d grab a 1/4 after work and it would be gone the next day. Two 3.5 g blunts to the head while I was out working my ass off to pay the mortgage/bills.", "2_Subreddit": "opiates"}], "dwnc6lq": [{"0_Comment Submission": "Fatal loperamide OD", "1_Text": "Don’t know why you got downvoted...you’re speaking the truth and said it wasn’t advisable...", "2_Subreddit": "opiates"}], "dwocop3": [{"0_Comment Submission": "I’m sick and tired of this, and nobody wants to help me. I’m a grown ass man and I’m crying right now.", "1_Text": "The OPMS silver is plain leaf and pretty weak. They make a gold extract, which is pretty strong, but a 5 pack is $50. Depending on your tolerance, you may not feel any mood lift, but it should help with withdrawal symptoms. Get some loperamide too, as that will help w/d and stop you from shitting yourself. Save the seroquel so you can get a few hours sleep at night...that insomnia is a bitch. I’m in your area, so I know all about it, that’s why I went the kratom/ lope route instead. Good luck, dude.", "2_Subreddit": "opiates"}], "dwonb12": [{"0_Comment Submission": "Took an RP30... 30mg is what I normally take... in about an hour I was gasping for air, passed out for about 30 mins and woke up in an ambulance... I assume this was cut or pressed with fent but now I’m scared to do it again.", "1_Text": "They’re pressing those big ass white RP30s now? Jesus. I hate those things. Me and my boys usually pass on them and wait for blues since that’s a lot of filler to sniff. Glad you’re ok man. This fent shit is completely out of hand...", "2_Subreddit": "opiates"}], "dwpex93": [{"0_Comment Submission": "Stupid shit people say about recovery - have to sit for you", "1_Text": "I think short term, you can quit for your wife, kids, job, etc, but the second they let their guard down and give you the benefit of the doubt, you’ll probably start chipping again. If you want to quit for good, it definitely has to come from within. \n\nBut I will agree with you on people quoting AA/ NA cliches...I’ve been around the block and I know the drill. If that stuff helps some people, then great, I’m all for it. For me, it’s always seemed like I’m being patronized or treated like a tourist.", "2_Subreddit": "opiates"}], "dwq2iqn": [{"0_Comment Submission": "{NSFW} Boof Queen!", "1_Text": "You’ve got a great rack and your preferred ROA leads me to believe you’re down with butt stuff. I’m sure you make your boyfriend very happy 😊 36DD?", "2_Subreddit": "opiates"}], "dwq42dz": [{"0_Comment Submission": "Drugs are ruining my life. Drugs make me okay with that. For real depressed.", "1_Text": "Sorry about your recent string of bad luck...that’s terrible. Opiates/ opioids have such an incredible hold on us, that we can literally kick back and watch everything we love or have worked for, go down in flames. I was on the verge of losing my house and I didn’t give a fuck...as long as I had my blues. I got clean(ish) and got myself caught up with bills, but not a second went by that I didn’t want to get high. Dealing with problems while sober can be a terrifying thought and your emotions are so amplified, that it’s damn near impossible to keep your wits about you.  Maybe some maintenance drugs could help you?  When you hit bottom, the only place to go is up. Good luck, OP, I hope you get everything turned around.", "2_Subreddit": "opiates"}], "dwq64bt": [{"0_Comment Submission": "Should I tell someone?", "1_Text": "I wouldn’t say anything if you’re stopping your use, their opinion of you could change drastically.  Plus you and your friends are young...who’s to say they won’t get worried about you and tell your parents, or their own parents. Losing the trust of your family will haunt you for the rest of your life...you’ll never get that trust back 100%. If you read this sub, you’ll see a lot of misery. Get off this shit while you still can.", "2_Subreddit": "opiates"}], "dwqd4fk": [{"0_Comment Submission": "{NSFW} Boof Queen!", "1_Text": "Thanks dude!  You catching any shows this run?", "2_Subreddit": "opiates"}], "dwqi5l1": [{"0_Comment Submission": "Should I tell someone?", "1_Text": "No problem dude. Didn’t want to see your life destroyed before it even begins.", "2_Subreddit": "opiates"}], "dwr6k0k": [{"0_Comment Submission": "Please help— real or fake A-214? Thank you in advance!", "1_Text": "Looks legit to me. The color seems a little odd, but it’s probably the lighting. Enjoy, dude.", "2_Subreddit": "opiates"}], "dwr7a0a": [{"0_Comment Submission": "Roxys. How many do I take?", "1_Text": "How much hydrocodone do you take at a time?  That would help give us a better idea. Do you know for sure these 30’s are legit?  There’s a lot of pressed pills out there and 2 of them could put your ass under ground. Always start small with a new connect...throw a picture of them on here if you want some expert opinions. A test kit would be the only way to be 100% sure, but a lot of us know our pills and would tell you if something looked sketch. Don’t just “take 2” if you’ve never done them before...be safe.", "2_Subreddit": "opiates"}], "dwriblk": [{"0_Comment Submission": "Roxys. How many do I take?", "1_Text": "If they’re legit, I’d split it into 2 doses (45mg). Personally, I insufflate my Oxy, but technically, that ROA has less bioavailability than simply eating them. I find the quick and more intense come up of snorting them outweighs the longer duration of ingesting them. Either way, you should have a good time. I find Oxy to be stimulating, as do many others. Definitely my favorite pill since they don’t have the old OC80’s in the US and pandas are insanely hard to find. Have fun and be safe, dude.", "2_Subreddit": "opiates"}], "dwujhuw": [{"0_Comment Submission": "I'm Eric Hafner, I'm running for U.S. Congress in Portland, Oregon (OR-3). I want to legalize all drugs, including opiates, but offer ibogaine therapy too, and free drugs for addicts via prescription.", "1_Text": "I’m not sure if this has been asked, as this is a long thread and I’m currently at work, but I’m curious as to how much support you have in the legalization of all drugs?  Is there any interest from the opposing party? Do you see this happening in the near future?\n\nIt’s pretty incredible that you understand this issue. We don’t have an opioid crisis, we have a fentanyl crisis, caused by government interfering in the medical field. Keep up the good work, and best of luck to you.", "2_Subreddit": "opiates"}], "dwuyzqr": [{"0_Comment Submission": "Some blues👌", "1_Text": "I’ve seen a lot of V’s with a lip like that. Straight from my friend’s script at the pharmacy while I’m waiting in his car. They should be hard to crush too, the 4812’s are little little stones...beautiful blue stones.", "2_Subreddit": "opiates"}]}], "1_submissions": [{"84ykbz": [{"0_Title": "When your long time Oxy connect suddenly connect leaves the game...", "1_Text": "I read that in Hank Hill’s voice, haha.", "2_Subreddit": "opiates"}]}]}]}