{"hoytchennn": [{"0_comments": [{"dv95r13": [{"0_Comment Submission": "Your wd symptoms also what is rls", "1_Text": "Arms here too. To me, that's the absolute worse!", "2_Subreddit": "opiates"}], "dv9lkmu": [{"0_Comment Submission": "How have prescription painkillers / opioids, Benzos or kratom improved your life?", "1_Text": "I've got a neck injury from a previous car wreck. Take Vicodin 7.5 mg 2x daily. It allows me to go to work, clean my house, cook, sleep without pain. Little ADLs that I used to take for granted", "2_Subreddit": "opiates"}], "dvaowdi": [{"0_Comment Submission": "Weekly TFR Express Lane Checkout - Post your very short anecdotes and experiences here for quick service!", "1_Text": "I'm doing this every time!", "2_Subreddit": "TalesFromRetail"}], "dw4wlx5": [{"0_Comment Submission": "Which is the most interesting fact you know about the human body?", "1_Text": "Same", "2_Subreddit": "AskReddit"}], "dw743uy": [{"0_Comment Submission": "Cops of Reddit, what situation did you respond too, only to find out it was the biggest waste of time ever?", "1_Text": "Not a cop, but had a woman call the police on me for not turning the air conditioner down at the restaurant I was working at. (It was locked, I didn't have the key. Keyholder was owner who was out of town). Called and said I was trying to assault her by heat. No fucking lie. Cops showed up. Heard 30 seconds of her story, looked at me and told me to tell her to leave and never come back and they would happily come back to enforce her ban if she ever tried to come back in. Btw, it was July in arkansas. 101 degrees with 90% humidity. No air conditioner my big sweaty ass!", "2_Subreddit": "AskReddit"}], "dw7si3i": [{"0_Comment Submission": "Cops of Reddit, what situation did you respond too, only to find out it was the biggest waste of time ever?", "1_Text": "Because I couldn't turn the air conditioner any lower. Was set to 75 I believe. She wanted it 52 in there i guess 😨😨", "2_Subreddit": "AskReddit"}], "dw7srmh": [{"0_Comment Submission": "Cops of Reddit, what situation did you respond too, only to find out it was the biggest waste of time ever?", "1_Text": "See I never ever know how to explain that. Ever. My parents laugh at me because I don't say it right. In my mind, it's turning it down, means making it colder in the room. Turning it up means making it warmer in the room. I'm slow. Forgive me 😂", "2_Subreddit": "AskReddit"}], "dw7t249": [{"0_Comment Submission": "Cops of Reddit, what situation did you respond too, only to find out it was the biggest waste of time ever?", "1_Text": "Think I will not print this out and frame it for my parents.", "2_Subreddit": "AskReddit"}], "dwcbgxm": [{"0_Comment Submission": "What are the \"laws\" of dope addiction?", "1_Text": "This! Plenty of great nights followed by shitty mornings", "2_Subreddit": "opiates"}], "dwcf720": [{"0_Comment Submission": "My codeine pills finally ran out yesterday", "1_Text": "We're kinda in the same boat. Wd sucks. No ifs and or buts about it. And it's different for everyone. Some people can quit cold turkey, some need rehab, some don't ever get the chance to quit. But me personally here ya go. Started off having hydro 5/500 scribed from a knee Injury 6 years ago. Ever since then, took any opiate I could. Went to pain mgmt and now have had a mthly script for hydro 7.5/325 (90). Which I usulsy go thru in about a week. Then a week of hell. I find more from one of my connects and then get mine refilled etc. Every month for 2 years. I love opiates man. They make me happy, energized, social. And I guess that's why they are so deadly. I'm 9 days clean and it sucks to be honest. But I know it gets better. For me it's immodium, Nyquil to sleep, vivarin during the day (caffeine pills). Lots and lots of water. It may not work for everyone, but it does for me. It's not a daily struggle for me right now. It's minute by minute. Best of luck", "2_Subreddit": "OpiatesRecovery"}], "dwe0w21": [{"0_Comment Submission": "My codeine pills finally ran out yesterday", "1_Text": "It's really incredibly hard. I would like to have tapered but i can't ever do it.", "2_Subreddit": "OpiatesRecovery"}], "dwe1izl": [{"0_Comment Submission": "My codeine pills finally ran out yesterday", "1_Text": "Yeah I took my last hydro the 18th. And I wish I would have just put them in a set place and divided them out but it's really hard to do. I always say that and I take them. It's like a compulsion.", "2_Subreddit": "OpiatesRecovery"}], "dwe4rkm": [{"0_Comment Submission": "Opioids are like a miracle drug for my ADHD and bipolar.", "1_Text": "Exactly the same here!", "2_Subreddit": "opiates"}], "dwij6jv": [{"0_Comment Submission": "Epidem-myass", "1_Text": "Thought I was the only one who felt like that", "2_Subreddit": "opiates"}], "dwik5cr": [{"0_Comment Submission": "paws", "1_Text": "Do you feel that different doc cause longer craving periods? I did cold turkey as well.", "2_Subreddit": "OpiatesRecovery"}], "dwiv4sr": [{"0_Comment Submission": "paws", "1_Text": "On and off 5 years. And I took my prescribed hydro (ranging from 5 to 10 mg, 30 to 120 mg a time) and then taking appx 10 to 30 more hydro or perks a week. It just depending on what I could afford at the time.", "2_Subreddit": "OpiatesRecovery"}], "dwiv5bl": [{"0_Comment Submission": "paws", "1_Text": "Thank you for this. Makes me feel better", "2_Subreddit": "OpiatesRecovery"}], "dwiz638": [{"0_Comment Submission": "Parents of Reddit, what's the most elaborate lie you've ever told your children?", "1_Text": "My son, 11, has issues being respectful. It's a long story and process but we began telling him that if he doesn't get his attitude in check that he has to go to school 7 days a week, every day of the year except Christmas. He didn't believe us. So I got with the principal and he sent a \"form\" home talking about \"defiance school\" and we signed it and sent it back. He still didn't believe us so last Saturday and Sunday he spent 8-3 at the school with the principal cleaning and working on \"assignments \". Haven't had an issue out of him this week.", "2_Subreddit": "AskReddit"}], "dwjjmce": [{"0_Comment Submission": "paws", "1_Text": "Thank you all so much for the Input. 14 days tomorrow! It's still minute by minute tho", "2_Subreddit": "OpiatesRecovery"}], "dwoih3o": [{"0_Comment Submission": "Opiates and motivation/creativity", "1_Text": "That's why opiates became an addiction for me. They don't keep me down. It's like they completely wire me. I'm social, faster, more productive and I love everything about life with them. I've heard that people that have certain mental disorders feel that way with them . I'm bipolar and that could be why they do that to me as well. I'm a hydro fan, but would take any of them of I got my hands on them. Be careful with em", "2_Subreddit": "opiates"}], "dwp6mkd": [{"0_Comment Submission": "Opiates and motivation/creativity", "1_Text": "Me too.", "2_Subreddit": "opiates"}], "dwpid5u": [{"0_Comment Submission": "This is Us (Dope Fiend Edition)", "1_Text": "I have so many stories and instances that I've been thru. A LOT that I'm not proud of I've lost jobs due to addiction. DOC : Hydro/Percocet. I've stolen from family, friends. I would go to friends house after they had surgery or some medical issue to \"check on them\" but was really looking for their meds. I can slip opiates into any conversation to check my surroundings to open a new connect. I've had RLS from WD so bad that I took everything I could think of to stop it, including my partners meds that he needs for MS. I've used food money to buy pills. I've used bill money for pills. At times I would drive 2 hours away for pills but wouldn't take my son to the store for a damn Gatorade. My last but from a connect, was a ripoff. Took money and ran. And instead of coming home and admitting defeat, I sat at a gas station for 4 hours waiting. Making an excuse every time my kid or fiance called. I've went out in a flood, ice, left work without telling anyone for pills. I've stolen pills from people's house while I was a maid. I lost my nursing license from drug addiction. (Not stealing pills, but being too fucked up to function. I've become so angry without them that I have screamed at family and friends. I've neglected seeing family and friends during birthdays or holidays or occasions because I wasn't high before I went. And sadly, I still love taking them. I've been clean 16 days and I still crave them so intensely. It's a vicious cycle.", "2_Subreddit": "opiates"}], "dwpin3a": [{"0_Comment Submission": "I’m worried about my sister. What’s the general addiction timeline look like from beginning to end?", "1_Text": "This was how i learned about being bipolar. Trying to self medicate for years.", "2_Subreddit": "opiates"}], "dwpp5oz": [{"0_Comment Submission": "This is Us (Dope Fiend Edition)", "1_Text": "It was hard to say but when I did, I felt great just admitting it.", "2_Subreddit": "opiates"}], "dwstsg7": [{"0_Comment Submission": "What's your best piece of NSFW advice?", "1_Text": "😂😂😂😂", "2_Subreddit": "AskReddit"}]}], "1_submissions": [{"82ceq3": [{"0_Title": "I was rude???", "1_Text": "Arms here too. To me, that's the absolute worse!", "2_Subreddit": "TalesFromRetail"}], "832n7e": [{"0_Title": "I'm not paying that price!", "1_Text": "Arms here too. To me, that's the absolute worse!", "2_Subreddit": "TalesFromRetail"}], "887nfm": [{"0_Title": "paws", "1_Text": "Arms here too. To me, that's the absolute worse!", "2_Subreddit": "OpiatesRecovery"}]}]}]}