{"kitkatny": [{"0_comments": [{"dw9u03f": [{"0_Comment Submission": "Scored a 100 pack of blues... Last hooray before getting sober for good", "1_Text": "True that, I've personally never copped of a person who has the actual script themselves. I dealt with a dude who buys the whole bottle of a person who is scripted and then he sells em to me. However, he is the only one I've had who sold me em for $20 each here and there. Usually i would pick up 5 for $100 and if he took too long or something came up he would throw me 1 or 2 for free depending how late he was, so thats always nice.", "2_Subreddit": "opiates"}], "dwa19be": [{"0_Comment Submission": "Scored a 100 pack of blues... Last hooray before getting sober for good", "1_Text": "Yeah man i agree, whatever works best for you! Isn't that the whole motto of self medication anyways ha!  Yeah sadly, once he stopped dealing a few years back i havent been able to find a solid connect i could trust. Its been like 3 years now since i could find anything and for a decent price anyways. Hows the morphine compared to oxy, never had any", "2_Subreddit": "opiates"}], "dwcpi4m": [{"0_Comment Submission": "Government is making things worse", "1_Text": "When have they made it better?", "2_Subreddit": "opiates"}], "dwcplai": [{"0_Comment Submission": "Can I be honest? I am about to throw my life down the drain", "1_Text": "I agree with this, get a hobby. Hopefully OP can let use know what interests him and we can guide him to some potential hobbies. I know i have a few that keep me going.", "2_Subreddit": "opiates"}], "dwcppr1": [{"0_Comment Submission": "Nods and Fortnite", "1_Text": "Gaming and oxies were the base of having a great time for me. To be honest, didn't matter if it was opiates,weed,lsd,or X, I just enjoyed playing and communicating. Now a days, being fully clean, I don't find any games enjoyable. I just sit here on my free time & watch youtube videos,browse this sub or something. Maybe i'll be able to once again get high and enjoy some games once I feel my work wont drug test randomly and i find a solid connect for some oxies, just thinking about it put some life into me giggling like a school girl ha!", "2_Subreddit": "opiates"}], "dwgh2kz": [{"0_Comment Submission": "Girlfriend and her friend got popped over the weekend. Fml.", "1_Text": "It is if you're mentally prepared for it. Yeah the withdrawals will suck, lack of sleep for a bit, shit for a bit, vomit a bit but over all it'll be fine. The body recovers quickly. It's the mental part of being sober that most people cant cope with", "2_Subreddit": "opiates"}], "dwghme4": [{"0_Comment Submission": "With all the drugs I fucked with opiates were the only ones that ever grabbed a hold of me and made me struggle with addiction and to me it's because I found that sweet spot for everything.", "1_Text": "I feel you on this dude, I was a big party guy myself and never thought i'd do opiates. The rule of thumb i used to make sure i never flew down a hole was use on the weekends, dont go a binge(which i did couple times but at the end of the week binge i got off, went through the WD's and didnt use for a little while). As long as you mentally prep yourself and take time off you can indefinitely keep using. Personally, i dont know about the boy situation since i made sure never to go that route. Keep it recreational, not addiction. Plus man, if you're making great money save it & do other fun shit. Go get a few hobbies and make sober successful friends.", "2_Subreddit": "opiates"}], "dwghrt4": [{"0_Comment Submission": "I'm an opiate newb, I don't wanna OD, can I get some advice?", "1_Text": "Lemme tell you right now, Don't mix the xanax. I know a girl who died doing that and she didn't even take a lot of the oxy. Passed out in the bathroom and boom dead. Its not worth it. Enjoy the oxy and chill", "2_Subreddit": "opiates"}], "dwhlhi1": [{"0_Comment Submission": "Girlfriend and her friend got popped over the weekend. Fml.", "1_Text": "I went through it(multiple times cause of multiple binges), its not as bad as people make it out to be is my point, countless shits through the day, 4 hour sleep a day,sweats and shakes RLS. Thats my point. Boo hoo, 1-2 weeks of sides effects, we all knew what we were in for, so man/woman up and do what you gotta do. We didn't complain when we were feeling good and knew that we would have to WD. If you want it bad enough you will over come it. The people who say they can't handle it just dont want to quit and rather go get high. It's just excuses. There are things people go through worse than a silly withdrawal. Thats just my opinion.  I've had times i got sick that would make a WD feel like a walk in the park, so bad i wouldn't wish it upon anyone. So maybe thats why i didn't think WD's are that bad.\n\nAs for the mental part, Each is its own case. Half the people that can't get off (this is no offense to anyone in this sub) just feel sorry for themselves constantly, think life owes them things without any effort and the whole world is out to get them/ put them down. Which isn't true. Its just an egg shell mentality. Using drugs is simple and fun, so keep it that way. Progress in life and enjoy life in every aspect, not just drugs and drugs only.", "2_Subreddit": "opiates"}], "dwhmwnt": [{"0_Comment Submission": "Girlfriend and her friend got popped over the weekend. Fml.", "1_Text": "Uhh depends, If you're referencing about the land of superiority, dont know, never been. Where i'm at, not so great but ideal weather for doing chores and not going out today.", "2_Subreddit": "opiates"}], "dwhncgt": [{"0_Comment Submission": "Let's talk about cuckqueanvideos.com", "1_Text": "Yep, I felt the same way last night. Just ban them up. Why have something spamming the sub with useless garbage?", "2_Subreddit": "cuckquean"}], "dwhoekm": [{"0_Comment Submission": "Lost My Job!", "1_Text": "Don't give in man, keep tryna get clean if thats what you need to do to make your life better. You should have not quit, should of let them fire you like others have mentioned to collect unemployment. Refusal to show whats in your pockets doesnt mean you're guilty. They arent police and they have not caught you in the act of anything. Refusal for a drug test also does not mean you wont collect unemployment. Best of luck to you bud!", "2_Subreddit": "opiates"}], "dwhp7me": [{"0_Comment Submission": "fuck sour patch kids...", "1_Text": "OH MY FUCKING GOD!!!! I CANT BELIEVE THEY MAKE A SOUR VERSION OF CANDY!! Now this is a must try", "2_Subreddit": "opiates"}], "dwhr2ke": [{"0_Comment Submission": "fuck sour patch kids...", "1_Text": "Did you buy these at an asian market or a name brand store? I gotta go on a hunt for there for sure. Yeah, people just dont understand the value of this company and their candies. I would eat a pack of the normal ones in like less than an hour. Great share!", "2_Subreddit": "opiates"}], "dwhrktb": [{"0_Comment Submission": "fuck sour patch kids...", "1_Text": "awesome, thanks for letting me know. Was a wise choice ha!", "2_Subreddit": "opiates"}], "dwhs76l": [{"0_Comment Submission": "Best day since I started seeing a sub doc. MEDICAL MARIJUANA!", "1_Text": "Thought this wouldn't be an issue since its medicinal and legal for the person to own. Just like pain patients that work and get drug tested but have a script?", "2_Subreddit": "opiates"}], "dwhs9o8": [{"0_Comment Submission": "Best day since I started seeing a sub doc. MEDICAL MARIJUANA!", "1_Text": "Indeed it is", "2_Subreddit": "opiates"}], "dwhtbh4": [{"0_Comment Submission": "RIP OldRapGroup", "1_Text": ".", "2_Subreddit": "opiates"}], "dwk2qnk": [{"0_Comment Submission": "Feels like oxy is becoming impossible to find", "1_Text": "If you think thats bad, I haven't been able to find a solid connect or pill for the last 3 years.", "2_Subreddit": "opiates"}], "dwqh1b5": [{"0_Comment Submission": "Lost my job of 4 years--the one thing is was proud of in my life", "1_Text": "Best advice i can give you is what i would if i was you. Go get clean, Then own up to your mistakes, go back in and repay the people of what you stole. Money is paper and thats not whats important, the important part is that you took food out of their mouths. From the people that stood right beside you everyday. Get clean, get a job,put the money you stole in an envelope & go back there and apologize for your actions. \n\n Don't give up on yourself and stand back up. As you saw the spiral its just not worth being an addict full time. Chip if you need to but keep it at that, chipping on weekends. Best of luck to you!", "2_Subreddit": "opiates"}], "dwqhavd": [{"0_Comment Submission": "Going to be experincing withdrawl for the first time, advice?", "1_Text": "Kratom and whatever else someone mentioned. Don't worry, its not as bad as people say it is honestly. Yes, it wont be a breeze and it will suck but as long as mentally you're able to keep yourself busy and not be a little bitch (Fight your mind, any time you think of it just blank the thought out with something else.) youll be fine. Keep busy & try to eat/stay hydrated as much as possible & with what ever energy you have left try to work out, that way you tire yourself out so you can get some better sleep. Best of luck you got this!", "2_Subreddit": "opiates"}], "dwqhl4n": [{"0_Comment Submission": "How addictive is OPIUM?", "1_Text": "I like the smell of opium, i feel thats its very relaxing to smoke it. I'd say give it a try if you can get some real stuff.", "2_Subreddit": "opiates"}], "dwqwoxd": [{"0_Comment Submission": "How addictive is OPIUM?", "1_Text": "Nah, not at all. I've been clean 3 years or so.  Its not something that you'll addicted over in a day. Its just like anything else, one day starts two,three,four,a week,a month. Just make sure you don't partake everyday and just enjoy yourself on the weekends in small to moderate amounts, youll be fine. Just understand that real opium isn't easy to get if you're in the states. Make sure you have the real deal.", "2_Subreddit": "opiates"}], "dwrzdm4": [{"0_Comment Submission": "How addictive is OPIUM?", "1_Text": "Yeah it is. Haha, Sounds like a person problem haha. You'll have to figure that one out. To me its easy to chip weekends only but i haven't in the last 3 years since I can't find a good source but its all good. Once i do, ohh babyy its gonna be a triple!", "2_Subreddit": "opiates"}], "dwtb36d": [{"0_Comment Submission": "I love using blunt straws to snort my h (on the rare occasion it doesn’t go up my ass)", "1_Text": "I second this, Used to use my blunt straws for railing oxy as well!", "2_Subreddit": "opiates"}]}], "1_submissions": [{"7k887k": [{"0_Title": "Best time of the year for opiates?", "1_Text": "True that, I've personally never copped of a person who has the actual script themselves. I dealt with a dude who buys the whole bottle of a person who is scripted and then he sells em to me. However, he is the only one I've had who sold me em for $20 each here and there. Usually i would pick up 5 for $100 and if he took too long or something came up he would throw me 1 or 2 for free depending how late he was, so thats always nice.", "2_Subreddit": "opiates"}]}]}]}