{"Beethovens420": [{"0_comments": [{"dvcc46o": [{"0_Comment Submission": "Came across this a while ago and idk I feel kinda attacked? 🤷‍♂️", "1_Text": "I think you’re more upset bout the engagement then the brows, I don’t see a problem with these.", "2_Subreddit": "awfuleyebrows"}], "dvccrqj": [{"0_Comment Submission": "When r/trashy meets r/tinder", "1_Text": "Stalkers do some scary ass things 🤷‍♀️", "2_Subreddit": "trashy"}], "dvco6q4": [{"0_Comment Submission": "Stay negative my friends... NSFW", "1_Text": "*it prevents the spread of HIV. It’s a pill you take if you want to have fun and not accidentally get HIV, or your partner is positive so you take this pill to keep yourself safe.", "2_Subreddit": "trashy"}], "dvddtda": [{"0_Comment Submission": "This has happened to me once and damn it stank.", "1_Text": "Every time I’ve done anal I’m unprepared for it. It’s not something I think about when I go out to dinner or get ready for a date cause it’s not something I enjoy, but I don’t hate it. Also cleaning it regularly isn’t healthy. \n\nMaybe if a dude is gunna beg to put it in there, or just do it unannounced, he should be prepared for the product it produces to come flying out. But no let’s just put this all on the female. Typical.", "2_Subreddit": "BlackPeopleTwitter"}], "dvdlkcx": [{"0_Comment Submission": "Dodge duck dip dive and dodge in front of yo mama", "1_Text": "It’s just a word. Stop giving it power. I can see getting upset if someone uses it to try and hurt your feelings, but most of the time it’s just another word in a sentence. \n\nI don’t say it simply cause I don’t want to start a problem with someone with a chip on their shoulder for honestly no reason. \n\nWho knew snowflakes came in more colors then white.", "2_Subreddit": "BlackPeopleTwitter"}], "dvidlda": [{"0_Comment Submission": "She lets people go in front of her. How generous", "1_Text": "I work at a gas station. Disappointed in the amount of beer I sell to people during rush hour. I know they are drinking and driving cause they always get a half full cup of ice with their tall boy🙄", "2_Subreddit": "trashy"}], "dvihb2v": [{"0_Comment Submission": "She lets people go in front of her. How generous", "1_Text": "In some states we operate in, we sell liquor as well. I agree with you, it makes me so upset, sometimes I refuse the sale when I’m having a bad enough day. \n\nI’ve also been to a bar inside a gas station. \n\nEdit because I guess people are upset I refuse the sale? I can refuse sale for any reason, I’d say refusing to sell a 24 oz beer along with an ice cup is fair reason to deny the sale. There’s usually another clerk that will just ring them up and do the sale anyway, but sorry some days I just don’t feel like let people get away with it.", "2_Subreddit": "trashy"}], "dvivfjw": [{"0_Comment Submission": "She lets people go in front of her. How generous", "1_Text": "Where I live an open container is a Class C misdemeanor... so the police have better things to do. If the person seems intoxicated, we refuse sale, if we aren’t busy and paying attention, we’ll call police if we see them drive away. \n\nBut most of theses people are having their first beer after work so they aren’t drunk technically, they’d pass a breathalyzer, have the poor out their beer and get a ticket.", "2_Subreddit": "trashy"}], "dvj8j1s": [{"0_Comment Submission": "Oh, hi Frank [OC]", "1_Text": "If they are surgical stainless steel, they are not magnetic. I’m pretty sure it’s the same for stainless steel as well, but I know for sure surgical isn’t.", "2_Subreddit": "bigtiddygothgf"}], "dvj8yf2": [{"0_Comment Submission": "Sad to say this was a family member’s post on my feed...", "1_Text": "I’d wear these", "2_Subreddit": "trashy"}], "dvjaabd": [{"0_Comment Submission": "Baby deli (xpost r/dontdeadopeninside)", "1_Text": "Baby Deli Dolllah ❤️", "2_Subreddit": "trashy"}], "dvjalir": [{"0_Comment Submission": "Fried gravel and dirt", "1_Text": "Fried food is the State Fair of Texas go to food item. I don’t normally eat like that but when fair season is on, it’s on. \n\nLast year I had deep fried spaghetti and meatballs on a stick, I dream of it sometimes 🤷‍♀️", "2_Subreddit": "BlackPeopleTwitter"}], "dw9rszz": [{"0_Comment Submission": "Pita Pit employee spits in customer's sandwich, right in front of her", "1_Text": "Anyone who thinks it’s okay and can defend someone spiting in someone else’s food is trash. I don’t care how terrible a customer treats me, spitting in their food IS NEVER AN OPTION.", "2_Subreddit": "trashy"}], "dwllw65": [{"0_Comment Submission": "Baker Hotel in Mineral Wells, Texas.", "1_Text": "It’s actually a Snapchat filter😂 I just really like the effect it adds.", "2_Subreddit": "abandoned"}], "dwllzsm": [{"0_Comment Submission": "Baker Hotel in Mineral Wells, Texas.", "1_Text": "Well I’m Texan and I’m not😂", "2_Subreddit": "abandoned"}], "dwlmque": [{"0_Comment Submission": "Baker Hotel in Mineral Wells, Texas.", "1_Text": "I’ve gotten in and out twice without any police contact whatsoever. There are no cameras or active security, just towns people and local police. It’s a trespassing fine of $300, so even if caught, jail time probably won’t happen.", "2_Subreddit": "abandoned"}], "dwlmtd1": [{"0_Comment Submission": "Baker Hotel in Mineral Wells, Texas.", "1_Text": "Also the post here in abandoned that is titled “abandoned hotel” is from inside the lobby of this hotel.", "2_Subreddit": "abandoned"}], "dwmpb59": [{"0_Comment Submission": "Baker Hotel in Mineral Wells, Texas.", "1_Text": "Oh there’s definitely spirits in there. A few friends and I plan to stay over night this summer.", "2_Subreddit": "abandoned"}], "dwnjv75": [{"0_Comment Submission": "One of many abandoned rooms in the Baker Hotel.", "1_Text": "Mineral Wells, Texas.", "2_Subreddit": "abandoned"}], "dwnqg72": [{"0_Comment Submission": "One of many abandoned rooms in the Baker Hotel.", "1_Text": "I have a few. I’ll post them!", "2_Subreddit": "abandoned"}], "dwnunyg": [{"0_Comment Submission": "Ouija board burned in the lobby of Baker Hotel.", "1_Text": "Thanks for pointing that out! Didn’t notice!", "2_Subreddit": "abandoned"}], "dwnuqay": [{"0_Comment Submission": "One of many abandoned rooms in the Baker Hotel.", "1_Text": "Never seen a motion detector here. There’s no electricity to the building. This last time was surprisingly easy, just hopped through a busted out, previously boarded window.", "2_Subreddit": "abandoned"}], "dwol15t": [{"0_Comment Submission": "Not the best lit, but the basement of Baker Hotel. Where the demons live apparently.", "1_Text": "This is under the courtyard. Kinda around the corner from where the cars pulled up under the bridge.", "2_Subreddit": "abandoned"}], "dwovxff": [{"0_Comment Submission": "Fentanyl-Laced Cocaine On the Rise in Cleveland, African-American Overdose Numbers Climb", "1_Text": "Killing customers always brings more business. That’s not a secret.", "2_Subreddit": "opiates"}], "dwsbvi3": [{"0_Comment Submission": "Baker Hotel in Mineral Wells, Texas.", "1_Text": "That’s my point. If they take you to jail over this, you probably were doing more then exploring.", "2_Subreddit": "abandoned"}]}], "1_submissions": [{"78rdvd": [{"0_Title": "Indian season? Really?", "1_Text": "I think you’re more upset bout the engagement then the brows, I don’t see a problem with these.", "2_Subreddit": "StopWhitePeople"}], "88jvrw": [{"0_Title": "Baker Hotel in Mineral Wells, Texas.", "1_Text": "I think you’re more upset bout the engagement then the brows, I don’t see a problem with these.", "2_Subreddit": "abandoned"}], "88s6vc": [{"0_Title": "One of many abandoned rooms in the Baker Hotel.", "1_Text": "I think you’re more upset bout the engagement then the brows, I don’t see a problem with these.", "2_Subreddit": "abandoned"}], "88whbt": [{"0_Title": "Another abandoned room in the Baker Hotel, TX.", "1_Text": "I think you’re more upset bout the engagement then the brows, I don’t see a problem with these.", "2_Subreddit": "abandoned"}], "88whjz": [{"0_Title": "Not the best lit, but the basement of Baker Hotel. Where the demons live apparently.", "1_Text": "I think you’re more upset bout the engagement then the brows, I don’t see a problem with these.", "2_Subreddit": "abandoned"}], "88whye": [{"0_Title": "Ouija board burned in the lobby of Baker Hotel.", "1_Text": "I think you’re more upset bout the engagement then the brows, I don’t see a problem with these.", "2_Subreddit": "abandoned"}]}]}]}