{"FirstEverAlt": [{"0_comments": [{"dwvldx5": [{"0_Comment Submission": "Wondering how you guys met your now-dealers? (Don't worry, I'm not trying to source)", "1_Text": "Hmmm, this is a good thought! Thanks, pal, I'll have to make a burner email and give this a shot. Should I make a post and try to be subtle? Honestly, one time when I was living in Montreal I saw a Craigslist post of someone who was obviously looking for meth but using sneaky words like \"we'll drink out of crystal glasses\" so I messaged her (despite my 100% disinterest in meth or any uppers these days) and we're still friends, lol. But I mean, we never helped each other get drugs, as was her hope.", "2_Subreddit": "opiates"}], "dwvm5i2": [{"0_Comment Submission": "Wondering how you guys met your now-dealers? (Don't worry, I'm not trying to source)", "1_Text": "Hi again, sorry I just saw the rest of your comment (only saw til the paragraph break before). I know, I know, giving up on morphine is a good idea. Honestly I've been living in the east and have a hard time finding it here, and oxy neos are the easiest shit to find. And I mean that, when I say shit - I fucking hate fucking oxy neos. They're garbage. They get me *by* (sort of) but they do not get me high. I mean, I've found a cheap plug for them when he's not avoiding me, $5 ish bucks for a 20mg (plus a reliable plug for $15 for a 20mg, but like, after the cheap but unreliable plug I don't really want to spend $15 on one), so that's pretty good, but morphine is way fewer and far between. \n\nI had a shitty plug for a while that was like, oxys once or twice a month (maybe more, they seem to be the most common here), dilaudids once or twice a month, percs once a month, and legit morphine capsules once a month, but she was the worst fucking dealer I've ever met. She stole $100 from me (we used to be friends way back when, and she ripped me off then dropped off the face of the earth) and is now gone forever, and I've only had spotty dealers since. \n\nAnyways, sorry to rant. Just wish I had some fucking pills.", "2_Subreddit": "opiates"}], "dwvmd3o": [{"0_Comment Submission": "Wondering how you guys met your now-dealers? (Don't worry, I'm not trying to source)", "1_Text": "This would be a good thought for me if I had a script someone was interested in. Thanks though! :). \n\nI stole some of my step-dad's zoplicones (sleeping meds) and had a friend saying \"I wish I had some zoplicones! They're the only pill that helps me sleep!\" and I was like WELL, I can help you out! ... but she doesn't get any good scripts. Just buys up some of my best friend's percs every month, which sucks since percs suck with my tolerance but I'd rather buy as many as possible for when I'm sick, lol.", "2_Subreddit": "opiates"}], "dwvmx18": [{"0_Comment Submission": "Wondering how you guys met your now-dealers? (Don't worry, I'm not trying to source)", "1_Text": "What did you try? That's what I'm just thinking too, like wtf keywords do I even try?", "2_Subreddit": "opiates"}], "dwvmxrl": [{"0_Comment Submission": "Wondering how you guys met your now-dealers? (Don't worry, I'm not trying to source)", "1_Text": "craigslist (it's a website)", "2_Subreddit": "opiates"}], "dwvo2if": [{"0_Comment Submission": "Cursing myself for the highs I've taken for granted", "1_Text": "Yes!!! \n\n100% I'm with you. A few weeks ago I had a bunch of 4mg dilaudids and fucking used the shit out of them. Like, the last day I had them I managed to use 9 or 10 of them over the course of the day (plugging), when realistically I'm sure I could get away with 5 in a day if I plug them and just ride it out. I'm mad at myself too - I do this every time I get a big amount of anything. \"Oh, I've got 10 of these? (hydromorph contins), no problem! That can last me 20 days if I'm frugal.\" Then 9 days later I'm completely out. Like, fuck.", "2_Subreddit": "opiates"}], "dwvppsj": [{"0_Comment Submission": "Did half of each already , but .4 of hard and .3 of Canadian brown Fent. I smoke both on tin foil, weird hey?", "1_Text": "Hi, friend. Fellow Canadian here. I'm fucking sober-ish, but I hope you're having a great time!!! :)", "2_Subreddit": "opiates"}], "dwvpw9e": [{"0_Comment Submission": "When your friend tells you he got percs but follows it with \"but you're not getting any\".", "1_Text": "Fuck people like that. I broke up with a guy who hated my pill use, then as soon as we broke up he was texting me like \"well, I've got percs, so come see me!\" ... and, well, I did, and he was just trying to trick me into taking him back by pretending he was gonna OD. I think I still got a couple out of him,  but it wasn't worth the trouble. Seriously, fuck people like that.", "2_Subreddit": "opiates"}], "dwvqca4": [{"0_Comment Submission": "When your friend tells you he got percs but follows it with \"but you're not getting any\".", "1_Text": "Right? It's a ridiculous way to think. He tricked me into coming by to get the percocets, then said \"actually I've already taken some so I'll just wash them down with this alcohol so I die\" basically, so I wrestled the percs out of his hand and he bit my arm hard enough to leave a mark for quite some time. Fuck those kinds of people, lol.", "2_Subreddit": "opiates"}], "dwwmfid": [{"0_Comment Submission": "Wondering how you guys met your now-dealers? (Don't worry, I'm not trying to source)", "1_Text": "Nice, yeah that sounds like a sweet deal! I feel like a work connection will be my best bet, since I'll likely be working in a restaurant as well (once I start working, that is. I still get 2 more months paid by the government, so I probably won't start working til that's about to run out) and I feel kitchen staff are often pretty open about such things. Fingers crossed anyways. \n\nI forgot about one more minor connection I've found, and it's through a bar in the sketchiest part of town. The bartender there gets a few percs a month, but it only ends up being about 20 and I have to split them with my best friend when either of us grab from him, so it's not a very good deal lol.", "2_Subreddit": "opiates"}], "dwwmh5d": [{"0_Comment Submission": "Wondering how you guys met your now-dealers? (Don't worry, I'm not trying to source)", "1_Text": "Yeah, I've been trying that, just hanging out in the sketchiest part of town with my drug-radar up, but apart from a local bartender who sometimes gets percs, I've yet to have any luck with it :(.", "2_Subreddit": "opiates"}], "dwwmkro": [{"0_Comment Submission": "Cursing myself for the highs I've taken for granted", "1_Text": "Lol yeah, exactly! Although if I popped 9 Adderalls over the course of a day, I think I would have a heart attack. I used to love that shit in high school, but I don't think I would like it anymore. Just downers for me, thanks ;).", "2_Subreddit": "opiates"}], "dwwmlu9": [{"0_Comment Submission": "Wondering how you guys met your now-dealers? (Don't worry, I'm not trying to source)", "1_Text": "I thought the personals section still existed? I was poking around on the front page of it yesterday thinking about where to look, and I could have sworn I saw it.", "2_Subreddit": "opiates"}], "dwwmna5": [{"0_Comment Submission": "Wondering how you guys met your now-dealers? (Don't worry, I'm not trying to source)", "1_Text": "I understand avoiding junkies, and I like your approach!", "2_Subreddit": "opiates"}], "dwwmrk3": [{"0_Comment Submission": "Wondering how you guys met your now-dealers? (Don't worry, I'm not trying to source)", "1_Text": "Nice, yeah cutting the middleman out is key. That's basically where I was heading with my morphine connect before I moved (in all fairness my buddy who's detoxing in Mexico is the middleman for that connection, but he said he's going to stay clean when he gets home and be willing to send me those for a good price - I told him that's playing with fire, but he claims he's okay with this). Ughhh lol.", "2_Subreddit": "opiates"}], "dwxvtvl": [{"0_Comment Submission": "Wondering how you guys met your now-dealers? (Don't worry, I'm not trying to source)", "1_Text": "The first connection I had was a hoe, and she was the fucking worst. Like, saying \"be there in 5 minutes\" and take 40 minutes, or fuck around with where she'd be meeting me, or take beads out of the hydro morph contins I like the best. Sorry, small rant lol. Where would you recommend I try to meet a more reliable hoe? Bar?", "2_Subreddit": "opiates"}], "dwxwm9c": [{"0_Comment Submission": "I have never done any opiates. I've been browsing this sub for ~2 hours now.", "1_Text": "I remember the first time I took an oxy, I think it was a 40mg too and I think I took the whole thing. It was like 7 or 8 years ago and I was writing in my online journal (probably the last post I made, in fact) when it kicked in and I was like hooooly shit, I have to get out of the house! So I don't even know what I did, but I got up and like went for a walk in the forest or something, I was so fucked. It was wonderful, and I started getting a lot of oxys after that. Now there are only oxyneos around here though, and they're garbage. I'd love to get real oxys again.", "2_Subreddit": "opiates"}], "dwxxn9a": [{"0_Comment Submission": "I didn't have time to make a pretty pic or message but beauty is in the eye of the beholder", "1_Text": "<3<3<3<3", "2_Subreddit": "opiates"}]}], "1_submissions": [{"825zeh": [{"0_Title": "Recently tried plugging hydromorphone", "1_Text": "Hmmm, this is a good thought! Thanks, pal, I'll have to make a burner email and give this a shot. Should I make a post and try to be subtle? Honestly, one time when I was living in Montreal I saw a Craigslist post of someone who was obviously looking for meth but using sneaky words like \"we'll drink out of crystal glasses\" so I messaged her (despite my 100% disinterest in meth or any uppers these days) and we're still friends, lol. But I mean, we never helped each other get drugs, as was her hope.", "2_Subreddit": "opiates"}], "8a3p5k": [{"0_Title": "Wondering how you guys met your now-dealers? (Don't worry, I'm not trying to source)", "1_Text": "Hmmm, this is a good thought! Thanks, pal, I'll have to make a burner email and give this a shot. Should I make a post and try to be subtle? Honestly, one time when I was living in Montreal I saw a Craigslist post of someone who was obviously looking for meth but using sneaky words like \"we'll drink out of crystal glasses\" so I messaged her (despite my 100% disinterest in meth or any uppers these days) and we're still friends, lol. But I mean, we never helped each other get drugs, as was her hope.", "2_Subreddit": "opiates"}]}]}]}