{"benofthesun": [{"0_comments": [{"dwlioa3": [{"0_Comment Submission": "Best prodictive stim avalible at the moment? finishing my masters", "1_Text": "I use this frequently at work. I rotate between adrafinil and phenylpiracetam. Both are very helpful at promoting cognitive function without having a pushing stim feeling at all.", "2_Subreddit": "researchchemicals"}], "dwm58ue": [{"0_Comment Submission": "Best prodictive stim avalible at the moment? finishing my masters", "1_Text": "Yes, and that can often be frustratingly unrewarding.", "2_Subreddit": "researchchemicals"}], "dwmjcu5": [{"0_Comment Submission": "Day 1 of no drinking", "1_Text": "Alcohol, of all the drugs I've ever put in my body, was the one thing that almost destroyed my marriage, my job, and my health. Since quiting a year ago, I have lost 70 lbs, gotten off all of my many prescriptions for blood pressure, gout, acid reflux, blood sugar.\n\nIt is sssoooo worth the pain of getting past the cravings. You will enjoy your new life much more than you ever enjoyed putting that poison in your body.", "2_Subreddit": "kratom"}], "dwnukaj": [{"0_Comment Submission": "What substance has made your friends who aren't themselves in the scene (except when you share with them) the most impressed or most enjoyed it?", "1_Text": "Maybe I just use DCK differently, but I cannot imagine going to a concert on this stuff. It would have to be a pretty light dose to be able to function in a crowd at a concert.", "2_Subreddit": "researchchemicals"}], "dwnur1v": [{"0_Comment Submission": "How much 1P-LSD would be roughly equivalent to 1 blotter of early 1990's low level street LSD?", "1_Text": "I would say 125ug of 1P feels comparable to the cleanest and strongest LSD I was able to pick up after following the grateful dead for 4 years. I was typically purchasing bulk to bring back home from a very trusted source.", "2_Subreddit": "researchchemicals"}], "dwnv2jt": [{"0_Comment Submission": "Are there any good research amphetamines? I hate **CATHINONES**", "1_Text": "4-FA and 3-FA for sure. 4-FA being something with empathic quality that beats any of the fake Molly that I've had since the 90s. It's not something you should take too often. 3-FA, is far more functional, so I tend to be more fiendish with it. Unfortunately (or maybe fortunately) it begins to lose effects after a week of everyday use. 2-FA is straight up speed without euphoria. It can be very useful. I had a gram of 4-fma, but just like reports warn, the side effects kind of outweigh the benefits.", "2_Subreddit": "researchchemicals"}], "dwnv5om": [{"0_Comment Submission": "Are there any good research amphetamines? I hate **CATHINONES**", "1_Text": "I liked 3-fa far more than I expected I would. My vendor sent me 4g of 3-fa when I ordered 4-fa. I was completely bummed, but then I discovered that, like 4-fa, it ha a magic of its own. But after a week of everyday use, that magic disappears. And it starts to just feel like speed - which i am really not into.", "2_Subreddit": "researchchemicals"}], "dwqjrzi": [{"0_Comment Submission": "What substance has made your friends who aren't themselves in the scene (except when you share with them) the most impressed or most enjoyed it?", "1_Text": "That's crazy. On 50mg of DCK, with no tolerance, I would hole, and then be doing the robot walk for several more hours. That would be very unpleasant to have to navigate in a crowd. But hey, everyone is different. I shared some with a friend a month ago, and he was bouncing all over the house in an excited happy mania while I was unable to even sit up straight in my chair.", "2_Subreddit": "researchchemicals"}], "dwr5dhz": [{"0_Comment Submission": "Oh php..... How i miss you", "1_Text": "Agreed. PHP is just a security problem. I would personally recommend Angular. But that's preference. And I would NEVER snort or vape it.", "2_Subreddit": "researchchemicals"}], "dwr5tn4": [{"0_Comment Submission": "Does kratom make you horny?", "1_Text": "At first it did the opposite. Made things a little numb, which is frustrating.\n\nNow that I take lower doses <10g only a couple times per week, it definitely gives me a spontaneous chubby. Fact.", "2_Subreddit": "kratom"}], "dwt2kz0": [{"0_Comment Submission": "Most functional RC benzo / stim for you", "1_Text": "Have not tried 2-FMA. Found 2-FA to be useful, but tolerance rendered it useless within 3 days. Went from feeling a 15mg dose quite well to taking 190mg and feeling nothing. I know, it's an RC and I should know better.", "2_Subreddit": "researchchemicals"}], "dwt31zf": [{"0_Comment Submission": "What substituted amphetamine would be good for sharp confidence?", "1_Text": "3-fa has a nice balance of productivity with a little euphoria mixed in. Much less than 4-fa. That challenge I found was that it felt like a functional stim, so I treated it like one...meaning I took it daily until 4 grams were gone. In hind site, I should have had more discipline and stretched it out, instead, I shot my tolerance and didn't even really enjoy most of it. It was wonderful the first few days.  While I love 4-FA, I have more discipline. I know I shouldn't take it more than every couple weeks. It's far to heavy to do more frequently.", "2_Subreddit": "researchchemicals"}], "dwt34kz": [{"0_Comment Submission": "What substituted amphetamine would be good for sharp confidence?", "1_Text": "Interesting how mixed the reviews of 3-fpm are. I'm assuming some of the reviews saying it feels like caffeine are from bad batches?", "2_Subreddit": "researchchemicals"}], "dwtbpx4": [{"0_Comment Submission": "Most functional RC benzo / stim for you", "1_Text": "Overall, I would just say 2-FA is pretty uninteresting. I'm not personally into stims on their own. I guess I've explored the fluorinated amphetamines because 4-FA was one of the closing things I can compare to clean MDMA, though not quite. It's the only keeping in the bunch as far as I'm concerned. I say this having explored 4-fa, 4-fma, 3-fa, and 2-fa. \n\nThe only one lf the x-FMAs that I tried was 4-FMA. From what I read, it is possibly the least favorite of the FMAs. It is quite potent. 15mg was a solid stimulation, with a lot less of the euphoria of, say 80mg of 4-FA. The few times I tried it I had some weird heart pounding and uncomfortable chest feelings. Tossed the rest of the gram for my own good.", "2_Subreddit": "researchchemicals"}], "dwtdk79": [{"0_Comment Submission": "More insight on 5-MeO-MET (trip report)", "1_Text": "Has anyone tried smoked 5-meo-amt? The body load for oral dosage was always pretty big, but the quality and duration of the visuals made it worth taking...even on a backpacking trip. I won't if vaping would avoid the body load  but still provide the head space and visuals.", "2_Subreddit": "researchchemicals"}], "dwu28yz": [{"0_Comment Submission": "Tan 3 meo stronger?", "1_Text": "I think it's safe to assume we are talking about a certain vendor that has recently switched from a white 3-meo-pcp to a tan 3-meo-pcp.", "2_Subreddit": "researchchemicals"}], "dwu2ygb": [{"0_Comment Submission": "75mg | 4-CPD", "1_Text": "and?", "2_Subreddit": "researchchemicals"}], "dwuvfkw": [{"0_Comment Submission": "RC Flip", "1_Text": "I've done 125ug 1pLSD and then about 5 hours later dropped 180mg 6-APB. It was a very nice transition into the sunset and the night. Most beautiful visuals. Pink glow around everything. Looking forward to repeating on a back country trip this summer.", "2_Subreddit": "researchchemicals"}], "dwv5eby": [{"0_Comment Submission": "Getting opiates filled.", "1_Text": "I feel for you. I broke my wrist once. The first two nights were the worst. Drank every bit of alcohol in the fridge to just pass out and sleep. But the pain get's dramatically better after a couple days. You'll live. It sounds like Norco might add more problems than it will solve. I've had my time with pain meds, and they are a bitch to be hooked on.", "2_Subreddit": "opiates"}], "dwvbp22": [{"0_Comment Submission": "3-meo-pcp and clonazolam producing enjoyable delirium hallucinations", "1_Text": "I've had 3-meo-pcp produce some amazing hallucinations. Usually ethereal spirits, orbs, shapes dancing around the walls and ceiling. But it can be very unpredictable. The same dosage on another occasion can bring on a completely different experience. I prefer the smooth consistency of the now impossible to find DCK.", "2_Subreddit": "researchchemicals"}], "dwvmrj0": [{"0_Comment Submission": "1P LSD = Cupid's Arrow?", "1_Text": "Interesting. Psychedelics, especially LSD, put my sex drive into overdrive.", "2_Subreddit": "researchchemicals"}], "dwx1ile": [{"0_Comment Submission": "Hexen crystal vs powder?", "1_Text": "You are crushing it before you snort it, right? Just want to make sure. Makes a big difference it uptake and pain.", "2_Subreddit": "researchchemicals"}], "dwx1tz2": [{"0_Comment Submission": "My first Hexen experience!", "1_Text": "I guess everyone has a different experience. I found 30mg vaped in the morning and 30mg vaped around 1PM provided a nice positive day. Never did like snorting it. Would love to try the crystaline stuff that is floating around now.", "2_Subreddit": "researchchemicals"}], "dwxqexi": [{"0_Comment Submission": "Legit gone scammer?", "1_Text": "their selection is so large and includes many illegal items. Of course it's a scam. If it seems too good to be true, it probably is.", "2_Subreddit": "buyresearchchemicals"}], "dwxurdt": [{"0_Comment Submission": "Goodbye for now bros", "1_Text": "I hope you find peace some how. It sounds like you are making the right choice.", "2_Subreddit": "researchchemicals"}]}], "1_submissions": [{}]}]}