{"op0420": [{"0_comments": [{"dwnzjt1": [{"0_Comment Submission": "People who have walked out of a job in the middle of the day, what was the last straw?", "1_Text": "He got fired a few months after from a womanly complaint.", "2_Subreddit": "AskReddit"}], "dwo88qe": [{"0_Comment Submission": "105 Days Clean", "1_Text": "Congrats man that's huge. And I'm sorry about prison.. hope everything works in your favor.", "2_Subreddit": "opiates"}], "dwok6m4": [{"0_Comment Submission": "People who have walked out of a job in the middle of the day, what was the last straw?", "1_Text": "I mean I agree with you completely. Just wasn't me.", "2_Subreddit": "AskReddit"}], "dwolb81": [{"0_Comment Submission": "People who have walked out of a job in the middle of the day, what was the last straw?", "1_Text": "Yes a woman did a few months after I left and he got fired for it.", "2_Subreddit": "AskReddit"}], "dworggr": [{"0_Comment Submission": "Staying at home when i'm high as fuck feel like a waste ?", "1_Text": "Every time I'd use I'd be at home and would chill after. That was my favorite part of being high and comfortable at home.", "2_Subreddit": "opiates"}], "dwp92jh": [{"0_Comment Submission": "Depression after stopping", "1_Text": "I'm dealing with the same thing. Sounds really lame but honestly stretching and working out a little has helped me so much.. to release a few endorphins while feeling like shit just makes life a little more bearable.", "2_Subreddit": "opiates"}], "dwpp6in": [{"0_Comment Submission": "2 years", "1_Text": "Needed this. Thank you. Congrats by the way that's huge.", "2_Subreddit": "opiates"}], "dwpuz9e": [{"0_Comment Submission": "What is the largest way where people waste money?", "1_Text": "Drugs.", "2_Subreddit": "AskReddit"}], "dwq5a4t": [{"0_Comment Submission": "Advice I guess?", "1_Text": "Have the same feelings. Even weeks after full WD. My cousin said something to me that has helped, if you can remember better times and strive for that again. I guess a time before dependent. I just keep thinking I want to get back there, before I had to get high every single day.. hope this helps.", "2_Subreddit": "opiates"}], "dwq5bte": [{"0_Comment Submission": "Advice I guess?", "1_Text": "This. Even stretching has helped me.", "2_Subreddit": "opiates"}], "dwq5jiu": [{"0_Comment Submission": "I’m former NASA astronaut Nicole Stott— AMA!", "1_Text": "Why does NASA lie about aliens?", "2_Subreddit": "space"}], "dwqcfya": [{"0_Comment Submission": "What are the best anime to get a person into watching anime?", "1_Text": "Death Note.", "2_Subreddit": "AskReddit"}], "dwqcs30": [{"0_Comment Submission": "[Serious] Single redditors that struggle with depression, how much happier would you be in a relationship?", "1_Text": "I wouldn't be happier. I do better by myself and prefer my own company to another persons. Thoughts of better times helps me through my depression.", "2_Subreddit": "AskReddit"}], "dwqrfcw": [{"0_Comment Submission": "OK Reddit - What just isn't worth the effort?", "1_Text": "Women.", "2_Subreddit": "AskReddit"}], "dwqvrxc": [{"0_Comment Submission": "😪", "1_Text": "Fucking d boys.", "2_Subreddit": "opiates"}], "dwuzuln": [{"0_Comment Submission": "I hate the dope game and methadone game", "1_Text": "Last few weeks went through the full withdrawal off methadone. Feeling a lot better clean now heh.", "2_Subreddit": "opiates"}], "dwv7yag": [{"0_Comment Submission": "I hate the dope game and methadone game", "1_Text": "Yeah pretty full cold Turkey.. I was out for 2 weeks could barely do anything. Worst thing I've ever done but I feel so much better now honestly, broke the vicious cycle. I picked up smoking tree again and it has helped quite a bit.", "2_Subreddit": "opiates"}], "dwvpr7k": [{"0_Comment Submission": "Clean for a month...yet i dont know if i trust myself yet with a job.", "1_Text": "I feel you. I'm in the exact same boat. Been working out to kill the time, and nervous as well about looking for work. Guess just baby steps towards everything. When you're ready you're ready you know?", "2_Subreddit": "opiates"}], "dwvx0as": [{"0_Comment Submission": "I hate the dope game and methadone game", "1_Text": "Thank you bro seriously, I'm still trying to grasp my head around actually doing it.. just a trip. I feel you completely, after awhile h and fent didn't get me sleepy it just became part of everything. Weeds way different, and definitely substituting but it's probably for the best. There's a huge weed presence out here that would be nice to get back into. I've tried NA and honestly they didn't do it for me.. they made me want to use more because everything was too relatable.. if that makes sense. But if I can kick 90mg of methadone, you and anyone can do anything you put your mind to.", "2_Subreddit": "opiates"}], "dwvxdcl": [{"0_Comment Submission": "!!! Approaching 72 hours !!! (If you want to quit, you can. That’s the ONLY way)", "1_Text": "I kicked a fent and 90mg of methadone habit. You can do anything you put your mind to. Keep it up and congrats.", "2_Subreddit": "opiates"}], "dwxogxj": [{"0_Comment Submission": "\"Why don't you just smoke weed?\"", "1_Text": "It definitely didn't help with the real WD symptoms. But it has really helped mentally and with the depression and anxiety. Everyone is different. It's definitely a better substitute..", "2_Subreddit": "opiates"}], "dwxotl7": [{"0_Comment Submission": "I am on day 6 of cold-turkey quitting 90mg of daily methadone.", "1_Text": "Bro I did the same thing. I quit fent and 90mg of methadone and I was sick for almost 3 weeks. This week isn't too bad, still a bit restless and stomach is still fucked up, going on the 4th week. Shit is no joke. I promise you though, if you can get through this you can do anything. I'm finally starting to feel normal on the 4th week, exercising when I can to tire the body. You're lucky you're getting that much sleep, I'm only getting about 6 still.. hope this helps in some way. Keep at it, if I can do it you can do anything my man.", "2_Subreddit": "opiates"}], "dwxoxzl": [{"0_Comment Submission": "I am on day 6 of cold-turkey quitting 90mg of daily methadone.", "1_Text": "When you start feeling like you can actually stretch or do some push ups or something do them. They have helped me so much.. just stretching in those weeks helped. It sounds shitty I know but it really does help repair the receptors that have been damaged due to use. Cause of the exercise I'm not as depressed or suicidal. Works wonders for me.", "2_Subreddit": "opiates"}], "dwxr037": [{"0_Comment Submission": "What was your worst house party experience?", "1_Text": "When someone left an upper decker in the toilet.. its where they take the top off the toilet and shit in the chamber and put the lid back on. So every time you flush you get shitty water. Impossible to clean.", "2_Subreddit": "AskReddit"}], "dwxrf7l": [{"0_Comment Submission": "I hate the dope game and methadone game", "1_Text": "I mean I understand its people's lives and shit but it's so relatable and it does come off as war storyish.. I definitely over think everything so it just doesn't help me, I've gone to them and been clean that day then used after. I did man. 90mg of methadone and a pretty big fent habit on top of the methadone.. if I can kick those cold Turkey I promise you can do anything you set your mind to. Every day gets a little better it's a trip. I definitely will, and you reach out as well if you need anything. Always here for that.", "2_Subreddit": "opiates"}]}], "1_submissions": [{"4mhkqp": [{"0_Title": "Dual Boot. Linux on Mac. What Boor Manager?..", "1_Text": "He got fired a few months after from a womanly complaint.", "2_Subreddit": "computers"}], "4nruph": [{"0_Title": "Tapering and Weaning Off", "1_Text": "He got fired a few months after from a womanly complaint.", "2_Subreddit": "opiates"}], "82yw5c": [{"0_Title": "New to PA", "1_Text": "He got fired a few months after from a womanly complaint.", "2_Subreddit": "opiates"}], "83wey4": [{"0_Title": "I hate the dope game and methadone game", "1_Text": "He got fired a few months after from a womanly complaint.", "2_Subreddit": "opiates"}], "84jjxt": [{"0_Title": "Does anyone else's hands or body get like this after shots? And not miss", "1_Text": "He got fired a few months after from a womanly complaint.", "2_Subreddit": "opiates"}], "854bci": [{"0_Title": "NYC", "1_Text": "He got fired a few months after from a womanly complaint.", "2_Subreddit": "opiates"}], "88igd1": [{"0_Title": "A day at a time.", "1_Text": "He got fired a few months after from a womanly complaint.", "2_Subreddit": "opiates"}], "88ipn6": [{"0_Title": "Great Grandpa 1914", "1_Text": "He got fired a few months after from a womanly complaint.", "2_Subreddit": "OldSchoolCool"}]}]}]}