{"DirtyAngelToes": [{"0_comments": [{"dwvymjz": [{"0_Comment Submission": "Ladies: What do guys do thinking it makes them look cool, but in reality just makes them look like douches?", "1_Text": "This, especially speeding up randomly to try to scare you or because they think it's 'funny'. I've been in two major car accidents, one that resulted in brain surgery, and it's terrifying to the point I've started crying when someone did it.", "2_Subreddit": "AskReddit"}], "dwvyti1": [{"0_Comment Submission": "Doctor’s of reddit what’s the stupidest reason someone came to you for treatment/medication?", "1_Text": "Not a doctor, but I came up with what I thought were quite creative ways to get opiates when I was addicted and looking back, some of them were blatantly obvious on how much of an addict I was, even though I did suffer from chronic pain. \"Hey, doc, I broke my hand *again*, it just keeps doing that...I must have some really intense osteoporosis/arthritis going on, huh?\"", "2_Subreddit": "AskReddit"}], "dwvyymd": [{"0_Comment Submission": "What was the best nap you have ever had?", "1_Text": "I'd been suffering from a severe migraine for about a week, extreme pain, dizziness, shaking, light sensitivity, vomiting, the whole she-bang. Finally, my doctor started me on a migraine abortive pill that kicked in within about 20 minutes and knocked my ass out. I remember I slept for about 2 days straight and the feeling of intense relief I felt was indescribable. I felt so warm and happy drifting in and out of sleep.", "2_Subreddit": "AskReddit"}], "dww2g0m": [{"0_Comment Submission": "Who does NOT like Mr. Brightside by The Killers?", "1_Text": "I worked at Hot Topic for over 7 years and had to listen to them almost daily, even after they were off the player almost every new hire we'd get would be obsessed with them and want to play them while cleaning the store. NOPE.", "2_Subreddit": "AskReddit"}], "dww2w1d": [{"0_Comment Submission": "People who don't sort by new, how are you reading this post?", "1_Text": "'cause you're in rising! You made it!", "2_Subreddit": "AskReddit"}], "dww3w8l": [{"0_Comment Submission": "What was your last pathetic or shameful meal?", "1_Text": "At the height of my eating disorder I'd 'binge' on something, down a ton of water with it (each bite of something I'd drink water) so I could vomit it up easily. Not proud of it, probably some of my darkest moments.", "2_Subreddit": "AskReddit"}], "dww8l77": [{"0_Comment Submission": "What’s a story you’ve always wanted to tell?", "1_Text": "Pretty much all the stuff I post about on here are things I want to talk about IRL but can't. My life has been pretty fucking crazy, to the point where it sounds like a giant made up story even to me, so I just keep quiet and rant about it on here.", "2_Subreddit": "AskReddit"}], "dww8snp": [{"0_Comment Submission": "If you could wear a fashion style from any time era with no social repercussions, which style would you pick and why?", "1_Text": "It hurts my heart knowing that I'll never be able to comfortably glide naked to my heart's content in nature.", "2_Subreddit": "AskReddit"}], "dww8xdr": [{"0_Comment Submission": "If you could wear a fashion style from any time era with no social repercussions, which style would you pick and why?", "1_Text": "I want capes to make a fashion comeback so badly, they look so elegant and beautiful. The closest I can get are those fashion ponchos/sweaters that have been making a comeback the last few years. Life is suffering.", "2_Subreddit": "AskReddit"}], "dwwahjl": [{"0_Comment Submission": "Where were you when 9/11 happened?", "1_Text": "I was in 4th grade when teachers started freaking out, we all got walked from recess to our classrooms and we got told to stay inside at all costs and not turn on the TVs. Of course, my teacher was freaking out and turned the TV on anyway and I remember seeing the twin towers on TV getting hit but not understanding what was going on. \n\nShortly after the classroom phone started ringing nonstop, teachers were visibly freaking out because they weren't sure if this meant there'd be more attacks, but most of the students were just confused and some were crying because they were scared that adults were scared.\n\nI remember everyone's parents suddenly rushing to pick them up, my mom included, and just being excited to go home before getting in the car with my mom who was crying. My mom used to work in the World Trade Center when she was in the army and had friends that had died. She had the radio on and suddenly I realized something terrible had happened and I remember crying with my mom even though I didn't understand the full extent just yet. We got home, turned the news on, and sat in shock as we watched the towers come crashing down (I believe it was around an hour before they started falling) and news stations kept airing footage of victims jumping out of the tower to avoid the fire. \n\n17 years later and it's still upsetting to think about a lot of the footage that was released.", "2_Subreddit": "AskReddit"}], "dwwexhn": [{"0_Comment Submission": "Can the community give their input whether or not you guys think these are real?", "1_Text": "You can get a pack of testing strips for like $20. A lot of people overdosing on fent are still trying tiny amounts of their pill before taking the others but don't realize that the amount of fent could be different for each pill...it's not worth dying over, especially for just $20 or less to test them.", "2_Subreddit": "opiates"}], "dwwf5bk": [{"0_Comment Submission": "3 months off pills and miss them today. any words of encouragement would be great right now", "1_Text": "I'm going through the same thing, OP. I'm 7 months clean and suddenly had such intense cravings yesterday and today that I started crying and even started searching through the cracks of my couch in hopes of finding a pill. Definition of fiending for a pill... Definitely embarrassing and made me feel guilty as all hell because I kept trying to think of all the reasons I had to stay clean but my thoughts were racing so badly I couldn't really focus. Thankfully I've made a new rule for myself which is any time I get a craving, I tell myself I'm going to give myself 1 hour to calm down and drink some water (I'm realizing that even being hungry or thirsty can cause my body to start craving...). As for shortness of breath, opiates slow down your heart rate which is why people overdose, your brain sends a signal to stop breathing. I'd take pills at night time and wake up gasping for breath and it's finally stopped now that I'm off of them. \n\nThings are definitely better for me than they were, I've learned new coping strategies I never would have been able to use a few years ago. You'll find something that works, too. You've got this.", "2_Subreddit": "OpiatesRecovery"}], "dwwfad6": [{"0_Comment Submission": "Just need some help", "1_Text": "Instead of canceling your appointment completely, you need to talk to your doctor that's prescribing them to you and ask them to monitor you and then help you ease off of them when you're ready. I was perfectly fine when I was in pain management, it was only when I couldn't afford it and started getting them from others while not monitored that my abuse spiraled out of control. But you shouldn't deny yourself pain relief if you're suffering. However, keep in mind that pain pills increase your pain *severely*. I was bed ridden with severe pain for over a year and thought it was my lupus, only to find out that it was the pain pills causing that level of pain; I've been off of pain pills for 7 months and have had more energy and felt better than I have in over 7 years of pain pill usage because I never realized my body had healed and never gave myself the chance. It took over 3 months before I started getting energy back, you have to keep yourself busy and motivated, which is easier said than done. :/ \n\nYou've got to ultimately make the decision if you actually need the pills or if you're just using things that have happened to you in the past to keep justifying your usage. Hopefully that made some kind of sense, haha.", "2_Subreddit": "OpiatesRecovery"}], "dwwhm36": [{"0_Comment Submission": "What was the happiest moment in your life?", "1_Text": "It was the last day of a summer visit to my grandparents' house in the (very poor) countryside of Alabama; we spent the whole day hunting honey-suckle flowers to eat the honey, climbing up in walnut trees to knock down the walnuts, and also gathering branches so we could tie a string onto the end with a water balloon attached to make it look like a 'fishing pole' to fake fish in the rain. My grandparents' house had a porch with a stoop on it so we sat on the stoop with our feet hanging out in the rain and pretended to go fishing. I still remember at the time realizing that things would never be like this again and I was right; I played in the rain with my cousins for hours, splashing and running around barefoot. It finally stopped raining, the sun set, fireflies started coming out and we camped out on the front porch talking for hours with mason jars glowing and comparing all of our mosquito bites and bruises. \n\nThat whole day was the happiest moment of my life and even then I realized just how good I had it.", "2_Subreddit": "AskReddit"}], "dwwhrwq": [{"0_Comment Submission": "What is your worst experience at a hospital?", "1_Text": "I went in for help with severe pain during a lupus flare up and the nurse told staff that I was suicidal despite me never mentioning anything about it. I got turned over to the behavioral ward with no warning and spent the next 24 hours pissed and asking to speak to charge nurse for hours but had to wait overnight because she wasn't there. In the morning I got to have a face to face talk with her and she finally apologized to me after admitting that I didn't need to be there. I was released because there was nothing wrong with me and was close to suing the hospital.", "2_Subreddit": "AskReddit"}], "dwxl6wd": [{"0_Comment Submission": "Reddit, how can Kathy Griffin make a mistake, and almost have her career destroyed, but Trump can scream and rant out anything he wants, do stupid stuff, and he remains president?", "1_Text": "Are you really asking this? You can't compare a terrible comedian to the POTUS; their jobs have completely different rules when it comes to firing people. It is much, much harder to get rid of a President and it was made that way for a reason.", "2_Subreddit": "AskReddit"}], "dwxlf0p": [{"0_Comment Submission": "People who have loved or dated disabled people, how did their disability affect your relationship (positively or negatively)?", "1_Text": "Disclaimer: Just throwing it out there that I have two disabled family members that I love very, very much and would do literally anything for, but I want to hear other peoples' experiences.", "2_Subreddit": "AskReddit"}], "dwxpkha": [{"0_Comment Submission": "What are men only problems most women can't experience?", "1_Text": "This can happen to women nowadays, too, especially women that donate their eggs. A lot of women are feeling pressured to sell them for money to pay off debt or drug addiction.", "2_Subreddit": "AskReddit"}], "dwxxrw0": [{"0_Comment Submission": "When were you the bad guy in someone else’s life story?", "1_Text": "All the times I kicked teens out of my store because they were obviously trying to impress their friends by being little shitheads.", "2_Subreddit": "AskReddit"}], "dwxxu9c": [{"0_Comment Submission": "If gay people like anal with a man, why wouldnt they like anal with a woman?", "1_Text": "Because physical attraction is literally the thing that brings people together. If there's no physical attraction, you're not going to enjoy it even if your body responds.", "2_Subreddit": "AskReddit"}], "dwxxze4": [{"0_Comment Submission": "So what was going through your mind during the first time you slid a buttplug in between your cheeks?", "1_Text": "\"I wish I had a dick so I could do the butt fucking.\"", "2_Subreddit": "AskReddit"}], "dwy8l3e": [{"0_Comment Submission": "In MMT, got a false positive, need advice/info", "1_Text": "You'll be okay, OP. My mom had the same thing happen to her and they confirmed it was a fluke due to some other medication she had been taking. I know some medicines can cause false positives, are you currently taking anything else? Ask them if they'd let you take a redo, I know people who have had their urine mixed up with someone else's.", "2_Subreddit": "OpiatesRecovery"}], "dwy8tz5": [{"0_Comment Submission": "I have never done any opiates. I've been browsing this sub for ~2 hours now.", "1_Text": "I was terrified that this was going to go in a different direction; I'm extremely glad to hear that you're not giving in and trying them, I can't even begin to explain how nice it is to hear that someone is unwilling to touch them. If you ever need more reassurance that you've made the right choice, just read some of the stories over at r/opiatesrecovery, some of the things I've seen people go through to get off opiates is terrifying.", "2_Subreddit": "opiates"}], "dwybxtw": [{"0_Comment Submission": "Emotional", "1_Text": "If it makes you feel any better, I'm currently going through the same situation as you are only with my mom. She tries to be there for me but I know she refuses to believe that I'm an addict. It's hard and hurtful not having anyone to talk to about it so I've been focusing on figuring out the underlying reasons I get so upset or emotional and working on fixing it a step at a time. I'm realizing it can be for stupid reasons such as just being too anxious because I'm hungry, anxiety because I didn't do something little like brush my teeth yet, etc. Mood swings can come and go for months depending on how well we develop coping skills after getting off drugs...fucking sucks, you'd think they'd be easier to learn but they're really not IMO. :/ \n\nAll you can do is take things a step at a time; try keeping it written down when you feel like this, so you can go back and see if you have certain triggers. It may sound simple, but at the time when you're emotional, it can be almost impossible to catch everything. As for your boyfriend, explain to him that you don't need him to solve things for you, just that you need him to listen or offer you a hug. Things will get better for you, I've been making progress with my parents myself, sometimes it can just take a while and lots of in depth conversations most people don't want to have at first.", "2_Subreddit": "OpiatesRecovery"}], "dwyg4aw": [{"0_Comment Submission": "Slowly starting this journey. Anyone else with other autoimmune issues?", "1_Text": "I have lupus, so any time I'm about to start my already excruciating period, I can expect to go into a flare up with severe joint pain and fever. Last time it happened and I was hospitalized, the doctors were going to send me home with nothing and I flat out refused to leave. I'm sure I sounded crazy but I've never been so furious and some of the things that left my mouth were *brutal* but they finally prescribed me medicine and steroids. Still proud of myself for standing up for myself, it hurts knowing there are so many women out there with genuine pain that get brushed off.", "2_Subreddit": "Endo"}]}], "1_submissions": [{"82lq44": [{"0_Title": "What's the greatest way you've trolled another person on the internet?", "1_Text": "This, especially speeding up randomly to try to scare you or because they think it's 'funny'. I've been in two major car accidents, one that resulted in brain surgery, and it's terrifying to the point I've started crying when someone did it.", "2_Subreddit": "AskReddit"}], "836kbg": [{"0_Title": "Men, what's something women think men like that you absolutely hate?", "1_Text": "This, especially speeding up randomly to try to scare you or because they think it's 'funny'. I've been in two major car accidents, one that resulted in brain surgery, and it's terrifying to the point I've started crying when someone did it.", "2_Subreddit": "AskReddit"}], "83lhn7": [{"0_Title": "Short/petite people of Reddit, what's the best way to get taken seriously while being so cute?", "1_Text": "This, especially speeding up randomly to try to scare you or because they think it's 'funny'. I've been in two major car accidents, one that resulted in brain surgery, and it's terrifying to the point I've started crying when someone did it.", "2_Subreddit": "AskReddit"}], "83ytm5": [{"0_Title": "What's the most flustered you've gotten from someone flirting with you?", "1_Text": "This, especially speeding up randomly to try to scare you or because they think it's 'funny'. I've been in two major car accidents, one that resulted in brain surgery, and it's terrifying to the point I've started crying when someone did it.", "2_Subreddit": "AskReddit"}], "865snt": [{"0_Title": "[Serious]Those of you that have been through or seen severe trauma/crimes, how did you cope?", "1_Text": "This, especially speeding up randomly to try to scare you or because they think it's 'funny'. I've been in two major car accidents, one that resulted in brain surgery, and it's terrifying to the point I've started crying when someone did it.", "2_Subreddit": "AskReddit"}], "867ond": [{"0_Title": "Genuinely nice people of Reddit, what's the worst thing you've ever done that nobody knows about?", "1_Text": "This, especially speeding up randomly to try to scare you or because they think it's 'funny'. I've been in two major car accidents, one that resulted in brain surgery, and it's terrifying to the point I've started crying when someone did it.", "2_Subreddit": "AskReddit"}], "8681u6": [{"0_Title": "What are some things you finally 'understand now that you're older' like your parents always told you?", "1_Text": "This, especially speeding up randomly to try to scare you or because they think it's 'funny'. I've been in two major car accidents, one that resulted in brain surgery, and it's terrifying to the point I've started crying when someone did it.", "2_Subreddit": "AskReddit"}], "86f78q": [{"0_Title": "[Serious]People that are legally not allowed to drive, either due to health or not, how do you get around?", "1_Text": "This, especially speeding up randomly to try to scare you or because they think it's 'funny'. I've been in two major car accidents, one that resulted in brain surgery, and it's terrifying to the point I've started crying when someone did it.", "2_Subreddit": "AskReddit"}], "87fmpd": [{"0_Title": "My parents don't realize that the only thing I want from them is for them to tell me everything will be okay, even if it's a lie.", "1_Text": "This, especially speeding up randomly to try to scare you or because they think it's 'funny'. I've been in two major car accidents, one that resulted in brain surgery, and it's terrifying to the point I've started crying when someone did it.", "2_Subreddit": "depression"}], "87vjw1": [{"0_Title": "What's the most intimate glimpse you've gotten into someone else's life (stranger or not)?", "1_Text": "This, especially speeding up randomly to try to scare you or because they think it's 'funny'. I've been in two major car accidents, one that resulted in brain surgery, and it's terrifying to the point I've started crying when someone did it.", "2_Subreddit": "AskReddit"}], "88web8": [{"0_Title": "People of Reddit with anger issues, when did you realize you might have a problem dealing with it?", "1_Text": "This, especially speeding up randomly to try to scare you or because they think it's 'funny'. I've been in two major car accidents, one that resulted in brain surgery, and it's terrifying to the point I've started crying when someone did it.", "2_Subreddit": "AskReddit"}], "8974lu": [{"0_Title": "I'd rather have another brain surgery than go through opiate withdrawal again.", "1_Text": "This, especially speeding up randomly to try to scare you or because they think it's 'funny'. I've been in two major car accidents, one that resulted in brain surgery, and it's terrifying to the point I've started crying when someone did it.", "2_Subreddit": "OpiatesRecovery"}], "899m6p": [{"0_Title": "You can suddenly check any one person's internet browsing history; whose do you look at and why?", "1_Text": "This, especially speeding up randomly to try to scare you or because they think it's 'funny'. I've been in two major car accidents, one that resulted in brain surgery, and it's terrifying to the point I've started crying when someone did it.", "2_Subreddit": "AskReddit"}], "89gkfx": [{"0_Title": "What are some major ways that internet culture has changed and evolved over the last decade?", "1_Text": "This, especially speeding up randomly to try to scare you or because they think it's 'funny'. I've been in two major car accidents, one that resulted in brain surgery, and it's terrifying to the point I've started crying when someone did it.", "2_Subreddit": "AskReddit"}], "89map8": [{"0_Title": "Redditors around the world that grew up poor, what did a normal meal consist of for you?", "1_Text": "This, especially speeding up randomly to try to scare you or because they think it's 'funny'. I've been in two major car accidents, one that resulted in brain surgery, and it's terrifying to the point I've started crying when someone did it.", "2_Subreddit": "AskReddit"}], "89mbub": [{"0_Title": "Besides retail, what is a job that everyone should have to experience at least once in their lifetime?", "1_Text": "This, especially speeding up randomly to try to scare you or because they think it's 'funny'. I've been in two major car accidents, one that resulted in brain surgery, and it's terrifying to the point I've started crying when someone did it.", "2_Subreddit": "AskReddit"}], "89mfqe": [{"0_Title": "What was something seemingly harmless you grew up around that you now realize was NOT normal after all?", "1_Text": "This, especially speeding up randomly to try to scare you or because they think it's 'funny'. I've been in two major car accidents, one that resulted in brain surgery, and it's terrifying to the point I've started crying when someone did it.", "2_Subreddit": "AskReddit"}], "89n6eg": [{"0_Title": "People with physical disabilities, what's the most awkward or funny situation you've been in because someone wasn't used to your disability?", "1_Text": "This, especially speeding up randomly to try to scare you or because they think it's 'funny'. I've been in two major car accidents, one that resulted in brain surgery, and it's terrifying to the point I've started crying when someone did it.", "2_Subreddit": "AskReddit"}], "89ugrj": [{"0_Title": "Redditors that started going by a new name, legally or not, what made you want to change it?", "1_Text": "This, especially speeding up randomly to try to scare you or because they think it's 'funny'. I've been in two major car accidents, one that resulted in brain surgery, and it's terrifying to the point I've started crying when someone did it.", "2_Subreddit": "AskReddit"}], "89vx50": [{"0_Title": "When was the moment you realized things would never go back to how they once were?", "1_Text": "This, especially speeding up randomly to try to scare you or because they think it's 'funny'. I've been in two major car accidents, one that resulted in brain surgery, and it's terrifying to the point I've started crying when someone did it.", "2_Subreddit": "AskReddit"}], "8a6gyv": [{"0_Title": "If you could wear a fashion style from any time era with no social repercussions, which style would you pick and why?", "1_Text": "This, especially speeding up randomly to try to scare you or because they think it's 'funny'. I've been in two major car accidents, one that resulted in brain surgery, and it's terrifying to the point I've started crying when someone did it.", "2_Subreddit": "AskReddit"}], "8a6nyb": [{"0_Title": "What did you grow up hating before getting older and realizing it's actually cool as heck?", "1_Text": "This, especially speeding up randomly to try to scare you or because they think it's 'funny'. I've been in two major car accidents, one that resulted in brain surgery, and it's terrifying to the point I've started crying when someone did it.", "2_Subreddit": "AskReddit"}], "8a7mvd": [{"0_Title": "Liars of Reddit, what's the biggest lie you've been able to keep up?", "1_Text": "This, especially speeding up randomly to try to scare you or because they think it's 'funny'. I've been in two major car accidents, one that resulted in brain surgery, and it's terrifying to the point I've started crying when someone did it.", "2_Subreddit": "AskReddit"}], "8adcdi": [{"0_Title": "What's the best thing you've managed to prove someone wrong on?", "1_Text": "This, especially speeding up randomly to try to scare you or because they think it's 'funny'. I've been in two major car accidents, one that resulted in brain surgery, and it's terrifying to the point I've started crying when someone did it.", "2_Subreddit": "AskReddit"}], "8ae5hc": [{"0_Title": "Who is someone from history that doesn't get enough credit for their contributions?", "1_Text": "This, especially speeding up randomly to try to scare you or because they think it's 'funny'. I've been in two major car accidents, one that resulted in brain surgery, and it's terrifying to the point I've started crying when someone did it.", "2_Subreddit": "AskReddit"}]}]}]}