{"Jjmb5": [{"0_comments": [{"drf8q0m": [{"0_Comment Submission": "My newest guitar", "1_Text": "Ec-401 v, i love it, i actually had a black ec1000 in my hand ready to buy, i walked past this one and ive always wanted a gold top so i had to play it before i left and 20 mins later i was leaving the store with it", "2_Subreddit": "guitars"}], "drf8sn2": [{"0_Comment Submission": "My newest guitar", "1_Text": "Thanks, i love it. I think next up is an american strat, ive always wanted one", "2_Subreddit": "guitars"}], "drf8vcu": [{"0_Comment Submission": "My newest guitar", "1_Text": "36th anniversary pafs", "2_Subreddit": "guitars"}], "dthm7ek": [{"0_Comment Submission": "i have been addicted to Codeine on/off for a while and today i took a higher dose and it really brought back my happiness briefly, any advice i am only 19?!", "1_Text": "The older you get and the longer you use, the harder it will be to stop. Mostly speaking from personal experience, but from friends who were users as well have agreed that when it comes to opiates, there is no \"a little bit\". Youll be able to control it until you can't and then its balls to the wall, using every day, stealing from friends, family, wherever, lying. Its a long, shitty road to go down, and very rarely do you get to just walk away consequence free. Youre gonna do what you want at the end of the day, but take it from people who have been there, quit while youre ahead before you end up pawning all your shit for pills or dope and destroying most if not all of your relationships", "2_Subreddit": "OpiatesRecovery"}], "dthmp2l": [{"0_Comment Submission": "What are/were your biggest triggers??", "1_Text": "My biggest trigger at first was going through a rough time. I got so used to numbing myself through any rough patches, that i forgot how i was supposed to feel/handle things. Its gotten way better. I dont have too many cravings to use nowadays, but when i do its mostly out of boredom. Sure watching a movie is fine, but watching a movie while high is better. So when im having a rough week, i just try and stay busy", "2_Subreddit": "OpiatesRecovery"}], "dthn5t6": [{"0_Comment Submission": "What are/were your biggest triggers??", "1_Text": "Relapsing sucks, but that guilt after is a good feeling, makes you feel like you know what it is that you want. So many times i relapsed and felt fine after and within weeks i was back to getting fucked up every day", "2_Subreddit": "OpiatesRecovery"}], "dthxb3m": [{"0_Comment Submission": "What are/were your biggest triggers??", "1_Text": "You know whats wild too bro, obviously withdrawal can be horrible, ive personally always found the mental to be far worse and longet lasting than the physical, but lets say the worst of the physical part is over in a week. Us addicts will prolong quitting and put ourselves through absolute hell for years to avoid a week of suffering. But honestly, thats awesome that youre feeling that way, youre never truly in the clear, or at least i havent felt like i am, but that realization thst you just cant keep living this way is the biggest hurdle", "2_Subreddit": "OpiatesRecovery"}], "dtzedrm": [{"0_Comment Submission": "So, we're posting our burnt finishes?", "1_Text": "Wasnt sure how id feel but i love this", "2_Subreddit": "guitars"}], "dugzjfc": [{"0_Comment Submission": "Back at day 1", "1_Text": "Thank you. I know, its gonna be tough, it always is. Just not worth it. Hoping ill be more successful this go around", "2_Subreddit": "OpiatesRecovery"}], "duh03tt": [{"0_Comment Submission": "Back at day 1", "1_Text": "I appreciate it", "2_Subreddit": "OpiatesRecovery"}], "dui6oyq": [{"0_Comment Submission": "Back at day 1", "1_Text": "Thank you i appreciate your kind words. Moving forward i have to remember i have a strong support system both at home and on here", "2_Subreddit": "OpiatesRecovery"}], "dui6sa9": [{"0_Comment Submission": "Back at day 1", "1_Text": "Thank you, you too. You got this and remember, you are not as alone in this as you feel.", "2_Subreddit": "OpiatesRecovery"}], "dui6tz3": [{"0_Comment Submission": "Back at day 1", "1_Text": "Thank you", "2_Subreddit": "OpiatesRecovery"}], "dui7c91": [{"0_Comment Submission": "Back at day 1", "1_Text": "Thank you. Its shitty, hes the truest friend ive had in years besides my wife, but the extent of her drug use was pot like 10 years ago, so as much as she tries to understand, she doesn't. My friend and i leaned on each other when we had bad days. But i have too much to lose by getting back into it. I will honor my friend by staying clean and living the best life i can for the both of us", "2_Subreddit": "OpiatesRecovery"}], "dui8iwp": [{"0_Comment Submission": "Back at day 1", "1_Text": "Thank you. Ive been a musician for about 15 years now, and during my 8 month stretch of sobriety i found myself picking up my guitar or drumsticks every day for at least an hour. We were writing music together, him being a singer and i was taking care of the music part. Think im gonna keep working on our stuff, hit some open mic or jam nights. Do something i really love as much as possible", "2_Subreddit": "OpiatesRecovery"}], "dulbusf": [{"0_Comment Submission": "My Cort CR200. Looks so cool without the pick guard.", "1_Text": "Hell yeah, i love pickguard-less les paul body styles. I have a black les paul, i took the pickguard off, got an all black humbucker in the neck and a zebra in the bridge, i gotta change my pants every time i look at it", "2_Subreddit": "guitars"}], "duxlr7b": [{"0_Comment Submission": "This thing outside of my school", "1_Text": "That's a ductile iron pipe going into some kind of fitting being held by a retaining gland. These are typically used for water mains. Not sure why its above ground like that though. Perhaps a vent since it has that cover on it\n\nEdit: if there was another building where that is, its possible that main fed into a machine room for heating and cooling", "2_Subreddit": "whatisthisthing"}], "duxovxk": [{"0_Comment Submission": "This thing outside of my school", "1_Text": "I think youre right, u.s pipe makes these, the rim is colored white for water and brown/red for sewer. Cant tell for sure but i think its brown/red at the rim", "2_Subreddit": "whatisthisthing"}], "dvfd60x": [{"0_Comment Submission": "Favorite brand?", "1_Text": "I love the classic Gibson and fender designs but lately my favorite is esp. I have an esp and an ltd eclipse and i love everything about them", "2_Subreddit": "guitars"}], "dvrrenn": [{"0_Comment Submission": "I lost two friends this week to OD", "1_Text": "So sorry to hear, i understand what your feeling, one of my best friends OD'd a month ago after being clean for a bit. Its shitty and you always feel like theres more you couldve done, but you cant beat yourself up over it. Stay strong my dude", "2_Subreddit": "OpiatesRecovery"}], "dw2b7uf": [{"0_Comment Submission": "Katana 100 or Peavey 6505 + combo", "1_Text": "I have a blackstar ht-5, i absolutely love it. I also have a vox nighttrain which has a really good classic rock tone", "2_Subreddit": "guitars"}], "dwa029c": [{"0_Comment Submission": "Applying epoxy coating to a factory floor", "1_Text": "I did this shit for 3 1/2 years i know exactly what youre talking about. Worked with a 59 year old who had been doing it for 20 years and its awful to see what all the solvents and epoxy does to your mind and body. Were doing a flake system in a bathroom on the walls, he brings us a mix, comes running in about 5 mins later yelling about how its only the base", "2_Subreddit": "interestingasfuck"}], "dwi08t0": [{"0_Comment Submission": "Looking for a new solid state or valve amp that both suits my gig and apartment needs, as well as my tastes, with a 300$ budget on the used market.", "1_Text": "I have a vox night train 15 and its my favorite amp ive ever owned. It has a great 70s rock sound to it and it also does a good modern sound.", "2_Subreddit": "GuitarAmps"}], "dwivhmr": [{"0_Comment Submission": "Looking for a new solid state or valve amp that both suits my gig and apartment needs, as well as my tastes, with a 300$ budget on the used market.", "1_Text": "I love it's clean channel. It has like a built in volume boost, and reverb, i think the reverb is really nice. I use a fuzz, a tube screamer, and a ehx canyon, it takes the pedals well. I think it's a really versatile amp and i havent heard a bad tone. Based off of tones you like, im a huge neil young fan and play a lot of his stuff, and i can get a tone fairly identical to brown sugar(zz top) without pedals", "2_Subreddit": "GuitarAmps"}], "dwrgfr8": [{"0_Comment Submission": "Why shouldn't I develop a heroin habit?", "1_Text": "My best friend OD'd and died a little over a month ago. No one is immune. Youre an adult and can do whatever you want, but thats why you shouldn't. Its fucking scary that every time i picked up i knew it could be the last thing i ever did and it still didn't deter me from using.", "2_Subreddit": "opiates"}]}], "1_submissions": [{"6p2as9": [{"0_Title": "Struggling", "1_Text": "Ec-401 v, i love it, i actually had a black ec1000 in my hand ready to buy, i walked past this one and ive always wanted a gold top so i had to play it before i left and 20 mins later i was leaving the store with it", "2_Subreddit": "OpiatesRecovery"}], "6p2w91": [{"0_Title": "The reason you quit?", "1_Text": "Ec-401 v, i love it, i actually had a black ec1000 in my hand ready to buy, i walked past this one and ive always wanted a gold top so i had to play it before i left and 20 mins later i was leaving the store with it", "2_Subreddit": "OpiatesRecovery"}], "6pkvar": [{"0_Title": "Just wanted to say....", "1_Text": "Ec-401 v, i love it, i actually had a black ec1000 in my hand ready to buy, i walked past this one and ive always wanted a gold top so i had to play it before i left and 20 mins later i was leaving the store with it", "2_Subreddit": "OpiatesRecovery"}], "6taxc5": [{"0_Title": "Thinking about reading the books", "1_Text": "Ec-401 v, i love it, i actually had a black ec1000 in my hand ready to buy, i walked past this one and ive always wanted a gold top so i had to play it before i left and 20 mins later i was leaving the store with it", "2_Subreddit": "gameofthrones"}], "7arod9": [{"0_Title": "Bronx,NY", "1_Text": "Ec-401 v, i love it, i actually had a black ec1000 in my hand ready to buy, i walked past this one and ive always wanted a gold top so i had to play it before i left and 20 mins later i was leaving the store with it", "2_Subreddit": "whatsthisbug"}], "7kglhs": [{"0_Title": "My newest guitar", "1_Text": "Ec-401 v, i love it, i actually had a black ec1000 in my hand ready to buy, i walked past this one and ive always wanted a gold top so i had to play it before i left and 20 mins later i was leaving the store with it", "2_Subreddit": "guitars"}], "7yizvj": [{"0_Title": "Back at day 1", "1_Text": "Ec-401 v, i love it, i actually had a black ec1000 in my hand ready to buy, i walked past this one and ive always wanted a gold top so i had to play it before i left and 20 mins later i was leaving the store with it", "2_Subreddit": "OpiatesRecovery"}]}]}]}