{"needtopass00": [{"0_comments": [{"dvy0ohm": [{"0_Comment Submission": "friend gave me these, didn't give name just 10mg each he says. How/When do I take them?", "1_Text": "You're tripping my dude methadone will rock your world if you take the right dose.  I went to a methadone clinic for years and got high daily.  I've taken some as recently as a year ago and they still fuck me up solid.\n\nOP if you have zero tolerance to opiates I would break one of those quarters in half and take it.  It takes over an hour for methadone to kick in so don't take more fifteen minutes later thinking it didn't work.   If you have a tolerance then it's up to how much H or oxy you take daily.   I was taking about 100 mgs of oxy/day and 40 mgs of methadone would get me right.", "2_Subreddit": "opiates"}], "dw83146": [{"0_Comment Submission": "Good morning world, I been doin good saving shit for the next day. next mission making the squad breakfast, before we start the day. Am I the only one that can eat and do white?", "1_Text": "If you take pills you want an empty stomach.  Common sense move right there.  Hell that's probably the only reason I'm not overweight.  I don't take pills until after my 9-5 and I won't eat until I've been high at least an hour (I also feel it can take away from the high but if you eat on the very beginning of the comedown it can revive a high).\n\nSo basically for years I've not eaten much, if anything, throughout the day in anticipation of a good high.", "2_Subreddit": "opiates"}], "dw83je3": [{"0_Comment Submission": "DAE feel like we are using opiates because we have been blocked off from our real purpose in life?", "1_Text": "I used to think like you and then I got clean for 4 years.  During this time I finished my college degree, met my wife, got a well paying job, and had a kid.  Around the time my son was born I started chipping and we know what happens from there.\n\nI still have my job but I am on my literal last leg with my wife and kid.  I came clean about my use for probably the third or fourth time with my wife yesterday.  It doesn't matter what you have opiates will always have that place in your heart.  I have a choice right now, I can keep doing opiates or I can keep my family.  I'm going to try to keep my family.\n\nMost people trying to quit will tell you how much they hate opiates and how awful they are..   I don't feel that way.  I love them and wish there was a place for them in my life but I clearly don't have the self control to use them responsibly.   They are too financially draining and they dull your emotions and sex drive.  No human should live their life addicted to opiates.  I've been physically addicted for about 10 of the almost 32 years I've been alive.  As someone who has been on both sides of the fence multiple times the clean life is more fulfilling.  I haven't tried it with my wife and kid in tow yet but I cant imagine the emotion my lil dude is going to bring me when I get back to normal (I'm on day 3 now).  He's 2 and although I have been a solid provider I haven't been much of an interacter.  Looking to change that.  \n\nJust know opiates will always have a pull on you.  You may find a flame that burns hotter for a bit but the opiates flame is steady and bright.  It never goes out I don't think.", "2_Subreddit": "opiates"}], "dw83uy3": [{"0_Comment Submission": "Ain’t refill day the best y’all!?! Currently feeling damn good.", "1_Text": "And they give you some 7.5 percs for that lmao. Nigga u should be getting roxy 30s for all that shit.", "2_Subreddit": "opiates"}], "dw87mbl": [{"0_Comment Submission": "What’s the most disgusting thing you’ve ever done in your life? (NSFW)", "1_Text": "I shit in a car wash drain bc the exterior bathroom at a gas station was locked and I didn't have time to make it to the clerk to get the key.  Car wash was 10 feet away.  Quickly (I mean VERY quickly) pulled my car into the stall, opened driver and passenger door for view blockage, ripped off shirt and held up to block view from exposed side number 3.   As soon as I had my setup in place EXPLOSIVE diarrhea goes down the drains.   Use shirt to wipe ass and throw in trash.   Drop $1.25 in the car wash to rinse the damn floor.  Head to the doctor that I was originally going to for stomach problems in the first place, now shirtless.\n\nThere is a whole other story to that day that makes it possibly the most memorable day of my life but that's one for another time.  All I can say is shitting in the car wash is a valid option if you're desperate.  It can be done.", "2_Subreddit": "AskReddit"}], "dw87p47": [{"0_Comment Submission": "Just ignore my son, like I do.", "1_Text": "Honestly tho it's better than I expected when you see the face associated with it.", "2_Subreddit": "trashy"}], "dw8d4ub": [{"0_Comment Submission": "DAE feel like we are using opiates because we have been blocked off from our real purpose in life?", "1_Text": "Had a scare where I thought I may have some twins.  Slept with a taken woman and she ended up pregnant soon afterwards.   Turned out to not be mine but I was a total loser at the time and when I heard she was pregnant I knew I had to get my shit in gear just in case they were mine.   Heard they were twins and really kicked recovery into high gear.  Had been using for so long I enjoyed the clean life.  Excelled at school and work but then I thought I could fuck around, it bit me in the ass.", "2_Subreddit": "opiates"}], "dwbj02b": [{"0_Comment Submission": "Yum", "1_Text": "I got a bunch of fakes like these a few months ago.  Couldn't believe someone would waste their time pressing tabs.", "2_Subreddit": "opiates"}], "dwc2zh5": [{"0_Comment Submission": "Yum", "1_Text": "They made me sick as a motherfucker.  Idk what was in it but it wasn't opiates(no pinpoint pupils).  I was very skeptical too bc I had thought I had gotten fakes from this source before (took 12 tab tens and didn't get high, but didn't get sick).  I looked at them very closely and decided they were legit.  Fucking thought I was going to die I got so sick.\n\nThere were some M523 percs made out of the same shit that I got through another middle but from the same source I later discovered.   I heard some people went to the hospital over them but I don't know what became of it.   I would like to find out what was in them.\n\nThe second time it happened I took 9 of the fake percs (inspected them very closely, even holding them up to my phone with a pic of a 523 pulled up and STILL fell for these motherfuckers!).  My wife and I were about to drive back to our family's house 4 hours away with the kid.   I copped these and was throwing my guts up within an hour.  Left to \"go to the store\" and come back deathly ill.. not suspicious at all.  \n\nAnyways.. tell her to take the kid and go and I will be behind them in my truck shortly (we typically drive separately as we have a lot of people to see when we go home) but I just laid there and wondered if I would die or not.  It fucking sucked so bad and I would only wish that feeling on one person.. the motherfucker dealing these pills.\n\nYou can check my post history I posted about it when it was happening bc I was legit worried about dying.   I was hiding my addiction (I recently came clean) and didn't wanna go to the doc.  Very scary experience and I feel so stupid for going through it twice!  I'm hoping to stay clean now but yeah be careful this was in rural middle America.  Shit can happen anywhere!", "2_Subreddit": "opiates"}], "dwc3ftb": [{"0_Comment Submission": "Yum", "1_Text": "The first ones I got I agree on all that.  The second set of fakes I got (which were m523 perc 10s) were fuckin pristine.   I had these little bitches right up to a google image on my phone.  Broke one and tasted one.  I thought the taste was a little off but everything else was so dead on I fell for that shit again!  bro I used to think I was a pill connoisseur and this just made me feel like I went back to pillhead preschool.  \n\nI'm too old for this game anymore... I don't have the sack i used to to stand up for myself and my money and I got too much to lose (which is the main reason for not taking shit to the next level when I need to!! Not worth it for me!)", "2_Subreddit": "opiates"}], "dwdan2d": [{"0_Comment Submission": "Yum", "1_Text": "I'm just glad the ones I took didn't have fent or I'd be dead.  I wish I knew what was in them.", "2_Subreddit": "opiates"}], "dwfqf1z": [{"0_Comment Submission": "Running doesn't get you high.", "1_Text": "I ran track and cross country in high school and I don't think you can get runner's high from a 3 mile run.  We ran 3 miles every morning and I've never experienced it.  \n\nI believe this is something that even marathon runners have a hard time achieving and that's 26 miles.", "2_Subreddit": "opiates"}], "dwfz8c4": [{"0_Comment Submission": "Good day", "1_Text": "They're saying it's the best far cry to date.   To me there has been no improvement since 3 so hopefully they're right.  I won't pay $60 for a game these days tho.  Steam has ruined me on that.", "2_Subreddit": "opiates"}], "dwmlc2a": [{"0_Comment Submission": "Anatomy of a dope fiend (original artwork)", "1_Text": "You're not stealing bc you're high on opiates.  You're stealing bc you're sober and you need to be high.", "2_Subreddit": "opiates"}], "dwp73h5": [{"0_Comment Submission": "I’m sick and tired of this, and nobody wants to help me. I’m a grown ass man and I’m crying right now.", "1_Text": "This OP.  This is your quickest route to anything that resembles relief.  It is worth the effort to get your hands on loperamide as it helps many withdrawal symptoms, not just diarrhea.", "2_Subreddit": "opiates"}], "dwp7h29": [{"0_Comment Submission": "First time with oxycodone, probably won’t feel much but still excited :)", "1_Text": "The same could be said about your existence but no one is complaining.", "2_Subreddit": "opiates"}], "dwp8xvu": [{"0_Comment Submission": "Do you guys think I passed my drug test?", "1_Text": "Idk about the alcohol but you are money on the heroin.  9 days is more than enough.", "2_Subreddit": "opiates"}], "dwq72ee": [{"0_Comment Submission": "Do you guys think I passed my drug test?", "1_Text": "I've taken a shit load of drug tests.  It just depends on how your system is running at the time...  I don't think you have to worry about anything past 5 days.", "2_Subreddit": "opiates"}], "dwqnzjf": [{"0_Comment Submission": "IV use is not for everyone", "1_Text": "I have a healthy habit and have shot up three times in 12 years.  It's not everyone's cup of tea my man.  I hit myself with dilaudid maybe a month ago and I'm back to eating pills.  I've IV'd oxy and I've IV'd meth.. just like OP I don't like sticking myself and I don't like the bruising.  It's not worth it for me.\n\nSome people (even those with habits) don't like it.", "2_Subreddit": "opiates"}], "dwqp032": [{"0_Comment Submission": "Please help! Methadone levels cut, counselor not taking responsibility or helping resolve my problem.", "1_Text": "Just curious but what would calling OSHA do for you?  I'm an occupational health and safety professional and this is not their territory.  Unless it is your workplace putting you in danger, OSHA is not the agency to call.", "2_Subreddit": "opiates"}], "dwqpou6": [{"0_Comment Submission": "Please help! Methadone levels cut, counselor not taking responsibility or helping resolve my problem.", "1_Text": "You would contact the DEA not OSHA.", "2_Subreddit": "opiates"}], "dwrhoqa": [{"0_Comment Submission": "I was delivering pizzas in the rain at 2 am and thought this alleyway looked cool", "1_Text": "Lmao thanks for that.   Cracked my shit up.", "2_Subreddit": "pics"}], "dwrhvw8": [{"0_Comment Submission": "I was delivering pizzas in the rain at 2 am and thought this alleyway looked cool", "1_Text": "Man.  I've pissed in public so many times too.  Right in the middle of fucking old town Pasadena one night.  I always kinda thought those sex offender for pissing in public stories were bogus.  I'd probably just move straight to the hardcore criminal life if I caught a charge like that no lie.  Forget that noise!", "2_Subreddit": "pics"}], "dwrmp88": [{"0_Comment Submission": "I was delivering pizzas in the rain at 2 am and thought this alleyway looked cool", "1_Text": "I'm pretty sure you can look up the charge on those watchdog websites and tell pretty quickly they're lying about pissing in public.", "2_Subreddit": "pics"}], "dwru4jh": [{"0_Comment Submission": "I was delivering pizzas in the rain at 2 am and thought this alleyway looked cool", "1_Text": "I've seen it.  There are a bunch of scam websites but I have looked at specific charges of people in my neighborhood.   It's familywatchdog.us\n\nI'm on there right now looking at people's charges in my town.  Rape - Second Degree..  \"Well man, I don't think the peeing in public story is gonna fly anymore.\"", "2_Subreddit": "pics"}]}], "1_submissions": [{"6n403z": [{"0_Title": "E794 Opana", "1_Text": "You're tripping my dude methadone will rock your world if you take the right dose.  I went to a methadone clinic for years and got high daily.  I've taken some as recently as a year ago and they still fuck me up solid.\n\nOP if you have zero tolerance to opiates I would break one of those quarters in half and take it.  It takes over an hour for methadone to kick in so don't take more fifteen minutes later thinking it didn't work.   If you have a tolerance then it's up to how much H or oxy you take daily.   I was taking about 100 mgs of oxy/day and 40 mgs of methadone would get me right.", "2_Subreddit": "opiates"}], "6nj154": [{"0_Title": "Opana withdrawals?", "1_Text": "You're tripping my dude methadone will rock your world if you take the right dose.  I went to a methadone clinic for years and got high daily.  I've taken some as recently as a year ago and they still fuck me up solid.\n\nOP if you have zero tolerance to opiates I would break one of those quarters in half and take it.  It takes over an hour for methadone to kick in so don't take more fifteen minutes later thinking it didn't work.   If you have a tolerance then it's up to how much H or oxy you take daily.   I was taking about 100 mgs of oxy/day and 40 mgs of methadone would get me right.", "2_Subreddit": "opiates"}], "6o1yno": [{"0_Title": "15x 7.5 hydrocodone for 2 molar extractions", "1_Text": "You're tripping my dude methadone will rock your world if you take the right dose.  I went to a methadone clinic for years and got high daily.  I've taken some as recently as a year ago and they still fuck me up solid.\n\nOP if you have zero tolerance to opiates I would break one of those quarters in half and take it.  It takes over an hour for methadone to kick in so don't take more fifteen minutes later thinking it didn't work.   If you have a tolerance then it's up to how much H or oxy you take daily.   I was taking about 100 mgs of oxy/day and 40 mgs of methadone would get me right.", "2_Subreddit": "opiates"}], "6oft3n": [{"0_Title": "How much can you overdraw a chase checking account?", "1_Text": "You're tripping my dude methadone will rock your world if you take the right dose.  I went to a methadone clinic for years and got high daily.  I've taken some as recently as a year ago and they still fuck me up solid.\n\nOP if you have zero tolerance to opiates I would break one of those quarters in half and take it.  It takes over an hour for methadone to kick in so don't take more fifteen minutes later thinking it didn't work.   If you have a tolerance then it's up to how much H or oxy you take daily.   I was taking about 100 mgs of oxy/day and 40 mgs of methadone would get me right.", "2_Subreddit": "opiates"}], "6pdk17": [{"0_Title": "Lope is better than kratom", "1_Text": "You're tripping my dude methadone will rock your world if you take the right dose.  I went to a methadone clinic for years and got high daily.  I've taken some as recently as a year ago and they still fuck me up solid.\n\nOP if you have zero tolerance to opiates I would break one of those quarters in half and take it.  It takes over an hour for methadone to kick in so don't take more fifteen minutes later thinking it didn't work.   If you have a tolerance then it's up to how much H or oxy you take daily.   I was taking about 100 mgs of oxy/day and 40 mgs of methadone would get me right.", "2_Subreddit": "opiates"}], "6qt1ng": [{"0_Title": "Clear liquid running from nose??", "1_Text": "You're tripping my dude methadone will rock your world if you take the right dose.  I went to a methadone clinic for years and got high daily.  I've taken some as recently as a year ago and they still fuck me up solid.\n\nOP if you have zero tolerance to opiates I would break one of those quarters in half and take it.  It takes over an hour for methadone to kick in so don't take more fifteen minutes later thinking it didn't work.   If you have a tolerance then it's up to how much H or oxy you take daily.   I was taking about 100 mgs of oxy/day and 40 mgs of methadone would get me right.", "2_Subreddit": "AskDocs"}], "6s1gu3": [{"0_Title": "Morphine Dose and Price", "1_Text": "You're tripping my dude methadone will rock your world if you take the right dose.  I went to a methadone clinic for years and got high daily.  I've taken some as recently as a year ago and they still fuck me up solid.\n\nOP if you have zero tolerance to opiates I would break one of those quarters in half and take it.  It takes over an hour for methadone to kick in so don't take more fifteen minutes later thinking it didn't work.   If you have a tolerance then it's up to how much H or oxy you take daily.   I was taking about 100 mgs of oxy/day and 40 mgs of methadone would get me right.", "2_Subreddit": "opiates"}], "6svkwg": [{"0_Title": "Day 3 Problems", "1_Text": "You're tripping my dude methadone will rock your world if you take the right dose.  I went to a methadone clinic for years and got high daily.  I've taken some as recently as a year ago and they still fuck me up solid.\n\nOP if you have zero tolerance to opiates I would break one of those quarters in half and take it.  It takes over an hour for methadone to kick in so don't take more fifteen minutes later thinking it didn't work.   If you have a tolerance then it's up to how much H or oxy you take daily.   I was taking about 100 mgs of oxy/day and 40 mgs of methadone would get me right.", "2_Subreddit": "opiates"}], "6x62mx": [{"0_Title": "6 Days", "1_Text": "You're tripping my dude methadone will rock your world if you take the right dose.  I went to a methadone clinic for years and got high daily.  I've taken some as recently as a year ago and they still fuck me up solid.\n\nOP if you have zero tolerance to opiates I would break one of those quarters in half and take it.  It takes over an hour for methadone to kick in so don't take more fifteen minutes later thinking it didn't work.   If you have a tolerance then it's up to how much H or oxy you take daily.   I was taking about 100 mgs of oxy/day and 40 mgs of methadone would get me right.", "2_Subreddit": "opiates"}], "741bsn": [{"0_Title": "Still battling the beast (shitpost)", "1_Text": "You're tripping my dude methadone will rock your world if you take the right dose.  I went to a methadone clinic for years and got high daily.  I've taken some as recently as a year ago and they still fuck me up solid.\n\nOP if you have zero tolerance to opiates I would break one of those quarters in half and take it.  It takes over an hour for methadone to kick in so don't take more fifteen minutes later thinking it didn't work.   If you have a tolerance then it's up to how much H or oxy you take daily.   I was taking about 100 mgs of oxy/day and 40 mgs of methadone would get me right.", "2_Subreddit": "opiates"}], "75q0kh": [{"0_Title": "TFW...", "1_Text": "You're tripping my dude methadone will rock your world if you take the right dose.  I went to a methadone clinic for years and got high daily.  I've taken some as recently as a year ago and they still fuck me up solid.\n\nOP if you have zero tolerance to opiates I would break one of those quarters in half and take it.  It takes over an hour for methadone to kick in so don't take more fifteen minutes later thinking it didn't work.   If you have a tolerance then it's up to how much H or oxy you take daily.   I was taking about 100 mgs of oxy/day and 40 mgs of methadone would get me right.", "2_Subreddit": "opiates"}], "765kno": [{"0_Title": "Will my wife's credit be greatly affected as an authorized user?", "1_Text": "You're tripping my dude methadone will rock your world if you take the right dose.  I went to a methadone clinic for years and got high daily.  I've taken some as recently as a year ago and they still fuck me up solid.\n\nOP if you have zero tolerance to opiates I would break one of those quarters in half and take it.  It takes over an hour for methadone to kick in so don't take more fifteen minutes later thinking it didn't work.   If you have a tolerance then it's up to how much H or oxy you take daily.   I was taking about 100 mgs of oxy/day and 40 mgs of methadone would get me right.", "2_Subreddit": "personalfinance"}], "7cbddj": [{"0_Title": "Ecstasy or no?", "1_Text": "You're tripping my dude methadone will rock your world if you take the right dose.  I went to a methadone clinic for years and got high daily.  I've taken some as recently as a year ago and they still fuck me up solid.\n\nOP if you have zero tolerance to opiates I would break one of those quarters in half and take it.  It takes over an hour for methadone to kick in so don't take more fifteen minutes later thinking it didn't work.   If you have a tolerance then it's up to how much H or oxy you take daily.   I was taking about 100 mgs of oxy/day and 40 mgs of methadone would get me right.", "2_Subreddit": "opiates"}], "7ehr14": [{"0_Title": "How long does lope keep you well?", "1_Text": "You're tripping my dude methadone will rock your world if you take the right dose.  I went to a methadone clinic for years and got high daily.  I've taken some as recently as a year ago and they still fuck me up solid.\n\nOP if you have zero tolerance to opiates I would break one of those quarters in half and take it.  It takes over an hour for methadone to kick in so don't take more fifteen minutes later thinking it didn't work.   If you have a tolerance then it's up to how much H or oxy you take daily.   I was taking about 100 mgs of oxy/day and 40 mgs of methadone would get me right.", "2_Subreddit": "opiates"}], "7fqfmg": [{"0_Title": "Would tramadol restart oxy withdrawal?", "1_Text": "You're tripping my dude methadone will rock your world if you take the right dose.  I went to a methadone clinic for years and got high daily.  I've taken some as recently as a year ago and they still fuck me up solid.\n\nOP if you have zero tolerance to opiates I would break one of those quarters in half and take it.  It takes over an hour for methadone to kick in so don't take more fifteen minutes later thinking it didn't work.   If you have a tolerance then it's up to how much H or oxy you take daily.   I was taking about 100 mgs of oxy/day and 40 mgs of methadone would get me right.", "2_Subreddit": "opiates"}], "7i73tn": [{"0_Title": "When the plug is low key trying to make you quit..", "1_Text": "You're tripping my dude methadone will rock your world if you take the right dose.  I went to a methadone clinic for years and got high daily.  I've taken some as recently as a year ago and they still fuck me up solid.\n\nOP if you have zero tolerance to opiates I would break one of those quarters in half and take it.  It takes over an hour for methadone to kick in so don't take more fifteen minutes later thinking it didn't work.   If you have a tolerance then it's up to how much H or oxy you take daily.   I was taking about 100 mgs of oxy/day and 40 mgs of methadone would get me right.", "2_Subreddit": "opiates"}], "7llim2": [{"0_Title": "First for sure experience with fake pills", "1_Text": "You're tripping my dude methadone will rock your world if you take the right dose.  I went to a methadone clinic for years and got high daily.  I've taken some as recently as a year ago and they still fuck me up solid.\n\nOP if you have zero tolerance to opiates I would break one of those quarters in half and take it.  It takes over an hour for methadone to kick in so don't take more fifteen minutes later thinking it didn't work.   If you have a tolerance then it's up to how much H or oxy you take daily.   I was taking about 100 mgs of oxy/day and 40 mgs of methadone would get me right.", "2_Subreddit": "opiates"}], "7ma05n": [{"0_Title": "How long does it take to start feeling Xanax WD?", "1_Text": "You're tripping my dude methadone will rock your world if you take the right dose.  I went to a methadone clinic for years and got high daily.  I've taken some as recently as a year ago and they still fuck me up solid.\n\nOP if you have zero tolerance to opiates I would break one of those quarters in half and take it.  It takes over an hour for methadone to kick in so don't take more fifteen minutes later thinking it didn't work.   If you have a tolerance then it's up to how much H or oxy you take daily.   I was taking about 100 mgs of oxy/day and 40 mgs of methadone would get me right.", "2_Subreddit": "opiates"}], "7mf93r": [{"0_Title": "Will I experience withdrawals?", "1_Text": "You're tripping my dude methadone will rock your world if you take the right dose.  I went to a methadone clinic for years and got high daily.  I've taken some as recently as a year ago and they still fuck me up solid.\n\nOP if you have zero tolerance to opiates I would break one of those quarters in half and take it.  It takes over an hour for methadone to kick in so don't take more fifteen minutes later thinking it didn't work.   If you have a tolerance then it's up to how much H or oxy you take daily.   I was taking about 100 mgs of oxy/day and 40 mgs of methadone would get me right.", "2_Subreddit": "benzodiazepines"}], "7o7fcg": [{"0_Title": "Need someone to talk to for a bit.. took fake pills don't know what was in them.", "1_Text": "You're tripping my dude methadone will rock your world if you take the right dose.  I went to a methadone clinic for years and got high daily.  I've taken some as recently as a year ago and they still fuck me up solid.\n\nOP if you have zero tolerance to opiates I would break one of those quarters in half and take it.  It takes over an hour for methadone to kick in so don't take more fifteen minutes later thinking it didn't work.   If you have a tolerance then it's up to how much H or oxy you take daily.   I was taking about 100 mgs of oxy/day and 40 mgs of methadone would get me right.", "2_Subreddit": "opiates"}], "7v237d": [{"0_Title": "Street value of 2 mg hydromorphone (dilaudid)", "1_Text": "You're tripping my dude methadone will rock your world if you take the right dose.  I went to a methadone clinic for years and got high daily.  I've taken some as recently as a year ago and they still fuck me up solid.\n\nOP if you have zero tolerance to opiates I would break one of those quarters in half and take it.  It takes over an hour for methadone to kick in so don't take more fifteen minutes later thinking it didn't work.   If you have a tolerance then it's up to how much H or oxy you take daily.   I was taking about 100 mgs of oxy/day and 40 mgs of methadone would get me right.", "2_Subreddit": "opiates"}], "7y5eyd": [{"0_Title": "Shit luck", "1_Text": "You're tripping my dude methadone will rock your world if you take the right dose.  I went to a methadone clinic for years and got high daily.  I've taken some as recently as a year ago and they still fuck me up solid.\n\nOP if you have zero tolerance to opiates I would break one of those quarters in half and take it.  It takes over an hour for methadone to kick in so don't take more fifteen minutes later thinking it didn't work.   If you have a tolerance then it's up to how much H or oxy you take daily.   I was taking about 100 mgs of oxy/day and 40 mgs of methadone would get me right.", "2_Subreddit": "opiates"}], "82hmxa": [{"0_Title": "Opi/Stoner Showerthought", "1_Text": "You're tripping my dude methadone will rock your world if you take the right dose.  I went to a methadone clinic for years and got high daily.  I've taken some as recently as a year ago and they still fuck me up solid.\n\nOP if you have zero tolerance to opiates I would break one of those quarters in half and take it.  It takes over an hour for methadone to kick in so don't take more fifteen minutes later thinking it didn't work.   If you have a tolerance then it's up to how much H or oxy you take daily.   I was taking about 100 mgs of oxy/day and 40 mgs of methadone would get me right.", "2_Subreddit": "opiates"}], "8393wv": [{"0_Title": "Opiate user for over 12 years about to shoot my first dilly. Advice Welcome.", "1_Text": "You're tripping my dude methadone will rock your world if you take the right dose.  I went to a methadone clinic for years and got high daily.  I've taken some as recently as a year ago and they still fuck me up solid.\n\nOP if you have zero tolerance to opiates I would break one of those quarters in half and take it.  It takes over an hour for methadone to kick in so don't take more fifteen minutes later thinking it didn't work.   If you have a tolerance then it's up to how much H or oxy you take daily.   I was taking about 100 mgs of oxy/day and 40 mgs of methadone would get me right.", "2_Subreddit": "opiates"}], "84ivr6": [{"0_Title": "A221 Tramadol", "1_Text": "You're tripping my dude methadone will rock your world if you take the right dose.  I went to a methadone clinic for years and got high daily.  I've taken some as recently as a year ago and they still fuck me up solid.\n\nOP if you have zero tolerance to opiates I would break one of those quarters in half and take it.  It takes over an hour for methadone to kick in so don't take more fifteen minutes later thinking it didn't work.   If you have a tolerance then it's up to how much H or oxy you take daily.   I was taking about 100 mgs of oxy/day and 40 mgs of methadone would get me right.", "2_Subreddit": "opiates"}]}]}]}