{"ImGonnaLoseItISwear": [{"0_comments": [{"dwm9als": [{"0_Comment Submission": "I'm pretty new here so what's the up/down vote and karma points?", "1_Text": "Bahahahah I def wouldn't say no one. I've seen some dumbbbbbb sourcing posts but our mods clean that shit up quick most of the time.", "2_Subreddit": "opiates"}], "dwmdz69": [{"0_Comment Submission": "How everyone here feels.....But the truth is, it's up to us weather we are alone in life or not. Smile. No ones alone.", "1_Text": "You're a rediculous thing to say.", "2_Subreddit": "single"}], "dwme2jw": [{"0_Comment Submission": "How everyone here feels.....But the truth is, it's up to us weather we are alone in life or not. Smile. No ones alone.", "1_Text": "You make no sense.", "2_Subreddit": "single"}], "dwme4xd": [{"0_Comment Submission": "How everyone here feels.....But the truth is, it's up to us weather we are alone in life or not. Smile. No ones alone.", "1_Text": "No you move on. Please don't tell me your actual name in real life is Kulas Devorn? What a dumb fucking name god you suck so bad.", "2_Subreddit": "single"}], "dwme7xw": [{"0_Comment Submission": "Back pain when I go to sleep while on to much kratom", "1_Text": "Ok i totally get what you mean because this happens to me. So when I take Kratom I get incredibly deep sleep. Like so deep I wake up with a stiff back because my muscles are so used to tossing and turning all night that they tense up and get very stiff from lack of movement", "2_Subreddit": "kratom"}], "dwmecsn": [{"0_Comment Submission": "How everyone here feels.....But the truth is, it's up to us weather we are alone in life or not. Smile. No ones alone.", "1_Text": "And you're a piece of shit. Leave my post once and for all. Don't let the door hit you in the cunt on your way out.", "2_Subreddit": "single"}], "dwmeiu8": [{"0_Comment Submission": "How everyone here feels.....But the truth is, it's up to us weather we are alone in life or not. Smile. No ones alone.", "1_Text": "You legit commented on a post that NO ONE commented on to tell me I'm wrong. Why? What was so outrageous about what I said worth commenting on? I'm sorry you're so alone you feel like it's out of your control. Well guess what? It is in your control. Go make some friends dicknuts.", "2_Subreddit": "single"}], "dwmenna": [{"0_Comment Submission": "I [22 F] punched my boyfriend[34 M] of 1 year last night after he screamed \"just hit me\" over and over. He thinks he was doing me a favor but I have never hit someone in my life before, and I am traumatized by the whole incident.", "1_Text": "The most fucked up part of this to me that if the roles were reversed, HE WOULD BE IN FUCKING PRISON RIGHT NOW. If I'm the guy, even tho I instigated it, I'm pressing charges. You crossed a line when you made physical contact with him. Just know that.", "2_Subreddit": "relationships"}], "dwmeu2g": [{"0_Comment Submission": "How everyone here feels.....But the truth is, it's up to us weather we are alone in life or not. Smile. No ones alone.", "1_Text": "Oh yes I'm stark raving mad over here Kulas, I'm gonna punch a hole in my wall because you didn't like my title wahhhhhhh. Nahhhhhh man I'm just better at being a sarcastic asshole than you are and it's getting under your skin I can tell. If it wasn't getting to you, you would just ignore my responses and go about your day. But you felt the need to keep responding. So I'm gonna keep fucking with you until you stop responding ok there kewlass dickhorn?", "2_Subreddit": "single"}], "dwmflhw": [{"0_Comment Submission": "How everyone here feels.....But the truth is, it's up to us weather we are alone in life or not. Smile. No ones alone.", "1_Text": "The day I start taking advice from a guy who hasn't been in a relationship for 8 YEARS is the day I go play in traffic on the highway. I'm civil towards 99.9% of everyone else on this earth, just not pieces of shit like you kewlass. So like I said before, don't let the door hit ya where God split ya :)", "2_Subreddit": "single"}], "dwmfn4n": [{"0_Comment Submission": "Perhaps those of us who have used kratom to overcome opiates can give our take on how kratom has helped us.", "1_Text": "You're correct. Im the worst.", "2_Subreddit": "kratom"}], "dwmg29w": [{"0_Comment Submission": "How everyone here feels.....But the truth is, it's up to us weather we are alone in life or not. Smile. No ones alone.", "1_Text": "Oh kewlnuts, I just had to see these killer lines you drop in the comment section of those ladies R4r posts. You really dazzled those ladies huh? How did that work out for you? Do yourself a favor, go back to your video games and jerk off to some hentai. Maybe it'll calm you down a little so you can stop getting so butt hurt that I am just CRUSHING you in life. Like just completely owning you. How's my dick taste bruh?", "2_Subreddit": "single"}], "dwmgye5": [{"0_Comment Submission": "Piss & shitpost", "1_Text": "Get Stoney baloney homeboiiiiiii", "2_Subreddit": "opiates"}], "dwmhpcy": [{"0_Comment Submission": "Gonna be a LIT easter. 20mg Oxy (have never had these 20s before) 20mg Adderall IR. Two CherryDog extract cartridges.", "1_Text": "It's straight gas man. Best tasting wax I've ever had.", "2_Subreddit": "opiates"}], "dwmjir6": [{"0_Comment Submission": "22 [M4F] Look at other posts. Now look at mine, now back at others, now back to mine.", "1_Text": "Buddy I'm not a woman. But 10/10 on  this ad. Unfourtunatly for you like MAYBE 7 girls total will actually see this here. But goddamn your post was witty, clever, and succinct. \n\nIf I was a woman, after reading this, your dick would be so far down my throat it wouldn't even be legal. Well played my good man. Best of luck.", "2_Subreddit": "bostonr4r"}], "dwmkgfd": [{"0_Comment Submission": "Gonna be a LIT easter. 20mg Oxy (have never had these 20s before) 20mg Adderall IR. Two CherryDog extract cartridges.", "1_Text": "Well for one the cartridges at 2$ each plus the cost of the VG and the cost of volumizer. Add the labor time it takes to make each one plus the cost of the actual extract and that's why theyre so expensive. \n\nBut you are right. When I was buying them all the time I paid 35$-$40 bucks per cart and I was going thru one a day. So I looked up the cost of the supplies and the process to make them and decided to make them myself. Since I grow my own bud and have a friend with a full on refinery system I get my wax for dirt cheap. I figure it costs me around 20$ max per cartridge now. Well worth it for sure.", "2_Subreddit": "opiates"}], "dwmkmxf": [{"0_Comment Submission": "After 6 long years of growing tolerance and an increased mental and physical dependance on RX opiates I'm finally completely off.", "1_Text": "Have you tried Kratom at all? I have sciatic nerve damage myself and 7g of red Bali Kratom completely eliminates my back pain. I have days like you where I can barely stand when I get up. And im on my feet 10 hours a day for my job. The stuff works. Hopefully your in a legal state.\n\nBut if weed is more your type of thing I'd suggest a heavy indica strain of bud with a high CBD percentage. You take that and make it into some kind of edibles and you got yourself a delicious pain relieving snack!", "2_Subreddit": "opiates"}], "dwmkz18": [{"0_Comment Submission": "22 [M4F] Look at other posts. Now look at mine, now back at others, now back to mine.", "1_Text": "Too true my dude. Like no joke I screenshot your post to use as a template for my tinder, POF, and bumble accounts. It's so perfect there's no way I won't get likes using something similiar to your post.", "2_Subreddit": "bostonr4r"}], "dwml41p": [{"0_Comment Submission": "What country or geographical area has the best opiates?", "1_Text": "I'm gonna guess the Middle East (Afghanistan, Iraq, Iran) and somewhere in the South Pacific (Laos, Vietnam, Thailand). These are the geographical areas where opium thrives naturally.\n\nI've read that in the last 60 years or so Mexico and Colombia have massively upped their production of poppy fields. Hence why they supply North America with 90% of our Heroin.", "2_Subreddit": "opiates"}], "dwml7r4": [{"0_Comment Submission": "After 6 long years of growing tolerance and an increased mental and physical dependance on RX opiates I'm finally completely off.", "1_Text": "Ya whites are more for energy boost than pain relief. One thing I would look into for extreme days but not every day use would be a red Bali extract. It's much more potent and much stronger than straight normal Kratom. But it ruins your tolerance. So I only use it for really bad days.", "2_Subreddit": "opiates"}], "dwmlrbs": [{"0_Comment Submission": "Oxy got me laid last night", "1_Text": "I been saying fam since you were lining the bottom of ya daddies nutsack lolol", "2_Subreddit": "opiates"}], "dwreip2": [{"0_Comment Submission": "Yesterday took 300mg codeine all at once, nothing, today I take 30mg Oxycodone eyes pinned, feeling better..", "1_Text": "Your nuts bro. But you are right. Codeine doesn't do shit for me. Waste.", "2_Subreddit": "opiates"}], "dwtz4ic": [{"0_Comment Submission": "What ever happened to r/opiaterolecall?", "1_Text": "They killed that shit a while ago.", "2_Subreddit": "opiates"}], "dwumnyj": [{"0_Comment Submission": "today would’ve been your 23rd birthday. i miss you everyday darlin’ 💔", "1_Text": "I'm sorry fam that sucks. Best you can do now is try and do right by her kids.", "2_Subreddit": "opiates"}], "dwy4k9i": [{"0_Comment Submission": "Bobby Shmurda - Hot N*gga", "1_Text": "If u ain't a hoe grtttttt up outttt my trapppp houseeee", "2_Subreddit": "hiphopheads"}]}], "1_submissions": [{"7vdw20": [{"0_Title": "What percentage of Redditors browse while on the toilet?", "1_Text": "Bahahahah I def wouldn't say no one. I've seen some dumbbbbbb sourcing posts but our mods clean that shit up quick most of the time.", "2_Subreddit": "AskReddit"}], "86qlsk": [{"0_Title": "8 months later and it still hurts", "1_Text": "Bahahahah I def wouldn't say no one. I've seen some dumbbbbbb sourcing posts but our mods clean that shit up quick most of the time.", "2_Subreddit": "BreakUps"}], "86qtnp": [{"0_Title": "I wanted to drink today bad. Like REALLY BAD.", "1_Text": "Bahahahah I def wouldn't say no one. I've seen some dumbbbbbb sourcing posts but our mods clean that shit up quick most of the time.", "2_Subreddit": "stopdrinking"}], "87lp3f": [{"0_Title": "Shout out to u/jimbalaya99", "1_Text": "Bahahahah I def wouldn't say no one. I've seen some dumbbbbbb sourcing posts but our mods clean that shit up quick most of the time.", "2_Subreddit": "randomactsofspeciosa"}], "88gry3": [{"0_Title": "How everyone here feels.....But the truth is, it's up to us weather we are alone in life or not. Smile. No ones alone.", "1_Text": "Bahahahah I def wouldn't say no one. I've seen some dumbbbbbb sourcing posts but our mods clean that shit up quick most of the time.", "2_Subreddit": "single"}], "88h1l6": [{"0_Title": "My karaoke song of choice. Video of before Jason Biggs was famous.", "1_Text": "Bahahahah I def wouldn't say no one. I've seen some dumbbbbbb sourcing posts but our mods clean that shit up quick most of the time.", "2_Subreddit": "listentothis"}], "88oc6h": [{"0_Title": "Gonna be a LIT easter. 20mg Oxy (have never had these 20s before) 20mg Adderall IR. Two CherryDog extract cartridges.", "1_Text": "Bahahahah I def wouldn't say no one. I've seen some dumbbbbbb sourcing posts but our mods clean that shit up quick most of the time.", "2_Subreddit": "opiates"}]}]}]}