{"amnesiaRx": [{"0_comments": [{"doe6wye": [{"0_Comment Submission": "Why did codeine stop working for me?", "1_Text": "codeine was good yeah, no you didn't make it up", "2_Subreddit": "opiates"}], "doe6zdg": [{"0_Comment Submission": "What is the easiest opiate to synthesize yourself?", "1_Text": "yeah lets get rich!!! lets create heroin !!! google search wiki how to make heroin !!!!! lets ask the gang on reddit!!   a few books to start off on would be great!!! tony! montana! thats my name I dont even like the shit no more just money!!!!", "2_Subreddit": "opiates"}], "donv9dq": [{"0_Comment Submission": "My first opiate cold cop...", "1_Text": "that is a long trip for $30 of dope, is your city really that dry?", "2_Subreddit": "opiates"}], "dp6lc55": [{"0_Comment Submission": "Hotboxing the car with some M30's 😄", "1_Text": "lol.....", "2_Subreddit": "opiates"}], "dq4x8sh": [{"0_Comment Submission": "Kicked out of rehab all there's left to do now is get high", "1_Text": "why'd you get kicked out? 13th steppin?", "2_Subreddit": "opiates"}], "dq5301q": [{"0_Comment Submission": "Reddit Secret Santa", "1_Text": "My gf and I have participated a few times, not for the secret Santa exchange but for other ones they have throughout the year. \n\nEach time they start there are several options to choose from & with the option to be matched international or you can select USA/Canada. It actually can work out to be the same amount of money to ship because you make the order from the country your match lives in (Amazon UK, Aliexpress, etc) \n\nThe amount suggested is 25$ although I noticed last year this girl got matched with Bill Gates & he gave some cool things, you are able to post in a gallery to say thank you and it gets linked back to the gift sender. People sign up to be rematch secret santa's as welll to send to people who got fucked by their ss\n\nI got a pretty cool knife from this girl on my second exchange, I noticed most people just request specific items they want + you can link your Amazon wishlist too. I didn't get around to anymore after that but my girlfriend has got some neat things from people across the world, its cool to check out all the different photos up to see what people have got. \n\nIt is worth trying it one time OP", "2_Subreddit": "opiates"}], "dq53ajw": [{"0_Comment Submission": "Mom found my heroin...", "1_Text": "put them in the freezer, remember someone talking about this in the summer", "2_Subreddit": "opiates"}], "dq53jh0": [{"0_Comment Submission": "When you IV, what's your style?", "1_Text": "there is a video of a guy doing IV methamphetamine on pornhub this way", "2_Subreddit": "opiates"}], "dq53ti3": [{"0_Comment Submission": "When you IV, what's your style?", "1_Text": "yeah it hurts really fckn bad & only ever see amateurs trying to do this / IV the opposite way down the arm.... had an \"old schooler\" 50-year-old lady neighbour IV tek this way in front of me trying to tell me she knows what she is doing", "2_Subreddit": "opiates"}], "dq53x8u": [{"0_Comment Submission": "craigslist wisdom", "1_Text": "this junkie girl wrote up a guide if you google around its pretty damn easy to find", "2_Subreddit": "opiates"}], "dq54j0u": [{"0_Comment Submission": "8mg pms-Hydromorphone Canadian", "1_Text": "lol I know there is some weird theory surrounding the hydromorph beads, greys and reds (24mg / 30mg) that you need heat for these specifically, all across the internet as well on drug boards there is not a ton of information from IV users of these because they are more big in canada / states has exalgo or used to ...\n\nback to the d8s... these absolutely do not add heat !!!! they dissolve so well & this at least is not a contested method online either!! water then filter... ez pie\n\nafter doing many hydromorph 24mg with heat/ no heat, there is NO need to heat them either, I think this is all in the head of a junkie and have had someone straight up not do the shot because I did not have a lighter so he carried on his way lol.... no benefit and it leaves all that black ash (soot?) on your cookers that eventually make your hands all dirty and countertops, etc. \n\n\nedit: yeah you got a great price on them, its crazy what people ask for those... luckily I have RX", "2_Subreddit": "opiates"}], "dq6rixl": [{"0_Comment Submission": "Blue Dot Vapors - Black Friday/Cyber Monday/Thanksgiving Week [Giveaway] - Up to 99% off Sale", "1_Text": "thankful", "2_Subreddit": "electronic_cigarette"}], "drm03pg": [{"0_Comment Submission": "I found this at a thrift store for $300. I no longer own it. Story in comments.", "1_Text": "good bot", "2_Subreddit": "synthesizers"}], "drohhkq": [{"0_Comment Submission": "Unintended mishap with the whole selling meth thing", "1_Text": "dude I have just the one dog to worry about & when I prep my goofballs iiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiie ooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooojjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjpwwwwwwwwnneanklllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllllnnnnnnnnnnnnnnnnnnnnnnnnnaaaaaaaaaaaaaanjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjj                 fffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffgggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggggg\n\nnow that i'm awake lol yeah I don't know how you were not paranoid about this before it happened unless you don't use tek", "2_Subreddit": "opiates"}], "dttqesq": [{"0_Comment Submission": "That time I met a girl on Reddit and we took lsd, mdma, and DMT.", "1_Text": "no shit hey took me all of 10 seconds to find.....after you made it clear he mentioned the username in the last sentence.....\n\nedit: further investigation indicates user mentioned also takes a dislike with a story told without paragraph indentation.... may want to spice it up... lol", "2_Subreddit": "Drugs"}], "du06ozr": [{"0_Comment Submission": "Ejuice Blowout - Special Reddit Valentines Pre-Sale and Giveaway!", "1_Text": "lets do some chems love", "2_Subreddit": "Canadian_ecigarette"}], "dwa903g": [{"0_Comment Submission": "Quick doubles routine.", "1_Text": "amazing!!", "2_Subreddit": "balisong"}], "dwnas4w": [{"0_Comment Submission": "How do I use whisper?", "1_Text": "if you can't figure out whisper then I really don't think you should try accessing the DNMs", "2_Subreddit": "opiates"}], "dwns4hm": [{"0_Comment Submission": "First time with oxycodone, probably won’t feel much but still excited :)", "1_Text": "two percocet lol... neither the picture or this thread were necessary...", "2_Subreddit": "opiates"}], "dwnsc1a": [{"0_Comment Submission": "I think I fucked up.", "1_Text": "canadian government facility?", "2_Subreddit": "opiates"}], "dwnskfl": [{"0_Comment Submission": "neuroimaging of the human brain reacting to an \"ALL GOOD\" text", "1_Text": "here", "2_Subreddit": "opiates"}], "dwq065z": [{"0_Comment Submission": "First time with oxycodone, probably won’t feel much but still excited :)", "1_Text": "sorry was having  a bad day", "2_Subreddit": "opiates"}], "dwqft9t": [{"0_Comment Submission": "What is a good projector I can connect to my smartphone so I can watch stuff in bed on the wall?", "1_Text": "http://www.brookstone.com/audio-tech/projector-screens/portable-projectors\n\nthe less expensive model is on sale right now for 299$  and is running android", "2_Subreddit": "AndroidQuestions"}], "dwqg3i4": [{"0_Comment Submission": "What is a good projector I can connect to my smartphone so I can watch stuff in bed on the wall?", "1_Text": "i can't imagine that their claim of 600 lumens is accurate on that unit when a more expensive projector (brookstone) is 200 lumen at six times the cost of the one you mentioned", "2_Subreddit": "AndroidQuestions"}], "dwxw89p": [{"0_Comment Submission": "Did half of each already , but .4 of hard and .3 of Canadian brown Fent. I smoke both on tin foil, weird hey?", "1_Text": "canada as well-  wish we could go back to heroin & not fent everywhere... would love to be one of those bc residents participating (participated ..? ) in the diacetylmorphine pharmaceutical study that they had or still have going on", "2_Subreddit": "opiates"}]}], "1_submissions": [{"4qzp91": [{"0_Title": "Replacement parts for Bachelor nano", "1_Text": "codeine was good yeah, no you didn't make it up", "2_Subreddit": "Canadian_ecigarette"}], "4raxv4": [{"0_Title": "Advice for painful skin", "1_Text": "codeine was good yeah, no you didn't make it up", "2_Subreddit": "SkincareAddiction"}], "4raz6c": [{"0_Title": "[Skin Concerns] Advice for painful skin", "1_Text": "codeine was good yeah, no you didn't make it up", "2_Subreddit": "SkincareAddiction"}], "4uid0a": [{"0_Title": "[Build Help] First build, need serious critique!", "1_Text": "codeine was good yeah, no you didn't make it up", "2_Subreddit": "buildapc"}], "51poil": [{"0_Title": "Pyrex glass bubbler atomizer", "1_Text": "codeine was good yeah, no you didn't make it up", "2_Subreddit": "electronic_cigarette"}], "56mt29": [{"0_Title": "63 Liquid thxGivin sale~ at vape excape", "1_Text": "codeine was good yeah, no you didn't make it up", "2_Subreddit": "Canadian_ecigarette"}], "59v1qb": [{"0_Title": "[Help/Question] Kennedy build help", "1_Text": "codeine was good yeah, no you didn't make it up", "2_Subreddit": "Canadian_ecigarette"}], "5eafb7": [{"0_Title": "Beyerdynamic dt770 pro 250ohm", "1_Text": "codeine was good yeah, no you didn't make it up", "2_Subreddit": "headphones"}], "5i3era": [{"0_Title": "Bit of introduction & micron filters", "1_Text": "codeine was good yeah, no you didn't make it up", "2_Subreddit": "opiates"}], "6o8hrf": [{"0_Title": "10 people you meet in the 12 steps", "1_Text": "codeine was good yeah, no you didn't make it up", "2_Subreddit": "opiates"}], "6q1its": [{"0_Title": "Fentanyl test strips now available @ DanceSafe / free shipping", "1_Text": "codeine was good yeah, no you didn't make it up", "2_Subreddit": "opiates"}], "6qmoct": [{"0_Title": "120ml miranda vape it forward 403", "1_Text": "codeine was good yeah, no you didn't make it up", "2_Subreddit": "Canadian_ecigarette"}]}]}]}