{"PHLyyyJAWN": [{"0_comments": [{"durf4z6": [{"0_Comment Submission": "Does this look like some good ECP? And if I can smoke it how do I do it", "1_Text": "You don't. I've tried a few times and it's just such a fucking waste.", "2_Subreddit": "opiates"}], "durg1qw": [{"0_Comment Submission": "does the memory ever fade?", "1_Text": "Agree with most of these pll with the working out tip. That in itself gets extremely addicting. Especially if you get some \"gym bros\" to keep you motivated. Even a gym \"nemesis\" that's bigger than you and you try to keep up. Sounds stupid but helped me for years before I relapsed awhile back. You're still young, your brain is still easily re-wirable. Good luck!!", "2_Subreddit": "opiates"}], "durk272": [{"0_Comment Submission": "Rainy day with the Baltimore blues...", "1_Text": "Ballsy putting it up there like that broad daylight so cops can easily see it. Not to mention phone in your other hand in plain view of the cops. Dunno where your at but it's state law in my tri-state area that they can pull you over for just having your phone in your hand while driving. I actually got pulled over the other day for it. was just looking at it for directions and the dick head pulled me over cause he said it had to be mounted. At least you'd be able to swallow em all quick if anyone did peep that.", "2_Subreddit": "opiates"}], "durmmh6": [{"0_Comment Submission": "New candy flavors - any good??", "1_Text": "Haven't seen em here in the states.", "2_Subreddit": "opiates"}], "dushw90": [{"0_Comment Submission": "In the USA? \"Anything you say will be used against you in court\". Don't talk to the police.", "1_Text": "They always try to act like your friend, and believe me, THEY WILL use whatever you say against you. They try to chat you up while they're booking you also and again, THEY Will use that info to try to fuck you further.", "2_Subreddit": "Drugs"}], "dut3a3m": [{"0_Comment Submission": "How much do yous use for your wake up??", "1_Text": "Haha it'd definitely a struggle, especially when you only got enough to get good that night for some decent sleep. If I'm low I'll even try to not dump out the whole bag, save a bit from each just for the AM. Even if it is more of a placebo effect.", "2_Subreddit": "opiates"}], "dut3dhg": [{"0_Comment Submission": "How much do yous use for your wake up??", "1_Text": "For me the smaller dose is just big enough usually so I can function, but Def not big enough to nod. Can't be passed out cold at work haha", "2_Subreddit": "opiates"}], "dut563w": [{"0_Comment Submission": "Doubled up 🤩", "1_Text": "I loved the taste", "2_Subreddit": "opiates"}], "duuvfwh": [{"0_Comment Submission": "How much do yous use for your wake up??", "1_Text": "You let it sit in the rig overnight?", "2_Subreddit": "opiates"}], "duv6h9k": [{"0_Comment Submission": "This gentleman's sweat suit fashion.", "1_Text": "This yeezys new shit?", "2_Subreddit": "mildlyinteresting"}], "dv1pgy1": [{"0_Comment Submission": "How long to recover after 2 week use", "1_Text": "I'm confused, why wouldn't it be? You asking if you can dose again without having more withdrawal symptoms? Or starting day 1 withdrawal??", "2_Subreddit": "opiates"}], "dv3dzx7": [{"0_Comment Submission": "Perfect something to occupy myself during the rain...", "1_Text": "Haha, a burn on the window sill from God knows what", "2_Subreddit": "opiates"}], "dv3qej4": [{"0_Comment Submission": "LPT: If you need to proofread something, read the the text backwards word-by-word to stop your brain from “auto-completing” the sentences", "1_Text": "r/shittylifetips", "2_Subreddit": "LifeProTips"}], "dv4icjd": [{"0_Comment Submission": "Harvesting Agave, the source of your tequila.", "1_Text": "Definitely not interesting as fuck. Quite a boring as gif tbh", "2_Subreddit": "interestingasfuck"}], "dv56t26": [{"0_Comment Submission": "Guy literally has races grim reaper himself", "1_Text": "r/titlegore", "2_Subreddit": "interestingasfuck"}], "dv8ko4a": [{"0_Comment Submission": "Anyone here not want to get clean?", "1_Text": "Fuck no, I hate being sober. I'm heading to pick up right now!!", "2_Subreddit": "opiates"}], "dvqpczg": [{"0_Comment Submission": "Instagram dealer (so far my lowest point trying to get drugs)", "1_Text": "How did you find him?? What did you search for? Did yous already follow each other?? I'd say almost 100% scam", "2_Subreddit": "opiates"}], "dvyhy9n": [{"0_Comment Submission": "After four years of being an only child, golden retriever Molly accepts her new role as big sister.", "1_Text": "Looks like a lemur", "2_Subreddit": "thisismylifenow"}], "dvyigh5": [{"0_Comment Submission": "Reddit, whats your million dollar app idea that you never built?", "1_Text": "Get rich off your own idea OP", "2_Subreddit": "AskReddit"}], "dw435vw": [{"0_Comment Submission": "I love when the d boy has a mix of blues", "1_Text": "Wait, dude would just keep the other 3?? Or hed five you your money back for those 3??", "2_Subreddit": "opiates"}], "dw4al2p": [{"0_Comment Submission": "Whats the best vendor to buy from online??", "1_Text": "My bad", "2_Subreddit": "kratom"}], "dwjn59f": [{"0_Comment Submission": "So in true junkie fashion last night I found a few bags and a baggie of girl I thought I lost. Mixed up a mean speedball to end my opiate career with a bang this morning. And here..we..go...", "1_Text": "I honestly thoifht it was some building with the sunset behind it and thought to myself that would be a dope scene for a last hurrah.", "2_Subreddit": "opiates"}], "dwpn259": [{"0_Comment Submission": "Crossing the street while drunk wcgw.", "1_Text": "He ded", "2_Subreddit": "Whatcouldgowrong"}], "dwpn5ct": [{"0_Comment Submission": "Crossing the street while drunk wcgw.", "1_Text": "My previous comment got removed be cause apparently it was to short. So to reiterate...\n\nHe ded", "2_Subreddit": "Whatcouldgowrong"}], "dwv9exq": [{"0_Comment Submission": "Payday", "1_Text": "You cant even ask about a good vendor on r/Kratom anymore. My post got locked when tried asking.", "2_Subreddit": "opiates"}]}], "1_submissions": [{"7y3hoq": [{"0_Title": "Decided to stay in tonight", "1_Text": "You don't. I've tried a few times and it's just such a fucking waste.", "2_Subreddit": "opiates"}], "804yob": [{"0_Title": "How much do yous use for your wake up??", "1_Text": "You don't. I've tried a few times and it's just such a fucking waste.", "2_Subreddit": "opiates"}], "81fmd9": [{"0_Title": "Perfect something to occupy myself during the rain...", "1_Text": "You don't. I've tried a few times and it's just such a fucking waste.", "2_Subreddit": "opiates"}], "82r647": [{"0_Title": "Gooood afternoon ladies and gentlemen. After a few days of getting shitty product and feeling sick, finally got some good shit", "1_Text": "You don't. I've tried a few times and it's just such a fucking waste.", "2_Subreddit": "opiates"}], "86dxnb": [{"0_Title": "Whats the best vendor to buy from online??", "1_Text": "You don't. I've tried a few times and it's just such a fucking waste.", "2_Subreddit": "kratom"}]}]}]}