{"JrSmith82": [{"0_comments": [{"dbayd0r": [{"0_Comment Submission": "Rams at Seahawks, Full-Game, Condensed", "1_Text": "That Coliseum looked mighty empty last weekend... I think Stan had a nightmarish vision about interest in the team persisting at \"empty stadium\" levels & realized LA won't fill his billion dollar seats w/o something worth watching @ least... LA rly is a different market. We must be made to give a fuck. He wants to make good on his investment, probably why Fishstache was canned after the stadium emptied, under his footballing product", "2_Subreddit": "LosAngelesRams"}], "dbrpuql": [{"0_Comment Submission": "PSA: you can bring rigs and drugs on planes", "1_Text": "International flight? I'm about to leave to Mexico from LAX and wanted to know what people thought the best way of getting like maybe a g if dope/couple crystal shards/a few rigs across was? \n\nAny pointers/past experiences massively appreciated, the thought of kicking overseas is so nauseating aloe :/ \n\nEDIT/UPDATE: so Mexican prison cells aren't too shabby, I have wifi and the diarrhea keeps the other inmates weary of penetratinnn-naaah  taking all the things I listed was actually simple. I even lost my passport/had to walk across US CUSTOMS (planned to do my dope by then) & they really did not seem to care. I just wrapped 3 rigs & a bunch of markers/colored pencils w/ a rubber band & threw it in the checked baggage, though I regret not doing carry-on cuz I got sick on the flight & attempted monkey water like a dumbass. I made no attempt to conceal my dope/clear. Just threw the baggies in my wallet & it was fucking money across all airport security, both nations. I was scared when I crossed border on foot & the dogs (those are 100% not bomb dogs @ border) were itching to go in my direction lol. But this dude on Forensic Files threw off police dogs using pepper (mf murdered old ladies in the same apartment complex, same month, same way... stole their VCRs... yeesh) so if it's not a kilo I'm sure a little pepper will just help you act cool about that measly couple grams no one gives a fuck about anyway apparently. Shot up in Mexico City upon landing & promptly hit an artery for the first time later that night. So many 1st's", "2_Subreddit": "opiates"}], "dbrr5cm": [{"0_Comment Submission": "PSA: you can bring rigs and drugs on planes", "1_Text": "Is carry on best bet for this? Or should I leave the dope in the luggage that one parts ways with for the duration of the flight?", "2_Subreddit": "opiates"}], "dbxnsnu": [{"0_Comment Submission": "Viable Options for Starting a Life Abroad as a Junkie", "1_Text": "Lmao. think you can please find? Cuz I just typed this up(Yes i searched) but i would def love to browse those replies...", "2_Subreddit": "opiates"}], "dbxob3b": [{"0_Comment Submission": "Viable Options for Starting a Life Abroad as a Junkie", "1_Text": "My head isn't in recovery honestly. I know what that mindstate looks like, & I'm just not anywhere near there at the moment. \n\nNot that I'm trying to be digging for my rock bottom (cuz I know I'll sure as fuck end up in China like that) or that I think fleeing problems actually works, but I'm up to my neck in debt & maintaining as I sort my shit out for law school sounds easier w/o shoddy employment history (ALL CONTACTS THINK IM DIARRHEA BOY FOR ALWAYS DITCHING SHIFTS TO GRAB/CALLING OUT SICK/WORKING SICK) & rocking a \"can it *even go* that low?\" credit score doesn't limit housing", "2_Subreddit": "opiates"}], "dbxods0": [{"0_Comment Submission": "Viable Options for Starting a Life Abroad as a Junkie", "1_Text": "As a foreigner?? How'd you... maintain? What was it like? Sounds awesome haha. & how'd you move on to wherever you're at now?", "2_Subreddit": "opiates"}], "dbxpb86": [{"0_Comment Submission": "Viable Options for Starting a Life Abroad as a Junkie", "1_Text": "No I already fucked that up for myself and got kicked out of my sub program after flipping the shits for a year & subbing clean pee @ checkups.. just didn't work out well for me haha. \n\nMethadone on the other hand I've considered at length. Sure it's trading addictions yadda yadda but there's obviously a colossal difference between a sip of a liquid and a rig full of 911. Unfortunately, I know damn well there's ways of circumventing the abuse safeguards even there, cuz subs/'done/rehab are only ever as effective as the addict allows em to be, & a life of getting high + dosing 'done sounds like a step back... not that this ridiculous Mexico shit isn't but I'm actually looking at income NOW down south w/o building debt even more @ least", "2_Subreddit": "opiates"}], "dfxe0jb": [{"0_Comment Submission": "[Wojnarowski] Lakers assistant GM Glenn Carraro has resigned, league sources tell @TheVertical. Carraro had been with franchise since 2000.", "1_Text": "Hinkie made the call  to trade for James Harden when he was in Houston. If Pelinka has even half that foresight we'd be awfully fortunate. \n\nPlus what's this anti-numbers stuff. Do you not pay attention to things like ppg/apg? Those are stats. Some stats are just better than others. The fact that we can't articulate how they're derived doesn't make them any less useful. Unless you watch games without ever looking at the scoreline and decide who should win with your gut, then you use numbers and stats. Why are we so threatened by people that just know how to use numbers better than we do", "2_Subreddit": "lakers"}], "dgrmj90": [{"0_Comment Submission": "To anyone who had a hard time shitting I have advice.", "1_Text": "No one wants to hear this but voluntary WD (I.e. Postpone the morning shot by several hrs) reliably delivers warm, smushy shit hills. \n\n Forgoing a shot under my own terms is key though, cuz being forced to shit by dopelessness somehow takes all the dignity out of a shit-dripping behind", "2_Subreddit": "opiates"}], "dgs59l4": [{"0_Comment Submission": "Amazon gift card to cash??", "1_Text": "Yes, was awarded online, totally non-physical turd of an ecard", "2_Subreddit": "opiates"}], "dgsapmg": [{"0_Comment Submission": "Amazon gift card to cash??", "1_Text": "Make a lifesaving donation to the Red Cross of course. No way I'd spend this on getting well, im way too good for that", "2_Subreddit": "opiates"}], "dgskozw": [{"0_Comment Submission": "How to get black tar off plastic??", "1_Text": "Stick it to the AC next time if you're not around a freezer", "2_Subreddit": "opiates"}], "dpzfdsp": [{"0_Comment Submission": "Why “Nathan for You” Isn’t for Everybody", "1_Text": "This sort of reminds me of Borat calling attention to all the ignorant shit Americans believe about people across the world. Bill, the \"Dating Daddy Guardian dude\", etc. all have an effortless way of making women feel uncomfortable. These bits wouldn't be funny without these dudes; when asked to reflect on what I found funny about these things, I'd say I'm laughing more at the guys and their antiquated views on gender than the women feeling uncomfortable, but there's no denying that particular element is present. However, simply ignoring that these social dynamics exist and \"shoving them under the carpet\" so to speak doesn't exactly move this conversation forward either. Some men are assholes and treat women this way; putting them in situations that bring this behavior of theirs to light places the joke on them, in my opinion at least. \n\nThe thing with Maci was entirely consensual, and it would seem to me at least that the joke is intended to be on Nathan's character (though admittedly using a woman to propel it forward, but what bit hasn't used \"people\" of all genders/races/ages/social classes especially! in their rawest forms to propel their respective segments on the show forward) \n\nI will say that it strikes me as entirely ridiculous to compare Nathan with Harvey Weinstein & Louis C.K., however. That's simply not where this show is coming from, nor what Nathan's interactions with women in particular are intended to achieve.", "2_Subreddit": "nathanforyou"}], "dq31fq9": [{"0_Comment Submission": "Why “Nathan for You” Isn’t for Everybody", "1_Text": "I think the fact that the finale reveals to us that Bill is an ardent Trump supporter gives a strong, obvious indication of what his societal views are (i.e. far from progressive), and to suggest that the show in any way condones his behavior would be like stating that the Anti-Semitic stuff in Borat makes Sasha Cohen a Neo-Nazi...\n\nof course, it can be argued that Cohen reveals American ignorance at the expense of Kazakhstan (though the portrayals of the country are such obvious caricatures that it's obvious his intent isn't to offend)... but nevertheless, I'm Mexican so it's clearly not my place to decide such things. I'm also male, so it's also clearly not my place to comment on whether certain segments with women on the show are offensive, but I guess I was initially reluctant to say so because it's clear (to me at least) that the intent in the segments I described wasn't to condone the power dynamics, but instead call attention to a)their existence & b)the ridiculous behavior of people holding such views. \n\nAt the end of the day, intentions are pretty irrelevant to any resulting state of affairs, so I guess I'm just disappointed that people can feel this way about the show. But I do maintain that comparing Nathan with H.Weinstein is a totally irresponsible move that in fact downplays the severity of sexual assault.", "2_Subreddit": "nathanforyou"}], "ds2289c": [{"0_Comment Submission": "Here's a clip from This Hour Has 22 Minutes that feels very similar to Nathan For You", "1_Text": "This YT channel is filled with older, recently uploaded Nathan segments (as recently as 12/30)", "2_Subreddit": "nathanforyou"}], "ds5owqa": [{"0_Comment Submission": "Do not forget true meaning of christmas r/nathanforyou", "1_Text": "Just watched this for the first time. I'm going to miss these hearty belly laughs that have me struggling to breathe. Thanks for this!", "2_Subreddit": "nathanforyou"}], "dsie3o4": [{"0_Comment Submission": "Movies / Shows...fellow subs, for fun or pass time during \"down\" time", "1_Text": "I remained sane in rehab watching Nathan for You and Game of Thrones. \n\nNathan for you, if the show's sense of humor is up your alley(unsuspecting real small biz owners given outlandish and impractical ideas to improve biz), will make you cry of laughter. It's severely underrated by the masses but the people who watch an episode tend to flip over it.\n\n& what can be said about Game of Thrones that hasn't been already... yes there's dragons, but that's not a knock against it. If Lord of the Rings had a debilitating heroin addiction, it would be Game of Thrones. It's dark as fuck, fascinating historical parallels, perfectly motivated villains (that you'll find yourself rooting for at times, since \"no one is the villain in their own story\" as George Martin says), incest, outstanding cinematography/writing/acting/directing.. you'll laugh,you'll cry, you'll squirm, & i'll stop", "2_Subreddit": "opiates"}], "dsie624": [{"0_Comment Submission": "Movies / Shows...fellow subs, for fun or pass time during \"down\" time", "1_Text": "watch GoT on videopad.me/series/2-game-of-thrones\n\nNathan for you on onitube.com/search/videos?search_query=nathan+for+you", "2_Subreddit": "opiates"}], "dsieedo": [{"0_Comment Submission": "The Relapse Carousel", "1_Text": "I really did appreciate what it did for me. I was sober long enough to land a job, and knowing that shooting up won't work is an excellent deterrent to actually attempting to do so. \n\nBut I think I fucked up by letting it \"do all the work,\" as in, the situation I found myself in shouldn't have resulted in me using so easily, and had I done more of that recovery dance (establishing a reliable network of sober motherfuckers to call upon when situations like this come up) maybe things would've turned out differently. \n\nI had no side effects though. It just hurts if you clinch your butthole (i did so out of fear and paid the price) but that's a small price to pay for getting your life back.", "2_Subreddit": "opiates"}], "dsifl7b": [{"0_Comment Submission": "The Relapse Carousel", "1_Text": "Oh no, it's very relevant. heh. When you get the shot, it goes in your butt cheek, so clenching your butthole or tensing up in any way just makes those sorts of injections unnecessarily painful.", "2_Subreddit": "opiates"}], "dt1vymc": [{"0_Comment Submission": "Anyone have any ideas for getting cash from a virtual visa? also how i got it (40$) for free basically", "1_Text": "If you have the paypal debit card, you can make a second paypal account, use the virtual visa as a payment method, and send the $ amount to your original account (avoid business transaction delays by making it a personal transaction/transfer). \n\nDid this a lot in my using days", "2_Subreddit": "opiates"}], "dtdzx2a": [{"0_Comment Submission": "[1/28 @ 3:00] Los Angeles Lakers (19-29) @ Toronto Raptors (32-15)", "1_Text": "Sure, he doesn't epitomize peak athletic potential in an NBA player, but to say unathletic is really underselling a 20y/o playing against grown men. Skinny is not forever either, he's not done developing physically and won't be for several years. \n\nHe can get to the rim from about the free throw line without dribbling the ball; his stride is that long. So he has physical gifts that definitely play up in this league. Not to mention that jump shots can always be fixed. \n\nThere's typically a learning curve to be expected with one and done players, patience really is key here. Countless examples across the league that fit such a pattern of performance improvement over time", "2_Subreddit": "lakers"}], "dvac6t1": [{"0_Comment Submission": "Really interesting (and non-judgy) article on the psychology of addiction on Vox. Enjoy!", "1_Text": "This was a fantastic article, thanks for posting. \n\nThe “path to recovery” as presently constructed is tragically at odds with what neuroscience reveals about the nature of choice. When I was researching rehabs about a year ago, it was so discouraging to find “evidence-based treatment” and “12-step approach” in the same sentence. Not that NA is incapable of doing *any* good, but to discourage medication assisted treatment and instead promote an approach that was developed closer to the Civil War than present day... well, that’s ignoring an awful lot of useful information we’ve learned about the brain over 80+ years", "2_Subreddit": "opiates"}], "dvccswi": [{"0_Comment Submission": "Efff speedballs feel so damn good, how the hell to quit these!! Has anyone out there quit a daily speedball habit?! Plz tell me how. I mean jeez it's like an orgasm from young Jesus.", "1_Text": "I know the struggle all too well. Habits like these don’t often end by choice, unfortunately. If it’s not ravaged veins or extreme financial hardship(i.e. homelessness), it could be an overdose. I hit all three and still couldn’t stop. Vivitrol/subs take care of the heroin, but months into sobriety I still fantasize about slamming coke. Best of luck with overcoming this, can’t say much more that’s already been said", "2_Subreddit": "opiates"}], "dwk7alp": [{"0_Comment Submission": "What's your secret stash spot ?", "1_Text": "[This inconspicuously titled bag](https://i.imgur.com/g5rVi47.jpg) whose contents nobody would ever guess", "2_Subreddit": "opiates"}]}], "1_submissions": [{"327wpv": [{"0_Title": "[serious] I just dropped a gram of bth in a public urinal. Need advice on damage control urgently", "1_Text": "That Coliseum looked mighty empty last weekend... I think Stan had a nightmarish vision about interest in the team persisting at \"empty stadium\" levels & realized LA won't fill his billion dollar seats w/o something worth watching @ least... LA rly is a different market. We must be made to give a fuck. He wants to make good on his investment, probably why Fishstache was canned after the stadium emptied, under his footballing product", "2_Subreddit": "opiates"}], "3enx7s": [{"0_Title": "Punctual Customer: 1 ; Tardy dBoy: 0 A True Tale of how the dboy was made to pay for breaking the ancient oath of swearing he'd \"be there in 20.\"", "1_Text": "That Coliseum looked mighty empty last weekend... I think Stan had a nightmarish vision about interest in the team persisting at \"empty stadium\" levels & realized LA won't fill his billion dollar seats w/o something worth watching @ least... LA rly is a different market. We must be made to give a fuck. He wants to make good on his investment, probably why Fishstache was canned after the stadium emptied, under his footballing product", "2_Subreddit": "opiates"}], "3wlg6f": [{"0_Title": "$2,580.93", "1_Text": "That Coliseum looked mighty empty last weekend... I think Stan had a nightmarish vision about interest in the team persisting at \"empty stadium\" levels & realized LA won't fill his billion dollar seats w/o something worth watching @ least... LA rly is a different market. We must be made to give a fuck. He wants to make good on his investment, probably why Fishstache was canned after the stadium emptied, under his footballing product", "2_Subreddit": "opiates"}], "47dcpu": [{"0_Title": "Mythbusters: Junkie Edition", "1_Text": "That Coliseum looked mighty empty last weekend... I think Stan had a nightmarish vision about interest in the team persisting at \"empty stadium\" levels & realized LA won't fill his billion dollar seats w/o something worth watching @ least... LA rly is a different market. We must be made to give a fuck. He wants to make good on his investment, probably why Fishstache was canned after the stadium emptied, under his footballing product", "2_Subreddit": "opiates"}], "4c6kg5": [{"0_Title": "Heroin Epidemic is Yielding to a Deadlier Cousin: Fentanyl", "1_Text": "That Coliseum looked mighty empty last weekend... I think Stan had a nightmarish vision about interest in the team persisting at \"empty stadium\" levels & realized LA won't fill his billion dollar seats w/o something worth watching @ least... LA rly is a different market. We must be made to give a fuck. He wants to make good on his investment, probably why Fishstache was canned after the stadium emptied, under his footballing product", "2_Subreddit": "opiates"}], "5goe6n": [{"0_Title": "Removing excess water from a shot?", "1_Text": "That Coliseum looked mighty empty last weekend... I think Stan had a nightmarish vision about interest in the team persisting at \"empty stadium\" levels & realized LA won't fill his billion dollar seats w/o something worth watching @ least... LA rly is a different market. We must be made to give a fuck. He wants to make good on his investment, probably why Fishstache was canned after the stadium emptied, under his footballing product", "2_Subreddit": "opiates"}], "67mzvl": [{"0_Title": "Amazon gift card to cash??", "1_Text": "That Coliseum looked mighty empty last weekend... I think Stan had a nightmarish vision about interest in the team persisting at \"empty stadium\" levels & realized LA won't fill his billion dollar seats w/o something worth watching @ least... LA rly is a different market. We must be made to give a fuck. He wants to make good on his investment, probably why Fishstache was canned after the stadium emptied, under his footballing product", "2_Subreddit": "opiates"}], "7pmifx": [{"0_Title": "The Relapse Carousel", "1_Text": "That Coliseum looked mighty empty last weekend... I think Stan had a nightmarish vision about interest in the team persisting at \"empty stadium\" levels & realized LA won't fill his billion dollar seats w/o something worth watching @ least... LA rly is a different market. We must be made to give a fuck. He wants to make good on his investment, probably why Fishstache was canned after the stadium emptied, under his footballing product", "2_Subreddit": "opiates"}]}]}]}