{"AusBillLee": [{"0_comments": [{"dwu680h": [{"0_Comment Submission": "My afternoon just got interesting", "1_Text": "Just 0.2g, its all going IV so it should stretch me the night though", "2_Subreddit": "Stims"}], "dwue0p9": [{"0_Comment Submission": "These are a LIFE SAVER when using. What’s your favorite anti-nausea medicine or remedy?", "1_Text": "In the past it was always promethazine. Potentiated the hit, increased nod and no nausea. And its over the counter in Australia.\n\nI figure it probably was partially responsible for a few OD's so im not doing that anymore.", "2_Subreddit": "opiates"}], "dwuf56b": [{"0_Comment Submission": "$100 (0.4)Worth of Canadian Fentanyl Brown (they sell it as H but my urine tests say otherwise). What do y’all pay?", "1_Text": "Where im at, its $50 for 0.1, $100 will get you .0.2 or 0.25 depending on who its from.\nAtleast thats what is supposed to weigh, usually under if its cold copped.\n\nOn the plus side its always #4 and fent is rare enough that it doesnt often show up in our gear.", "2_Subreddit": "opiates"}], "dwunbte": [{"0_Comment Submission": "My afternoon just got interesting", "1_Text": "Complete loser; says the guy going round throwing insults at random people on the internet lol. Havent got anything better to do?", "2_Subreddit": "Stims"}], "dwupwnf": [{"0_Comment Submission": "My afternoon just got interesting", "1_Text": "This is mostly a fair criticism, it didnt have much in it post rush i must admit. I dont think its as bunk as you think it is (10% is a little low i suspect) but its not like what i used to see/get a few years ago either. I made somewhat of a rookie error in getting a bit excited (was cheap as hell too)\n\ni wouldnt describe myself as a tweaker or a meth head, i use it maybe 2-3 times a year and dont claim to be an expert by any means; i also have zero tolerance though.", "2_Subreddit": "Stims"}], "dwuwzko": [{"0_Comment Submission": "$100 (0.4)Worth of Canadian Fentanyl Brown (they sell it as H but my urine tests say otherwise). What do y’all pay?", "1_Text": "Australia, and 99 times out of 100 its H, if its not its completely bunk more likely than fent.", "2_Subreddit": "opiates"}], "dww68bi": [{"0_Comment Submission": "People who have overdosed or had a near death experience on drugs, what drug(s) was it and what was it like?", "1_Text": "I shot heroin, felt really high; all of a sudden theres paramedics and my freaked out girlfriend, friends or brother standing around me looking concernes and im feeling sick. Roughly 30mins-1hr later im high again.\n\nHeroin/opioid overdose; whilst often fatal doesnt involve as much discomfort as that of a stimulant overdose for example. Not that ive experienced stimulant overdose personally, doesnt look fun though.\n\nEdit; the above scenario was a few different times.", "2_Subreddit": "Drugs"}]}], "1_submissions": [{"89wyj1": [{"0_Title": "My afternoon just got interesting", "1_Text": "Just 0.2g, its all going IV so it should stretch me the night though", "2_Subreddit": "Stims"}]}]}]}