{"N1njaj3w": [{"0_comments": [{"dw810zp": [{"0_Comment Submission": "Did I do / take something wrong?", "1_Text": "Sounds like fent to me I used to abuse patches and I'd have pinned pupils for like 2 days and would wake up with pounding headaches and feeling like I would pass out when I stood up after using them.", "2_Subreddit": "opiates"}], "dw81mdk": [{"0_Comment Submission": "Am I snorting my ecp wrong?", "1_Text": "That's sounds like fent to me but 5 times your normal dose even if you had a little tolerance to fent should fucking floor you they were either stepped on to shit or not opiates at all I used to be able to tell my guy his shit was weak but he started taking offense to it when I wanted 8/10 quality and he realized I was cutting in to his profits. And I have never paid 30 for a bundle in my live i don't know how your guy is making money. I guess that's what's so suspicious for me is the price and how you described the doing the 17 bags.", "2_Subreddit": "opiates"}], "dwfe6v7": [{"0_Comment Submission": "How many hydros is too many at one time?", "1_Text": "I once ate 45 norcos at once cause my tolerance is fucked from dope. Went to the hospital after vomiting all night and was diagnosed with gastritis.", "2_Subreddit": "opiates"}], "dwfehjd": [{"0_Comment Submission": "Mixy matchy party pack", "1_Text": "Take 40 mg of morphine for the nod and the body load man with the dilaudid it's a trip.", "2_Subreddit": "opiates"}], "dwhw86n": [{"0_Comment Submission": "So I'm gonna tell you a story, and I want to know what you think really happened.", "1_Text": "Your \"friend\" got all Nike bags from his guy switched them out inside with shit he brought with him and took the good bags and gave you flour or baking powder in the plain ones, stay far away from that shit he'll fuck you again without a care in the world. Sorry this happened to you but at least you got some shit out of it my main guy that lived down the street from me got out of jail and started selling fake bags and carrying his gun into McDonald's last time I picked up from him. I told myself I wouldn't go back to someone who fucks me you know.", "2_Subreddit": "opiates"}], "dwjdn67": [{"0_Comment Submission": "Texts with my dealsr", "1_Text": "The bagel is what's the best for me for some reason.", "2_Subreddit": "opiates"}], "dwjgx9b": [{"0_Comment Submission": "Texts with my dealsr", "1_Text": "Oh shit good luck man I hate owing people money I owe my dad 75 and I'm dreading the days as they go on I get paid on the second and it's a low check.", "2_Subreddit": "opiates"}], "dwjh6rp": [{"0_Comment Submission": "Lope price hike?", "1_Text": "I pay a dollar for 12 pills at dollar tree in my area if that's not to specific but they started pushing 6 packs of gel tabs for the same price.", "2_Subreddit": "opiates"}], "dwjhlt4": [{"0_Comment Submission": "So in true junkie fashion last night I found a few bags and a baggie of girl I thought I lost. Mixed up a mean speedball to end my opiate career with a bang this morning. And here..we..go...", "1_Text": "I didn't believe loperamide and krarom would work for me but it helped get rid of the shakes and sweating and some of the irritability but it may not work for you. I know that it got me over the 3 day hump of feeling like garbage. Hope you feel better man and stay safe.", "2_Subreddit": "opiates"}], "dwjm6i5": [{"0_Comment Submission": "Lope price hike?", "1_Text": "Yea it's crazy at my local jewel a 96 count bottle is 20 bucks", "2_Subreddit": "opiates"}], "dwjr55z": [{"0_Comment Submission": "Avoiding withdrawals possible?", "1_Text": "I just finished a two day supply of 5mg vicodins and I felt like shit afterwards irritability and rls I had clonidine and gabapentin but I was crawling in my fucking skin for like 3 days", "2_Subreddit": "opiates"}], "dwjz9no": [{"0_Comment Submission": "Didn’t even have to travel for it 😌 bye 33 days of sobriety", "1_Text": "Hey man stay safe your tolerance has probably dropped a bit so do test bumps/shots so you know what you can handle. I'm not going to give you a spiel about how you should toss it because I would be doing bumps rn so at least stay safe fam don't want you to od on some bullshit.", "2_Subreddit": "opiates"}], "dwkv3is": [{"0_Comment Submission": "Avoiding withdrawals possible?", "1_Text": "It sounds like bullshit but but I was in the hospital with my dad and those 8 5 mgs on top of like 15 Norcos I did a few days before that. Anyways im prescribed .3 mg of clonidine and like 1800 mg of gabapentin and felt like shit for like two hours in between doses and then took lope when I got home from the hospital and felt 100 times better.", "2_Subreddit": "opiates"}], "dwla4i4": [{"0_Comment Submission": "My mother takes Gabapentin every single day. What gives?", "1_Text": "No man I take 1800 mg a day and I'm just fine it's a separate problem from the gabapentin in my opinion.", "2_Subreddit": "Drugs"}], "dwn8cew": [{"0_Comment Submission": "prescription monitoring across state lines", "1_Text": "https://www.crisphealth.org/services/prescription-drug-monitoring-program-pdmp/\n\n\"If you have access to Maryland PDMP data, you can also view PDMP data from D.C., Virginia, West Virginia, Pennsylvania, Connecticut, Delaware, Minnesota, and  Arkansas.\" Sorry man doesn't look good for you but I'm not sure i just ran a quick Google search and found that.", "2_Subreddit": "opiates"}], "dwn8oo6": [{"0_Comment Submission": "prescription monitoring across state lines", "1_Text": "Oh no problem man anything to help. Have a great easter.", "2_Subreddit": "opiates"}], "dwqzxi8": [{"0_Comment Submission": "Waiting on my guy after the wat u need text.", "1_Text": "Worst part is i messaged him on facebook and i can see when he's online thats what killing me", "2_Subreddit": "opiates"}], "dwrfa1p": [{"0_Comment Submission": "Waiting on my guy after the wat u need text.", "1_Text": "He still hasn't hit me back up so I'm still waiting.", "2_Subreddit": "opiates"}], "dwshcg1": [{"0_Comment Submission": "Omw To the hospital with breathing problems", "1_Text": "Sorry to hear that man my dad has copd and emphysema so were at the hospital all the time. Usually for breathing problems it is an xray then breathing treatments every 4 to 6 hours at least that was the protocol for my father. Hope you feel better and when i was in for withdrawal i got clonidine for the withdrawal but it depends on the hospital and the doctors accreditation.", "2_Subreddit": "opiates"}], "dwt1cim": [{"0_Comment Submission": "dope porn sunrise [nsfw]", "1_Text": "I hope that shot gave you the warm fuzzies in your chest thats the best part of the day.", "2_Subreddit": "opiates"}], "dwt2alp": [{"0_Comment Submission": "A SFW Boof Time!", "1_Text": "Have fun hun hope you get the warm fuzzies.", "2_Subreddit": "opiates"}], "dwutrqp": [{"0_Comment Submission": "My dboy who sold me these bricks invited me into his trap house to party. I politely declined", "1_Text": "Hey girl good score stay safe and keep doing you im not going to tell you to change you shit because i be doing hella bags right with you but  have fun dude do one for your internet friends.", "2_Subreddit": "opiates"}], "dwuv42t": [{"0_Comment Submission": "Any effects from taking Dilaudid orally? Need advice.", "1_Text": "I have a tolerance to like 70 mg of hydro so about 35 mg of oxy i did 8 mg insufflated and it was a very mild warm blanket over me for like 2 hours before it wore off. I would start with 8mg  and redose every 4 to 6 hours as needed.", "2_Subreddit": "opiates"}], "dwuv6fj": [{"0_Comment Submission": "Any effects from taking Dilaudid orally? Need advice.", "1_Text": "Also oral doesn't do shit you basically have to snort it if your not going to shoot it.", "2_Subreddit": "opiates"}], "dwuvpvk": [{"0_Comment Submission": "Rehab", "1_Text": "Dude i know it sucks ass but if that whats they want to do in their house that's on them. If you want to continue smoking weed you'll probably have to etch that all out on your own it sucks but i think that's all you have. I agree with you that this is excessive in my opinion but they're your parents and that how shits works unfortunately.", "2_Subreddit": "Drugs"}]}], "1_submissions": [{"7mwxvw": [{"0_Title": "I knew what wad going to happen chipping trash patches but here we are.", "1_Text": "Sounds like fent to me I used to abuse patches and I'd have pinned pupils for like 2 days and would wake up with pounding headaches and feeling like I would pass out when I stood up after using them.", "2_Subreddit": "opiates"}], "7ucw64": [{"0_Title": "Have any of you guys had some wild is stories?", "1_Text": "Sounds like fent to me I used to abuse patches and I'd have pinned pupils for like 2 days and would wake up with pounding headaches and feeling like I would pass out when I stood up after using them.", "2_Subreddit": "opiates"}], "7xz74m": [{"0_Title": "Some vicodin and a soma.", "1_Text": "Sounds like fent to me I used to abuse patches and I'd have pinned pupils for like 2 days and would wake up with pounding headaches and feeling like I would pass out when I stood up after using them.", "2_Subreddit": "opiates"}], "85uthj": [{"0_Title": "New some advice cause I'm a piece of shit.", "1_Text": "Sounds like fent to me I used to abuse patches and I'd have pinned pupils for like 2 days and would wake up with pounding headaches and feeling like I would pass out when I stood up after using them.", "2_Subreddit": "opiates"}], "85vfsk": [{"0_Title": "I'm sorry what a rollercoaster of emotions but I'm back on my bullshit", "1_Text": "Sounds like fent to me I used to abuse patches and I'd have pinned pupils for like 2 days and would wake up with pounding headaches and feeling like I would pass out when I stood up after using them.", "2_Subreddit": "opiates"}], "89he4z": [{"0_Title": "Waiting on my guy after the wat u need text.", "1_Text": "Sounds like fent to me I used to abuse patches and I'd have pinned pupils for like 2 days and would wake up with pounding headaches and feeling like I would pass out when I stood up after using them.", "2_Subreddit": "opiates"}], "89i6kc": [{"0_Title": "Can only get magic mushrooms.", "1_Text": "Sounds like fent to me I used to abuse patches and I'd have pinned pupils for like 2 days and would wake up with pounding headaches and feeling like I would pass out when I stood up after using them.", "2_Subreddit": "opiates"}], "8aby4c": [{"0_Title": "Theres still hope for us all.", "1_Text": "Sounds like fent to me I used to abuse patches and I'd have pinned pupils for like 2 days and would wake up with pounding headaches and feeling like I would pass out when I stood up after using them.", "2_Subreddit": "opiates"}]}]}]}