{"_Dreadz": [{"0_comments": [{"dwh5cgg": [{"0_Comment Submission": "Happy Birthday to me...", "1_Text": "Do you have any friends or family you can hit with the “ hey you know it’s my birthday right? I’ve been a little stressed over the bills I’m a little short before I even think about my birthday... anyway possible you could help me with some for my birthday so I can have a little breath of air for my bday?", "2_Subreddit": "opiates"}], "dwh64g3": [{"0_Comment Submission": "BTH OD when smoked?", "1_Text": "They wouldn’t use the fent in its pure form it would be cut itself before being mixed in and I may have to call bullshit becuase the news loves to even say the bars are mixed with fent. I did watch a documentary the other day that followed around a bunch of poppy growers in Mexico and he said straight up they add it in and showed how they mix it with a coffee grinder and straight said everyone does it now days becuase if you don’t you loose what little profit they make so if that’s the case it’s coming premixed from the start of the chain before it’s even brought down to the major cities in Mexico waaaay before border crossing. I think someone said the name of the show was “the trade” and is based in Guerrero (probably spelling error) which is a heavily contested plaza which is currently ran by El Mencho’s crew. \n\nMencho or Tio was born in Mexico and then came to Northern California where he lived both in Fresno and San Francisco’ where he was detained and deported twice for heroin sells cases. He gets out of prison and sent back where he then funny enough becomes a police officer and then a sicario. He was the one who kidnapped chapos sons and would have killed them had chapos long time friend El Mayo who is believed to be the real leader behind the known face of chapo.  He just took chapos  public enemy number one for leading the CJNG ( cartel Jalisco Nuevo generation aka new generation Jalisco cartel)", "2_Subreddit": "opiates"}], "dwh6nm6": [{"0_Comment Submission": "I have a few questions about panda bears. Any help is much appreciated.", "1_Text": "Beg to differ.. the euphoria from them goes away extremely fast and never had that problem with oxy or hydro if my tolerance went up I would just take more. With the panda maybe becuase they are stronger I found that if I take more I just nod out and I’ve never nodded out standing up straight in the middle of the day until a panda but it was like within a week they were almost pointless and my tolerance just shot up so why the occasional panda is a fun time for me at least they aren’t cracked up what they are supposed to be and people just give them that rep becuase they are hard to get and when they do it’s like a bragging point or maybe they are shooters but i can say as someone who only eats and snorts 9 out of 10 times id still take oxy.  I’d go with panda if I just wanted to sleep or something but it’s not something i would take then go hang out with some friends that’s for sure.  Now i just save them for some special occasion and end up taking them with some Hydrocodone so that way i have the fucked up and euphoria mixed ( think it’s like the Dilly’s and are more for shooters or something i know I had been feeling like shit and taken a couple and i remember thinking damn this doesn’t even feel like a few Norco’s and had it not taken the WD away at least I would have been mad haha!)", "2_Subreddit": "opiates"}], "dwh6qqs": [{"0_Comment Submission": "This is seriously the worst forum to look when sick BUT the best when HIGH!! Lol", "1_Text": "Lmao exactly my guy! That was just wishful thinking and worded for the true ones that know the struggle of drooling over your phone for so long you elbow out your leg to sleep ahahahah", "2_Subreddit": "opiates"}], "dwh8l70": [{"0_Comment Submission": "I have a few questions about panda bears. Any help is much appreciated.", "1_Text": "Lol they are in the mix becuase I still prefer them but have no trouble with my 200-300mg of oxy so that isn’t the issue. I know quite a few people who are that way becuase I live an area where they aren’t hard to get pandas are only 15 a pop and a 30mg Roxy or the likes is 10-15 a pop. Only pay 3 bucks per 10mg Norco and 4 for 10mg perc. I’ve had my couple little binges on them becuase if a nice break is between them the euphoria comes back but I don’t get the same satisfaction as when i take perc or Norco ( just took 20 yellows for breakfast ) and I have no trouble handling the panda I just the enjoyment factor was gone. I’m sure if I was into the Nod i would love them but opiates are an upper for me I take a handful and then I’m in a great mood talkative feeling warm. That only lasts for the first day or two with the panda where as the others If the fun goes away I just take more. Wasn’t really the case so that could be my bodies chemical make up which is why they legit tell you not to take other peoples meds becuase they do affect different body chemistry differently and reactions are different. I have friends that can function of tons of bars meanwhile i can’t take a half 1mg without blacking out for 3 days. It seems the people that hold this pill so high up is on this sub. If you talk to real people most don’t even like them and feel the way I do. Maybe its supply and demand also the placebo effect is huge. If you believe they are from god becuase you read it every day it it’s either gonna be the greatest or the greatest let down and I could say I honestly didn’t see anything special about them compared to anything else :) ( the placebo effect is enough for women to start producing milk and lactating if they truly believed they were pregnant even though they weren’t which is why when they test meds you hear it’s against a placebo and all that is basically a blank sugar pill so they can compare peoples reaction to the drug when they don’t know if they are getting the real drug or not and some people end up say loosing weight or something becuase they believe they are on the pill. Also most people don’t have easy access to them so if they were far and few in between and expensive then maybe if my experience was based off having enough for like one dosage a month or something then I might feel the same way but as someone who can choose what to take I would say I would not be taking pandas everyday so maybe that’s why the majority feel the other way idk?", "2_Subreddit": "opiates"}], "dwh8trx": [{"0_Comment Submission": "Do doctors ever prescribe oxy for chronic migraines?", "1_Text": "Go in and tell them your balls hurt too much and you can’t fuck your old lady and she’s gonna leave you.  Had a buddy who’s one but was hurting him super bad like even to the touch and they did some tests and couldn’t find anything and they chalked it up as some infection and gave him 100 5mg Perc and told him to get with a pain specialist. Might be worth a try.", "2_Subreddit": "opiates"}], "dwhfele": [{"0_Comment Submission": "Some morning happiness! P.$ this is for the v haters that whined about no opiates in my last post!", "1_Text": "Yes I have anxiety bad too which is why they gave the Xanax script but my body can’t handle it. Shit valume is 10 times weaker and that puts my dick in the dirt and within minutes I’m fucked lmao.  Not to mention it’s only a super temp fix as a real doctor is not supposed to prescribe it for more then 6 months at a time so half the year your fucked and then if you get stuck on those man o man it’s one thing to feel like your gonna die but to actually risk death is a little out of my league. \n\nActually had a buddy who’s roommate got arrested and was on a daily habit of way too many bars and they didn’t give a fuck till they found his dead in his cell. I’ll stick to my opiates and cannabis for anxiety i already take enough risk in the opiate game haha. \n\nPersonally the opiates is what’s give me the self confidence and takes away my anxiety that’s why I think half the reason I’m stuck in the cycle as it helps more things then just my physical pain maybe? That’s why i still like to keep Norco’s in the mix they are like an energy pill and luckily live in an area I can afford for the moment to have a high tolerance and still take them all though I know there’s a much a cheaper alternative I think it’s a whole ritual for me. Pick up pop a handful after breaking them in halves and counting as i do it even though i know how many haha then grab a little Cesar’s pizza for the hour drive back to the pad", "2_Subreddit": "opiates"}], "dwhfw2z": [{"0_Comment Submission": "The Federal Highway System was built for NATIONAL DEFENSE purposes and paid by DOD funds..", "1_Text": "Was that the part they didn’t focus on? They basically made it seem that if they protested they would be facing the charges and said they were worth it to further the cause. A few of them are natives and were at standing rock helping I believe so I’m not sure if i missed it by saying public or private property but they made it seem more public as that was the kind of focus. I won’t give vice credit or clicks but it was released on their YouTube channel in the past 6 days if someone wants to check it out and maybe let us know a little more becuase that’s oppressing a fundamental right “the right to protest” but we all know how Oklahoma has treated the lands they took and taking away peoples right ( sitting bull and his tribe. Good movie on hbo about it ) so it wouldn’t surprise me if they screwing them over as I said there were native Americans involved", "2_Subreddit": "The_Donald"}], "dwhg5xl": [{"0_Comment Submission": "Is this computer any good for its price?", "1_Text": "Quick search shows it’s an audio engineer program for music creation and editing. Do i know how intensive the program is on resources?  Seems like a great deal for a MacBook if it’s not stolen just check the serial number with Apple first :) but as far as normal work there should be no issues the only problem maybe how  labor intensive the program is ( something like adobe or the likes )", "2_Subreddit": "pcmasterrace"}], "dwi2bn5": [{"0_Comment Submission": "Some morning happiness! P.$ this is for the v haters that whined about no opiates in my last post!", "1_Text": "Haha I only say that becuase i would black out and not even get to feel it I’m not saying it doesn’t work for anyone else lol", "2_Subreddit": "opiates"}], "dwm70z7": [{"0_Comment Submission": "BTH OD when smoked?", "1_Text": "calm there little man. \n\nand actually when you made the reference to \" a grain of salt\" that is actually implying its pure becuase anyone who is cutting their product on any regular basis would have it way more diluted down so no a \"grain of so and so\" wouldnt be enough to kill you otherwise how would they cut the product down to make it even worth the trouble? a grain of salt in an ounce of meth, H, whatever the substance would be there would be no reason to add a cut that you wouldnt be able to spread out and would be opposite of what your trying to achieve becuase at that grain of salt level your talking about that would mean there is one little piece floating around and  would be a one hit and the rest of the ounce or even bigger of a sac would have nothing in it. the whole point of cutting is to stretch all of it or to make already cut stronger again. maybe you didnt mean to say it but your words are all we can read not your mind;)", "2_Subreddit": "opiates"}], "dwmv4t6": [{"0_Comment Submission": "Just a scenic route through China.", "1_Text": "Ummmm pretty sure if what I’m seeing is correct is that in his shadows on the cliff face you can see it looks like a safety line coming off him and it’s probably attached to the guide chain and that would explain why he wasn’t concerned with holding on :)", "2_Subreddit": "AdrenalinePorn"}], "dwmv8ed": [{"0_Comment Submission": "Just a scenic route through China.", "1_Text": "Edit: also you can see from the start the clip with the lines i was talking about is on the middle of his chest and goes off to his right side", "2_Subreddit": "AdrenalinePorn"}], "dwmw2dq": [{"0_Comment Submission": "As a gay male who like to ride my motorcycle fast and in disregard of the law.. When I found this sub I thought I had found heaven...", "1_Text": "I’m sure the taste of iron is no where near as bad as slobbin down a chocolate dipped corn dog and he has a point. You totally unvalidated your argument the minute you judged him. I’ve notice the lgbtq community is great and playing the victim and pointing the finger and then will do what you did literally the next sentence and his reply to you about being judgmental was too perfect.  U can’t be on here crying about being judged and then immediately blatantly judge what gets a man his jollies haha I mean yea sure he might like to lick period blood but that leads to procreation meanwhile your obsession of dick is just awkward and leads to no kids which helps doesn’t help advancement of our species other then to exclude the mutated genes.  The goal of a human from a biological stand point is to survive and fuck and create, all this other shit just became a bonus.", "2_Subreddit": "CalamariRaceTeam"}], "dwmw5r9": [{"0_Comment Submission": "As a gay male who like to ride my motorcycle fast and in disregard of the law.. When I found this sub I thought I had found heaven...", "1_Text": "Wtf? You need to warn people about that kinda shit dog.  I’m glad you like to work on your gag reflex but some people don’t want to see that shit for real for real.", "2_Subreddit": "CalamariRaceTeam"}], "dwmwnvc": [{"0_Comment Submission": "As a gay male who like to ride my motorcycle fast and in disregard of the law.. When I found this sub I thought I had found heaven...", "1_Text": "That would be your interpretation of a statement which expressed no emotion so while you think that can u be sure I’m not laughing while saying some of it? I have to hear about this all the time my girlfriends sister is a big ol proud twat sucker", "2_Subreddit": "CalamariRaceTeam"}], "dwpxy66": [{"0_Comment Submission": "Rarest cars people have in Forza 7(Anyone need a specific car)", "1_Text": "Anyone got an extra Horizon 1997 m3? Would love to have one for fm7 drift :)", "2_Subreddit": "forza"}], "dww6kuc": [{"0_Comment Submission": "I have 5mg hydrocodone + 325mg Acetaminophen each pill. Whats the max safe amount of pills I could take at once?", "1_Text": "How many do you normally take?I had 150mg an hour ago", "2_Subreddit": "opiates"}], "dww7avn": [{"0_Comment Submission": "My pick today 2gs of fire bth", "1_Text": "Looks like you have a gram stuck to your hands. I don’t understand where a long the lines of being an opiate user one decides that washing up and cleaning yourself is no longer necessary it’s like fuck it who cares.. you know I can basically 100 percent guarantee if a user just takes care of themselves it makes everything from getting money easier...people tend to give you gas money if you half way look and smell like you actually own a vehicle and your dealers will usually hook you up a little chunkier if when you pick up you bullshit with homie but he isnt gonna wanna bullshit when you have last months dinner stuck in your front teeth and look and smell like you havent even wiped yourself down let alone showered. They gonna give you the shit and get the person out with a quickness and they little better on letting money slide when short or kickin enough to make u feel bettwr to hussle up the next one..people give up on people when they dont even have enough respect to give themself why would they care about anyone else so why should someone go out there way its not like they care obviously.just look at the picture and think to yourself “Would someone wantto touch/shake my hand thats getting money?”", "2_Subreddit": "opiates"}], "dww7tbi": [{"0_Comment Submission": "My pick today 2gs of fire bth", "1_Text": "Right? When your hands make BTH look clean.. something is well beyond fucked in the head..its amazing how much every single thing would improve with something as a shower every day shit even every other day even just Monday Thursday Sunday for our nostrils. I always feel so bad for the people that have to deal with nasty grubby ass people..being homeless and opiate addicted whether it be pills or Heroin it takes 5 minutes to get a rag and some hand soap and bird bath that shit. Money is not an excuse to be worthless and filthy.cant do it cus your sick fine but do it after when you feel like a king cuz you know damn well your gonna get the fix regardless.its easier for a clean person to get money when asking as well so its win fucking win situation!", "2_Subreddit": "opiates"}], "dww8amd": [{"0_Comment Submission": "Can the community give their input whether or not you guys think these are real?", "1_Text": "With the press game getting better and people realizing how much money is to be made if you live in an area and your concerned enough i would get the fent test strips. If the thought is even in your mind and there is possibility whereyou live no ones opinion from a reddit picture is going to be worth your life from either the pill harming you or you getting sketch and moving them to someone else and if they are hurt your liable even if you straight tell them and they know they will check phone records and person they got them from will be charged with manslaughter or worse so just consider your options wisely. I would take a quarter ofone and see..if you have experience you’ll know quickly (fent hits way faster) it will taste different. If your honestly that concerned toss them down the toliet like i said a picture is no where near a safe bet or a smart one to bet your life.personally id rail half and see from there but my tolerance is out the ballpark lmao 😂", "2_Subreddit": "opiates"}], "dww9cys": [{"0_Comment Submission": "My pick today 2gs of fire bth", "1_Text": "You’re work would have a sink and like a normal person you would wash your hands especially if you dealwith injections. Second, if your gonna post a pic of something it’s basiccommon sense to anyone who has posted online to wash your hands especially when your gonna make a post SHOWING OFF! The fact you had to counter my long comment with a long comment like yours just proves your in the same boat as him and it hit a cord. Go wash your hands too. No fucking excuse. And what does this guy do for work if that Les what’s it’s from? Clean resin out of bongs? If a normal person took that pic and saw the grubby ass you know what they would do... NOT POST THE PIC this is thefuckjng internet where u will be told your shits nasty whether it’s your room the floor or hands such as rhese and yours and it’s people NOT speaking up that people think it’s cool to go around filthy and stinking. It’s called common courtesy no body needs that discussed moment.  It’s called hygiene. No excuses.", "2_Subreddit": "opiates"}], "dwwa887": [{"0_Comment Submission": "My pick today 2gs of fire bth", "1_Text": "You wouldn’t post a picture of your face with shit smeared all over it would you? Nothing wrong if you want to walk around with grubby ass hands touching everything and leaving hands prints that’s on you. I get filthy daily being a welder and every job I have been at has a sink in fact most jobs that are manual labor require them from OSHA for eye wash out stations. Shit they even started bringing the porta potties with sinks so the farm workers can wash their hands out in the fields and they are illegal as fuck lmao 😂", "2_Subreddit": "opiates"}], "dwwa9mx": [{"0_Comment Submission": "My pick today 2gs of fire bth", "1_Text": "Triggered is only second to filth.", "2_Subreddit": "opiates"}], "dwwai4h": [{"0_Comment Submission": "My pick today 2gs of fire bth", "1_Text": "Lol it’s not even being mad. Just amazed that some people have no decency. If you don’t see an issue here then it’s already to late.  And please OP fill us in on this job please. Also if you have some reading comprehension that scores somewhat decent go ahead and go back and re read and you will Notice that some was directed towards him but shit like this always pops up and it was generalized more to the sub in its entirety and there actually legitimate questions asked so it’s not like i was just running my mouth for the fuck of it for example the part in where “ at what point does an opiate user just say fuck it and throw normal hygiene out the window? Like yea your homeless and addicted but what the hell does that have to do with being clean? I know some legit homeless people and they make it more of a point to be clean and presentable to make up for the other things they are lacking", "2_Subreddit": "opiates"}]}], "1_submissions": [{"6mv122": [{"0_Title": "[AMA Request] Stryker (Hobart Huson)", "1_Text": "Do you have any friends or family you can hit with the “ hey you know it’s my birthday right? I’ve been a little stressed over the bills I’m a little short before I even think about my birthday... anyway possible you could help me with some for my birthday so I can have a little breath of air for my bday?", "2_Subreddit": "IAmA"}], "6n0xmh": [{"0_Title": "Squad oriented build questions.", "1_Text": "Do you have any friends or family you can hit with the “ hey you know it’s my birthday right? I’ve been a little stressed over the bills I’m a little short before I even think about my birthday... anyway possible you could help me with some for my birthday so I can have a little breath of air for my bday?", "2_Subreddit": "joinsquad"}]}]}]}