{"jimjimjim420420": [{"0_comments": [{"dvwf5v2": [{"0_Comment Submission": "Chill out cels, girls don't care if you haven't had sex", "1_Text": "\"I'm not a virgin I'm just horrible at sex and have no idea what I'm doing\"", "2_Subreddit": "Braincels"}], "dvwge8f": [{"0_Comment Submission": "Anybody experience this before?", "1_Text": "You have peered through the mirage of pussy and seen actual fulfillment", "2_Subreddit": "Braincels"}], "dvwszm1": [{"0_Comment Submission": "Anyone Ever Experience This?", "1_Text": "Getting laid is a *really* low bar for \"genetic elite\"", "2_Subreddit": "Braincels"}], "dvwuemw": [{"0_Comment Submission": "This is what they want.", "1_Text": "Did you read the article?  He grabbed the bitch and started kissing, this wasn't just \"an advance\" it was a pretty advanced advance", "2_Subreddit": "Braincels"}], "dvwupkq": [{"0_Comment Submission": "Damn, RAGEFUEL, woman approaches a CHAD on VIRGIN airlines flight and rewards him with sex for winning the genetic lottery.", "1_Text": "Most women aren't even on tinder though", "2_Subreddit": "Braincels"}], "dvwwm6p": [{"0_Comment Submission": "I got a tweaker this delivers anything I want to my window at all times of the night", "1_Text": "Idk the guys name is pretty gross", "2_Subreddit": "opiates"}], "dvx0zjm": [{"0_Comment Submission": "Tipping runners", "1_Text": "Damn bro do you tip waiters and pizza guys?", "2_Subreddit": "opiates"}], "dvx57d3": [{"0_Comment Submission": "Question for anyone out there who does crack", "1_Text": "Yeah they don't have crack cocaine, so instead of calling meth \"meth\" they call meth \"crack\"\n\nThis comment felt odd to write", "2_Subreddit": "opiates"}], "dvy3p04": [{"0_Comment Submission": "Anyone Ever Experience This?", "1_Text": "I know that's the culture of this sub, but there's a bunch of \"low value\" women out there too, just fucking does not make you genetic elite. Maybe (genetically?) superior to the ones who can't fuck, but I'm sorry to reveal to you that most men, the vast majority even, have hidden their penis inside of another human at some point for *free*", "2_Subreddit": "Braincels"}], "dvy4o1l": [{"0_Comment Submission": "Anyone Ever Experience This?", "1_Text": ">in this sub of all places\n\nYes, where else lmao", "2_Subreddit": "Braincels"}], "dvy507p": [{"0_Comment Submission": "Anyone Ever Experience This?", "1_Text": "I thought it was pretty clearly about a guy fantasizing about having a woman come and dispell his clouds, based on the last panel. It's obviously not an ongoing relationship as he is sitting there alone, shrouded in his clouds just as bad as he ever was at the end of the comic. What's your take on it?", "2_Subreddit": "Braincels"}], "dw3fdxm": [{"0_Comment Submission": "Single mothers in 2018", "1_Text": "Is that really a myth?  Sauce please tbh", "2_Subreddit": "Braincels"}], "dw53bsm": [{"0_Comment Submission": "Always scared of not being able to get my next dose", "1_Text": "People don't want to hear that shit but it's true. One of the biggest mistakes you can make is allow yourself the freedom of an excuse to not face your problems.\n\nYour mental illness, your addiction, your whatever. It turns 10x as soon as you give it footing in your head.  Nobody will save you but you, and you either do or don't. \n\nAlso yes we are scared, smart, hairless, monkies and nothing else, IMHO. I like your opinions on the above matters, upvote 😂", "2_Subreddit": "opiates"}], "dwbby9r": [{"0_Comment Submission": "Anyone Ever Experience This?", "1_Text": "If you lurked me gooder you'd see I just like hanging out with \"virgins and junkies\". I'm not even a little bit of either  :\\^)\n\nEdit:  btw sorry ur wrong", "2_Subreddit": "Braincels"}], "dwbcbj5": [{"0_Comment Submission": "Single mothers in 2018", "1_Text": "I asked for a source here last week and you didnt give me one, instead I got downvoted. So I guess I'll continue believing 40 year old women pump out retards half the time.  Either way thanks.", "2_Subreddit": "Braincels"}], "dwda6mp": [{"0_Comment Submission": "Anyone Ever Experience This?", "1_Text": "Literally never had that high, you pathetic *le virgin*.  I have taken oxycontin pills years ago for legitimate pain, didnt take enough to get high, decided I didnt like them, and stuck the rest of the prescription in a medicine cabinet where I guess it either still is or has been thrown away. \n\nCool kids don't do drugs😎😎.  The stories on /r/opiates however can get downright compelling and when I get bored sometimes I go on a comment spree, sue me. /r/braincels is the same way, and these two are just the only 2 subs I ever read at the moment.\n\nEdit:  Maybe I like the dichotomy of a bunch of junkies working like crazy to hustle for their next hit but never getting anywhere in the long term, while incels LDAR and make this sub?", "2_Subreddit": "Braincels"}], "dwgh1m0": [{"0_Comment Submission": "Anyone Ever Experience This?", "1_Text": "Once again, lurk me better.  I barely spend any time posting anywhere", "2_Subreddit": "Braincels"}], "dwj6df0": [{"0_Comment Submission": "anon is a fool in a mans shoes", "1_Text": ">hurr nobody else can be inside ur brain\n\nNo shit sherlock", "2_Subreddit": "4chan"}], "dwjkm0u": [{"0_Comment Submission": "Anon hacks for grills", "1_Text": "Horseshit, in \n\n>current year\n\nStarwars is mainstream and nerds are the new normies", "2_Subreddit": "4chan"}], "dwjl2o0": [{"0_Comment Submission": "First time on 4chan", "1_Text": "I think, if you can wrap your head around this one, I *think* that they want that *very info* that *you* use to buy things online. \n\nWith me so far?  \n\nThey want that info so that *they* can also buy things online with your information. \n\nThe end result of this scheme being that the 1337 hackboys behind these scams get to buy things, while ***you*** foot the bill!  \n\nNow tell me, does that seem fair?", "2_Subreddit": "4chan"}], "dwjwu40": [{"0_Comment Submission": "Anon is a narc", "1_Text": "11 days ago you were a faggot", "2_Subreddit": "4chan"}], "dwkh1r9": [{"0_Comment Submission": "Ever realize how Women always get validation and consolation, while Men get slammed while they are already down?", "1_Text": "It can in fact come and go. You are the ignorant one in this case. Oops, at least now you know better 😂", "2_Subreddit": "Braincels"}], "dwm19ka": [{"0_Comment Submission": "Need some advice with running/cardio", "1_Text": "This sounds so so wrong but I don't actually know for sure, it just intuitively seems to me that running needs really good form.", "2_Subreddit": "Fitness"}], "dwpqy6e": [{"0_Comment Submission": "TYL: Completely useless facts about FTL", "1_Text": "I noticed another ship hailed me as \"human\" (I think it was a mantis ship saying \"move on or you're next human\") but I didnt have a human on my crew, it was all zoltans and rocks.", "2_Subreddit": "ftlgame"}], "dwsuu5j": [{"0_Comment Submission": "Every day that goes by I'm heartbroken FTL will never be on Android, will never be on Windows with touchscreen support, and there's no announced plans to do a Switch version.", "1_Text": "I'm very late but you might find it interesting that they hired a programmer to work with them for the ios port, it wasnt outsourced", "2_Subreddit": "ftlgame"}]}], "1_submissions": [{}]}]}