{"Botanicallover": [{"0_comments": [{"dv2oeq9": [{"0_Comment Submission": "Fentanyl patches", "1_Text": "You'd be surprised, if you have a tolerance those patches won't be really strong, and most of them are somewhat complicated to even get to the point of being able to IV them. Depending on the type of patch cutting it up and putting it on your gum line is probably your best bet just don't be surprised if you don't get a good nod.", "2_Subreddit": "HeroinHeroines"}], "dvb7qkt": [{"0_Comment Submission": "Venting about my situation <3", "1_Text": "I agree with all the girls above break up with him now no point in leading him on, let him process it and take out his initial anger while he's still locked up in the meantime, if he's threatened you and even a small part thinks he's serious change your number your already in a new town make sure he can't see any of your social media if you have it he'll sometimes it's not a bad idea to just deactivate or make new accounts just to lay low for awhile, but you know your guy best just always be careful and don't bank on these other dudes having your back because at the end of the day you don't want your safety in anyone's hands but your own if you can do something about it.", "2_Subreddit": "HeroinHeroines"}], "dw2qc0n": [{"0_Comment Submission": "Should I get a 100ug fent pill or a 8mg dilaudid", "1_Text": "You rush and nod if you've never nodded from dills then you haven't taken enough", "2_Subreddit": "opiates"}], "dw2qt1b": [{"0_Comment Submission": "omw 2 work, thinking bout US/EU differences", "1_Text": "My POS ex was so horrific at hitting himself I had to do it always and he's a dude! I'm a girl and I have connective tissue issues so my veins are shit but I can hit every tiny shitty one I have hell I can hit the veins on top of the knuckle on my thumb I don't understand what some especially guys are doing to themselves, I knew this one guy who I'd help out they all called me the nurse and he wastes a bun just being completely retarded and wrecked his arm right up I'm just glad I don't have that issue I've literally placed an IV in myself it kills me when nurses fuck up shredding my shit", "2_Subreddit": "opiates"}], "dwbchla": [{"0_Comment Submission": "On This Episode of “Real or Fake”?", "1_Text": "100000000% fake", "2_Subreddit": "opiates"}], "dwenql6": [{"0_Comment Submission": "Taste the Rainbow", "1_Text": "I recognize the Dillies I don't know what the other pills are, what's in the picture?", "2_Subreddit": "u_HiRoller26"}], "dwenzqa": [{"0_Comment Submission": "Dealing with addiction crisis", "1_Text": "My ex got a paraphernalia charge from the elastic from his underwear that he was using as a \"tourniquet\" fuck cops man", "2_Subreddit": "opiates"}], "dweo5zx": [{"0_Comment Submission": "Dealing with addiction crisis", "1_Text": "Jesus People in America are just so fucked up its unbelievable", "2_Subreddit": "opiates"}], "dwjbdos": [{"0_Comment Submission": "Just did a shit not sure what's up", "1_Text": "The shot was 3 4mg dillies, im used to normal histamine reactions but it's not like that nothing swollen or anything just red patches anyone have an idea what's going on?\n\nUpdate: it's been a few minutes and the spots are still there", "2_Subreddit": "opiates"}], "dwjwmiw": [{"0_Comment Submission": "Just did a shit not sure what's up", "1_Text": "Thanks I'll keep an eye on it no pain so that's a good sign, I think they're starting to fade a bit already!", "2_Subreddit": "opiates"}], "dwjwpbc": [{"0_Comment Submission": "H.R. Supplies Offer", "1_Text": "Sounds like a great idea", "2_Subreddit": "opiates"}], "dwl4epw": [{"0_Comment Submission": "Come check this .onion out, you might just like what you see!", "1_Text": "Thank you for making this I'm on now too!", "2_Subreddit": "u_KickerS12X"}], "dwl4w9t": [{"0_Comment Submission": "Man I’m just having good day after good day! Love serving!", "1_Text": "Your not smoking those bars, right? I assume the pipe is for rock?", "2_Subreddit": "opiates"}], "dwlc3ez": [{"0_Comment Submission": "Man I’m just having good day after good day! Love serving!", "1_Text": "He had broken up chunks of bar next to his pipe and I phrased the question assuming it wasn't, but you never know, I see people constantly sniffing bars which is a fucking waste I've also seen people try to shoot them even though they're not water soluble people do crazy shit, someone crazy enough to try to smoke xanax doesn't seem that wild to me.", "2_Subreddit": "opiates"}], "dwleyog": [{"0_Comment Submission": "God Damn Mail Mam", "1_Text": "Do you have to use ID to set up a PO box I guess what I'm asking is how risky is this?", "2_Subreddit": "opiates"}], "dwllgmh": [{"0_Comment Submission": "God Damn Mail Mam", "1_Text": "So you think it's safer to get stuff sent to your house the get a PO box?", "2_Subreddit": "opiates"}], "dwsn1ux": [{"0_Comment Submission": "I have a legitimate issue with emotions...", "1_Text": "Dm we can talk", "2_Subreddit": "HeroinHeroines"}], "dwsnn13": [{"0_Comment Submission": "Fuck relationships..", "1_Text": "Your story almost completely reflects mine I was 18 when we met a virgin he was my first we were together for almost 2 years and while all that shit was going down I was severely ill in and out of hospitals, but I was the one tucking him to bed rolling around with an IV pump, and we even got engage, I was stupid didn't now any better I was a straight A student virgin when he picked me up now I'm 20 and dealing with felony heroin charges, but also at the end of the day KNOW KNOW all his behavior is him hurting himself by hurting you , I'm pretty sure you the best thing going in his life therefore he's self destructing and the drug mood swings don't help and he can self destruct by being cruel enough to get you to remove yourself and then comes back hands and need crying, my ex systematically destroyed me please I know when you love someone it's the most painful thing in the world but I should have got away when there was a chance earlier,  but he always lured me back almost out of pitty and I'd say get out and not just get out RUN!!'nn", "2_Subreddit": "HeroinHeroines"}], "dwwkuef": [{"0_Comment Submission": "Fuck relationships..", "1_Text": "Girl you ever need to vent need help or anything DM me please don't hesitate!!! We might be able to support one another!!! :)", "2_Subreddit": "HeroinHeroines"}]}], "1_submissions": [{}]}]}