{"Livybird82": [{"0_comments": [{"dvldhrg": [{"0_Comment Submission": "Oxys 80 and picnic. Ohhhh...", "1_Text": "Can you send contact info for these? Looking for vendor..", "2_Subreddit": "opiates"}], "dwcnpl9": [{"0_Comment Submission": "Old timers", "1_Text": "I was using during that time, stopped for quite some time. When I started again and heard what they changed them to I was quite disappointed!", "2_Subreddit": "opiates"}], "dwcpwf8": [{"0_Comment Submission": "Current dwelling", "1_Text": "Same here", "2_Subreddit": "opiates"}], "dwf8ifv": [{"0_Comment Submission": "opiate insomnia", "1_Text": "It’s hard for me to fall asleep too. I take oxys and they used to help me fall asleep right away, as they helped with my pain (chronic pain patient) but now it’s much harder to fall asleep.", "2_Subreddit": "opiates"}], "dwgq24d": [{"0_Comment Submission": "I'm an opiate newb, I don't wanna OD, can I get some advice?", "1_Text": "Love to snort too. I’m new on here and have been reading that eating them is supposed to be better. I try it, but I still just want that powder up my nose! Trying to figure out a good combo of eating so they last longer, and snorting for that rush.", "2_Subreddit": "opiates"}], "dwpq5h6": [{"0_Comment Submission": "After 6 long years of growing tolerance and an increased mental and physical dependance on RX opiates I'm finally completely off.", "1_Text": "I’m also a chronic pain patient. I’ve been wanting to lower my dose on my own, but it’s hard. I always tell myself I’m going to do it, but I always come up with excuses. I need to come up with a plan like yours and just stick to it. I need to supplement my rx with extras I buy every month. The last couple of months I would have to drastically lower my dosage the last week before my refill so I wouldn’t run out. But at least this month I’m taking them so that won’t happen. My connect I buy from will be moving away next month, so I’ll really have no choice but to lower it down to where I can be comfortable with my own meds. I only know that one person to buy from and don’t know how else to get the extras that I need. So, I’ll have to come up with that plan soon, and stick to it! But thanks for sharing your story, gives me a little hope and idea for a tapering plan.", "2_Subreddit": "opiates"}], "dwu4dwl": [{"0_Comment Submission": "Pin point pupils", "1_Text": "Good to know! Going to get some tomorrow. I have the same problem, with blue eyes.", "2_Subreddit": "opiates"}], "dwyex7u": [{"0_Comment Submission": "\"Why don't you just smoke weed?\"", "1_Text": "Same here... weed fucks me up like nothing else. Not in an enjoyable way either. I tried edibles because I heard it’s more of a body high, but it still messed with my head, made me super anxious. I tried it again after many years hoping it would help with my chronic pain. It does help with my pain, but I’m too fucked up. Wouldn’t be able to go about my daily activities in that state of mind.", "2_Subreddit": "opiates"}], "dwyf30p": [{"0_Comment Submission": "Pin point pupils", "1_Text": "I got some of those drops, it worked! Now I’m not scared to make direct eye contact with people at work. Thanks for the info!", "2_Subreddit": "opiates"}]}], "1_submissions": [{}]}]}