{"BIGD0321": [{"0_comments": [{"dwjzsqi": [{"0_Comment Submission": "First time klonopin", "1_Text": "Just smashed 4 1mg green tevas after a nasty chest and shoulder workout haves great night friend I take them hit a hot shower and get out chillin .....", "2_Subreddit": "benzodiazepines"}], "dwk2hss": [{"0_Comment Submission": "First time klonopin", "1_Text": "Haha I'm totally running 125mg of tren a eod with 700mg of test e with 400mg EQ a week trust me a need the pins at night lol", "2_Subreddit": "benzodiazepines"}], "dwkmgjj": [{"0_Comment Submission": "ORANGE TESLAS", "1_Text": "Being that your a newer user of M I would take a half testlas are great but imo they are not the 280 mg they claim and good for you to have self control I took 2 testlas  and it  was awesome  may just be my last roll it was 15 years since the last roll it was a white dove WOW I'm old lol I rolled threw the 90s rave scene and didn't have the net yet and just went with it .......towards the end of my party days the online ecstasy data.com wasn't yet a .com lol they just showed up at raves for a service. We never used them.", "2_Subreddit": "MDMA"}], "dwng65d": [{"0_Comment Submission": "Thoughts/experience with gabapentin?", "1_Text": "Take 2400 mg for effect my gaba receptors are smoked so it really makes me feel great.......there is a horrible withdrawal after a few weeks so be careful", "2_Subreddit": "Drugs"}], "dwp5zw8": [{"0_Comment Submission": "Illegal Substances", "1_Text": "I appreciate your words !!! Very nice view and said well I love different views on the truth", "2_Subreddit": "shrooms"}], "dwq08pi": [{"0_Comment Submission": "Hey, I've just been prescribed methylphenidate as a 19 year old. Doctor told me NO recreational drugs at all can be used.", "1_Text": "From experience Ritalin will not hurt you when used with other drugs if they work for you and you don't abuse them i would suggest you stop taking them 2 days before your party time and start taking normal dose when you get your 1st sleep you will be a very happy man waking up to a solid 20mg. Of methylphenidate after useing those three drugs it will help alot especially if you don't abuse your meds.......honestly I'm not a doctor so there really could be a reason she stressed that to you but I never ran into any bad effects from that mix and I would add pcp to that mix too. Like I said just my experience not advice. Happy rolls and holes and slopes be safe.", "2_Subreddit": "Drugs"}], "dwq0bux": [{"0_Comment Submission": "is md addiction a thing?", "1_Text": "You can't stop anything but you are right its not a good thing at all so .......what you can do is be a friend and make her aware without scaring her off and no matter what help her through what ever comes her way .......thats a friend good luck you and your friend are in my thoughts", "2_Subreddit": "Drugs"}], "dwq0egw": [{"0_Comment Submission": "Had unintentional unprotected sex with a recovering heroin addict", "1_Text": "Well the only answer is being repeated over and over .....you could ask her if she has any thing straight forward .", "2_Subreddit": "sex"}], "dwq0n1r": [{"0_Comment Submission": "Wish me luck, I think a controlled delivery is underway", "1_Text": "Yup don't touch it for hours just let it sit .......leave your house go out for the day because honestly why would a cop call you and basically tell you we are coming ? I'm not sure how LE is in your country but I assume they are not that stupid and if they are be 1 up on them and just not take it as your mail when you do pick it up like physically  wright with a marker return to sender the package  . Other than that good luck and you had it coming ordering that many packs to 1 house. Not being an ass. I hope all is well.", "2_Subreddit": "Drugs"}], "dwq0y61": [{"0_Comment Submission": "Hi help from who to trust", "1_Text": "Huh not where I live", "2_Subreddit": "Drugs"}], "dwq16yx": [{"0_Comment Submission": "Gotta love Micron filters... 120mg of IR Morphine (not the ER crap) filtered crystal clear in 0.9% sterile saline using a .45um and then a .22um Micron filter. Since you can only fit 50mg/ml of Morphine Sulfate I had to whip out the 3cc. Time for Netflix and some pain free relaxation.", "1_Text": "Wow that looks very similar to my 500mg. Of test shots lol have fun be safe", "2_Subreddit": "opiates"}], "dwr1qyu": [{"0_Comment Submission": "I gave a squirrel autism", "1_Text": "Ahhhhh ok", "2_Subreddit": "Drugs"}], "dwr2hev": [{"0_Comment Submission": "Weed prices crazy low in US", "1_Text": "Up at the top of New England  (legal state) ozs were 300 now as low as 75 it's crazy", "2_Subreddit": "Drugs"}], "dwrrcrx": [{"0_Comment Submission": "What is the heroin capital of the US?", "1_Text": ".Lawrence Mass.", "2_Subreddit": "opiates"}], "dws9wue": [{"0_Comment Submission": "Maybe just a stupid tweaker question.", "1_Text": "Hmmmmmmmmmmm you may want to check into the casserole dish I get dry mouth when eating casseroles", "2_Subreddit": "Stims"}], "dwsc7a7": [{"0_Comment Submission": "What's the Best way to deal with this type of Withdrawal?", "1_Text": "Yes def tapper done to 300mg then to 100mg maybe even lower than eod small dose and good idea about the benzos for a day or 2 I found that no matter how low I tappered it was still 2 full days without before I starting staging (detoxing) it sucks but it's different then other drugs by far ......the worst part for me was the most excessive sweat I have ever delt with its insane 3 towels a night 5-8 shirts a day and I did it in January in the north east ugh.....but I made it and so can you !!!! Good luck you'll be fine", "2_Subreddit": "Drugs"}], "dwsvrkh": [{"0_Comment Submission": "What's the Best way to deal with this type of Withdrawal?", "1_Text": "Well night 3 sleep is shitty bad dreams if you sleep at all I got prescribed  clonidine for a month it helped but def. Get sleep aid diphenhydramine 50mg. Don't take more than 100mg. It has adverse effects you will hate your self ......good news you sweat so bad the detox is only 72 hours and your 90% through sleep is the hanger so smoke weed if you can it's recreational where I live so it's easy to grab. .....if you need me just hit me with a PM I build houses so I am busy but will check them here and there .....keep your eye on the prize my friend you can do it and will do it !!!!", "2_Subreddit": "Drugs"}], "dwt4pt7": [{"0_Comment Submission": "This guy decides if you were a kid in the 90’s.", "1_Text": "I Created Myself in the 90s born in 80", "2_Subreddit": "gatekeeping"}], "dwufi8i": [{"0_Comment Submission": "Woman intentionally ignites gas pump", "1_Text": "Ahhh what ? How come? Very confused? ........ok your right hunny it is flammable lol", "2_Subreddit": "nononono"}], "dwuvf2f": [{"0_Comment Submission": "Woman intentionally ignites gas pump", "1_Text": "Hahaha", "2_Subreddit": "nononono"}], "dwwlz3e": [{"0_Comment Submission": "Nitrazolam", "1_Text": "Without any research on my half .......i thought the mg. On this chem was in the 30-40mg range maybe I'm wrong like I said just a thought and maybe boofing but not snorting as far I know that class is pointless to snort......i would lol", "2_Subreddit": "researchchemicals"}], "dwxfxkz": [{"0_Comment Submission": "PCP liquid administration", "1_Text": "If it helps any it is definitely absorbed threw the skin", "2_Subreddit": "Drugs"}], "dwxgpux": [{"0_Comment Submission": "PCP liquid administration", "1_Text": "No I just know that my brother spilled it all overhimself back in the 90s ir,wasn't good lol", "2_Subreddit": "Drugs"}], "dwy4ydh": [{"0_Comment Submission": "These bars look sus? Pressed?", "1_Text": "Yeah they are pressed but take a little taste the presses I have been getting are alprazolam if it's bitter AF it's probably alp and if not who cares they are probably Etiz ......hipe they are not fent ugh", "2_Subreddit": "benzodiazepines"}], "dwymi9a": [{"0_Comment Submission": "Cost of suboxone and methadone in the the US?", "1_Text": "It's cheaper to buy them on the street by far it's  14 dollars for a strip at the pharmacy and 10 on the street pills are cheaper in both places but again cheaper on the street", "2_Subreddit": "opiates"}]}], "1_submissions": [{"80ciou": [{"0_Title": "Any one remember???", "1_Text": "Just smashed 4 1mg green tevas after a nasty chest and shoulder workout haves great night friend I take them hit a hot shower and get out chillin .....", "2_Subreddit": "MDMA"}], "80d1b4": [{"0_Title": "TAS", "1_Text": "Just smashed 4 1mg green tevas after a nasty chest and shoulder workout haves great night friend I take them hit a hot shower and get out chillin .....", "2_Subreddit": "researchchemicals"}], "80ye1n": [{"0_Title": "ACL", "1_Text": "Just smashed 4 1mg green tevas after a nasty chest and shoulder workout haves great night friend I take them hit a hot shower and get out chillin .....", "2_Subreddit": "u_BIGD0321"}], "811v7n": [{"0_Title": "u/ACLbio", "1_Text": "Just smashed 4 1mg green tevas after a nasty chest and shoulder workout haves great night friend I take them hit a hot shower and get out chillin .....", "2_Subreddit": "u_BIGD0321"}], "896a06": [{"0_Title": "Etizzzz $$$ ?", "1_Text": "Just smashed 4 1mg green tevas after a nasty chest and shoulder workout haves great night friend I take them hit a hot shower and get out chillin .....", "2_Subreddit": "researchchemicals"}]}]}]}