{"mikaneda": [{"0_comments": [{"dvv9n2f": [{"0_Comment Submission": "Uber Dopes", "1_Text": "Oh cool, I'll check it out", "2_Subreddit": "opiates"}], "dwh1pyw": [{"0_Comment Submission": "This is seriously the worst forum to look when sick BUT the best when HIGH!! Lol", "1_Text": "I like looking at it whilst *getting* high", "2_Subreddit": "opiates"}], "dwh1trn": [{"0_Comment Submission": "Dopesick to ALIVE - Easter resurrection", "1_Text": "I know that feeling bruvvvvvahhhhhhh. Chase that little bastard all up and down the crease in that cheap one pound foil and feel the sickness and anxiety slowly be replaced with warmth and contentedness and a deep dark dive into the oblivion of gearsmoke", "2_Subreddit": "opiates"}], "dwh23j1": [{"0_Comment Submission": "BTH OD when smoked?", "1_Text": "Agreed. Correct me if I'm wrong, but it was mixing it with xanax that did it; as others have said, you'd get to a place through smoking where you'd simply stop before ODing.\n\nI suppose it's possible to pass out and choke on vomit, but even then your body would snap to before that happens. With the xanax in the system, however, it's a different story....", "2_Subreddit": "opiates"}], "dwhq9fw": [{"0_Comment Submission": "BTH OD when smoked?", "1_Text": "oh I wasn't asking you anything, sorry, maybe I worded my post badly", "2_Subreddit": "opiates"}], "dwhy77u": [{"0_Comment Submission": "Rebate; Re up; Relief", "1_Text": "Thanks brother. I wish this for more addicts too. There are some awesome people on this sub, and I don't read/post as much as I'd like; I wanted those struggling to know that there can be balance.\n\nI'm not advocating addiction, but I am striving for sustainability.", "2_Subreddit": "opiates"}], "dwyq2rr": [{"0_Comment Submission": "Rebate; Re up; Relief", "1_Text": "> As a functioning addict who wishes to become high-functioning, I'll be shooting a PM your way.\n\nPlease do. I'd be more than happy to swap stories/give advice/listen to whatever you want to talk about. I'm a people person. I enjoy hearing other people's experiences, especially on this sub, which is so interesting. \n\n> I wish more people would acknowledge that getting sober isn't the most important thing; developing life skills is\n\nI hear you. It's just that, for a lot of (most?) people, the two are pretty much mutually exclusive. I feel like I can learn new, and develop old, life skills even when I'm using.\n\nIn fact, I'd go so far as so say that trying new things when you're **just** stating on your path to sobriety can actually be a trigger for relapse, in that, you may try something you've always wanted to try, and then (because this is how life works), you don't succeed first time: what are you gonna do - pick up the pen/racket/cue/ball/control-pad/textbook/poetry notepad/etc. and start again?\n\nMaybe. \n\nBut if you're anything like I **used** to be? No, you'll reach right for the needle/foil/pipe/grindr/etc. to stave off the already rapidly encroaching sense of guilt and worthlessness that accompanies any perceived failure on your part, be it small (like boiling an egg and breaking it accidentally) or big (like finally picking up that unpaid bill from months ago, you know, the one where they're threatening to take your stuff? Only to find that there's about £4 less in your account than is needed to pay the fucking thing, which, honest to god, you **were** willing to pay, you promise, and is there **any** way we can work out a payment plan? I mean, you've been with that phone/gas/gym company for over a decade now and this is the only time.......what's that? Oh, ok, fine, the **second** time you've ever been late paying the bill...).\n\nYeah, you know how it goes. So I think you've got the right idea when you say:\n\n>I think there would be less damage leading up to that point and fewer relapses afterward\n\nOh, and, thanks for this:\n\n>Congrats, proud af of you, stranger\n\n:)", "2_Subreddit": "opiates"}], "dwys82g": [{"0_Comment Submission": "Supplies for a two-week sting off work", "1_Text": "I made these three orders on Thursday 29th March, after which I immediately left my city to visit family for the long Easter weekend. I returned to my city on Thursday evening, with two of the three deliveries waiting for me: the eighth of weed and the 100x10mg blue valium (jellies).\n\nNow, Friday 30th & Monday 2nd were both no-post days in the UK; two of the packages were UK-to-UK, and both arrived on the Wednesday 4th, which makes sense (in fact, when you think about it, it's pretty much NDD).\n\nOne of them, the dope, was from Northern Europe. I'd ordered from this vendor before - it was on a Wednesday night, and it arrived Saturday morning, which I couldn't believe. So I thought, with the post outage, this'll probably arrive on the Thursday (yesterday - the 5th). \n\nSadly, the postman didn't have anything for me, so I decided to ring d-boy and have him deliver a couple bags to tied me over till Friday (today), which I thought **must** be the delivery day for my third package. \n\nNow, this d-boy, I try very rarely to score from him. I have another guy, who, although he doesn't deliver, does much better quality dope and in much larger prizes, but, annoyingly, he was out of action yesterday.\n\nSo anyway, I'm getting a slight nod from this sub-standard gear, as well as a little kick from some rocks that I also ordered from this same d-boy (his white being marginally better than his brown), when the urge strikes me to, one last time, rifle through some of the non-packaged, regular-looking mail (envelopes) that's been delivered over the last couple of days (there are a lot of people living in my warehouse complex, so there was quite a lot to get through, and I didn't actually check to see if there was any actual regular mail for me anyway).\n\nMy heart stops. Here's an envelope, a little fatter than the rest, with a printed address that's *exactly* how I type it in the DNM address box, with, holy fuck, a bunch of Netherlands stamps in the top right corner. \n\nNow, regardless of the fact that I've wasted £12.50 on two bags of shitty dope, plus £12.50 on two bags of slightly-above-average crack, I now have all three DNM orders (this still being Thursday 5th April, at around 5.00pm), including 7 grams of the finest #3 I've ever had the pleasure of using. \n\nAnd of course I shoot up straight away, completely forgetting that one of my best friends is coming over for a smoke (weed) and some PS4. God knows what he must've thought I was on. I managed to fob him off with \"too many jellies and too much weed\", and I *think* that placated him slightly, but.....\n\nAnyway, I thought I'd give you guys a snapshot (literally), of my day today. The Mandy is from a previous order - I just thought it'd look nice :)", "2_Subreddit": "opiates"}], "dwyse5k": [{"0_Comment Submission": "Supplies for a two-week stint off work", "1_Text": "I made these three orders on Thursday 29th March, after which I immediately left my city to visit family for the long Easter weekend. I returned to my city on Thursday evening, with two of the three deliveries waiting for me: the eighth of weed and the 100x10mg blue valium (jellies).\n\nNow, Friday 30th & Monday 2nd were both no-post days in the UK; two of the packages were UK-to-UK, and both arrived on the Wednesday 4th, which makes sense (in fact, when you think about it, it's pretty much NDD).\n\nThe third package, the dope, was from Northern Europe (and I'd ordered from this vendor before - on a Wednesday night - and it arrived on the following Saturday morning, which I couldn't believe). So, on Thursday 29th, as I was ordering it all, I thought, with the post outage, this one will probably arrive on the Thursday 6th, a day after the two domestic deliveries. \n\nWaking up Thursday, and sadly the postman didn't have anything for me, so I decided to ring d-boy and have him deliver a couple bags to tied me over till Friday, which I thought **must** now be the delivery day for my third package.\n\nNow, this d-boy, I try very rarely to score from him. I have another guy, whom, although he doesn't deliver, does much better quality dope and in much larger sizes, but, annoyingly, he was out of action yesterday.\n\nSo anyway, I'm getting a slight nod from this sub-standard gear, as well as a little kick from some of the rocks that I also ordered from this same d-boy (his white being marginally better than his brown), when the urge strikes me, one last time, to rifle through the non-packaged, regular-looking mail (envelopes) that had been delivered over the last couple of days (there are a lot of people living in my warehouse complex, so there was quite a lot to get through, and I hadn't checked to see if there was any regular mail for me anyway).\n\nMy heart stops. Here's an envelope, a little fatter than the rest, with a printed address that's exactly how I type it in the DNM address box, with, holy fuck, a bunch of Netherlands stamps in the top right corner.\n\nNow, regardless of the fact that I'd wasted £12.50 on two bags of shitty dope, plus £12.50 on two bags of slightly-above-average crack (d-boy does 4 for £20, in case you hadn't figure out his deal system), I now have all three DNM orders (this still being Thursday 5th April, at around 5.00pm), including 7 grams of the finest #3 I've ever had the pleasure of using.\n\nAnd of course I shoot up straight away, completely forgetting that one of my best friends is coming over for a smoke (weed) and some PS4. God knows what he must've thought I was on; I managed to fob him off with \"too many jellies and too much weed\", and I think that placated him slightly, but.....\n\nAnyway, I thought I'd give you guys a snapshot (literally), of my day today. The mandy is from a previous order - not even mine - I just thought it'd look nice with the rest of my gear, all laid out and ready to go \n\n:)\n\nBe safe, be well, and above all, be fucking awesome.", "2_Subreddit": "opiates"}], "dwyspkr": [{"0_Comment Submission": "I’m on weed suboxone 8mg and Xanax 1mg am I okay to sleep?", "1_Text": "If you're using suboxone (we call it subutex where I live) as an ORT, then it really depends on your heroin usage prior to prescription. When I was on it, I was on 0.4mg x 5/day, so that's 2mg every 24 hours, which was enough for me to stave off the withdrawals and not jones towards the 22nd/23rd hour. I imagine if you're on 8mg/day then your heroin/opiate usage was considerably higher than mine.\n\nIf I took my normal dose of 2mg, then smoked a huge spliff, then ate a 2mg xanax, I probably wouldn't *sleep*, per say, but I would feel very relaxed, drowsy, and might even nap. But, sleep, as in the deep dark sleep of the untroubled soul? No.", "2_Subreddit": "opiates"}], "dwyumph": [{"0_Comment Submission": "Supplies for a two-week stint off work", "1_Text": "It's too big to be a contact lens; no, it's a dope-cooker - can be found in any pharmacy rig-set (where the pharmacy is part of your city's/area's needle-exchange programme", "2_Subreddit": "opiates"}], "dwyxr6x": [{"0_Comment Submission": "Supplies for a two-week stint off work", "1_Text": "Yeah, when I said “2 weeks” I meant the substances themselves, rather than the assorted paraphernalia; I do indeed have more rigs, more cookers, more acid, etc.\n\n7 grams of dope; 100 blue jellies; 3.5 grams of mandy (which to be fair isn’t actually mine - I bought it for a mate who’s DNM-challenged); and  lastly that’s about 2 grams of weed. \n\nThis *should* all last me a week, since I’m splitting the dope with a different mate. \n\nI say mate. He’s super fucking cute and so I don’t want to jinx it by putting him into “mate status”. \n\nIf you’re reading this, yeah, you already know I think you’re cute.", "2_Subreddit": "opiates"}], "dwyxto6": [{"0_Comment Submission": "Supplies for a two-week stint off work", "1_Text": "I know. Possibly being optimistic", "2_Subreddit": "opiates"}], "dwyxwsa": [{"0_Comment Submission": "Help a friend out", "1_Text": "Xanax and weed over charlie any day of the week", "2_Subreddit": "Drugs"}], "dwz0sn8": [{"0_Comment Submission": "Supplies for a two-week stint off work", "1_Text": "Ah, thanks man, that's good advice, but with just two *minor* caveats:\n\n**a)** that ain't crystal; in fact, there's only one substance in that photo that gets my sex drive going, and that's the tiny bit of crack up there in the top right, above the benzos (admittedly though, it does get me **fucking** horny...)\n\n**b)** we met on reddit, fairly recently, and are only just getting to know each other. There is clearly something there, but we're taking it slow, for a lot of reasons. In fact, nothing has actually happened between us apart from hanging out and chatting, but, we're both aware I think of how strong the connection is even at this early stage\n\nBoy - if you're reading this, please don't be mad at me :)", "2_Subreddit": "opiates"}], "dwz18og": [{"0_Comment Submission": "First time benzo injection", "1_Text": "Pills....", "2_Subreddit": "benzodiazepines"}], "dwz2km1": [{"0_Comment Submission": "Supplies for a two-week stint off work", "1_Text": "That's what everyone says, and yeah, it does look dark, but *man* it smokes like a dream; all bud; no stalk or seed or leaf; it grinds up beautifully; a full 3.5g for £29 (including delivery). \n\nIt's by no means knock-your-face-off-your-skull-fuckery, but then, that's not what I'm looking for, and if I was, I could get it, from the same vendor too. And, when it's NDD, you can't really go wrong.\n\nThis isn't a reprimand for your denigration of the hue of my weed, but, you should never judge a book by its colour. Wait, no, that's not right. You should never judge a bud by its cover. No wait, shit. Oh you know what I mean.", "2_Subreddit": "opiates"}], "dwz3oo7": [{"0_Comment Submission": "You might get me with cheap syringes.....", "1_Text": "Yeah. This. I'm sick of using broken booze miniatures and foil. What do I do??", "2_Subreddit": "opiates"}], "dwz3s0u": [{"0_Comment Submission": "First time benzo injection", "1_Text": "Ah OK, fair enough. Yeah to be honest swallowing them is pretty effective, so I'll just stick to that. Cheers man.", "2_Subreddit": "benzodiazepines"}], "dwz3vxx": [{"0_Comment Submission": "First time benzo injection", "1_Text": "I'd ask what a micron filter is as opposed to a normal cigarette filter-tip or one of the ones that come with cookers from the exchanges, but it seems from this thread that there's actually no point in shooting them anyway....", "2_Subreddit": "benzodiazepines"}], "dwz5hbc": [{"0_Comment Submission": "You might get me with cheap syringes.....", "1_Text": "Sorry, yeah, I meant wire wool (what you in the US call \"chore boy\"), not foil.", "2_Subreddit": "opiates"}], "dwz7nnz": [{"0_Comment Submission": "You might get me with cheap syringes.....", "1_Text": "Haha, no, I have a degree in English Literature, I teach English in a High School, and I also tutor adults who need to learn English for citizenship rights!", "2_Subreddit": "opiates"}], "dwz7osu": [{"0_Comment Submission": "Supplies for a two-week stint off work", "1_Text": "NDD = next day delivery", "2_Subreddit": "opiates"}], "dwzay57": [{"0_Comment Submission": "Supplies for a two-week stint off work", "1_Text": "That's my makeshift crack pipe - the powder to the right of it is crack, although it's broken down so it doesn't look like a regular crack rock", "2_Subreddit": "opiates"}], "dwzb61p": [{"0_Comment Submission": "Supplies for a two-week stint off work", "1_Text": "I use almost a whole sachet, but only when it's a big shot. I would never shoot a whole gram in one go though - that's insane. My tolerance with the needle is quite low - as in, I've only been injecting for a couple of weeks, and I've been starting out slow, little by little; before that, I was smoking at least a gram every 3 days, for about 10 years.", "2_Subreddit": "opiates"}]}], "1_submissions": [{"6qncwc": [{"0_Title": "Sirmione/Garda Friends", "1_Text": "Oh cool, I'll check it out", "2_Subreddit": "italy"}], "6qnfl0": [{"0_Title": "Italy - Sirmione", "1_Text": "Oh cool, I'll check it out", "2_Subreddit": "Drugs"}], "6qnh2b": [{"0_Title": "Italy - Sirmione - help", "1_Text": "Oh cool, I'll check it out", "2_Subreddit": "Drugs"}], "6r3jr8": [{"0_Title": "Verona - weed - places?", "1_Text": "Oh cool, I'll check it out", "2_Subreddit": "Drugs"}], "6tel28": [{"0_Title": "Cardiff - numbers, friends, areas", "1_Text": "Oh cool, I'll check it out", "2_Subreddit": "Drugs"}], "76wtr9": [{"0_Title": "Thirty-four going back twenty-one", "1_Text": "Oh cool, I'll check it out", "2_Subreddit": "opiates"}], "79da99": [{"0_Title": "\"Inside Out\" - Short Story (Part 1)", "1_Text": "Oh cool, I'll check it out", "2_Subreddit": "opiates"}], "79gywf": [{"0_Title": "Comparison Question", "1_Text": "Oh cool, I'll check it out", "2_Subreddit": "benzodiazepines"}], "7aq794": [{"0_Title": "Tapered use and eventual cleanliness", "1_Text": "Oh cool, I'll check it out", "2_Subreddit": "opiates"}], "7axo9m": [{"0_Title": "Can This be Right?", "1_Text": "Oh cool, I'll check it out", "2_Subreddit": "benzodiazepines"}], "7b5cxb": [{"0_Title": "At the cinema", "1_Text": "Oh cool, I'll check it out", "2_Subreddit": "benzodiazepines"}], "7e111f": [{"0_Title": "'Dose as small as a grain of sand can kill you': alarm after Canada carfentanil bust", "1_Text": "Oh cool, I'll check it out", "2_Subreddit": "opiates"}], "7h66m5": [{"0_Title": "Pills, Scams, and Successful Experiments", "1_Text": "Oh cool, I'll check it out", "2_Subreddit": "opiates"}], "7k6nl0": [{"0_Title": "Valuim Identification and Information Help Request", "1_Text": "Oh cool, I'll check it out", "2_Subreddit": "benzodiazepines"}], "7kkq53": [{"0_Title": "Loyal to the Foil", "1_Text": "Oh cool, I'll check it out", "2_Subreddit": "opiates"}], "8536kx": [{"0_Title": "Uber Dopes", "1_Text": "Oh cool, I'll check it out", "2_Subreddit": "opiates"}], "881bfy": [{"0_Title": "Rebate; Re up; Relief", "1_Text": "Oh cool, I'll check it out", "2_Subreddit": "opiates"}], "8ai4v2": [{"0_Title": "Supplies for a two-week stint off work", "1_Text": "Oh cool, I'll check it out", "2_Subreddit": "opiates"}], "8aj3ra": [{"0_Title": "First time benzo injection", "1_Text": "Oh cool, I'll check it out", "2_Subreddit": "benzodiazepines"}]}]}]}