{"holyanddead": [{"0_comments": [{"dwfgowg": [{"0_Comment Submission": "How do disputes work on dream?", "1_Text": "I figured it would just be a waiting game until a mod stepped in and made a decision on it. But if the vendor is admitting fault that means I should get refunded right? He’s claiming he sent it but because he doesn’t have trac he can’t prove it so it’s his fault?", "2_Subreddit": "darknet"}], "dwfii3v": [{"0_Comment Submission": "$10,000 a week for H???", "1_Text": "Lol the same wife that claimed she had no idea about his drug use until after he nodded out at the wheel with her in the passenger seat? Yeah she’s either a liar or she really is as dumb as she seems on the show.....", "2_Subreddit": "opiates"}], "dwflbkl": [{"0_Comment Submission": "How do disputes work on dream?", "1_Text": "Just sucks because I went with this vendor because of the good reviews. But I noticed after checking them everyday while waiting for my pack and reading the new ones that came up I noticed a pattern. It seems as if 10+ transactions go through no problems. Raving about fast shipping and then a few that had no complaints about anything but the shipping took way longer than expected and then you would get a negative one saying he’s a scammer and his shit is fake ect.  So either he’s burning every couple of deals to try and make up for fees to cash out (or at least that’s what I think) and I just happened to be the unlucky buyer or he is so swamped with orders he can’t keep track of them and he is literally screwing up and thinking he made shipments when he didn’t. I’ll still hold out hope though it will still come through or I’ll get my money back. Already deposited more to try a new one so fingers crossed this guy comes through. New guy already shipped so now it’s just a waiting for the mailman game haha", "2_Subreddit": "darknet"}], "dwfno6h": [{"0_Comment Submission": "Don't know if I have liver failure", "1_Text": "So I’ve recently been through this exact situation a few weeks back..this is going to be long lol\nmy sister who lives with me got her wisdom teeth taken out recently and upon asking her how she was doing she had mentioned that the pain meds they prescribed her made her sick and gave her ‘the spins’.  We both have had our past addictions but she liked to go up and I was the opiate addict so it made sense that she couldn’t handle the pain meds they gave her. I had assumed they gave her hydrocodone but out of curiosity asked her what they gave her and she said ‘oh I don’t know oxy something’ So then I get the itch and I went into her room while she was at work and looked for the pill bottle and found a bottle perc 5/325s so I started out with taking a few (4) so she wouldn’t notice.  Anyways \nI end up doing all.Of.Them. \nShe had 18 and took maybe 1 and 1/2. Long story short I’m an addict and couldn’t help myself. I ended up just taking the whole bottle after being high for a few days because I knew she wouldn’t miss them and if she did notice they were missing she would blame it on her ex that had come over recently. After using all of them up during a period of about a week I did have some slight withdrawal symptoms lol \nNothing like how I used to get when I was doing H for years with no breaks. I haven’t done opiates in almost 4 years so I had zero tolerance. One of the days I took 5 and was so high I puked twice.  So your liver isn’t shutting down I would say you feel kind of shitty because you are having a slight opiate withdrawals", "2_Subreddit": "opiates"}], "dwfnwl4": [{"0_Comment Submission": "Don't know if I have liver failure", "1_Text": "Also, a good indicator that you are in fact in withdrawal is that your pupils will be big as opposed to being pinned when you’re high", "2_Subreddit": "opiates"}], "dwfp0e5": [{"0_Comment Submission": "How do disputes work on dream?", "1_Text": "Makes sense haha I felt I was being as smart as possible checking the reviews and only going with domestic vendors that have escrow, mainly because I’m paranoid and even more so because I didn’t feel  like waiting forever for something to come overseas. Should of gone with my gut though. I’ll check out the forum. I was trying to find one in the search but it looked like I wasn’t typing in the right words because the ones that popped up were deleted. Thanks I appreciate the input!", "2_Subreddit": "darknet"}], "dwi2dsi": [{"0_Comment Submission": "I don't know if I'm late to the party on this, but here's a cool way to collect your resin if you smoke. If you already knew about this, my b.", "1_Text": "I would use a glass tube the ones they sell with a plastic flower in it. The ones used for crack pipes. That’s a pretty decent tube to use and it catches lots of resin so when you’re out you can either scrape it or put a little water in it and plug each sides with your finger and shake it until everything dissolved and either snort the water or I’ve recently heard you can use alcohol instead of water, dump the liquid on a piece of foil and wait for it to evaporate and then smoke the remainder. Never tried that method but I plan to soon once I finally get some hopefully tomorrow", "2_Subreddit": "opiates"}], "dwi2g40": [{"0_Comment Submission": "Is this tar or what? Never seen dope like this the more I breathe on it the more it melts down happy nodding!", "1_Text": "Good old gunpowder!", "2_Subreddit": "opiates"}], "dwi2pxu": [{"0_Comment Submission": "When your plug don’t even know he da plug", "1_Text": "Currently waiting for my postman to bring me my shit hopefully tomorrow. Send me good vibes my fellow nodders!", "2_Subreddit": "opiates"}], "dwi2vp6": [{"0_Comment Submission": "When your plug don’t even know he da plug", "1_Text": "Can you PM me what vendor you use? I tried one and it never came. Reordered with a new guy and waiting on his stuff to come and I like to only go with domestic since I’m inpatient and it seems the less risky route", "2_Subreddit": "opiates"}], "dwi5g2j": [{"0_Comment Submission": "When your plug don’t even know he da plug", "1_Text": "US", "2_Subreddit": "opiates"}], "dwij0ju": [{"0_Comment Submission": "Wax dab vape pen for smoking H?", "1_Text": "I just ordered a kit that has one of those globe wax attachments. From what I understand it has an element that gets red hot so in theory it should work. I guess I’ll just have to give it try and see what happens...", "2_Subreddit": "opiates"}], "dwikdu5": [{"0_Comment Submission": "Wax dab vape pen for smoking H?", "1_Text": "[looks like this](https://www.valhallasmokeshop.com/wp-content/uploads/2017/06/IMG_4002-e1496293620696.jpg)", "2_Subreddit": "opiates"}], "dwjcnbd": [{"0_Comment Submission": "Wax dab vape pen for smoking H?", "1_Text": "Will do sir haha", "2_Subreddit": "opiates"}], "dwjlltb": [{"0_Comment Submission": "How to get the best/longest high on Percocet?", "1_Text": "I would crush them up and eat the powder(gets in your system faster) also do this on an empty stomach. Don’t get into the habit of that though because it’s hell on your stomach", "2_Subreddit": "opiates"}], "dwk1vpn": [{"0_Comment Submission": "Didn’t even have to travel for it 😌 bye 33 days of sobriety", "1_Text": "Start slow! Remember periods of abstinence lead to overdose. Happy nods", "2_Subreddit": "opiates"}], "dwk45rz": [{"0_Comment Submission": "🎵Rubber Ducky, you're the one! You make smoking so much fun!🎵", "1_Text": "What’s the purpose of the duck? Is there a purpose or is it just for decoration 😂", "2_Subreddit": "opiates"}], "dwlonlj": [{"0_Comment Submission": "Something just felt off for weeks.", "1_Text": "Give yourself a break and remember recovery is not linear. Sending good vibes your way", "2_Subreddit": "opiates"}], "dwlpdci": [{"0_Comment Submission": "Can someone please explain what this powdery residue is left in my tooter after smoking? I've only had this happen with very high quality tar. Anyone experience this?", "1_Text": "That is some fine gunpowder residue my friend smoke that shit", "2_Subreddit": "opiates"}], "dwphhim": [{"0_Comment Submission": "Happy Monday everyone", "1_Text": "Silicone containers for wax work so well for tar!", "2_Subreddit": "opiates"}], "dwphiwk": [{"0_Comment Submission": "Happy Monday everyone", "1_Text": "I can’t tell if you’re being sarcastic or not haha", "2_Subreddit": "opiates"}], "dwqpks4": [{"0_Comment Submission": "How long does opiate dependence take?", "1_Text": "I meant don’t use Consecutively for more than 3 days. The thing about it too is that because I have been clean for so long I don’t have a dboy on speed dial so I don’t have easy access to it and I have responsibilities now that I can’t abandon to get high for days on end either. I did the teeny tiniest bit yesterday and was high for 8 hours and my eyes were pinned and I puked most of the day from getting motion sickness just from sitting there talking. With all that taken into consideration I think I’ll be able to successfully chip. Thank you all for your concerns and I appreciate the input", "2_Subreddit": "opiates"}], "dwrbmg7": [{"0_Comment Submission": "Ayyyy and another one.", "1_Text": "*Dj Khaled voice*", "2_Subreddit": "opiates"}], "dwu1ppp": [{"0_Comment Submission": "Kind of annoyed", "1_Text": "I know I’m a cunt 😆", "2_Subreddit": "opiates"}], "dwv0htp": [{"0_Comment Submission": "Kind of annoyed", "1_Text": "That’s what I was worried about. Every time I use some I feel like I’m going to die", "2_Subreddit": "opiates"}]}], "1_submissions": [{"87pj9a": [{"0_Title": "How do disputes work on dream?", "1_Text": "I figured it would just be a waiting game until a mod stepped in and made a decision on it. But if the vendor is admitting fault that means I should get refunded right? He’s claiming he sent it but because he doesn’t have trac he can’t prove it so it’s his fault?", "2_Subreddit": "darknet"}], "887iiv": [{"0_Title": "Wax dab vape pen for smoking H?", "1_Text": "I figured it would just be a waiting game until a mod stepped in and made a decision on it. But if the vendor is admitting fault that means I should get refunded right? He’s claiming he sent it but because he doesn’t have trac he can’t prove it so it’s his fault?", "2_Subreddit": "opiates"}], "896nso": [{"0_Title": "Happy Monday everyone", "1_Text": "I figured it would just be a waiting game until a mod stepped in and made a decision on it. But if the vendor is admitting fault that means I should get refunded right? He’s claiming he sent it but because he doesn’t have trac he can’t prove it so it’s his fault?", "2_Subreddit": "opiates"}], "8980cb": [{"0_Title": "How long does opiate dependence take?", "1_Text": "I figured it would just be a waiting game until a mod stepped in and made a decision on it. But if the vendor is admitting fault that means I should get refunded right? He’s claiming he sent it but because he doesn’t have trac he can’t prove it so it’s his fault?", "2_Subreddit": "opiates"}], "89v7mz": [{"0_Title": "Kind of annoyed", "1_Text": "I figured it would just be a waiting game until a mod stepped in and made a decision on it. But if the vendor is admitting fault that means I should get refunded right? He’s claiming he sent it but because he doesn’t have trac he can’t prove it so it’s his fault?", "2_Subreddit": "opiates"}]}]}]}