{"oddradiation": [{"0_comments": [{"dwv5m8o": [{"0_Comment Submission": "Hey its mr.blackout back with some more hospital goodies", "1_Text": "It's a iv morphine", "2_Subreddit": "opiates"}], "dwv5u7e": [{"0_Comment Submission": "Hey its mr.blackout back with some more hospital goodies", "1_Text": "Personally I wouldn't know all I hear is its good to use iv. I don't shoot so I can't say for sure", "2_Subreddit": "opiates"}], "dwvigik": [{"0_Comment Submission": "Drug test possibly", "1_Text": "Could I get certo at Walmart?", "2_Subreddit": "opiates"}], "dwvj7li": [{"0_Comment Submission": "Drug test possibly", "1_Text": "3 whole days and a half day lol", "2_Subreddit": "opiates"}], "dwvjwrt": [{"0_Comment Submission": "Drug test possibly", "1_Text": "Right on thanks man appreciate it", "2_Subreddit": "opiates"}], "dwvlwz7": [{"0_Comment Submission": "Just copped for the first time in 7 months.", "1_Text": "Super happy lol moved out to a new state and haven't been any to find any plugs for the longest time. Needless to say it's a good day indeed. Happy nods everyone and stay safe", "2_Subreddit": "opiates"}], "dwvoo4i": [{"0_Comment Submission": "Drug test possibly", "1_Text": "When yiu say b2 vitamins you mean like a b complex?", "2_Subreddit": "opiates"}], "dwvookg": [{"0_Comment Submission": "Drug test possibly", "1_Text": "Or b2 specifically", "2_Subreddit": "opiates"}], "dwvotqt": [{"0_Comment Submission": "Just copped for the first time in 7 months.", "1_Text": "I plan on chipping. I actually loved out here because I got arrested on a possession with intent to deliver some weed like 2 pounds so I caught a felony. Literally came out here with the intent to be here 2 days. Got arrested my girl bonded me out and we've been here ever since just got my sentence which was 3 years supervised probation. I was using a lot of meth before I came out here as well as heroin but never got addicted to heroin I was only using once every few days maybe twice a week. So yeah I'm just going to be using every so often. I'm not ready to be fully clean honestly", "2_Subreddit": "opiates"}], "dwvxexm": [{"0_Comment Submission": "Just copped for the first time in 7 months.", "1_Text": "I hear you I'm on minimum supervision so I went in on my first meeting like a few weeks or so ago and met him. I was expecting a piss test and I didn't get one at all to my surprise. And it was for a felony drug charge too so I thought it was weird. But anyway since I'm on minimum supervision I only visit him once every 90 days. We don't have a colors system either and he pretty much said he has other people who are more of a problem to deal with. Also said if I do good My first couple months he'd put me on unsupervised probation. Then after like a year and a half if all goes well I'll be off probation. So hopefully that happens lol. But thank you for looking out man I appreciate it", "2_Subreddit": "opiates"}], "dwvyii3": [{"0_Comment Submission": "Drug test possibly", "1_Text": "Sweet just got the vitamins and certo", "2_Subreddit": "opiates"}], "dww39bz": [{"0_Comment Submission": "I live in kansas. Kratom is legal. ive been on it for about 2 years now. been on probation for about 5 months. all off a sudden now im banned from being able to use kratom along with ALL vitamins, supplements, or herbs. HELP!", "1_Text": "I would definitely get a lawyer if you're in a position to afford one. Even the cheapest lawyer is better than no lawyer. I wish they offered free lawyers even when you're not facing a trial. Systems kinds fucked up. Its crazy to me that they're taking away things that legitimately work and help you every day. Best of luck to you friend", "2_Subreddit": "kratom"}], "dww3xae": [{"0_Comment Submission": "Can you use every third day and not get sick?", "1_Text": "If you're going through all of this just to keep from getting truly addicted to it and you know just how addictive this drug is, why keep doing it? Just think about it man you're going to move an hour away from where you live if and when you get addicted, when you could just stop before it's too late. Not trying to be a dick about it either just putting the thought out there man. Happy nods either way", "2_Subreddit": "opiates"}], "dww3z1d": [{"0_Comment Submission": "I live in kansas. Kratom is legal. ive been on it for about 2 years now. been on probation for about 5 months. all off a sudden now im banned from being able to use kratom along with ALL vitamins, supplements, or herbs. HELP!", "1_Text": "And you're paying her? Fuck that if I'm paying someone to defend me you can bet your sweet ass they're going to be defending me. Maybe time to look for another one. That is if it's a paid lawyer", "2_Subreddit": "kratom"}], "dww5cqu": [{"0_Comment Submission": "I live in kansas. Kratom is legal. ive been on it for about 2 years now. been on probation for about 5 months. all off a sudden now im banned from being able to use kratom along with ALL vitamins, supplements, or herbs. HELP!", "1_Text": "I would at the very least ask for advice maybe a free consultation most law firms do free consultations.", "2_Subreddit": "kratom"}], "dww5pff": [{"0_Comment Submission": "WHY CANT I KNOW A TAR PLUG!?! :(", "1_Text": "Learn how to use the dark web. It works", "2_Subreddit": "opiates"}], "dww6753": [{"0_Comment Submission": "I have 5mg hydrocodone + 325mg Acetaminophen each pill. Whats the max safe amount of pills I could take at once?", "1_Text": "What's your tolerance. I don't have much of one and just yesterday I took like 40 mg got a nice little buzz going. But look into cold water extraction that way you get all that apap out of there. Then you can take as many as you'd like depending on your tolerance", "2_Subreddit": "opiates"}], "dww7p1k": [{"0_Comment Submission": "I have 5mg hydrocodone + 325mg Acetaminophen each pill. Whats the max safe amount of pills I could take at once?", "1_Text": "I took it with the apap it's just not very good on the liver. I don't think it's life threatening at 40 mg with the apap", "2_Subreddit": "opiates"}], "dww8xd2": [{"0_Comment Submission": "I have 5mg hydrocodone + 325mg Acetaminophen each pill. Whats the max safe amount of pills I could take at once?", "1_Text": "Yeah haha that's pretty bad for your liver no doubt I wouldn't recommend it honestly", "2_Subreddit": "opiates"}], "dww92u0": [{"0_Comment Submission": "Some perks", "1_Text": "Right hahahah", "2_Subreddit": "opiates"}], "dww93ss": [{"0_Comment Submission": "Some perks", "1_Text": "Just be careful if you do man. It starts of with these then oxy 30s then heroin before you even notice it.", "2_Subreddit": "opiates"}], "dwwvnjb": [{"0_Comment Submission": "Just copped for the first time in 7 months.", "1_Text": "Hahaha made me laugh. Like some shit you get when you use iso to clean out your rig", "2_Subreddit": "opiates"}], "dwxnucv": [{"0_Comment Submission": "Can you use every third day and not get sick?", "1_Text": "Lol same here I was just curious. I'm pretty much the same I don't know when Ill fully quit just don't want to break the bank", "2_Subreddit": "opiates"}], "dwxq417": [{"0_Comment Submission": "Can you use every third day and not get sick?", "1_Text": "I just got off a 7 month long sober run and man am I high as shit right now lol. Makes it easier because I moved from my hometown to a town a lot smaller. So I have no steady connects so I've been using the dnm. Just got my sac yesterday and I don't think I'm ever using a regular d boy again lol", "2_Subreddit": "opiates"}], "dwxrljz": [{"0_Comment Submission": "Give me your trashiest drug story", "1_Text": "Its not gay as long as your balls dont touch", "2_Subreddit": "Drugs"}]}], "1_submissions": [{"86bo9i": [{"0_Title": "Questions about north Dakota probation", "1_Text": "It's a iv morphine", "2_Subreddit": "probation"}], "86eja7": [{"0_Title": "Question on price of heroin", "1_Text": "It's a iv morphine", "2_Subreddit": "opiates"}]}]}]}