{"hiluhry": [{"0_comments": [{"dbusvyl": [{"0_Comment Submission": "Millennials are the most employed generation in two occupational areas: food service and the military.", "1_Text": "> this whole thread is Mill.s acting like they have it uniquely bad\n\nThis *is* a thread about problems specific to Millennials.", "2_Subreddit": "dataisbeautiful"}], "dbuxtoq": [{"0_Comment Submission": "Found this in blackpeopletwitter. Thought you guys might appreciate it.", "1_Text": "You decide what onion rings mean to *you*", "2_Subreddit": "infp"}], "dbw4qk4": [{"0_Comment Submission": "How to get help when you don't even trust the therapists?", "1_Text": "Try to put your paranoia aside and go to another therapist. I swear, there are good ones out there that make it all worth it. Don't wait for a breakdown, your problems will be much easier to work with now. Sorry you had shit therapists in the past. As a therapist myself I hate hearing that. \n\nGiven the nature of what you described as your hangups, I wouldn't put too much focus on group meetings right now. You would likely benefit from something more intimate. At least for starters.\n\nTherapy isn't about being normal or not, or diagnoses, crises, etc. It's about self-awareness and reflection. Try not to let those societal expectations of 'what is deserving of therapy' ruin your good work.", "2_Subreddit": "therapy"}], "dbwxjh8": [{"0_Comment Submission": "FwD: Dear Barry....", "1_Text": "It's fine because it's a *Jewish* symbol. Their religion isn't true anyways- unless it is politically significant of course.", "2_Subreddit": "forwardsfromgrandma"}], "dbxrrci": [{"0_Comment Submission": "TIL: On his second day in office, President Jimmy Carter pardoned all evaders of the Vietnam War drafts.", "1_Text": "That is also how I took it. I'd be surprised if /u/wondertribe was talking about the actual soldiers. Everybody has to make a living somehow. It's the politicians who make the decisions to create war.", "2_Subreddit": "todayilearned"}], "dbzb73u": [{"0_Comment Submission": "Tailgater being break checked.", "1_Text": "I'm a fan of the sarcastic thumbs-up", "2_Subreddit": "WTF"}], "dbzbejm": [{"0_Comment Submission": "Tailgater being break checked.", "1_Text": "I've taken defensive driving about 10 times and they've always said to leave about 2 seconds of space when you're traveling at highway speeds. I remember seeing something on myth busters or top gear about it too. \n\nedit- Not to say I don't completely agree with the rest of his comment though. Fuck tailgaters.\n\nedit again- all petty, aggressive behavior on the road is horrible- tailgating, brake checking, blocking the fast lane to teach someone a lesson...Just drive defensively. You aren't going to see those assholes ever again, who cares of they 'win' or 'get away with bad behavior' or etc?", "2_Subreddit": "WTF"}], "dc2eg87": [{"0_Comment Submission": "Hate crime charges filed against 4 in torture of teen", "1_Text": "the way it was written reads like apologia...\n\nof course torture is horrible in *all* circumstances but we're talking about a specific occurrence. Why muddy it with defensive abstractions?", "2_Subreddit": "news"}], "dcg5obx": [{"0_Comment Submission": "Trump's first foreign trip as president will be to meet Putin: report", "1_Text": "Right? As if there is some rhyme or reason to any of this.", "2_Subreddit": "politics"}], "dcg6114": [{"0_Comment Submission": "Trump's first foreign trip as president will be to meet Putin: report", "1_Text": "making america great again 700 jobs at a time.", "2_Subreddit": "politics"}], "dcg6a60": [{"0_Comment Submission": "Trump's first foreign trip as president will be to meet Putin: report", "1_Text": "They value their *party* over their country. Is that what you meant? \n\nOr did you mean \"shit, surely they value their country over their party, right? Right?! What's happening?!\"", "2_Subreddit": "politics"}], "dcg6gw2": [{"0_Comment Submission": "Trump's first foreign trip as president will be to meet Putin: report", "1_Text": "I agree, 100%", "2_Subreddit": "politics"}], "dcyw0bj": [{"0_Comment Submission": "Trump’s Chief Strategist Says News Media Should ‘Keep Its Mouth Shut’", "1_Text": "> There should be four parties one that's both Social and Economically Progressive, One that's both Economically and Socially Conservative, one that's Socially Progressive but Economically Conservative, as well as one that is Socially Conservative but Economically Progressive\n\nThese seem like universal continua for political ideologies. Is this how parties in other countries are divided? Does it generally work better for them? I always hear so much about the woes of the two party system and the relief of having 3-4 parties. Have +3 parties made those countries more progressive?\n\nIt's probably easily googled and I have an intuition on the answers, but you seem to have an excellent handle on it, so I'd love a concise answer with your opinion.", "2_Subreddit": "politics"}], "dgdp20f": [{"0_Comment Submission": "I'm going to light it up if the bombs start flying.", "1_Text": "I'm about two months out for the third time. I think I've developed a bit of a morbid humor around it. \n\nGood luck, man!", "2_Subreddit": "opiates"}], "dge07q3": [{"0_Comment Submission": "I'm going to light it up if the bombs start flying.", "1_Text": "Climate change is a massive trigger for me- definitely more than the worldwide pissing contest that's currently happening re: USA, North Korea, et al.", "2_Subreddit": "opiates"}], "dge2ar5": [{"0_Comment Submission": "I'm going to light it up if the bombs start flying.", "1_Text": "I hear ya man, that's what makes the Great Escape so tempting! Pessimism and feeling helpless are heavy.", "2_Subreddit": "opiates"}], "dgeccoj": [{"0_Comment Submission": "I'm going to light it up if the bombs start flying.", "1_Text": "\"Please, if it's my day to die let it be in the morning so I don't have to go to work for no reason\"", "2_Subreddit": "opiates"}], "dgehxcs": [{"0_Comment Submission": "I'm going to light it up if the bombs start flying.", "1_Text": "for real. But lab-grown meat is really taking off. I hope it replaces traditional supplies soon. And we'll have to get on that bandwagon eventually- whether we like it or not.", "2_Subreddit": "opiates"}], "dh5o77r": [{"0_Comment Submission": "United States Mattress Sizes [OC]", "1_Text": "> a thing.\n\na porn thing.", "2_Subreddit": "dataisbeautiful"}], "dsrchcl": [{"0_Comment Submission": "What restaurant have you sworn to never return to and why?", "1_Text": "I think if a restaurant serves alcohol, they also have to serve free tap water. That is in the UK at least. Not sure about stateside.", "2_Subreddit": "AskReddit"}], "due7m18": [{"0_Comment Submission": "How to deactivate a cat", "1_Text": "This method is very effective on ferrets as well. Little buggers just freeze. It's how you train them out of biting and other bad habits and it endures throughout their lives. \n\nThe same as kittens/cats, you should never ever pick up a ferret this way without supporting the creature. They're very bottom heavy.", "2_Subreddit": "interestingasfuck"}], "dvo7mwa": [{"0_Comment Submission": "Pick three books for your favorite genre that a beginner should read, three for veterans and three for experts.", "1_Text": "His new series set in the same world is excellent if you're pining for more. Only the first book is out so far-- La Belle Sauvage. Two more will be coming soon.", "2_Subreddit": "books"}], "dwlheq0": [{"0_Comment Submission": "\"I fuck dwarves\" would not be an improvement", "1_Text": "Oh god, you're right\n\n[Imgur](https://i.imgur.com/z86Iu2h.jpg)", "2_Subreddit": "trashy"}], "dwlm4px": [{"0_Comment Submission": "Anatomy of a dope fiend (original artwork)", "1_Text": "what are the painful shins for?", "2_Subreddit": "opiates"}], "dwlmcpo": [{"0_Comment Submission": "Anatomy of a dope fiend (original artwork)", "1_Text": "huh, I'm not familiar with that side effect. I know suboxone made my body and joints hurt like mad. I was thinking something like restless legs from wds. \n\nGreat art, op!!", "2_Subreddit": "opiates"}]}], "1_submissions": [{"65u0zr": [{"0_Title": "I'm going to light it up if the bombs start flying.", "1_Text": "> this whole thread is Mill.s acting like they have it uniquely bad\n\nThis *is* a thread about problems specific to Millennials.", "2_Subreddit": "opiates"}], "88l3fn": [{"0_Title": "\"I fuck dwarves\" would not be an improvement", "1_Text": "> this whole thread is Mill.s acting like they have it uniquely bad\n\nThis *is* a thread about problems specific to Millennials.", "2_Subreddit": "trashy"}]}]}]}