{"dopenpizza": [{"0_comments": [{"dvfq2p7": [{"0_Comment Submission": "nasal spray bottles", "1_Text": "I tried doing this. Make sure you filter it VERY VERY GOOD. The spray nozzle has a super tiny tube that will gunk up and separate when you squirt it. After about 6squirts i opened by bottle to find about .2 of nasty goop and no liquid.", "2_Subreddit": "opiates"}], "dvfr11m": [{"0_Comment Submission": "Hit the jackpot yesterday with my bank but got some questions", "1_Text": "And this is better than stealing from people? Do not think for one minute you aren’t as scummy as the scummiest, you are.  Goodluck getting service from a bank in the future", "2_Subreddit": "opiates"}], "dvfsfrn": [{"0_Comment Submission": "Hit the jackpot yesterday with my bank but got some questions", "1_Text": "No, it’s not super scummy. It’s as scummy as\nAny other petty act is what I’m saying.", "2_Subreddit": "opiates"}], "dvfttjo": [{"0_Comment Submission": "Hit the jackpot yesterday with my bank but got some questions", "1_Text": "Thats fair. What about stealing from people, and stealing from an establishment? Which would you list those two under.", "2_Subreddit": "opiates"}], "dvfugro": [{"0_Comment Submission": "Hit the jackpot yesterday with my bank but got some questions", "1_Text": "Robbing; scummy. Stealing; trashy.", "2_Subreddit": "opiates"}], "dvgnv9o": [{"0_Comment Submission": "nasal spray bottles", "1_Text": "Can you send me a pic of your gear? Im on the westcoast but i think i have ecp also. Mine dissolved with LITTLE heat. I used cotton to filter it, about 5times. And it still had garbage in it. I would suggest getting a micron filter", "2_Subreddit": "opiates"}], "dvh4mh9": [{"0_Comment Submission": "Anyone else like to take walks in the middle of the night while high?", "1_Text": "In the summertime sure, winter fuck no", "2_Subreddit": "opiates"}], "dvh51w0": [{"0_Comment Submission": "Question for those of you who currently have a significant amount of clean time (1 year+)", "1_Text": "Sorry to hear about your friend. Too many lives have been taken.\n\nYou need to be serious about getting clean and staying clean. Doing so will require you to get rid of anything and anyone that may coax you into getting high. If there are people that you will need to distance yourself from tell them whats up; if they know. True friends will always be there, and will understand the circumstances so don’t worry about losing/breaking friendships. Always keep busy or atleast try to (i personally relapse a lot purely out of boredom, i live in a small shithole with absolutely nothing to do so i turn to dope). Working out/physical activity will help a ton; keep occupied, sleep better/easier, release dopamine, etc. SUPPORT, be open with those who know. If you feel an urge to use text someone and talk with them. There support will help reassure you. If you get the idea to use chances are you will convince yourself it’s a good idea even though the negatives outweigh the positives.", "2_Subreddit": "opiates"}], "dvh5blo": [{"0_Comment Submission": "Question for those of you who currently have a significant amount of clean time (1 year+)", "1_Text": "I can’t give you an opinion on that because i’ve never been to one, but i think it could be very beneficial, especially if you don’t have a strong support system. Those ex addicts in that room could end up being lifelong friends and give a lot of insight and advice.\n\nForsure man. Couple months in i figured i could dabble once a week or something along the lines, but It will never not be a consecutive day thing. Definitely find a hobby or multiple if possible.\n\nJust curious, what are some of the hobbys/interests you used to have? Dope killed any interest i used to have, life is all about getting high now, everything else seems so transparent.", "2_Subreddit": "opiates"}], "dvke1ji": [{"0_Comment Submission": "My middle left the plugs # in my phone", "1_Text": "Yup, money is money. Some people just hustle harder than others. Especially if you’re already out there all day everyday, why not weigh some nicks. 20people pass by with only $5... well thats some blue cheese that just walked away.", "2_Subreddit": "opiates"}], "dvlkd9z": [{"0_Comment Submission": "If Walter White whipped up heroin instead.", "1_Text": "Dye?", "2_Subreddit": "opiates"}], "dvll2bx": [{"0_Comment Submission": "Lope", "1_Text": "How does immodium help with withdrawals?? Besides preventing you from pissing out your asshole, I don’t feel any other benefits.", "2_Subreddit": "opiates"}], "dvll68q": [{"0_Comment Submission": "Party Time! Excellent!!! *Dope/Coke/Meth/Xanax/Weed Porn*", "1_Text": "How much per cap roughly? .1?", "2_Subreddit": "opiates"}], "dvm6do6": [{"0_Comment Submission": "My homie pulled through at the last minute", "1_Text": "I wouldn’t pay a dollar for that shwag, disgusting.", "2_Subreddit": "opiates"}], "dvm6ek2": [{"0_Comment Submission": "If Walter White whipped up heroin instead.", "1_Text": "How was it", "2_Subreddit": "opiates"}], "dvo680j": [{"0_Comment Submission": "in the PNW you have to know how to play when it rains.", "1_Text": "The bag looks like turmeric powder. And the other shit looks like ground coffee. Anyways how was the gear?", "2_Subreddit": "opiates"}], "dw2y2ha": [{"0_Comment Submission": "When toss and wash fails and you have to improvise. #Beatsbeingsick Kratom is a godsend, those who have suffered through withdrawals but never tried this wonderfully effective and amazingly disgusting plant are in for a surprise", "1_Text": "I toss n washed until i was dry heaving pulling chunks of kratom powder out of the back of my throat for 45mins. Never again lol", "2_Subreddit": "opiates"}], "dw3e0il": [{"0_Comment Submission": "Today's pickup. Payday tomorrow, this will hold me over until then", "1_Text": "Oh the memories this brought back are wonderful. I remember copping my buddys entire script (150x6mg)  every month back in my pill days. Would dump out 5-10capsules a time and crush the beads into powder(takes some effort to say the least) and rail er in 2lines, pure bliss back then. The day I decided i wanted to quit(pfft what a joke of an 💡) i crushed the remaining 40capsules i had and went crazy. Having so much in my system postponed the withdrawals for 2days, silly me thinking i had somehow beaten the withdrawals. Fuck was the next couple days hell, I couldn’t make it further than day 5 i believe(2 1/2days postpone w/d)", "2_Subreddit": "opiates"}], "dw3g3xn": [{"0_Comment Submission": "Today's pickup. Payday tomorrow, this will hold me over until then", "1_Text": "I don’t IV. I can’t do needles, phobia.\n\nEdit: the last time i had a needle in me was for bloodwork 7years ago. Could barely go through with it", "2_Subreddit": "opiates"}], "dw906lk": [{"0_Comment Submission": "Today's pickup. Payday tomorrow, this will hold me over until then", "1_Text": "Does the process hurt? IV’ing.", "2_Subreddit": "opiates"}], "dw96x9n": [{"0_Comment Submission": "I'm at a loss... What should I do?", "1_Text": "Well if your muscle spasms and spasticity are as bad as you say, you’re going to break your dick off in your own hand. Stick with the ativan. Having an erection is no use if your so loaded up on opi’s you can’t cum", "2_Subreddit": "opiates"}], "dwcmv74": [{"0_Comment Submission": "I'm at a loss... What should I do?", "1_Text": "It aint the methadone, it’s the $2 crack whore. No way one of those could make you cum!", "2_Subreddit": "opiates"}], "dweo8hc": [{"0_Comment Submission": "No urge to use heroin anymore since becoming fatalistic and understanding i will die one day, any day, perhaps soon, perhaps not soon", "1_Text": "Nice day.", "2_Subreddit": "opiates"}], "dwrqjai": [{"0_Comment Submission": "What is the heroin capital of the US?", "1_Text": "Ohio forsure, check out the series called “the trade”", "2_Subreddit": "opiates"}], "dwu2uc2": [{"0_Comment Submission": "Tried smoking ECP", "1_Text": "I smoke powder all the time thats my only ROA. Works wonderfully. And yes when you get fent cut stuff and hold it in a decent while you can feel it hit you before you exhale", "2_Subreddit": "opiates"}]}], "1_submissions": [{"7z1yjb": [{"0_Title": "Buying online", "1_Text": "I tried doing this. Make sure you filter it VERY VERY GOOD. The spray nozzle has a super tiny tube that will gunk up and separate when you squirt it. After about 6squirts i opened by bottle to find about .2 of nasty goop and no liquid.", "2_Subreddit": "DarkNetMarketsNoobs"}], "80v4c6": [{"0_Title": "Barney", "1_Text": "I tried doing this. Make sure you filter it VERY VERY GOOD. The spray nozzle has a super tiny tube that will gunk up and separate when you squirt it. After about 6squirts i opened by bottle to find about .2 of nasty goop and no liquid.", "2_Subreddit": "opiates"}], "80v4ph": [{"0_Title": "Pr0n", "1_Text": "I tried doing this. Make sure you filter it VERY VERY GOOD. The spray nozzle has a super tiny tube that will gunk up and separate when you squirt it. After about 6squirts i opened by bottle to find about .2 of nasty goop and no liquid.", "2_Subreddit": "opiates"}], "82mhmz": [{"0_Title": "I need my dope like i need my glasses to see", "1_Text": "I tried doing this. Make sure you filter it VERY VERY GOOD. The spray nozzle has a super tiny tube that will gunk up and separate when you squirt it. After about 6squirts i opened by bottle to find about .2 of nasty goop and no liquid.", "2_Subreddit": "opiates"}]}]}]}