{"CannabisAndCoffee": [{"0_comments": [{"ddtmjh8": [{"0_Comment Submission": "What are your thoughts on Kratom?", "1_Text": "Definitely rivals codeine, and in some ways hydro as well. Bigger doses with grapefruit juice tend to put me about where a good dose of hydro takes me. Less itch and a less intoxicating head high, but still just as warm and euphoric tbh", "2_Subreddit": "opiates"}], "ddto6rl": [{"0_Comment Submission": "What are your thoughts on Kratom?", "1_Text": "Sourcing is not allowed on this tread. r/Kratom is your friend", "2_Subreddit": "opiates"}], "den7lh7": [{"0_Comment Submission": "People", "1_Text": "OP you are entirely correct to say that snorting alprazolam is wasteful in that the bioavailability is a good bit lower than oral. However the bioavailability is still between 30% and 60%. It is most certainly not negligible. And of course with intranasal administration there is the benefit of a quicker onset and more powerful come-up. Personally I don't like to waste about half of my Xanax by snorting it, but I will every so often take a bar and then proceed to snort a half bar afterwards to potentiate the euphoria associated with the come up. Is this truly such a waste that we must berate others about it on Reddit? I don't think so. There is a noticeable difference in the euphoria experienced on the come up and then what does not get absorbed intranasally proceeds to drop down into the stomach where it is absorbed at the full oral bioavailability: ~90%. If people want to snort their Xanax, more power to them in my opinion. Personally I'd suggest not to snort your entire dose because certainly some is lost, but to say that snorting Xanax in any situation is such a waste that it should not be considered a viable means of administering the drug is ridiculous.", "2_Subreddit": "opiates"}], "den7s0o": [{"0_Comment Submission": "People", "1_Text": "Oh and to set the record straight - Water solubility is not the end all be all determinate of intranasal bioavailability. There are many other factors at play and indeed there are a few benzodiazepines that are highly bioavailable via the nose, despite lacking in water solubility.", "2_Subreddit": "opiates"}], "derw73g": [{"0_Comment Submission": "TIFU by keeping drugs in the trunk of my car.", "1_Text": "I know nearly everyone commenting on this has said the same thing but I would still like to let you know that indeed this entire exchange was illegal at the very least from the point when the officer decided to detain you because he had no legal right to make that decision at that point. It may have even been illegal from the very beginning when he took you to sit in his car to be questioned. Not sure on that but at the very least it was extremely unorthodox. Generally you should remain in your vehicle buckled and facing forward with hands clearly visible throughout a traffic stop exchange of that nature. Had you or your friend known your rights and filmed this exchange I highly doubt it would have ever escalated to a search because the cop had no probable cause or legal precedent to conduct one.", "2_Subreddit": "tifu"}], "dey4x7j": [{"0_Comment Submission": "When I was a kid I played Runescape for years as a male character and was never bothered by anyone. Went back to play it as a teenager and tried playing as a female...", "1_Text": "Absolutely not my \"excuse\" for practicing it. There are many very real and serious reasons one should support the feminism movement. This was an example of my first exposure to the different treatment women and men receive as a kid. This isn't my one reason for supporting the movement. I'm sorry if I offended, I simply thought it was funny that when I first came across feminism as an adult that was the first thing that came to mind. It just made sense that I experienced that because of what I had learned. I'm not stupid enough to believe that the worst thing a woman may have to deal with in life is getting free stuff in a video game.", "2_Subreddit": "Showerthoughts"}], "dey50mc": [{"0_Comment Submission": "When I was a kid I played Runescape for years as a male character and was never bothered by anyone. Went back to play it as a teenager and tried playing as a female...", "1_Text": "Women face far worse issues than these and those are the reasons I am a feminist, not because of these silly examples. This was just a story. It was just an experience I had as a child that I didn't understand that I later came to understand. I wasn't saying that's such a horrible thing that people should hate it and support feminism because of it. I hope you don't think I am that unintelligent.", "2_Subreddit": "Showerthoughts"}], "dey56q9": [{"0_Comment Submission": "When I was a kid I played Runescape for years as a male character and was never bothered by anyone. Went back to play it as a teenager and tried playing as a female...", "1_Text": "I can see that I came across differently than how I meant to because all of the comments on this post sound quite similar to yours, but (and please forgive me if I'm wrong) your comment seems a bit more like a vex. Please don't think the only reasons I identify as a feminist are that women get free things in video games or get asked to be some guy's girlfriend. There are many real reasons I feel it is a worthy cause. This was meant to be nothing but a funny story of how I eventually came to understand as an adult why I experienced that as a child. As a kid it seemed more coincidental than like a manifestation of deep-rooted social issue.", "2_Subreddit": "Showerthoughts"}], "dey5ka3": [{"0_Comment Submission": "When I was a kid I played Runescape for years as a male character and was never bothered by anyone. Went back to play it as a teenager and tried playing as a female...", "1_Text": "Wow I would like to sincerely apologize to anyone, women especially, who may have been offended by this or may have found it to be a trivial argument for feminism. When I posted this I was only hoping that some of you would find it as amusing as I did that I would even think of this so randomly while in the bathroom. My point was simply this:\n1. As a kid/young teen I once made a runescape account as a girl.\n2. I was regularly interacted with while playing as that female character, which was strange because playing my normal account I had gone for weeks if not months before without ever speaking to anyone on the site.\n3. I ended up using these interactions to my advantage essentially preying on sad kids, like myself a few years previous, who wanted to feel loved through the safety of a computer screen.\n4. As an adult when I first had a serious conversation with someone about feminism and what it means, the first thing I thought about was that experience from when I was a kid. And I thought it was funny.\n\nI thought it was funny for the same reasons you all have berated me in the comments. The issues in that case are quite trivial in comparison to the real issues women face. I agree with you. That was my point. I played runescape as a girl and got free stuff and that was the first time I ever experienced sexism and understood it to some degree. It was minor sexism. Nothing to be enraged at. Nothing to fight against. And certainly not something that should be the sole reason one takes up arms in support of feminism. But it was just what I thought of. And I thought that was the point of r/Showerthoughts. I simply wanted to share a funny story, I didn't mean to come across like I was either an extremely naïve and offensive supporter of feminism or making fun of it. I love women. I love people in general and I think everyone is deserving of equal rights and equal treatment. I would have never posted this had I known that I would come across as anything but that. Again I apologize.", "2_Subreddit": "Showerthoughts"}], "dgvotxb": [{"0_Comment Submission": "The police in my city use comic sans on their vehicles.", "1_Text": "I like it. It looks so benign. Like something on the wall of a preschool classroom.", "2_Subreddit": "mildlyinteresting"}], "dhnhgav": [{"0_Comment Submission": "Red eyes?? Anyone??", "1_Text": "Could be minor dehydration? Most people don't drink enough water in the first place, plus nicotine (like other stimulants) tends to help dehydrate you as well. I get bloodshot eyes sometimes when vaping a lot and especially if I have some coffee with it. Perhaps keeping track of your daily water intake could help clear up this issue? Hope this is some help!", "2_Subreddit": "Vaping"}], "di337bi": [{"0_Comment Submission": "\"It was 70 years ago today, Sgt. Pepper taught the band to play.\"", "1_Text": "Funny because Paul was inspired to orchestrate this album in response to the Beach Boys' Pet Sounds", "2_Subreddit": "Music"}], "di33v5s": [{"0_Comment Submission": "\"It was 70 years ago today, Sgt. Pepper taught the band to play.\"", "1_Text": "Much of the Beatles later stuff was unplayable live. Part of the reason they decided not to tour anymore was for that very purpose. They could freely utilize every tool and instrument they wanted on any given song without worrying about how they would be able to play it live. Had loud crowds been the only issue they would've just played smaller venues. \"Tomorrow Never Knows\" for instance couldn't be played live because much of the guitar fill in it is actually being played in reverse and there is a ridiculous amount of tape looping going on", "2_Subreddit": "Music"}], "di34pjq": [{"0_Comment Submission": "boofin e-juice", "1_Text": "Hahahaha I fucking needed this thanks for the research fellow psychonaut!", "2_Subreddit": "Drugs"}], "di3enrk": [{"0_Comment Submission": "\"It was 70 years ago today, Sgt. Pepper taught the band to play.\"", "1_Text": "I meant to orchestrate as in to coordinate not literally using an orchestra. But yes there have certainly been elements of that all along thanks to Martin.", "2_Subreddit": "Music"}], "di3epob": [{"0_Comment Submission": "\"It was 70 years ago today, Sgt. Pepper taught the band to play.\"", "1_Text": "Those and \"I Just Wasn't Made For These Times\" are my favorites. The title song \"Pet Sounds\" itself is also brilliant in its intricacy.", "2_Subreddit": "Music"}], "dndenlx": [{"0_Comment Submission": "Suboxone for 1.5 months-- how to go back to heroin?", "1_Text": "There are a few opioids with high enough affinities for the u-opioid receptor to actually kick the buprenorphine off of the receptors instantly. The one I'm sure of off the top of my head is U-47700, and then I believe fent actually can as well but don't hold me to that. But basically best bet would be waiting as long as you can before doing any dope and then going from there. I wouldn't advocate using fent or U for a day or two just to get extra high before the suboxone leaves your system. It wouldn't be worth it at all.", "2_Subreddit": "opiates"}], "dnop3bs": [{"0_Comment Submission": "99,999 hits handcheck", "1_Text": "Need to know what happens on the next hit now lol", "2_Subreddit": "Vaping"}], "doz8g68": [{"0_Comment Submission": "Today i said NO to drugs.", "1_Text": "Heroin", "2_Subreddit": "Drugs"}], "dp7c235": [{"0_Comment Submission": "My Halloween COstume", "1_Text": "Assuming it's pressed at the same concentration as an OC80 you could probably just walk up to it and give it a little lick and be high off your ass. Like a giant oxy lollipop😋", "2_Subreddit": "opiates"}], "dwipye4": [{"0_Comment Submission": "A baby born at 11 p.m. in California and baby born at 2 a.m. in New York have different birthdays despite being born simultaneously", "1_Text": "Because time isn’t fucking real", "2_Subreddit": "Showerthoughts"}], "dwp3bti": [{"0_Comment Submission": "Uncontrollable Munchies", "1_Text": "Firstly, drink more water. If that’s not enough, try gum. If gum doesn’t work, get some bland crackers that you don’t like but can tolerate high and munch on those in controlled portions. And by controlled portions I mean, if you can’t find a way to hold back the munchies altogether, whatever you eat you must pre-portion for yourself. I have a nasty habit of grabbing an entire bag of chips when I’m high, or ordering a large pizza for myself, and before I know it I’ve eaten the whole thing in one sitting. The best way to prevent that is to keep your portions reasonable, by pouring yourself a bowl of chips or making a plate of a few pizza slices and putting the rest away in the fridge for the next day. When you do this, oftentimes you will notice that you are content with the amount you ate and you have no desire to go back for more.", "2_Subreddit": "trees"}], "dwp47se": [{"0_Comment Submission": "Street value?", "1_Text": "That’s worth like $5-$10. Basically just DXM syrup from the CVS man, but with an antihistamine in it, which makes it even less recreationally valuable bc you can’t take enough DXM to trip without becoming sedated and delirious from the antihistamine. Truly worth nothing on the street", "2_Subreddit": "opiates"}], "dwxmv09": [{"0_Comment Submission": "Today’s pick up", "1_Text": "I’ve had these straight out of the prescription bottle before and they had slightly raised edges like that. They look legit to me", "2_Subreddit": "opiates"}], "dwyixh1": [{"0_Comment Submission": "Real or fake?", "1_Text": "On real M boxes each of the top points on the M kind of bleed together rather than cleanly coming together to form an angle. I can’t tell well enough from the picture but if the Ms on them are made up of all straight thin lines forming clear angles then they’re definitely presses of some sort. Use google to find the pill identification wizard and you can see a clear image of what I’m talking about with the design of the M", "2_Subreddit": "opiates"}]}], "1_submissions": [{"4vo52a": [{"0_Title": "Favorite RC drugs of each class.", "1_Text": "Definitely rivals codeine, and in some ways hydro as well. Bigger doses with grapefruit juice tend to put me about where a good dose of hydro takes me. Less itch and a less intoxicating head high, but still just as warm and euphoric tbh", "2_Subreddit": "Drugs"}], "5mv5jm": [{"0_Title": "Stella and her little buddy Fredrick taking an evening nap", "1_Text": "Definitely rivals codeine, and in some ways hydro as well. Bigger doses with grapefruit juice tend to put me about where a good dose of hydro takes me. Less itch and a less intoxicating head high, but still just as warm and euphoric tbh", "2_Subreddit": "cats"}], "6bnte6": [{"0_Title": "Spearmint Menthol Flavor", "1_Text": "Definitely rivals codeine, and in some ways hydro as well. Bigger doses with grapefruit juice tend to put me about where a good dose of hydro takes me. Less itch and a less intoxicating head high, but still just as warm and euphoric tbh", "2_Subreddit": "Vaping"}]}]}]}