{"InternalImagination": [{"0_comments": [{"duejw2s": [{"0_Comment Submission": "Gatherer Database For Kronos", "1_Text": "I'm too lazy, the fact that I can get a database and skip all of the leg work is too much for me to resist", "2_Subreddit": "KronosWoW"}], "dufemk2": [{"0_Comment Submission": "I want to go to the bar but I'm on probation.", "1_Text": "What? You really posted that letter on peoples door? \nAnd put that on social media, that's going to do the opposite of what you wanting. lol wtf. Stop it", "2_Subreddit": "Drugs"}], "dufepdq": [{"0_Comment Submission": "How much speed is considered a lot if caught in the mail (UK)?", "1_Text": "No amphetamine paste is SUPER cheap in the UK, I mean super cheap. You can get it for less than a pound a gram, it's usually at around 30% potency and is bulked up with caffeine.  But overall not bad. The speed is usually wet and loses weight when dried, not that much though.", "2_Subreddit": "Drugs"}], "dufet66": [{"0_Comment Submission": "How much speed is considered a lot if caught in the mail (UK)?", "1_Text": "Also you can get very decent MDMA for under £3 a gram. I love the UK. It's so close to the Netherlands, that's why its so cheap.\n\nBut I do agree, 50grams is a large amount no matter the price. If you got caught with it you'd be in a lot of trouble and would probably face prison time.", "2_Subreddit": "Drugs"}], "duuke1x": [{"0_Comment Submission": "Stimulant psychosis", "1_Text": "I agree, dont listen to these people saying just sleep. They arent doctors, they don't know your personal situation. Get him to the hospital and get a professional opinion. This isn't necessary harmless. Only a doctor can tell. And if he's had issues with depression, you dont want to risk it. What if he hurts himself.", "2_Subreddit": "Drugs"}], "duukl8p": [{"0_Comment Submission": "Stimulant psychosis", "1_Text": "Please update on situation", "2_Subreddit": "Drugs"}], "duuklqo": [{"0_Comment Submission": "Stimulant psychosis", "1_Text": "I can't believe the irresponsibility of this subreddit, if you worried about him, phone an ambulance if you cant get him to the hospital willingly", "2_Subreddit": "Drugs"}], "duulxu7": [{"0_Comment Submission": "Need help and advice ASAP", "1_Text": "I can't believe the irresponsibility of this subreddit, if you worried about him, phone an ambulance if you cant get him to the hospital willingly", "2_Subreddit": "Drugs"}], "dv3oyhs": [{"0_Comment Submission": "Homeless Wisdom", "1_Text": "How can you say this? lol. Most homeless people I know in the UK (I know many) usually wake up with no dope. No drugs, and if their lucky. They've made enough for a morning hit to get well. If not, a lot of times they panhandle or whatever. And stay sick until they make enough money for one hit. This isn't a quick process for most people, you might not even make enough for one hit.\n\nThen the cycle continues. You need another hit later in the day, so you go out to make more money.  \nThis is life for most addicted homeless people, honestly a life nobody deserves. The homeless problem is so crazy in the UK and these people are suffering, emotionally and often physically.", "2_Subreddit": "opiates"}], "dv41sic": [{"0_Comment Submission": "New Gene Variant Robustly Linked to Opioid Addiction", "1_Text": "It's not requiring me to signup to view on PC, maybe it's just a a phone thing?  Anyway, I'll post the text in the comment section for those that cannot see it.", "2_Subreddit": "opiates"}], "dv41ss0": [{"0_Comment Submission": "New Gene Variant Robustly Linked to Opioid Addiction", "1_Text": "Researchers have identified a novel gene variant involved in opioid addiction, a finding that may aid efforts to develop novel pharmacologic approaches to the treatment of opioid dependence.\n\nIn a genome-wide association study, investigators found that a variant on chromosome 15 (rs12442138) near the repulsive guidance molecule A (RGMA) gene was associated with opioid dependence at a \"genome-wide significant\" level.\n\n\"We hope that this new biology that we identified will lead to new treatment strategies. Previously, there was little reason to focus on RGMA systems in developing opioid dependence treatments. Now there is,\" senior author Joel Gelernter, MD, professor of psychiatry and director of the Division of Human Genetics in Psychiatry, Yale University, New Haven, Connecticut, told Medscape Medical News.\n\nThe study was published online January 11 in Biological Psychiatry.\n\nPromising Lead\nOpioid dependence is a genetically complex disorder that is influenced by complex environmental factors, making it tough to identify genetic factors that underlie the disorder, Gelernter and colleagues note in their article.\n\nTo tease out some of the genetic contributions to opioid dependence, they scanned the genomes of 3058 opioid-exposed European Americans, including 1290 who met DSM-IV criteria for opioid dependence.\n\nThey found that the rs12442183 variant near the RGMA gene had a \"robust\" association with opioid dependence. \"If you have a certain RGMA variant, you're more likely to have opioid dependence symptoms than if you have the alternative form,\" Gelernter said.\n\n\"We believe this is a good new lead and hope it encourages novel pharmacological approaches to treating opioid dependence,\" Gelernter told Medscape Medical News. He added that larger opioid dependence clinical samples are needed to replicate and extend the current findings.\n\nThis RGMA variant was also linked to opioid dependence in a group of African Americans, but the association was much weaker than in European Americans.\n\nPrior studies have shown that the protein product of RGMA regulates cell death and nerve growth in the brain, findings that suggest how the gene might alter the brain's response to opioids, the researchers point out.\n\nIn an analysis of brain tissue expression datasets, they further demonstrated a significant correlation between the expression of RGMA and the expression of four genes that have been shown to affect risk for other psychiatric disorders, including schizophrenia, Alzheimer's disease, and autism.\n\n\"These RGMA coexpressed genes are critical to normal brain function, supporting the potential involvement of RGMA in related biological processes,\" the researchers conclude.\n\n\"In the midst of an opioid crisis, it is timely to identify new genetic risk factors that contribute to addiction risk,\" John Krystal, MD, chairman, Department of Psychiatry, Yale University School of Medicine, and editor of Biological Psychiatry, commented in a news release.", "2_Subreddit": "opiates"}], "dv7c1sw": [{"0_Comment Submission": "Homeless Wisdom", "1_Text": "Not in my experience, and I've worked and volunteered in multiple different community /addiction centres in multiple cities here in the UK.\nI mean it's just basic logic, where do  you expect these homeless people to get money for drugs? From the £40 they get per week? No, they need a lot more than that. They turn to crime or begging.  And that isn't exactly a guaranteed income.  \n\nI used to see the same people, multiple times a week. Coming to the place I worked when they couldn't get any dope. In withdraw, we'd give them so food, comfort them and stuff.  Most of them wouldn't take subutex they knew that whenever they managed to get dope, they wouldn't be able to get high if they took that.\n\nWould also go outside and deliver care packages to the many homeless people around the city. And you definitely could tell a big portion of them were in wd's of some kind. Whether it's legal high stimulants, spice, heroin. You could tell lol. Some people would even tell us.", "2_Subreddit": "opiates"}], "dvo90fj": [{"0_Comment Submission": "WTF has happened to Josh.", "1_Text": "He's trying to control his temper he says, has he ever said this before? A lot of things he's been saying sounds like it came straight from clints mouth. Been watching since the start of the stream and he's said a lot of things I've never heard him say before, he also looks clean.\n \nSeems like they had a long talk while boxing up the wands. Took them over 2 hours apparently.", "2_Subreddit": "kingcobrajfs"}], "dvo9mtt": [{"0_Comment Submission": "WTF has happened to Josh.", "1_Text": "The pizza has triggered him, he's currently in a war in his mind. He's trying to handle it and calm himself. But the rage keeps coming back, but he's dealing with it and not completely flipping out. 'It's a learning curve'", "2_Subreddit": "kingcobrajfs"}], "dwwk814": [{"0_Comment Submission": "Feelsgoodman.jpg", "1_Text": "Thats the thing, some bars might be underdosed to shit, some may be overdosed from the same batch. Could just be a shitty mix with hotspots. \n\nStay safe, and please be atleast a little worried for your safety lol.", "2_Subreddit": "opiates"}]}], "1_submissions": [{"7y4049": [{"0_Title": "Gatherer Database For Kronos", "1_Text": "I'm too lazy, the fact that I can get a database and skip all of the leg work is too much for me to resist", "2_Subreddit": "KronosWoW"}], "7yd14a": [{"0_Title": "Am I shadow banned. And are my previous posts showing on different subreddits", "1_Text": "I'm too lazy, the fact that I can get a database and skip all of the leg work is too much for me to resist", "2_Subreddit": "amishadowbanned"}], "84az8w": [{"0_Title": "WTF has happened to Josh.", "1_Text": "I'm too lazy, the fact that I can get a database and skip all of the leg work is too much for me to resist", "2_Subreddit": "kingcobrajfs"}]}]}]}