{"Neviets": [{"0_comments": [{"dw7emv3": [{"0_Comment Submission": "I feel like, at least in my area, fent has about disappeared.. And you?", "1_Text": "Def not around where I am.  Every single person I know that has gotten popped (myself included early last year) all, yes 100%, of their lab results come back as either fent or fent and heroin.  Once you start with fent, dope just isn’t the same...", "2_Subreddit": "opiates"}], "dw7gb5o": [{"0_Comment Submission": "Does a week ago, still in hospital. Aspirate pneumonia, septic shock and rhabdomilosis. Still in hospital just wanna talk.", "1_Text": "I caught Chikengunya down in Mexico and while being treated for that I was exposed to a dirty IV and caught a Staph infection of the blood (bacteremia).  Showed up at the ER with a 107.6 degree F fever, which made the nurse chuckle and got another machine because “that couldn’t possibly be correct).  Sure enough it was correct, and once they realized I was Septic, I had a team of doctors and residence (I chose to go to a teaching hospital as my primary care physician didn’t have a clue what was wrong with me and I figured the more minds working together the better!).\n\nA bunch of IV morphine and 10mg oxycodone IR for pain (didn’t want to give me any type of fever reducer), a diagnosis of penicillin resistant Staph A. With endocarditis of my tricuspid value acquired due to my weakened immune system due to Chikengunya and an unsanitary IV placed in my ankle in Mexico...37 days in the hospital in IV Nafcillin, discharged with a PICC line to deliver antibiotics for 2 months while at home.  Was the most miserable experience of my life, especially since I required blood cultures to be drawn drawn twice a day, while my veins were absolutely destroyed (from the blood draws, not IV needles abuse).  Wasn’t allowed out of bed the entire time, lost 67lbs between April 22nd - June 7th, extreme muscular atrophy...took my months and months to gain my strength and weight back.\n\nLuckily since I’m generally very healthy and was in my lower 30s, I kicked the shit out of that 30% mortality rate!\n\nUnfortunately, the staph infections attacked my knee joints, leaving me on crutches and in incredibly pain...ran into an hold “friend” who helped me with the pain by getting me a few bags of dope.  Went from being perfectly clean for years to losing an amazingly high paying job and just about everything in my life as I got caught stealing from work in an attempt to support my now $3-400 habit. 2+ years later finally just getting back on my feet, though still critically underpaid as I can’t pass a background check.\n\nTruly one of the few regrets I have in my life.  In the end my health is perfectly fine and slowly using my highly technical skills to freelance and get my bills paid.  Was pretty amazing how I want from zero to jail between July - September.\n\nFeel free to PM me, I know how incredibly\nBoring the hospital is and you can only watch so much law and order.\n\nRespect your addiction, as at anytime it decides, it will deceptively rear it’s ugly head with a ferocity that almost cannot be explained.\n\nTake good care of yourself, you WILL get through this!", "2_Subreddit": "opiates"}], "dw7gnid": [{"0_Comment Submission": "Fent warning - Newark, NJ", "1_Text": "I’ve done plenty of bags of fent before, and while this mixed up white clear (pointing towards almost pure fent*) my friend snorted half a bag (he is very opiate naive) and couldn’t drive for at least an hour and had to really fight the urge to fall out.\n\nUnfortunately, once you start using the needle, there’s no other option to get right.  I’ve been doing this on and off since 2007, and never experienced getting slapped in the face as hard and quickly as this.  I’m certain two would have killed me if I wasn’t given narcan in the proper amount of time.\n\nJust be extremely careful.  Maybe I caught a hot bag designed to kill someone to increase the marketing of this batch, but there’s no way to know (and this was a regular plug my friend has and he’s never had any problems before).", "2_Subreddit": "opiates"}], "dw7gp2j": [{"0_Comment Submission": "Fent warning - Newark, NJ", "1_Text": "I have pics of the bags for reference purposes but can’t figure out how to upload them, any help would be appreciated as it could safe a life (and I’ve heard this batch has been around a specific area in Newark for a bit now)", "2_Subreddit": "opiates"}], "dw7lbcl": [{"0_Comment Submission": "Fent warning - Newark, NJ", "1_Text": "[green mafia - FENTANYL](http://i.imgur.com/BWM5jzE.jpg)", "2_Subreddit": "opiates"}], "dw7ldo8": [{"0_Comment Submission": "Fent warning - Newark, NJ", "1_Text": "Think I did it right, click on the link to see what they look like.  Used the plunger cap to show size", "2_Subreddit": "opiates"}], "dw7ljlb": [{"0_Comment Submission": "Does a week ago, still in hospital. Aspirate pneumonia, septic shock and rhabdomilosis. Still in hospital just wanna talk.", "1_Text": "It’s gonna be a long painful road but use this time to get yourself clean, reach out to family, and watch a lot of Law and Order hahaha.  Feel free to reach out directly...that was the most difficult time in my life and I honestly thought I wasn’t gonna make it through it but you will!!!  Take care of yourself man, just remember there are people who care about you!  One love!", "2_Subreddit": "opiates"}], "dwfylfp": [{"0_Comment Submission": "What is the most valuable prescription one could POSSIBLY obtain", "1_Text": "Damn I used to get those yellow stop signs for $40...dude had no idea what he had.  This was back in like 2009 or so.  Never figured out/tried to shoot em, but I would get wildly rocked from snorting them it was out of control hahah", "2_Subreddit": "opiates"}], "dwg8366": [{"0_Comment Submission": "How to avoid taking fentanyl cut heroin", "1_Text": "Many “hot spots” are done on purpose.  Dealers will boost a couple bags a brick to literally make people fall out cause it’s “good marketing”.  Always do test shots when using new stuff.  Or find a plug that is honest and will tell you if it’s death or just normal work", "2_Subreddit": "opiates"}], "dwg8754": [{"0_Comment Submission": "How to avoid taking fentanyl cut heroin", "1_Text": "I’m not positive but aren’t those specific to fent?  There’s so many fentalogs out there I’m not sure if they will come back positive.\n\nAnd even though the VAST MAJORITY of bags are now cut with fent, there’s still a ton of garbage out there (I’m talking ECP, we don’t see BTH out here ever)", "2_Subreddit": "opiates"}], "dwg8goo": [{"0_Comment Submission": "How to avoid taking fentanyl cut heroin", "1_Text": "If you mean dump all the bags out, mix it up, and test?  It’s not a terrible strategy.  I’ve been in and out of the game for awhile and never have a “hot bag” before...they either work or they don’t.  Ya just have to be careful...there really isn’t a fool proof way of playing this game.  The same would go for pills, I’ve gotten perfectly pressed blues that rocked me into another world where I couldn’t even make a grilled cheese sandwich.\n\nIf you don’t have a tolerance you just have to be cautious.  Unfortunately if you’re sick...caution is the last thing your thinking about when you’re throwing up in your car on the way to pick up.\n\nGod forbid you get a bag with carfent in it, there’s zero safe way to do a test shot (though that’s extremely rare)", "2_Subreddit": "opiates"}], "dwg9all": [{"0_Comment Submission": "How to avoid taking fentanyl cut heroin", "1_Text": "Everyone I know (talking like 5-10 people, myself included 1.5 years ago) that has gotten popped for possession has had their bags come back from lab testing with fent in them (and from talking with dealers).  They get raw and they get “fent powder” they use to bulk out the product.  They just have no clue how strong the fent powder is.  It’s become extremely common.  This is area specific, but even people I’ve talked to from Baltimore have said they’re being told their “scramble” as they call it is always raw and fent.  Once people get used to fent, you can’t really got back to raw...it just doesn’t pack the same punch.\n\nIt’s also just better business (from an economics POV).  A key of fent is easier to make and goes a much longer way that a key of raw.  This leads me to believe this trend isn’t going anywhere fast.  Unless China decides to actively shut down their labs, but I’m sure the Mexican cartels are either working on it or will fill that void if one such occurs.\n\nThis could all be nonsense, but all I know is back in like 2004-6 when I started messing around, things were way different.  From the high to the withdrawal.  Kicking fent is much different feeling than kicking dope...at least for me.  Nowadays I’m even more concerned because I’m not an everyday user anymore so my tolerance is low, but not nonexistent.", "2_Subreddit": "opiates"}], "dwh4ubw": [{"0_Comment Submission": "How to avoid taking fentanyl cut heroin", "1_Text": "I noticed that too, the kick from fent is much more severe but only for like 4 days for me.  I used to never throw up, and now between like 24-48 hours  I end up puking violently multiple times.  And subs don’t even touch it, it’s actually “easier” to just kick cold, even though it’s absolutely miserable.", "2_Subreddit": "opiates"}], "dwh50c9": [{"0_Comment Submission": "How to avoid taking fentanyl cut heroin", "1_Text": "Hah you got that right, I don’t think we’ll ever see compassionate use here like in Switzerland and Australia.  We could save billions of dollars but we like to throw money at problems after the fact instead of actually trying to solve them.", "2_Subreddit": "opiates"}], "dwmc5ec": [{"0_Comment Submission": "Is cwe neccesary for 4 hydro pills 10mg/325mg APAP?", "1_Text": "No, the LD-50 is much higher, but it is strongly recommended against.  I’ve definitely exceeded the 4g/24hour limit many times...but each time is a gamble.  When Acetaminophen toxicity causes acute liver failure you do not immediately know, by the time you’re symptomatic it’s often too late to be reversed (typically treated with Mucomyst aka Acetylcysteine).\n\nThere are some statistics out there stating that acetaminophen is responsible for 20-30% of all liver failures (I’d recommend researching this as I do not have the sources at my fingers and this was from many years ago).  \n\nRegardless, JUST SAY KNOW, use CWE whenever possible, and switch from Tylenol to Advil or some other OTC painkiller that has a safer therapeutic profile (not that Advil and NSAIDs don’t have their own risk, irreversible liver failure isn’t one of them) - unless you’re treating a fever, acetaminophen is more effective at treating fevers at the recommended dose).", "2_Subreddit": "opiates"}]}], "1_submissions": [{"86ryyq": [{"0_Title": "Fent warning - Newark, NJ", "1_Text": "Def not around where I am.  Every single person I know that has gotten popped (myself included early last year) all, yes 100%, of their lab results come back as either fent or fent and heroin.  Once you start with fent, dope just isn’t the same...", "2_Subreddit": "opiates"}], "86s0qf": [{"0_Title": "FENTANYL WARNING - NEWARK, NJ", "1_Text": "Def not around where I am.  Every single person I know that has gotten popped (myself included early last year) all, yes 100%, of their lab results come back as either fent or fent and heroin.  Once you start with fent, dope just isn’t the same...", "2_Subreddit": "opiates"}]}]}]}