{"emiliegoldberg": [{"0_comments": [{"dwv6gno": [{"0_Comment Submission": "Gay and Single? Bi? Trans? The 2020 Census Still Erases You", "1_Text": "As much as I want my fellow Bs and Qs (as well as my Ls, Gs, and Ts) to be represented, I think this might be for the better.  \n\nI believe that Chump and his administration will begin rounding people up based on race, religion, gender, sexuality, etc. and putting us into camps.  \n\nWe should not give them much information at all.", "2_Subreddit": "politics"}], "dwv7dzs": [{"0_Comment Submission": "What will make you instantly dislike a person?", "1_Text": "If you're republican or christian you're probably in part responsible for the fourth reich currently in charge of America.  \n\nGo fuck yourself.", "2_Subreddit": "AskReddit"}], "dwv8cbd": [{"0_Comment Submission": "Shouldn’t Police at Home Exhibit at Least as Much Discipline as Soldiers at War?", "1_Text": "And who exactly would be responsible for the \"blood bath?\"", "2_Subreddit": "politics"}], "dwv8gr2": [{"0_Comment Submission": "Forget About Impeaching Trump", "1_Text": "Right-wing media outlets like Politico are of course trying to downplay all of the evidence of collusion.  \n\nSorry, right wing, but Trump's days in the oval office are coming to an end very, very soon.  He'll be in jail before the new year.", "2_Subreddit": "politics"}], "dwvidva": [{"0_Comment Submission": "Mile End stabbings: Three teenagers in hospital after knife attack amid London violence surge", "1_Text": "I hope you know that posting something like this is extremely problematic.  \n\nI will be in touch with mods about removing this.  If they do not act I may have to get the police involved.  \n\nIn fact, I should alert the police about this subreddit in general as it's been filled with nothing but racist propaganda the last couple of days.  Reddit cannot and should not hide the identities of the bigots posting this hate-filled bullshit.  \n\nThis is a warning to the OP, all posters (including /u/brunette_in_the_city), the mods, and this sub in general.  DO NOT keep posting propaganda or the police will be notified.", "2_Subreddit": "london"}], "dwvj96b": [{"0_Comment Submission": "My dboy who sold me these bricks invited me into his trap house to party. I politely declined", "1_Text": "Nothing wrong with fucking your dboy when you're out of cash.  I've done it many times and never regretted it.", "2_Subreddit": "opiates"}], "dwvtgip": [{"0_Comment Submission": "Forget About Impeaching Trump", "1_Text": "You're delusional and possibly a Nazi sympathizer if you believe that any media outlets lean left.", "2_Subreddit": "politics"}], "dwvxsv7": [{"0_Comment Submission": "Shouldn’t Police at Home Exhibit at Least as Much Discipline as Soldiers at War?", "1_Text": "That's ridiculous but not without merit, actually.  Without police/military, white people would begin slaughtering all of us minorities without prejudice.  I suppose our best bet is to let them have a semblance of power with police/military.", "2_Subreddit": "politics"}], "dww3jrb": [{"0_Comment Submission": "South African farm murders by race and association with farm, 2001 to 2018", "1_Text": "White people get what they deserve for colonizing African lands.  I laugh when I see white suffering.", "2_Subreddit": "southafrica"}], "dww3lo1": [{"0_Comment Submission": "Shouldn’t Police at Home Exhibit at Least as Much Discipline as Soldiers at War?", "1_Text": "White people are all shit.", "2_Subreddit": "politics"}], "dwwr95p": [{"0_Comment Submission": "Shouldn’t Police at Home Exhibit at Least as Much Discipline as Soldiers at War?", "1_Text": "It is not possible to be racist against whites as they hold all the power.", "2_Subreddit": "politics"}], "dwww7uj": [{"0_Comment Submission": "Alberta government introduced legislation to keep protesters at least 50 metres away from abortion clinics and make it illegal for demonstrators to video or take pictures of people entering or leaving building. Intimidation of patients at province’s clinics is on rise, Health Minister Hoffman said.", "1_Text": "Even Canada is not safe from nazis and the alt. right.", "2_Subreddit": "worldnews"}], "dwwxbig": [{"0_Comment Submission": "Young Britons have never been unhappier, research suggests - Young people’s happiness across every single area of their lives has never been lower, research by the Prince’s Trust has found.", "1_Text": "They don't feel safe.  It's that simple.  \n\nYou have white supremacists and nazis all over the internet and now in the streets committing violent crimes, but the police can't stop all of them.  \n\nHomophobia and racism are peaking because white brits have a problem with refugees.  Maybe if you actually took care of the migrants coming in (providing them with living wages, healthcare, education, housing) then they wouldn't spend all day outside looking for ways to survive.  \n\nI have no sympathy for white British youths.", "2_Subreddit": "worldnews"}], "dwwxpf9": [{"0_Comment Submission": "Trump asked CIA official why drone strike didn’t also kill target’s family: report", "1_Text": "Heartless.  We had eight years of peace and great foreign relations with Obama but now we have a lunatic racist who wants to kill brown children.  \n\nFortunately Trump will be in jail by the end of the year unless he fires Mueller.", "2_Subreddit": "politics"}], "dwwxya6": [{"0_Comment Submission": "Will We Stop Trump Before It’s Too Late?", "1_Text": "Dems are way too far right.  Until we see universal healthcare, immediate permanent amnesty for all immigrants, $15-$20/hour minimum wage, reparations for all African-American families, free college, etc., it is hard to support the Dems.", "2_Subreddit": "politics"}], "dwx06g6": [{"0_Comment Submission": "In China, an American diplomat was beaten for his bad words about Stalin", "1_Text": "Good.", "2_Subreddit": "communism"}], "dwx07xv": [{"0_Comment Submission": "Will We Stop Trump Before It’s Too Late?", "1_Text": "What about my comment is unrealistic?", "2_Subreddit": "politics"}], "dwx6ujr": [{"0_Comment Submission": "Will We Stop Trump Before It’s Too Late?", "1_Text": "Yes those also need to be on the agenda.  Everyone should be taken care of regardless of where they live.  We should be making more contributions to poorer nations as well so that their citizenry can escape poverty.  \n\nThese are common sense initiatives.  It's time to make it happen.", "2_Subreddit": "politics"}], "dwxcegm": [{"0_Comment Submission": "Will We Stop Trump Before It’s Too Late?", "1_Text": "Not hard at all.  If everything is free and every poor person is given a ton of money, things become a lot easier for everyone.", "2_Subreddit": "politics"}], "dwxct1l": [{"0_Comment Submission": "Will We Stop Trump Before It’s Too Late?", "1_Text": "This is why we need to stop voting white men into high offices.  They will never, EVER look out for minorities.  African-Americans, Latinx-Americans, Arab-Americans, Jews, etc. will never be allowed a level playing field so long as white men like Bush and Trump run the show.", "2_Subreddit": "politics"}], "dwxd33g": [{"0_Comment Submission": "Britain's sugar tax on soft drinks comes into effect", "1_Text": "This is a step in the right direction but not nearly enough.  \n\nMaking eating GMO products and non-vegan products illegal is truly the only way we can end the madness of corporate food/drinks.  While sugar-laden drinks are terrible and lead to much suffering worldwide, forcing everyone via legislation to eat and drink properly will be the only effective method of controlling the masses.", "2_Subreddit": "worldnews"}], "dwxdrql": [{"0_Comment Submission": "What is wrong with me?", "1_Text": "Remember that most college professors are staunch conservatives who make hefty salaries on the backs of their students.  I've had professors who shut down any speech that they don't like, because they're fucking authoritative assholes.  \n\nIt's okay though, soon our generation will be in full control and America will have UBI, a full ban on all weapons, comprehensive universal healthcare, etc. and these old assholes will be thanking us.", "2_Subreddit": "communism"}], "dwxdw2f": [{"0_Comment Submission": "Will We Stop Trump Before It’s Too Late?", "1_Text": "So you're trying to argue with me by taking my quotes out of context?", "2_Subreddit": "politics"}], "dwxeci9": [{"0_Comment Submission": "Will We Stop Trump Before It’s Too Late?", "1_Text": "Your thinking suggests to me that you aren't on board with what needs to happen.  Our generation will fix everything within a few years.  \n\nReparations and UBI and other initiatives don't have to cost any \"government money\" if you simply tax the rich (people making $125,000 or more per year) 90%.  If that's not enough, and if the poor need more, the treasury can simply print more money.  \n\nThe solutions to the problems are easy.  Stop playing ignorant.", "2_Subreddit": "politics"}], "dwxekj1": [{"0_Comment Submission": "Will We Stop Trump Before It’s Too Late?", "1_Text": "Why, because you're a \"moderate\" leftist, or you want \"incremental\" change?  \n\nThe change for African-Americans has been incremental for centuries, and look at the spot that they're in.  They cannot leave home without fear of harassment or even murder by police, but that's okay, because we can change that INCREMENTALLY.  \n\nYou're either a bot or a troll or a fucking nazi coward afraid of owning up to it.  Go fuck yourself.", "2_Subreddit": "politics"}]}], "1_submissions": [{"836jsp": [{"0_Title": "In his fight with North Korea, Trump may end up with no allies", "1_Text": "As much as I want my fellow Bs and Qs (as well as my Ls, Gs, and Ts) to be represented, I think this might be for the better.  \n\nI believe that Chump and his administration will begin rounding people up based on race, religion, gender, sexuality, etc. and putting us into camps.  \n\nWe should not give them much information at all.", "2_Subreddit": "politics"}]}]}]}