{"amnesicaqueous": [{"0_comments": [{"duh8elj": [{"0_Comment Submission": "Alpro", "1_Text": "No? That's definitely 10mg Oxy. Who told you it was Alp?", "2_Subreddit": "drugsarebeautiful"}], "dukilc4": [{"0_Comment Submission": "leap of faith?", "1_Text": "Not really. APAP reduces bioavailability. I've always noticed roxies are way better than regular percocet. There's a distinguishable difference.", "2_Subreddit": "opiates"}], "duonxt6": [{"0_Comment Submission": "My kind of morning! Hydro in the rig and the green lines on the glass are from a fentanyl pill.", "1_Text": "Is that an OC 80 press? And I'm assuming by hydro you mean hydromorphone right?", "2_Subreddit": "opiates"}], "duoooun": [{"0_Comment Submission": "Just got this oxy 80 that I know is fent. How do I not die while being able to experience what fent feels like?", "1_Text": "There's a lot of stigma around fent presses but really what it comes down to is that fentanyl is no more dangerous than other opiates; it's just stronger, thus harder to dose. If a fent press is created professionally by people who know what they're doing it will be no different from regular Oxy of the same analgesic dose. However it's not always easy to know if it's created professionally so just do maybe an eighth of a pill and go from there depending on how you feel.", "2_Subreddit": "opiates"}], "duoqxdz": [{"0_Comment Submission": "My kind of morning! Hydro in the rig and the green lines on the glass are from a fentanyl pill.", "1_Text": "Nice, didn't know they made 6/9 mg hydromorphone. But yeah honestly the whole press stigma is annoying. I love presses, and I'd probably say more so than actual Oxy. Be careful though because you never know if it has a hot spot.", "2_Subreddit": "opiates"}], "dutexgy": [{"0_Comment Submission": "Early morning pick up", "1_Text": "Yeah they're fakes but who cares lmao. Presses are way better than actual Oxy in my opinion.", "2_Subreddit": "opiates"}], "duxidfb": [{"0_Comment Submission": "If someone had a high fent/heroin tolerance, how many mg of oxycodone would it take them to get high?", "1_Text": "How long have you been on that for?", "2_Subreddit": "opiates"}], "dv1leow": [{"0_Comment Submission": "3 8mg Dilly's and 6 10mg addys. Dude finally came through. He's gonna hold another 7 dills for me for when I get paid. Happy days:)", "1_Text": "The bioavailability for Adderall orally is 25%. Nasal is 75%", "2_Subreddit": "opiates"}], "dv5gzcb": [{"0_Comment Submission": "3 8mg Dilly's and 6 10mg addys. Dude finally came through. He's gonna hold another 7 dills for me for when I get paid. Happy days:)", "1_Text": "Lasting longer doesn't always equal greater bioavailability. But the bioavailability of Adderall should be pretty common knowledge to anyone who's used Adderall and knows what they're doing with it. It's designed to last longer orally; that's why it's supposed to be taken orally. Sniffing will give a more intense effect though.", "2_Subreddit": "opiates"}], "dv5h0rl": [{"0_Comment Submission": "7 8mg dilaudid with one broken up ready to be insufflated. Enjoy:) #LinesOfLaud", "1_Text": "It's actually 50 for hydromorphone.", "2_Subreddit": "opiates"}], "dw9weih": [{"0_Comment Submission": "Nice little score of some M's", "1_Text": "Right, that's the part I loved the best about this picture when my dealer sent it to me. Got all of them for $90.", "2_Subreddit": "opiates"}], "dw9x3is": [{"0_Comment Submission": "Nice little score of some M's", "1_Text": "I definitely have been :)", "2_Subreddit": "opiates"}], "dwa3u9g": [{"0_Comment Submission": "Nice little score of some M's", "1_Text": "They're 5mg pills. Notice that they're white, not blue.", "2_Subreddit": "opiates"}], "dwa46eo": [{"0_Comment Submission": "Nice little score of some M's", "1_Text": "I won't ever pay more than $15 for a roxy. These are 5mg pills though so for $90 it comes to like $18/30mg. So really it's the most I've ever paid for Oxy, on a milligram basis.", "2_Subreddit": "opiates"}], "dwaggsf": [{"0_Comment Submission": "Nice little score of some M's", "1_Text": "Yiss I haven't done much, since my tolerance isn't that bad and I can get high off of 30-40mg. Usually when I do any more than that I throw up lel", "2_Subreddit": "opiates"}], "dwaghig": [{"0_Comment Submission": "Nice little score of some M's", "1_Text": "About 150mg in total. There's 30 of them in the bottle.", "2_Subreddit": "opiates"}], "dwcbvho": [{"0_Comment Submission": "Doc finally gave me some pandas 😩😩😩.", "1_Text": "Holy fuck mate you're going to fucking kill this guy.", "2_Subreddit": "opiates"}], "dwcbyaq": [{"0_Comment Submission": "Doc finally gave me some pandas 😩😩😩.", "1_Text": "If you snort it, 5mg is going to be equivalent to like 50-100mg of Oxycodone taken orally. So take it very slow with these.", "2_Subreddit": "opiates"}], "dwccc8i": [{"0_Comment Submission": "The elusive Mbox.... :)", "1_Text": "Were you maybe getting fakes? Fake M boxes will slide like crazy and have great bioavailability when smoked because the drug is Fentanyl and not Oxycodone.", "2_Subreddit": "opiates"}], "dwou93a": [{"0_Comment Submission": "Doc finally gave me some pandas 😩😩😩.", "1_Text": "Through what ROA? I've never done Oxymorphone as I haven't found any yet, but that conversion ratio is just what equianalgesic converters online tell me.", "2_Subreddit": "opiates"}], "dws1my9": [{"0_Comment Submission": "One of the dumbest things I have laughed at in awhile", "1_Text": "God it irritates the shit out of me when people don't (can't) understand humor that is obliviously satirical. Obviously it's an ironic jab at the cringy, unfunny nature of genuine rage comics.", "2_Subreddit": "opiates"}], "dws2kmm": [{"0_Comment Submission": "Is there any benefit to mixing oxycodone and hydrocodone?", "1_Text": "Every milligram of Oxycodone is equivalent to 1.5 milligrams of Hydrocodone I think. And my pet dog Jeff honestly likes Hydrocodone equally as much as Oxycodone, but they both feel pretty different. Hydrocodone is more of a sedative, mellow high whereas Oxy kind of incorporates energy and stimulation, in a way. So I feel as though mixing the two would be a better option than just taking a bunch of one or the other at a time as you would get the effects of both, which in theory I think would be way better, but you'd have to ask Jeff.", "2_Subreddit": "opiates"}], "dwtyb5k": [{"0_Comment Submission": "Did Anyone Get Their Tax Refund Money yet? I did at 4 Am. At 4:05 i called the dboy. Didnt spend a lot, trying to cut down and save $", "1_Text": "The irony in telling the state, \"thanks for giving me back a portion of the money you stole from me.\"", "2_Subreddit": "opiates"}], "dwu3bqx": [{"0_Comment Submission": "Connect from cold cop always coming correct", "1_Text": "Oof don't get banned mate", "2_Subreddit": "opiates"}], "dwvqipa": [{"0_Comment Submission": "The come up", "1_Text": "For real man I hate when niggas be ridding my duck.", "2_Subreddit": "opiates"}]}], "1_submissions": [{"873a4x": [{"0_Title": "Nice little score of some M's", "1_Text": "No? That's definitely 10mg Oxy. Who told you it was Alp?", "2_Subreddit": "opiates"}], "8a4s5o": [{"0_Title": "Oof", "1_Text": "No? That's definitely 10mg Oxy. Who told you it was Alp?", "2_Subreddit": "opiates"}]}]}]}