{"bynarie": [{"0_comments": [{"dwoqzsm": [{"0_Comment Submission": "Flualprazolam is improperly named", "1_Text": "yep", "2_Subreddit": "Flualprazolam"}], "dwos3vq": [{"0_Comment Submission": "Flualprazolam is improperly named", "1_Text": "Here is my honest overall opinion on FLAP. The morning glories were on a benge of various stims, like 4FA, 6-apb, etc... for about 2 days.. I administed them 2mg of F-ALP and probably 10mg of c-lam. So the plants I dont believe could distinguish between the 2, I just thought I noticed 2mg of flap wasnt doing it for them. So I did 2mg of c-lam every 15 minutes until the flowers had calmed down. By the point of about 10mg the plants seemed to be in complete euphoria. So it was probably a combination between the 2, not exactly sure. They sort of hented at me the the f-alp wasnt very potent compared to c-lam. That's why i fed them c-lam. Hopefully this will give u a inside perspective of how glenn and his brothers did, the morning glories. Thank you guys for everything, the most important thing is that we dont over fertilize our plants with any chemical be it tylenol or whatever. This is an extremely high dose for morning glories but they were completely out of control so I had to fertlize to stabilze them. Thanks you guys for everything, of the support, the love, the overall understanding that no body can be certain about anything in life. Thanks to the mods, thank you the all users. You guys and gals are good people with good hearts, shout out to my homies u/newbieforever2016 and u/Flualp_4_Prez_2020 (aka Drooling). Have a wonderful day!", "2_Subreddit": "Flualprazolam"}], "dwosnvi": [{"0_Comment Submission": "Okay so where do you go when this sub and my account gets banned?", "1_Text": "I started up a dedicated server man, started implementing an open source reddit style forum, then realized I was making a mistake and stopped because I am trying to get off this shit. So I need to leave reddit for good. Prolly within the next couple of months I will no longer be around. You have been a fantastic friend to me and wish you and everyone for that matter a hopefully positive journey through life.", "2_Subreddit": "Etizolam_2"}], "dwowuxb": [{"0_Comment Submission": "Bam baby", "1_Text": "Fuck benzos, I hate em whish they never excisted! Good luck to you my frined, please be careful. Its not really a drug u want to hooked up so as long as your doctor can taper u off, u cool. Be safe", "2_Subreddit": "benzodiazepines"}], "dwox413": [{"0_Comment Submission": "Reporting illegal content anonymously?", "1_Text": "Well if you're smart ud be running the OS on TOR thru a disposable usb drive that has no access to your computer. With vpn + socks5 proxy + TOR. But you didnt do anything wrong. The FBI is watching me this sub right now. And everyone on Reddit, so dont be scared to submit a tip. I've submitted tips", "2_Subreddit": "onions"}], "dwoxj51": [{"0_Comment Submission": "Reporting illegal content anonymously?", "1_Text": "And also, there's a thing called encryption... Use anything privately u need to do with an encryped virtual machine or something but dont EVER use your fucking computer. Install virtualbox and encrypt the motherfucker like 5 times on an encrytped drive and its sandboxed inside of an encryped VM. Then, encrypt your home drive, then encrypt folders inside of your home folder. Thats 4 layers of encryption and u can encrypt more if you want. But as long as its either an external drive with no access to your pc or in a VM, there wont be anything on your harddrives, especially if u run the VM on an encrypted HD partition, encrypt the entitre VM, encrypt the home folder, encrypt the folders. Use the highest possible encryption method. It will run WAY slower because of the cpu having the decode everything but thats my take.", "2_Subreddit": "onions"}], "dwoxn48": [{"0_Comment Submission": "Reporting illegal content anonymously?", "1_Text": "CP = ? btw??", "2_Subreddit": "onions"}], "dwoz3ho": [{"0_Comment Submission": "Reporting illegal content anonymously?", "1_Text": "OH... shit... get the fuck away from that bro.. Just go on about your business and do not even look back.", "2_Subreddit": "onions"}], "dwoz607": [{"0_Comment Submission": "Reporting illegal content anonymously?", "1_Text": "Thank you, I'm not versed on some of the darkweb terminogoloy. I thought it was a chemical or something... Yea everyone stay away from that shit...", "2_Subreddit": "onions"}], "dwoz9av": [{"0_Comment Submission": "Reporting illegal content anonymously?", "1_Text": "That's the most nastiest, uncalled for shit. If I found out who was doing this shit I would personally bring an army of people with me and make sure this guy knows hes in big fucking trouble.", "2_Subreddit": "onions"}], "dwp38hk": [{"0_Comment Submission": "Reporting illegal content anonymously?", "1_Text": "exactly, we need to protect our inncocent kids", "2_Subreddit": "onions"}], "dwqg34e": [{"0_Comment Submission": "Caution Statement", "1_Text": "Sorry, I was talking about oceanside resources. I made a mistake when posting...", "2_Subreddit": "RCchems"}], "dwqgg1g": [{"0_Comment Submission": "dagger", "1_Text": "My only option is to have faith in a supreme being that I call God. I am not reiligious in anyway shape or form and everyone deserves to express their opinion without being bashed. I have a fantastic support group for my addictions but I need MY God there too. I pray to God daily, well, I forget sometimes but I am struggling bad with tiz and I need the faith... Honestly I did not watch the videos but I just wanted to express that! Thanks all", "2_Subreddit": "Etizolam_2"}], "dwqgx8e": [{"0_Comment Submission": "Everyone hates Ohio", "1_Text": "LOL i live in ohio i get etizolam all the time... what does it being scheduled got to do with anything", "2_Subreddit": "benzodiazepines"}], "dwqh8rm": [{"0_Comment Submission": "Everyone hates Ohio", "1_Text": "Scheduled or not ur still going to jail most likely if busted with a huge amount... of any RC... Seen it time and time again.. It's been in the news, etc...", "2_Subreddit": "benzodiazepines"}], "dwqtlai": [{"0_Comment Submission": "dagger", "1_Text": "could be brother.. theres no way to ever find out.. for me it helps, others it dont. everyone has their ways of dealing with life ya know", "2_Subreddit": "Etizolam_2"}], "dwqw260": [{"0_Comment Submission": "Okay so where do you go when this sub and my account gets banned?", "1_Text": "thanks bro i appreciate that. unfortunately my taper has gotten fucked up now 2 times.. the first time the dr put me on phenobarbital for 9 days. that ruined my taper. second time the doctor gave me 600mg per day gabapentin.. had uncontrollable tremors and shakes and here i am back up to god knows how much etizolam. id say 50mg at minimum per day. i really dont know what to do, im fucking desperate and crying out for help. if i go to a detox center, i will have to stop my bupe, then will give me pain pills which is not wtf i want. i want out of this fucking drug lifestyle so bad and its fucking killing me. i have a full unopened bottle of fluorophenibut 100grams, just waaay to many RCs. all kinds of racetams. i dont know what to do. im stunned and i feel no way out", "2_Subreddit": "Etizolam_2"}], "dwukft3": [{"0_Comment Submission": "Bum just traded me a bunch of halved kpins and 3 lorazepams for a black and mild", "1_Text": "Huh? We have already discussed this, and we both agree'd everything was cool. Why are u bringing this up? Being a grown up means standing up for what you feel is right and not calling people names, like you did. And yes, I have problems with my emotions. But I definitely can control them. Brother, I mean no harm no foul no drama, I have a genuine care for others. I hope and wish the best to you man. Have a great day.", "2_Subreddit": "benzodiazepines"}], "dwuksyh": [{"0_Comment Submission": "dagger", "1_Text": "Oh absolutely dude... You did not insult or disprect me and or anything else. I like your attitude man. You're a good fella. I preach \"To each their own.\" I think people should be able to say \"I dont believe in XYZ\" and not get shit on, and vice versa. I would never bash someone for their religious or spirituality even if I thought the idea was insane... Like, The Holy Bible, is just another book u pick up at the book store and read. Its just simply a book, in my opinion. For other people, its sacred and thats fine. Whatever steps are neccessary for someone to live in peace, shit, do it. Thank you so much for that message man, that truly does inspire me.", "2_Subreddit": "Etizolam_2"}], "dwum8k8": [{"0_Comment Submission": "Shout out to all you private vendors!", "1_Text": "He's currently not vending at the moment, sorry brother.", "2_Subreddit": "TheRealEtizolam"}], "dwv00u1": [{"0_Comment Submission": "I'm Eric Hafner, I'm running for U.S. Congress in Portland, Oregon (OR-3). I want to legalize all drugs, including opiates, but offer ibogaine therapy too, and free drugs for addicts via prescription.", "1_Text": "Mr. Hafner, while I do believe in harm reduction, which is basically what this sounds like you are doing, I think you should consider the consquences of legalizing all drugs. This will potentially INCREASE crime rates and the drug addictions will get out of control and eventually you will have nothing. I do tremendously respect the fact of admitting to using drugs and saying that politics is a bunch of bullshit, which we already know. Do you believe it would be more wise to invest money into helping people recover and putting in policies for de-criminalization instead? For example, instead of going to jail for getting caught with some drugs, how about the cops give out a citation and referring them to a chance of recovery. The idea of just letting drug addicts have free drugs 24/7 is absurd and it will never happen.", "2_Subreddit": "opiates"}], "dwv1p7m": [{"0_Comment Submission": "I'm Eric Hafner, I'm running for U.S. Congress in Portland, Oregon (OR-3). I want to legalize all drugs, including opiates, but offer ibogaine therapy too, and free drugs for addicts via prescription.", "1_Text": "Ah, I see your point Sir. I do live in a Capital city where drugs are horrific. Needles all over the fucking place. Regardless, if I lived in your State I would 100% vote for you, especially now that you have broken it down a little more. I like your ideas and it could be plausible. Much respect Sir. Best of luck to you and I hope you can help make the country better by starting something in a state. Thank you for this.", "2_Subreddit": "opiates"}], "dwv26qn": [{"0_Comment Submission": "I'm Eric Hafner, I'm running for U.S. Congress in Portland, Oregon (OR-3). I want to legalize all drugs, including opiates, but offer ibogaine therapy too, and free drugs for addicts via prescription.", "1_Text": "Absolutely, thank you for being a realist and admitting to your own history. That's very very admirable. Have a nice day.", "2_Subreddit": "opiates"}], "dwy80vz": [{"0_Comment Submission": "Benzodiazepines (Etizolam, Diclazepam, Clonazolam, Flubromazolam, Flunitrazolam, Pyrazolam etc.) discussion thread", "1_Text": "Meclonazepam is notoriously weak and I would hardly call it a benzo. Well, I'm far addicted to benzos, taking 30-40mg of etiz / day. So if u have no tolerance I suppose it could be recreational. I tried to get high on meclon. 30, 40, 50mg... not shit... But, thats just me. alpraz and kpins and valium are definitely the top dawg benzos.", "2_Subreddit": "researchchemicals"}], "dwyati2": [{"0_Comment Submission": "Benzodiazepines (Etizolam, Diclazepam, Clonazolam, Flubromazolam, Flunitrazolam, Pyrazolam etc.) discussion thread", "1_Text": "ive never actually had valium. only etiz and xaxax and klonopin. but id guess probably 100-150mg. im just basing that off of the etiz 1mg =10mg valium.. i am trying so hard to get off of benzos man. its notoriously hard. but ive tried every rc benzo out there. i have a mountain of etizolam powder but its not a good drug for tapering.. and to make things worse im on buprenorphine. i had 5 years completely sober. best time of my life. fucked it up by taking 1mg of kpin. finally found out about etizolam and RCs, and it was on. i was upwards taking well over 100mg a day of etizolam. wish me luck man, got a dr appt on Monday and i hope to get a proper taper. have a good one", "2_Subreddit": "researchchemicals"}]}], "1_submissions": [{"79onb8": [{"0_Title": "FREE Needles and Narcan - Columbus OH", "1_Text": "yep", "2_Subreddit": "Drugs"}], "7a3dph": [{"0_Title": "Just saved a life yesterday... I hope", "1_Text": "yep", "2_Subreddit": "Drugs"}], "7bg7a1": [{"0_Title": "Looking for a quick $5 USD bitcoin trade", "1_Text": "yep", "2_Subreddit": "Bitcoin"}], "7hpyr4": [{"0_Title": "Where to get an Etiz CoA?", "1_Text": "yep", "2_Subreddit": "researchchemicals"}], "7k7uy4": [{"0_Title": "Looking for a good \"wake me up\" chemical", "1_Text": "yep", "2_Subreddit": "researchchemicals"}], "7m7nj8": [{"0_Title": "Automatic altcoin checkout system", "1_Text": "yep", "2_Subreddit": "Bitcoin"}], "7muho2": [{"0_Title": "FlubromazePAM or Metizolam; Which Shall I Choose?", "1_Text": "yep", "2_Subreddit": "benzodiazepines"}], "7mukg4": [{"0_Title": "FlubromazePAM or Metizolam; Which Shall I Choose?", "1_Text": "yep", "2_Subreddit": "researchchemicals"}], "7pfnu3": [{"0_Title": "My PGP key", "1_Text": "yep", "2_Subreddit": "u_bynarie"}], "7q5l8e": [{"0_Title": "Does anyone know of an IRC channel for RCs?", "1_Text": "yep", "2_Subreddit": "researchchemicals"}], "7q5le7": [{"0_Title": "Does anyone know of an IRC channel for RCs?", "1_Text": "yep", "2_Subreddit": "Drugs"}], "7rexcx": [{"0_Title": "How to enable SSH thru cloudflare", "1_Text": "yep", "2_Subreddit": "CloudFlare"}], "7woxjw": [{"0_Title": "Seriously?", "1_Text": "yep", "2_Subreddit": "Flualprazolam"}], "7ww7xl": [{"0_Title": "Looking for memory and concentration stack / better focus", "1_Text": "yep", "2_Subreddit": "StackAdvice"}], "7wx776": [{"0_Title": "Would like to apologize", "1_Text": "yep", "2_Subreddit": "Flualprazolam"}], "7xcsn1": [{"0_Title": "Created my own stack, opinions please?", "1_Text": "yep", "2_Subreddit": "StackAdvice"}], "7zil2e": [{"0_Title": "Is this stack OK?", "1_Text": "yep", "2_Subreddit": "StackAdvice"}], "80y7sm": [{"0_Title": "Phenobarbital", "1_Text": "yep", "2_Subreddit": "depressants"}], "811gf9": [{"0_Title": "Etizolam Schedule I Ohio effective Feb 14th, 2018", "1_Text": "yep", "2_Subreddit": "Etizolam_2"}], "82sed6": [{"0_Title": "Flualprazolam is improperly named", "1_Text": "yep", "2_Subreddit": "Flualprazolam"}], "83uifu": [{"0_Title": "RedSky/RedskyLabs (Reddit user) (Redskylabs@proton) ADVICE INCLUDED", "1_Text": "yep", "2_Subreddit": "VendorScams"}], "8448mr": [{"0_Title": "Can someone PLEASE help me with my daily regimen", "1_Text": "yep", "2_Subreddit": "Supplements"}], "86l7ox": [{"0_Title": "My Public PGP Key", "1_Text": "yep", "2_Subreddit": "u_bynarie"}], "88lbi3": [{"0_Title": "I need help badly!", "1_Text": "yep", "2_Subreddit": "ResearchRecovery"}], "894wv2": [{"0_Title": "Caution Statement", "1_Text": "yep", "2_Subreddit": "RCchems"}]}]}]}