{"bigdaddy723": [{"0_comments": [{"dutgolr": [{"0_Comment Submission": "Suspected fent analog with weird side effects", "1_Text": "Whats the stamp? I had some stamped power recently and i suspect fent but had mad euphoria and legs", "2_Subreddit": "opiates"}], "duxqnlo": [{"0_Comment Submission": "I can't nod", "1_Text": "I dont nod...i get mad euphoria and energy from all those...i only nod after being awake for like 2 days runnin around cleanin this....organizing that.", "2_Subreddit": "opiates"}], "duxqr07": [{"0_Comment Submission": "Spent another 60$ this is getting pricey", "1_Text": "Buy dope...its cheaper and better high....plus nowadays unless u see the persons script....who knows whats in the pill", "2_Subreddit": "opiates"}], "duxqx49": [{"0_Comment Submission": "Just gearing up to do some house chores", "1_Text": "Thats me nowadays i need dope to get motivated to clean...when im lit i love cleanin and manual labor...lol", "2_Subreddit": "opiates"}], "duxspu2": [{"0_Comment Submission": "Spent another 60$ this is getting pricey", "1_Text": "Lol....\"i like my somewhat stable life\" said every dope user ever who used to have a plug for pills and the plug either died out (they all do...no dr will prescribe 30s forever bruh)or paying 35$ or more for a 4hr fix gets to be too expensive....", "2_Subreddit": "opiates"}], "duxt5zg": [{"0_Comment Submission": "Just gearing up to do some house chores", "1_Text": "Bro me too....i organize the kitchen cabinets...do ALL the dishes..ALL the laundry...vacum...sweep...pull out small chin hairs...scratch my nutz for like 8hrs straight...and when wifey wakes up at 6am and im on the ps4 with the mic yellin \"fuck u u lil cunt\" and the house looks like Mary Fuckin Poppins came thru in the middle of the night...and she says \"look at me\" and i turn to her all sweaty...eyes pinned....and she says \"you got dope while i was sleepin again huh\" and i say \"naaah babe i just felt like cleanin for 6hrs str8 then playin ps4\"...i know its gonna be a fucked day", "2_Subreddit": "opiates"}], "duxtc97": [{"0_Comment Submission": "I can't nod", "1_Text": "Bro then enjoy it.....fuck noddin out and burnin cig holes in your favorite snuggy...when u nod u dont get to ENJOY THE HIGH", "2_Subreddit": "opiates"}], "duzlkj7": [{"0_Comment Submission": "you guys are so sweet, i love posting here 💓", "1_Text": "Spread it please?", "2_Subreddit": "Gonewild18"}], "duzsp32": [{"0_Comment Submission": "Gabapentin and dope i have a question?", "1_Text": "Shit dope bru", "2_Subreddit": "opiates"}], "duzsrv3": [{"0_Comment Submission": "Finally found a dealer", "1_Text": "Presses=fent and nothing else....thats a death wish", "2_Subreddit": "opiates"}], "dvjn00w": [{"0_Comment Submission": "If I take a half perc 30 with no tolerance and it happens to have fent will I be ok", "1_Text": "Pill users dont have the tolerance of a dope user and if u get fent pressed pills your basically gambling hardcore with your life...stay safe with those oxys.", "2_Subreddit": "opiates"}], "dvjqt6d": [{"0_Comment Submission": "I know we all love sour shit but has anyone else tried....", "1_Text": "According to google....it is a regular lime that has lost all its water content from being dried out. It is then regularly ground up and used as a spice in the middle east.\nIf your familiar with dogfish brewing company (from my home state of DE) you would know that they are renowned for their inventive brews", "2_Subreddit": "opiates"}], "dvjqylj": [{"0_Comment Submission": "(f)18 Happy Sunday! What do you think?", "1_Text": "Wow! Awesome tits and the light bush looks sexy as hell on you! Wuestion? You like ass play?", "2_Subreddit": "Gonewild18"}], "dvjr0fk": [{"0_Comment Submission": "[F] want to be naughty today", "1_Text": "That looks uncomfortable as all hell", "2_Subreddit": "Gonewild18"}], "dvjsf06": [{"0_Comment Submission": "Is there anything you guys would like to see from me? 😋😘", "1_Text": "Yes i agree....spread open so wide we can see your 18yr old cervix", "2_Subreddit": "Gonewild18"}], "dvpzmox": [{"0_Comment Submission": "For all the times I've been beat, shorted bags, stood up, left waiting in the hood for hours, sold fent, robbed, or overcharged....I FINALLY won over a Dboy!(Sorta..Kinda)", "1_Text": "Whats wrong with finding a flaw in my dboys hustle and then exploiting it for my benefit? And it wasn't a \"liq\" that term came about from way back in the day when thugs/junkies/gang members/teens would go \"hit\" up a LIQUOR store with the sole purpose of robbing/stealing from said liquor store, and so \"hitting a liq\" was born and mainly used to describe robberies of small shops & bodegas...what I did is known amongst the cool junkies as getting a \"come up\"...which basically means walking away with something when you originally had nothing.\nAnd the value of my come up wasn't $30 it was 9 bags so more like $60..which i believe i stated in my post...but you were too busy forming an opinion about me instead of thoroughly reading the entire post. And i didn't rob or steal them from the kid...he willingly gave them to me knowing there was no profit coming back to him.", "2_Subreddit": "opiates"}], "dvq612y": [{"0_Comment Submission": "For all the times I've been beat, shorted bags, stood up, left waiting in the hood for hours, sold fent, robbed, or overcharged....I FINALLY won over a Dboy!(Sorta..Kinda)", "1_Text": "Still baffled as to how i am a leech?...i saw an oppurtunity in some drug dealers ignorance...so that makes me a leech?", "2_Subreddit": "opiates"}], "dvq9399": [{"0_Comment Submission": "For all the times I've been beat, shorted bags, stood up, left waiting in the hood for hours, sold fent, robbed, or overcharged....I FINALLY won over a Dboy!(Sorta..Kinda)", "1_Text": "You guys have me smiling my ass off right now! And from your comments i can tell a lot of you read my post about how some fresh ass dboy handed me free dope and you all turned a nice shade of green and not in the spirit of St. Patrick's Day...lol.\nSo allow me to just make a few points more clear to those of you who couldn't follow my post correctly bc those WD's had you shaking your phones too much to be able to read.\nFirst of all...I did not rob anyone, never been about that. Dude handed me off a bun, never expecting payment, and never did I gurantee that it would definitely bring him guranteed business but that it couldn't hurt. Now letting go of a bun is a drop in the bucket to some dealers especially when they can get them for 1-2 bucks a bag wholesale, and ive known dboys who have misplaced plenty of buns or even tossed a few down the sewers just bc a car comin down the road looked suspect. \nFor those of you thinkin i should be worried about my safety over nine bags that were given to me....maybe its time you eased up off  all the Drugs Inc. Episodes....If i even had an inkling that my safety was at risk over some samples i wouldn't have even attempted it..some of you might put yourself into some UNCOMFORTABLE POSITIONS to get your fix but im not desperate to get high, like I've said i seen an oppurtunity and went for it...had a 50/50 shot at either getting him to throw md the samples or not.\nSome of you are callin me a piece of shit for exploiting the Dboy...who makes good money exploiting each of your weaknesses...and its the Dboy...the one so many of you cry about fuckin you over...i looked at it as a win for the dopers. How many of you have fucked over your own friend or SO to get high? Overcharging your peoples and taxing the work? Or have had a buddy accidentally drop a few bags or maybe a couple of blues in your car...that you snatched up like a fucking hawk...and then acted clueless when your friend realized they had lost some of their shit? I bet a few of you have even helped disassemble a car trying to be a good samaritan and help your friend find what they dropped...while it was secured in your pocket??\nAnd finally i gotta tell you all coming at me for making my come up...that your principals are fucked up...bc i have seen many many threads over the past few years where some of you swap secrets on the best ways to steal shit from Walmart/home depot/etc by doing the non-receipt return scam...the \"dig a receipt out the trash and then grab the items off the receipt and bring em up to returns scam\"...detailed descriptions on how to use your banks ATM check deposit feature to do kiting scams, Overdraft scams...the best ways to strip copper pipes from construction sites to hawk at the scrap yard...etc...ive seen you recommend people go on craigslist and go \"gay 4 pay\" and start letting guys blow them (or for them to blow guys) for a couple hundred bucks...literally putting them in danger of being assaulted....and ive seen some r/opiate members even give detailed experiences of how they lure guys into a gay 4 pay (and girls do the same straight 4 pay) robbery set up where either a weapon is involved or you rob the john while they r naked and boom your high fiving each other and thanking each other for the helpful info....back when the subreddit which shall never be named existed plenty of people i talked to said they fell for some smooth talking r/opiate member who convinced them to Western Union them money to middle for them...and by gaining someones trust beat them for several hundred bucks!\nSo all of you can get off your high horse with your holier than thou attitudes bc not one of you is perfect little angels when it comes to getting your fix...i think some of you are just mad that you never thought to pull the wool over your dboys eyes and instead resorted to swallowing some creepy mid 50's in the closet married guys spunk just so you could make enough scratch to fight off WD's for one or two more days!....Mic Drop...Im done", "2_Subreddit": "opiates"}], "dvqfex3": [{"0_Comment Submission": "For all the times I've been beat, shorted bags, stood up, left waiting in the hood for hours, sold fent, robbed, or overcharged....I FINALLY won over a Dboy!(Sorta..Kinda)", "1_Text": "Actually its 2 different stamps...sometimes a plug will have multiple ones as crazy as that sounds. And you all are taking the phrase \"weak shit, and implying its total garbage..when i definitely said it got me high just came on slow...still had good legs...i just wasnt fucking nodding out 5min after doing a bump.", "2_Subreddit": "opiates"}], "dw15n5c": [{"0_Comment Submission": "Help! Piss Test", "1_Text": "I have pissed clean in less than 72 hours before....like i did a few stamp bags on a saturday evening and then pissed clean the following tuesday evening....I too have a fast metabolism, dont workout, and sleep alot...my usage is different what you claim yours is...I am definitely more of a chipper than a physically addicted \"need to use everyday multiple times a day\" user.  I dont IV I boof or snort my Dope.\nRegarding the time i passed that DT...it was a very risky gamble and not something i would bet on working each time...when I used that Saturday evening it was only a total of 2.5 stamps, they weren't the greatest strength but also not garbage and they def had legs bc i could still feel it late into Sunday...Anyway starting Saturday night i began drinking nothing but water like everytime i went into the kitchen or to the bathroom id fill up a tall glass from the fridge anf just chug it...The night b4 my test and the day of i just kept drinkin and pissin...drinkin and pissin...when i finally had to go see my PO and take the test i was pissing nothing but water...and luckily i passed...but lime i said if was a HUGE RISK and absolutely not something i would do ever again.", "2_Subreddit": "opiates"}], "dw15vq1": [{"0_Comment Submission": "Help! Piss Test", "1_Text": "And let me add that the type of piss test could play a role in whether or not you pass or not...luckily for me the probation office i have to go to doesnt send out your piss for a follow up lab test...bc if they did i might have failed..I just piss in the cup, my PO glances at the results and just dumps it out. They also don't check to see if it has been diluted by someone drinking to much water and pissin clear...the places that do check for that might give you a fail if your piss is only water....GOOD LUCK DUDE AND LET US KNOW HOW IT TURNS OUT FOR YOU", "2_Subreddit": "opiates"}], "dwxfiip": [{"0_Comment Submission": "Vivitrol question(s) only for those with xp", "1_Text": "How can you od if your not feeling the effects of the D? When you OD you fall out go unconcious etc. How can that happen if your fully awake?", "2_Subreddit": "opiates"}], "dwxfm42": [{"0_Comment Submission": "Vivitrol question(s) only for those with xp", "1_Text": "And a full month after the shot?....like an additional month after the shot supposedly wears off?", "2_Subreddit": "opiates"}], "dwxfpfk": [{"0_Comment Submission": "Vivitrol question(s) only for those with xp", "1_Text": "Why would i get high off subs then? If the shot blocks opiates then how does that make bupe any different?", "2_Subreddit": "opiates"}], "dwxjxv0": [{"0_Comment Submission": "Vivitrol question(s) only for those with xp", "1_Text": "I used to take naltrexone in pill form and could still get high while on them if i used more than usual...are naltrexone pills diff from shot", "2_Subreddit": "opiates"}]}], "1_submissions": [{"3m8xnx": [{"0_Title": "Feeling blissful", "1_Text": "Whats the stamp? I had some stamped power recently and i suspect fent but had mad euphoria and legs", "2_Subreddit": "opiates"}], "3s98bo": [{"0_Title": "Anyone Else? A heroin addict with kids?", "1_Text": "Whats the stamp? I had some stamped power recently and i suspect fent but had mad euphoria and legs", "2_Subreddit": "opiates"}], "3yb8ir": [{"0_Title": "Free Fire! It pays to be a nice guy", "1_Text": "Whats the stamp? I had some stamped power recently and i suspect fent but had mad euphoria and legs", "2_Subreddit": "opiates"}], "40e1ym": [{"0_Title": "Questions about poppy seeds", "1_Text": "Whats the stamp? I had some stamped power recently and i suspect fent but had mad euphoria and legs", "2_Subreddit": "opiates"}], "444ju0": [{"0_Title": "So ive heard of dudes shootin up into their dick veins but i wonder....", "1_Text": "Whats the stamp? I had some stamped power recently and i suspect fent but had mad euphoria and legs", "2_Subreddit": "opiates"}], "44ztwx": [{"0_Title": "DMX Almost dies from overdose! \"Grrr...Can i get some narcan? Arf Arf\"", "1_Text": "Whats the stamp? I had some stamped power recently and i suspect fent but had mad euphoria and legs", "2_Subreddit": "opiates"}], "48ek1e": [{"0_Title": "So...i think my [26/F] Sister in-law has been hitting on me [M/31] right in front of my SO [34/F]", "1_Text": "Whats the stamp? I had some stamped power recently and i suspect fent but had mad euphoria and legs", "2_Subreddit": "relationships"}], "4bqlo7": [{"0_Title": "When the stamp be so fuego e caliente! You only need a single to blast offff", "1_Text": "Whats the stamp? I had some stamped power recently and i suspect fent but had mad euphoria and legs", "2_Subreddit": "opiates"}], "4inw1c": [{"0_Title": "So TIFU by losing about 14,000£ worth of my kingpins dope.", "1_Text": "Whats the stamp? I had some stamped power recently and i suspect fent but had mad euphoria and legs", "2_Subreddit": "opiates"}], "4io2r6": [{"0_Title": "The Best of 3 worlds", "1_Text": "Whats the stamp? I had some stamped power recently and i suspect fent but had mad euphoria and legs", "2_Subreddit": "opiates"}], "4mm0go": [{"0_Title": "To Boof (plug) or not to Boof? That is my question", "1_Text": "Whats the stamp? I had some stamped power recently and i suspect fent but had mad euphoria and legs", "2_Subreddit": "opiates"}], "51uoji": [{"0_Title": "[Request] Is there a subreddit for nasty bloody pussy?", "1_Text": "Whats the stamp? I had some stamped power recently and i suspect fent but had mad euphoria and legs", "2_Subreddit": "NSFW411"}], "56ar6n": [{"0_Title": "PLEASE HELP ME ASAP! CANT TAKE MUCH MORE", "1_Text": "Whats the stamp? I had some stamped power recently and i suspect fent but had mad euphoria and legs", "2_Subreddit": "opiates"}], "5aot55": [{"0_Title": "Finally JJ is coming thru b4 the sun comes up", "1_Text": "Whats the stamp? I had some stamped power recently and i suspect fent but had mad euphoria and legs", "2_Subreddit": "opiates"}], "5d8of6": [{"0_Title": "Chasing the dragon question", "1_Text": "Whats the stamp? I had some stamped power recently and i suspect fent but had mad euphoria and legs", "2_Subreddit": "opiates"}], "5dajzr": [{"0_Title": "UPDATE: Today I tried chasing the dragon for my 1st time using only a single stamp bag of ECP, Hillarious attempt story inside!", "1_Text": "Whats the stamp? I had some stamped power recently and i suspect fent but had mad euphoria and legs", "2_Subreddit": "opiates"}], "5dbkj5": [{"0_Title": "Opiate Users Opinion Survey: The 3 Dreaded \" I CAN'TS\"! I Want To Know Which \"I CAN'T\" Pisses you off the most?", "1_Text": "Whats the stamp? I had some stamped power recently and i suspect fent but had mad euphoria and legs", "2_Subreddit": "opiates"}], "5ih56m": [{"0_Title": "Scientific question about Dope strength when pluggin", "1_Text": "Whats the stamp? I had some stamped power recently and i suspect fent but had mad euphoria and legs", "2_Subreddit": "opiates"}], "6xzejq": [{"0_Title": "RIP u/njstein", "1_Text": "Whats the stamp? I had some stamped power recently and i suspect fent but had mad euphoria and legs", "2_Subreddit": "opiates"}], "6xzgch": [{"0_Title": "RIP U/njstein", "1_Text": "Whats the stamp? I had some stamped power recently and i suspect fent but had mad euphoria and legs", "2_Subreddit": "opiates"}], "7y01ym": [{"0_Title": "Anyone heard from northwesternvae?", "1_Text": "Whats the stamp? I had some stamped power recently and i suspect fent but had mad euphoria and legs", "2_Subreddit": "opiates"}], "83pvdr": [{"0_Title": "I know we all love sour shit but has anyone else tried....", "1_Text": "Whats the stamp? I had some stamped power recently and i suspect fent but had mad euphoria and legs", "2_Subreddit": "opiates"}], "84gyrl": [{"0_Title": "For all the times I've been beat, shorted bags, stood up, left waiting in the hood for hours, sold fent, robbed, or overcharged....I FINALLY won over a Dboy!(Sorta..Kinda)", "1_Text": "Whats the stamp? I had some stamped power recently and i suspect fent but had mad euphoria and legs", "2_Subreddit": "opiates"}], "8abruw": [{"0_Title": "Vivitrol question(s) only for those with xp", "1_Text": "Whats the stamp? I had some stamped power recently and i suspect fent but had mad euphoria and legs", "2_Subreddit": "opiates"}]}]}]}