{"Funkpolice911": [{"0_comments": [{"dw1c9ro": [{"0_Comment Submission": "Craig's list cop", "1_Text": "I'll keep updating this post.\nI feel like Indiana jones... heheh junkieana jones", "2_Subreddit": "opiates"}], "dw1fakk": [{"0_Comment Submission": "Craig's list cop", "1_Text": "Gotta have that funk ow", "2_Subreddit": "opiates"}], "dw1fhhb": [{"0_Comment Submission": "The needle really is a beast of its own", "1_Text": "Dude he's trying to tell you that if you're clean from opiates right now, why the fuck would you go back?\nWhy detox from heroin cold turkey to just go on methadone and become addicted again?\n\nDoesn't really make sense. I know for me personally, if I detoxed from h and didn't use sub or methadone to do it, I wouldn't go get on sub/methadone after the wd stoped", "2_Subreddit": "opiates"}], "dw1fmfa": [{"0_Comment Submission": "The White House can’t use proper grammar while trying to inflate big pharma. What are they even talking about", "1_Text": "They're trying to act like trump is actually doing something useful to hide the fact that he's doing even more wrong.\nThat post doesn't say 'trump is asking Americans to report their local drug dealer and get them on the waiting list for capital punishment'\nIt's a crock of shit that people who know no common sense will eat up with their evening dinner.", "2_Subreddit": "opiates"}], "dw4zv36": [{"0_Comment Submission": "Today's Turkish", "1_Text": "Why did this comment get so many 👎? \nYes... it's kind of an uneducated statement and obviously there are different forms of H so not all heroin, lately, looks like sandy rocks and asphalt.\nAgain with the obvious truth... people probably shouldn't be injecting it no matter the color, but we're gunna anyways.\n I just don't get why that deserved so many 👎.\nWas it really that annoying and deserving of that much attention and energy?\nI'm genuinely curious.", "2_Subreddit": "opiates"}], "dw8gvdg": [{"0_Comment Submission": "Disposing of Needles. Needle Exchange.", "1_Text": "If I have the option to thrown my points in a container specifically for needles I will, even if I'm high and want to get rid of evidence", "2_Subreddit": "opiates"}], "dwam5we": [{"0_Comment Submission": "hello?", "1_Text": "Is there anybody in there?", "2_Subreddit": "cocaine"}], "dwb3bza": [{"0_Comment Submission": "Risk cotton fever... Or not?", "1_Text": "Get well now! Get well now! Get well now!", "2_Subreddit": "opiates"}], "dwim8yq": [{"0_Comment Submission": "Somebody asked for opiate related art, it’s not mine but I think it applies. Enjoy!", "1_Text": "Taylor swift", "2_Subreddit": "opiates"}], "dwkl4mz": [{"0_Comment Submission": "Any other fellow solo skiiers feeling chatty this beautiful night? Took a break from fapping in hopes of finding a fap buddy", "1_Text": "A fap buddy? Dude...", "2_Subreddit": "cocaine"}], "dwlddv6": [{"0_Comment Submission": "Used subs for the first time recreationally, need advice please...", "1_Text": "Because suboxone blocks oxycodone. You just waisted oxy", "2_Subreddit": "opiates"}], "dwnbucx": [{"0_Comment Submission": "Anyone have a favorite dope fiend that they admire/idolize from the past or present?", "1_Text": "Love the libertines.\nDoherty was far far gone in the early days.\nHe used to put ads up on the web, throwing concerts at his various flats and charge ten pound at the door only to spend all the money on dope and crack. Fucking genius", "2_Subreddit": "opiates"}], "dwnmqrg": [{"0_Comment Submission": "Anyone have a favorite dope fiend that they admire/idolize from the past or present?", "1_Text": "First song I heard was can't stand me now and then death on the stairs. I was instantly hooked\nI love babyshambles too as well as the dirty pretty things.\nI heard about the cat ordeal too. I guess he was always blowing crack and H smoke in its face to get it high.\nWhen Alan McGee was the libs manager, there was tour that Doherty was supposed to go on with the rest of the band but no one knew where the fuck he was. So McGee (who'd been sober for years) goes around London to all these different crack house searching for Doherty and finally finds him in a crack den, naked, underneath the covers with some girl smoking crack and h. So at this point McGee has to physically force Doherty to get his ass up out of this crack house so the tour isn't cancelled / a shitshow, but not before Doherty takes a fat hit off the foil of some H and blows in it his, sober for years, managers face. \nLol! Like what a fuckhead.", "2_Subreddit": "opiates"}], "dwntokf": [{"0_Comment Submission": "First timer.", "1_Text": "Plug it my man.\nCut it into fourths and stick it in ur booty.\nI'm actually serious.\nDissolve a fourth in water and put the water in your butt", "2_Subreddit": "opiates"}], "dwntruq": [{"0_Comment Submission": "should swim just go to H", "1_Text": "Don't do it man.\nIt's all gravy until your parents kick you out and you're squatting with a bunch of junkies stealing from the Nike factory so you can get a gift card so you can eventually get money just so you're not sick", "2_Subreddit": "opiates"}], "dwnu4xn": [{"0_Comment Submission": "should swim just go to H", "1_Text": "Switch to h and you will end up like the guys on the street man. I used to hate my family until I went through all the unbelievably painful shit that I did at such a young fucking age. Shit that I never ever saw myself doing. I thought I was above being homeless. No one should have to go through it and let me tell you this... we can tell you no don't do it all day and night, but the fact is, you might just have to go through all this terrible, painful, unnecessary bull crap for yourself just to realize that you should have listened.\nBeing apart of the opiates club looks cool from the outside, but once you're in this club, all you want is out", "2_Subreddit": "opiates"}], "dwnuxy1": [{"0_Comment Submission": "should swim just go to H", "1_Text": "Do man, just stick with pills every now and again.\nYou'll be good.\nH is gay", "2_Subreddit": "opiates"}], "dwogxka": [{"0_Comment Submission": "Anyone have a favorite dope fiend that they admire/idolize from the past or present?", "1_Text": "Ohhh I know haha! Carl was mad into the booger sugar. Nearly lost his eye because of it too. Don't know if you've heard that story but it's worth looking into.\nPersonally I don't think Pete is completely sober nor do I ever think he will be. \nHis definition of sober is smoking heroin instead of iving it haha. Fucking lunatic", "2_Subreddit": "opiates"}], "dworzm5": [{"0_Comment Submission": "Anyone have a favorite dope fiend that they admire/idolize from the past or present?", "1_Text": "Definitely get into music. It's awesome and gets you laid all the time. I play guitar myself and various other instruments. Music just comes naturally to me and I fucking love it.\nBut yeah when you're a rock star you can get just about any kind of drug with all the different people you come across", "2_Subreddit": "opiates"}], "dwp3o9f": [{"0_Comment Submission": "so i actually died", "1_Text": "Life is life. Just be glad you get to experience the pain and suffering", "2_Subreddit": "opiates"}], "dwrd9dg": [{"0_Comment Submission": "Vivid dreams/sleep paralysis after getting off stims, opis or other drugs? [vent/might-be-shit-post]", "1_Text": "You were visited by a shadow person. It's common with sleep paralysis", "2_Subreddit": "opiates"}], "dwrdjac": [{"0_Comment Submission": "Vivid dreams/sleep paralysis after getting off stims, opis or other drugs? [vent/might-be-shit-post]", "1_Text": "Yeah it's something that happens to a lot of people all around the world and no one really has any fucking clue why", "2_Subreddit": "opiates"}], "dwuyjtx": [{"0_Comment Submission": "Newbie dealer", "1_Text": "Okay man I don't know why you weren't asked this question...\nHow much do you buy a g for?\nHow much do you buy at a time and what is the price of the quantity?", "2_Subreddit": "cocaine"}], "dwuznjc": [{"0_Comment Submission": "Last night I tried cocaine... not your typical story.", "1_Text": "Damn dude... 5gs of purified cola IV for your first time. FUCKING ANIMAL.\nYou should really try snorting it, even if you don't like it. \nThis high is more sociable, lasts longer, less intense, but smooth. Comparable to mdma in a way.\nGive it some thought\n\nWhat did you think of the taste in your mouth when the dose hits? I personally love it, especially when there's some heroin in the shot", "2_Subreddit": "cocaine"}], "dwuzx4k": [{"0_Comment Submission": "Is this real?", "1_Text": "How often have you been doing blow?\nWas the stuff you bought the same as what you tested?", "2_Subreddit": "cocaine"}]}], "1_submissions": [{"735w7l": [{"0_Title": "Ibogaine in Mexico and some other fun things", "1_Text": "I'll keep updating this post.\nI feel like Indiana jones... heheh junkieana jones", "2_Subreddit": "Drugs"}], "78j0u7": [{"0_Title": "My old plug just sent me a pic", "1_Text": "I'll keep updating this post.\nI feel like Indiana jones... heheh junkieana jones", "2_Subreddit": "cocaine"}], "791neu": [{"0_Title": "What's some freaky shit to do in this city?", "1_Text": "I'll keep updating this post.\nI feel like Indiana jones... heheh junkieana jones", "2_Subreddit": "Denver"}], "7a9uvb": [{"0_Title": "This the only thing that this has to due with cocaine is that I'm friending like a motherfucker and find myself scraping multiple ziploc bags that used to contain kratom lol", "1_Text": "I'll keep updating this post.\nI feel like Indiana jones... heheh junkieana jones", "2_Subreddit": "cocaine"}], "7b4tej": [{"0_Title": "I love back country skiing and reading. Anyone else?", "1_Text": "I'll keep updating this post.\nI feel like Indiana jones... heheh junkieana jones", "2_Subreddit": "cocaine"}], "7bhc1v": [{"0_Title": "Question about Tolerance with a direct correlation to an OD", "1_Text": "I'll keep updating this post.\nI feel like Indiana jones... heheh junkieana jones", "2_Subreddit": "kratom"}], "7lfwfs": [{"0_Title": "Anyone else where 6 layers today?", "1_Text": "I'll keep updating this post.\nI feel like Indiana jones... heheh junkieana jones", "2_Subreddit": "Denver"}], "833s29": [{"0_Title": "Gun powder 💥", "1_Text": "I'll keep updating this post.\nI feel like Indiana jones... heheh junkieana jones", "2_Subreddit": "opiates"}], "85pbji": [{"0_Title": "Craig's list cop", "1_Text": "I'll keep updating this post.\nI feel like Indiana jones... heheh junkieana jones", "2_Subreddit": "opiates"}]}]}]}