{"intj-nodsquad": [{"0_comments": [{"dvwu73m": [{"0_Comment Submission": "Been off heroin for about a month!", "1_Text": "Woohoo! YOU GO GLEN COCO!", "2_Subreddit": "opiates"}], "dvx63tj": [{"0_Comment Submission": "Now he wants to reduce the threshold for mandatory jail time AND kill the drug dealers...", "1_Text": "Thank ya! Idk why its dead for y'all, it works fine on my phone :/", "2_Subreddit": "opiates"}], "dvx67d8": [{"0_Comment Submission": "Now he wants to reduce the threshold for mandatory jail time AND kill the drug dealers...", "1_Text": "Yeah I read an article a long time ago saying he liked the Philippines current leaders tactic for dealing with drugs, basically killing all drug dealers.", "2_Subreddit": "opiates"}], "dvx6l7p": [{"0_Comment Submission": "Now he wants to reduce the threshold for mandatory jail time AND kill the drug dealers...", "1_Text": "That does make me feel better about it. How do you feel about lowering the minimum for mandatory jail time?", "2_Subreddit": "opiates"}], "dw1a4gu": [{"0_Comment Submission": "Scraping", "1_Text": "Depends on what  you use for a straw. I but glass straws and smoke them after, I've tried scraping and it just didn't seem as effective as when I smoked the straw. I have a straw now that I've ran 3 grams through and I can barely see through it its so filled with residue :)", "2_Subreddit": "opiates"}], "dw6skq2": [{"0_Comment Submission": "Anyone in here a fan of The Office?", "1_Text": "I literally cringe everytime he's on", "2_Subreddit": "opiates"}], "dwdde3u": [{"0_Comment Submission": "Patience ain't my virtue!", "1_Text": "Lmao! I legit started dying and wasted a hit off my foil as I read this sitting in a McD's parking lot! Worth it!", "2_Subreddit": "opiates"}], "dwdews4": [{"0_Comment Submission": "Dboy b like..", "1_Text": "I used to have to go pick up a middle that lived 30 min South of me, drive an hour and half north, have him go meet the guy at his apt. And then my middle would legit be there for at least an hour getting well till he would even come back with my shit. Then I still had to drive his ass home and then drive myself home for overcharged shit.\n\nI finally told him to fuck off and now I pick up bulk 4 hours away from me like once a month. This guy will always be at my car the second I pull up.", "2_Subreddit": "opiates"}], "dwdi5un": [{"0_Comment Submission": "Chasing the dragon Technique", "1_Text": "A few years ago I had a buddy who was just stupid af. He would lose his tar whenever he tried to turn it or move it on their so he taped foil from the top of his fridge to his counter and would smoke it off that so he wouldn't have to turn it lol we started racing each other on it too", "2_Subreddit": "opiates"}], "dwdr87y": [{"0_Comment Submission": "Smoking heroin out of a glass pipe?", "1_Text": "Smoke shops have glass straws. Mine has all different sizes. I'll get one a souple of inches long, smoke on foil, and after a few grams you can smoke the straw for the residue", "2_Subreddit": "opiates"}], "dweaj20": [{"0_Comment Submission": "getting purposely addicted", "1_Text": "Lol! I've always been around hardworking people, my Bf not so much.. So when it comes to wanting to quit things he always says it's so hard and I tell him it's a matter of willpower. (He has never been heavily addicted to anything).\nThing is, you really can't tell those type of people to just do things, you have to show them. I stopped asking him to quit ciggs with me and just did it myself. Same thing went with tar.\nIt got to the point where he started to feel bad about it and realized he was being a bit of a pussy.", "2_Subreddit": "opiates"}], "dweb3h9": [{"0_Comment Submission": "getting purposely addicted", "1_Text": "When you can barely call yourself an addict, yeah it's willpower", "2_Subreddit": "opiates"}], "dwneghd": [{"0_Comment Submission": "3g rock of fire rock for 150. More pics in comments.", "1_Text": "Beautiful! Bought the same amount for my trip to Disneyland and it was perfff", "2_Subreddit": "opiates"}], "dwneq41": [{"0_Comment Submission": "Policy Change regarding human consumption", "1_Text": "^this! Guess most of us are about to go into lurker mode", "2_Subreddit": "opiates"}], "dwq6cba": [{"0_Comment Submission": "3gs of the best black tar in the whole city 🎱", "1_Text": "I second smoking tar! I do it every once in awhile but always make sure to give my lungs a few days rest to get tall the shit out of them", "2_Subreddit": "opiates"}], "dwq6xzj": [{"0_Comment Submission": "2 Dboys owe me extra but I don't want it right now-fuck me!", "1_Text": "LMAO Damn y'all got me bad!!", "2_Subreddit": "opiates"}], "dwq8lld": [{"0_Comment Submission": "Advice I guess?", "1_Text": "I learned in my mental health class that you physically have these pockets in your brain that fill up with seratomin when you're happy. When you use drugs like H and other drugs you start to overfill these pockets and start to stretch  them out and can make them huge compared to how they we're originally.\nWhen you withdraw you're \"happy pockets\" have nothing and can't be filled with the seratonin you have naturally. It can take years to physically have those  pockets shrink which is why alot of drug users can feel majorly depressed even after they are clean. (On top of the depression that may have lead to drug use)\n\nIn summary, you can feel suicidal and depressed because you lack enough seratonin.", "2_Subreddit": "opiates"}], "dwqlh6s": [{"0_Comment Submission": "2 Dboys owe me extra but I don't want it right now-fuck me!", "1_Text": "Not much, both were only a few points", "2_Subreddit": "opiates"}], "dwrltt5": [{"0_Comment Submission": "Making moves with the plug", "1_Text": "God damn that's some sweet looking fire! Can't wait to get into mine ;)", "2_Subreddit": "opiates"}], "dwrqwq5": [{"0_Comment Submission": "Grrrrrrr can't work out how to upload pics I'm on a tablet help!", "1_Text": "What's wrong with it?", "2_Subreddit": "opiates"}], "dwrr73k": [{"0_Comment Submission": "SWIM feel like heroin brought my depression back.", "1_Text": "I just found out it was a prank too! Lol! my original post didn't make any sense when I did that lol", "2_Subreddit": "opiates"}], "dwrre8y": [{"0_Comment Submission": "1g dank tar", "1_Text": "I just picked up a half of that in the same bag!! Lmao small world", "2_Subreddit": "opiates"}], "dwrs36t": [{"0_Comment Submission": "Today's pickup!", "1_Text": "It tastes good and got me up a little,  but I plan on actually  sitting down  and doing the rest tomorrow so I'll let ya know!", "2_Subreddit": "opiates"}], "dwrvzex": [{"0_Comment Submission": "Today's pickup!", "1_Text": "Lmfao the fuck?", "2_Subreddit": "opiates"}], "dwteqxb": [{"0_Comment Submission": "Did Anyone Get Their Tax Refund Money yet? I did at 4 Am. At 4:05 i called the dboy. Didnt spend a lot, trying to cut down and save $", "1_Text": "...and delinquent. If the govnt is already garnishing your wages your loans are in collections and your interest is even worse now.......Edit: Garnishing your return lol not paycheck", "2_Subreddit": "opiates"}]}], "1_submissions": [{"7e444c": [{"0_Title": "Difference in taste between BTH and BTH w/fentanyl?", "1_Text": "Woohoo! YOU GO GLEN COCO!", "2_Subreddit": "opiates"}], "7xjrk1": [{"0_Title": "New here. But thank you for this reddit.", "1_Text": "Woohoo! YOU GO GLEN COCO!", "2_Subreddit": "socialanxiety"}], "807xyw": [{"0_Title": "Cold copping advice?", "1_Text": "Woohoo! YOU GO GLEN COCO!", "2_Subreddit": "opiates"}], "808r26": [{"0_Title": "Best sourcing app?", "1_Text": "Woohoo! YOU GO GLEN COCO!", "2_Subreddit": "opiates"}], "80k38b": [{"0_Title": "Fun question for elementary school teachers", "1_Text": "Woohoo! YOU GO GLEN COCO!", "2_Subreddit": "Teachers"}], "856gjp": [{"0_Title": "Picked up a g of bth last night, babe lost it for 3 hours, then I found it in my car HUZZAH!", "1_Text": "Woohoo! YOU GO GLEN COCO!", "2_Subreddit": "opiates"}], "85akln": [{"0_Title": "What is in my tar?!", "1_Text": "Woohoo! YOU GO GLEN COCO!", "2_Subreddit": "opiates"}], "85fyzx": [{"0_Title": "Now he wants to reduce the threshold for mandatory jail time AND kill the drug dealers...", "1_Text": "Woohoo! YOU GO GLEN COCO!", "2_Subreddit": "opiates"}], "86fcrw": [{"0_Title": "Woah Woah Woah!", "1_Text": "Woohoo! YOU GO GLEN COCO!", "2_Subreddit": "opiates"}], "87zs3y": [{"0_Title": "BTH OD when smoked?", "1_Text": "Woohoo! YOU GO GLEN COCO!", "2_Subreddit": "opiates"}], "8845b8": [{"0_Title": "Did my VITA supervisor lie to me?!", "1_Text": "Woohoo! YOU GO GLEN COCO!", "2_Subreddit": "tax"}], "89dg18": [{"0_Title": "2 Dboys owe me extra but I don't want it right now-fuck me!", "1_Text": "Woohoo! YOU GO GLEN COCO!", "2_Subreddit": "opiates"}], "89lbrs": [{"0_Title": "Today's pickup!", "1_Text": "Woohoo! YOU GO GLEN COCO!", "2_Subreddit": "opiates"}], "89tlh5": [{"0_Title": "GOD DAMN! Not my photo, just great H porn", "1_Text": "Woohoo! YOU GO GLEN COCO!", "2_Subreddit": "opiates"}]}]}]}